{"pageProps":{"questions":[{"id":"us8CMC9CDqGrY7YJncLo","timestamp":"2022-10-12 07:33:00","unix_timestamp":1665552780,"answers_community":["B (72%)","A (23%)","3%"],"discussion":[{"comments":[{"poster":"aatikah","content":"Application Context in This Scenario:\nAWS Applications Mentioned in the Scenario:\n\nThe question focuses on AWS Single Sign-On (AWS SSO) and the use of SSO across AWS accounts.\nAWS SSO with AWS Organizations does not require AWS applications to look up or access on-premises AD objects beyond authentication.\nBlog Reference:\n\nThe blog mentions the need for a two-way trust if AWS services like Amazon WorkSpaces or Amazon WorkMail require access to user attributes stored in the on-premises AD.\nThis scenario does not mention such AWS applications, so a one-way trust is sufficient for the SSO use case.","comment_id":"1325614","timestamp":"1734008820.0","upvote_count":"2"},{"timestamp":"1704558060.0","poster":"mohamedsambo","content":"AWS IAM Identity Center requires a two-way trust so that it has permissions to read user and group information from your domain to synchronize user and group metadata. IAM Identity Center uses this metadata when assigning access to permission sets or applications. User and group metadata is also used by applications for collaboration, like when you share a dashboard with another user or group. The trust from AWS Directory Service for Microsoft Active Directory to your domain permits IAM Identity Center to trust your domain for authentication. The trust in the opposite direction grants AWS permissions to read user and group metadata.","upvote_count":"6","comment_id":"1115300"},{"content":"The problem with this is that nowhere in the question is it saying that the application needs to be able to flow back so two-way is not needed.","poster":"pbpally","upvote_count":"4","timestamp":"1683409800.0","comment_id":"891036"},{"timestamp":"1683410280.0","comment_id":"891044","poster":"pbpally","content":"What I did find though was documentation that explicitly states that IAM Identity Center (successor to AWS SSO) requires a two-way trust:\nhttps://docs.aws.amazon.com/directoryservice/latest/admin-guide/ms_ad_setup_trust.html","upvote_count":"12"}],"content":"Selected Answer: B\nTricky question!!! forget one-way or two-way. In this scenario, AWS applications (Amazon Chime, Amazon Connect, Amazon QuickSight, AWS Single Sign-On, Amazon WorkDocs, Amazon WorkMail, Amazon WorkSpaces, AWS Client VPN, AWS Management Console, and AWS Transfer Family) need to be able to look up objects from the on-premises domain in order for them to function. This tells you that authentication needs to flow both ways. This scenario requires a two-way trust between the on-premises and AWS Managed Microsoft AD domains.\nIt is a requirement of the application\nScenario 2: https://aws.amazon.com/es/blogs/security/everything-you-wanted-to-know-about-trusts-with-aws-managed-microsoft-ad/","upvote_count":"78","poster":"17Master","timestamp":"1667175600.0","comment_id":"708092"},{"comments":[],"content":"Answer B as we have AWS SSO which requires two way trust. As per documentation - A two-way trust is required for AWS Enterprise Apps such as Amazon Chime, Amazon Connect, Amazon QuickSight, AWS IAM Identity Center (successor to AWS Single Sign-On), Amazon WorkDocs, Amazon WorkMail, Amazon WorkSpaces, and the AWS Management Console. AWS Managed Microsoft AD must be able to query the users and groups in your self-managed AD.\n\nAmazon EC2, Amazon RDS, and Amazon FSx will work with either a one-way or two-way trust.","poster":"KADSM","upvote_count":"14","timestamp":"1667805300.0","comment_id":"712870"},{"poster":"omunoz","timestamp":"1742014680.0","content":"Selected Answer: A\nA one-way trust (rather than a two-way trust) is the recommended approach for security reasons:\nThe on-premises AD remains the authoritative identity provider.\nAWS trusts the on-prem AD, but AD does not trust AWS.\nThis setup ensures that AWS does not introduce potential security risks to the on-premises \n\nA two-way trust is unnecessary for SSO and can introduce security risks, as it allows AWS to authenticate users in the on-prem AD and vice versa.\nAWS best practices recommend using a one-way trust for such integrations.","comment_id":"1396666","upvote_count":"2"},{"poster":"javaguy1906","content":"Selected Answer: A\nA one-way trust is sufficient because AWS should trust the on-premises AD for authentication, but the on-premises AD does not need to trust AWS","upvote_count":"1","timestamp":"1739934240.0","comment_id":"1358562"},{"comment_id":"1347540","poster":"AwsAbhiKumar","upvote_count":"1","timestamp":"1738006740.0","content":"Selected Answer: A\nAWS Single Sign-On can integrate with on-premises Microsoft Active Directory using AWS Directory Service for Microsoft Active Directory.\nA one-way trust relationship is sufficient for AWS SSO to authenticate users from the on-premises Active Directory without requiring changes to existing trust relationships in the on-premises environment."},{"timestamp":"1737953100.0","comment_id":"1347234","poster":"AfricanCloudGuru","content":"Selected Answer: B\nBecause we need to create two ways forest traffic","upvote_count":"1"},{"poster":"Rcosmos","comment_id":"1338582","timestamp":"1736465520.0","content":"Selected Answer: B\nResposta correta: B!\n\nExplicação revisada:\nQuando a empresa precisa integrar seu Microsoft Active Directory autogerenciado com o AWS SSO para logon único em múltiplas contas na AWS, uma relação de confiança de floresta bidirecional é necessária para permitir que usuários e grupos locais sejam autenticados e tenham acesso completo aos recursos da AWS. Essa abordagem garante interoperabilidade total entre o AD local e o AWS SSO.","upvote_count":"1"},{"upvote_count":"3","content":"Selected Answer: A\nAWS Single Sign-On (AWS SSO) allows centralized management of access to multiple AWS accounts, and it integrates with on-premises Active Directory via AWS Directory Service for Microsoft Active Directory.\nA one-way trust enables AWS Directory Service to authenticate users from the on-premises AD without giving AWS access to manage the on-premises AD. This is secure and follows best practices.\nThis is the correct solution because it integrates the on-premises AD with AWS SSO and maintains the centralized management of users and groups in the on-premises AD.","comment_id":"1332209","poster":"MGKYAING","timestamp":"1735270680.0"},{"comment_id":"1332009","timestamp":"1735231980.0","poster":"John54321","upvote_count":"1","content":"Selected Answer: B\nAWS SSO (previously called Identity center) requires two way trust.\n\nhttps://docs.aws.amazon.com/directoryservice/latest/admin-guide/ms_ad_setup_trust.html"},{"timestamp":"1735027920.0","upvote_count":"1","comment_id":"1331054","content":"Selected Answer: A\nAWS Single Sign-On (AWS SSO): Provides a centralized way to manage SSO access to multiple AWS accounts and business applications. It simplifies user access management across AWS Organizations.\n\nOne-Way Trust: Creating a one-way trust with AWS Directory Service allows the on-premises Microsoft Active Directory to authenticate users without allowing AWS to initiate authentication requests to the on-premises directory. This maintains security and control.\n\nMinimal Operational Overhead: This approach leverages AWS managed services, reducing the complexity and overhead of managing SSO and directory services.","poster":"hilker1983"},{"upvote_count":"1","comment_id":"1325615","content":"Selected Answer: A\nApplication Context in This Scenario:\nAWS Applications Mentioned in the Scenario:\n\nThe question focuses on AWS Single Sign-On (AWS SSO) and the use of SSO across AWS accounts.\nAWS SSO with AWS Organizations does not require AWS applications to look up or access on-premises AD objects beyond authentication.\n\nThis scenario does not mention such AWS applications, so a one-way trust is sufficient for the SSO use case.","timestamp":"1734008880.0","poster":"aatikah"},{"content":"Selected Answer: A\nNo need for both ways communication.","poster":"Carlini2020","timestamp":"1731607920.0","upvote_count":"1","comment_id":"1312207"},{"poster":"trinh_le","timestamp":"1731324960.0","comment_id":"1309979","content":"Selected Answer: B\nA specific aws applications require two-way trust. To migrate to the aws, we need all apps are available. So I pick B","upvote_count":"1"},{"comment_id":"1302297","upvote_count":"1","timestamp":"1729744200.0","poster":"mzeynalli","content":"Selected Answer: A\nA. Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console. Create a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory.\n\nTwo-way trust (as mentioned in option B) allows mutual trust between both environments, which is not necessary if the company only wants AWS to authenticate against the on-premises AD.\n\nA two-way trust is not necessary if the company only needs authentication from the on-premises AD. It may introduce unnecessary complexity and potential security risks since it requires trust in both directions."},{"comments":[{"timestamp":"1735772880.0","comment_id":"1335310","upvote_count":"1","content":"Looks like this tell us that B is the answer","poster":"techghost"}],"content":"Current version of this question (with Identity Center) doesn't even contain option A.\n\nhttps://www.examtopics.com/discussions/amazon/view/136806-exam-aws-certified-solutions-architect-associate-saa-c03/","poster":"MatAlves","comment_id":"1288002","timestamp":"1727071500.0","upvote_count":"5"},{"comment_id":"1272182","timestamp":"1724596980.0","poster":"DwarfBaggins","upvote_count":"2","content":"Selected Answer: B\nkey word: Self Managed.\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html"},{"poster":"rpmaws","comments":[{"timestamp":"1724725500.0","poster":"HoaHK","content":"Right, but with Active Directory, two-way trust is require","comment_id":"1273097","upvote_count":"5"}],"content":"Selected Answer: A\nTwo way trust is not required here.","timestamp":"1724482860.0","comment_id":"1271551","upvote_count":"2"},{"timestamp":"1722089400.0","content":"Selected Answer: B\nOption B (enabling AWS SSO and creating a two-way forest trust) is the appropriate solution based on the requirement for a two-way trust to support AWS enterprise applications and provide single sign-on capabilities across all AWS accounts while integrating with the on-premises Microsoft Active Directory.","comment_id":"1256327","poster":"PoolDead","upvote_count":"3"},{"timestamp":"1718273760.0","upvote_count":"1","content":"Selected Answer: B\nB for sure","comment_id":"1229748","poster":"ChymKuBoy"},{"upvote_count":"1","content":"Options A is enough and will make it work.","comment_id":"1226473","poster":"Gape4","timestamp":"1717808880.0"},{"comment_id":"1217102","upvote_count":"2","poster":"OBIOHAnze","content":"Selected Answer: A\nOption A suggests enabling AWS SSO and using a one-way trust, which allows AWS SSO to rely on the on-premises Microsoft Active Directory for authentication while keeping the management centralized in AWS SSO. This is a common and recommended approach for integrating on-premises Active Directory with AWS SSO.","timestamp":"1716507240.0"},{"upvote_count":"2","comment_id":"1194072","content":"Selected Answer: A\nFor the sake of exam options A is enough. Option B rather increases security risk surface.","timestamp":"1712885640.0","poster":"firsttimetesttaker"},{"upvote_count":"4","content":"Selected Answer: B\nI'll go for B as \nA feels incomplete\nC Can be done but company wants SSO, not a fill director service\nD On prem already has a IDP so no.","comment_id":"1122076","timestamp":"1705183980.0","poster":"awsgeek75"},{"poster":"A_jaa","content":"Selected Answer: B\nAnswer-B","timestamp":"1705149540.0","upvote_count":"1","comment_id":"1121641"},{"comment_id":"1108297","timestamp":"1703820780.0","upvote_count":"1","poster":"boooliyooo","content":"Selected Answer: D\nD is better and more applicable in real-world context where everyone chooses simplicity over a overhaul solution; Where Organizations may prefer to continue using their existing, trusted on-premises IdP solutions for authentication, especially if they have specific security policies or compliance requirements."},{"poster":"Ruffyit","upvote_count":"3","comment_id":"1054545","content":"Two-way trust or AD Connector. IAM Identity Center only works with those two.\n\"One-way trusts do not work with IAM Identity Center.\"\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","timestamp":"1698323160.0"},{"poster":"rlamberti","content":"Selected Answer: B\nTwo-way trust or AD Connector. IAM Identity Center only works with those two.\n\"One-way trusts do not work with IAM Identity Center.\"\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","comment_id":"1045321","timestamp":"1697494980.0","upvote_count":"2"},{"comment_id":"1039163","timestamp":"1696913880.0","upvote_count":"2","poster":"dhax12","content":"From AWS Documentation:\n\nA two-way trust is required for AWS Enterprise Apps such as Amazon Chime, Amazon Connect, Amazon QuickSight, AWS IAM Identity Center, Amazon WorkDocs, Amazon WorkMail, Amazon WorkSpaces, and the AWS Management Console. AWS Managed Microsoft AD must be able to query the users and groups in your self-managed AD.\n\nAmazon EC2, Amazon RDS, and Amazon FSx will work with either a one-way or two-way trust."},{"comment_id":"1026050","poster":"prabhjot","content":"Option a- and why not option B -Option B, which suggests a two-way forest trust, is generally not recommended unless there are specific reasons for requiring a two-way trust, as it increases complexity and potential security risks.","timestamp":"1696550520.0","upvote_count":"1"},{"timestamp":"1696509180.0","content":"B\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","comment_id":"1025649","upvote_count":"1","poster":"parrtner73"},{"comment_id":"997806","timestamp":"1693759020.0","content":"A two-way trust is required for AWS Enterprise Apps such as Amazon Chime, Amazon Connect, Amazon QuickSight, \"AWS IAM Identity Center (successor to AWS Single Sign-On)\", Amazon WorkDocs, Amazon WorkMail, Amazon WorkSpaces, and the AWS Management Console","upvote_count":"2","poster":"Examprep202324"},{"upvote_count":"2","content":"Option B is the correct choice because it aligns with the AWS documentation, which states that a two-way trust relationship is needed between AWS Managed Microsoft AD and a self-managed AD for users to sign in with their corporate credentials to AWS services. This solution integrates AWS SSO, AWS Directory Service for Microsoft AD, and centralized account management through AWS Organizations.\n\nRead until the end\n\"Create a two-way trust relationship – When two-way trust relationships are created between AWS Managed Microsoft AD and a self-managed directory in AD, users in your self-managed directory in AD can sign in with their corporate credentials to various AWS services and business applications. One-way trusts do not work with IAM Identity Center.\"\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","poster":"Yonimoni","timestamp":"1692342840.0","comment_id":"984242"},{"content":"Selected Answer: C\nExplanation:\nTo route users to the Region with the lowest latency, we can use Amazon Route 53 latency-based routing with health checks. We can deploy a Network Load Balancer (NLB) associated with the Auto Scaling group and create an Amazon Route 53 latency record that points to aliases for each NLB. To enable automated failover between Regions, we can configure Route 53 with failover routing policy. With failover routing policy, active-active or active-passive configurations can be configured between the Regions. Lastly, we can create an Amazon CloudFront distribution that uses the latency record as an origin which will improve the delivery performance of content to the end-users.","upvote_count":"1","comment_id":"982027","poster":"Raggz","timestamp":"1692137760.0"},{"upvote_count":"1","timestamp":"1689534300.0","content":"Option B is the right answer for this.","comment_id":"953574","poster":"miki111"},{"poster":"TheHadidi","upvote_count":"1","comments":[{"upvote_count":"3","poster":"bingusbongus","timestamp":"1689098220.0","comment_id":"949223","content":"This solution does not feature single-sign-on (SSO)."}],"comment_id":"940947","timestamp":"1688306220.0","content":"Selected Answer: C\nC. Use AWS Directory Service. Create a two-way trust relationship with the company's self-managed Microsoft Active Directory.\nMore information: https://docs.aws.amazon.com/directoryservice/latest/admin-guide/ms_ad_use_cases.html\nAnd yest, two-way trust can be created between AWS DS for MS-AD and the self-managed on-premises AD (https://docs.aws.amazon.com/directoryservice/latest/admin-guide/ms_ad_tutorial_setup_trust_create.html)"},{"upvote_count":"7","content":"Selected Answer: A\nThe recommended solution is option A: Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console and create a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO using AWS Directory Service for Microsoft Active Directory.\n\nBy implementing this solution, the company can achieve a single sign-on experience for their AWS accounts while maintaining central control over user and group management in their on-premises Active Directory. The one-way trust ensures that user and group information flows securely from the on-premises directory to AWS SSO, allowing for centralized access management and control across all AWS accounts.","comment_id":"926590","poster":"cookieMr","timestamp":"1687080420.0"},{"comment_id":"917794","upvote_count":"2","timestamp":"1686199260.0","content":"Selected Answer: D\nCan we have a moderator ?","poster":"DuboisNicolasDuclair"},{"comment_id":"903601","content":"A is correct\nOption B comes with security risk two way trust","timestamp":"1684716000.0","upvote_count":"1","poster":"omoakin"},{"comment_id":"901552","timestamp":"1684451700.0","upvote_count":"3","content":"Selected Answer: B\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","poster":"sbnpj"},{"upvote_count":"1","content":"AWS IAM Identity Center (successor to AWS Single Sign-On) requires a two-way trust so that it has permissions to read user and group.","poster":"Abrar2022","comment_id":"897299","timestamp":"1684044780.0"},{"upvote_count":"2","comment_id":"887789","content":"Selected Answer: A\nThis is the answer of chatGPT:\nOption A is the best solution that meets the requirements of providing a single sign-on (SSO) solution across all the company's accounts while continuing to manage users and groups in the on-premises self-managed Microsoft Active Directory.\n\nExplanation:\nOption A is the best solution as it enables AWS Single Sign-On (AWS SSO) from the AWS SSO console and creates a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory. This solution allows the company to manage users and groups in the on-premises Active Directory and provides a single sign-on (SSO) experience across all the company's AWS accounts.","comments":[{"upvote_count":"1","timestamp":"1713852720.0","comment_id":"1200501","content":"Jesus wept. Why do people rely on chat gbt so much?","poster":"lofzee"}],"timestamp":"1683052080.0","poster":"AlaTaftaf"},{"upvote_count":"3","comment_id":"883050","comments":[{"poster":"Clouddon","upvote_count":"1","comment_id":"974946","timestamp":"1691437860.0","content":"Before SSO could work, authentication to and fro must have been established."},{"comment_id":"929774","poster":"ruqui","content":"that's wrong!!! think yourself instead of relying on software: https://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","upvote_count":"3","timestamp":"1687368540.0"}],"timestamp":"1682629380.0","poster":"darkknight23","content":"I think its A. From ChatGpt:\n=========\nShould this be one way or two way trust?\nTo integrate AWS SSO with an on-premises Microsoft Active Directory, a one-way trust relationship should be established.\n\nIn a one-way trust relationship, the on-premises Microsoft Active Directory trusts the AWS SSO directory, but the AWS SSO directory does not trust the on-premises Microsoft Active Directory. This means that users and groups in the on-premises Microsoft Active Directory can be mapped to AWS SSO users and groups, but not vice versa.\n\nThis is the recommended approach for security reasons, as it ensures that the on-premises Microsoft Active Directory is not exposed to external entities. The one-way trust relationship also simplifies administration and reduces the risk of errors in configuration."},{"content":"Selected Answer: B\nAnswer is B\nhttps://docs.aws.amazon.com/directoryservice/latest/admin-guide/ms_ad_setup_trust.html","upvote_count":"2","comment_id":"858462","timestamp":"1680403920.0","poster":"skr05"},{"poster":"linux_admin","comments":[{"poster":"pentium75","comment_id":"1104633","timestamp":"1703426220.0","content":"AD trust is not replication. Two-way trust means that users in domain A and access servers in domain B and vice versa. With a one-way trust, only users in the trusted domain can access resources in the trusting domain, but NOT vice versa.","upvote_count":"1"}],"upvote_count":"1","comment_id":"857007","content":"Selected Answer: B\nA two-way trust would enable AWS SSO to retrieve user and group information from the on-premises AD domain, and would also allow changes made to users and groups in AWS SSO to be synchronized back to the on-premises AD.\n\nOption A, which suggests creating a one-way trust relationship, would not enable synchronization of user and group information between AWS SSO and the on-premises AD domain.","timestamp":"1680263520.0"},{"poster":"cheese929","upvote_count":"1","content":"Selected Answer: B\nIt's B. \nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","comment_id":"849962","timestamp":"1679737140.0"},{"comment_id":"830938","content":"Selected Answer: D\nD. I'm going for this because adding the AWS directory service means that you can manage adding users within AWS as well as on prem. Installing an identity provider on premises (like AD Federation Service) means you can continue to manage everything on premises and use SAML with SSO","timestamp":"1678115100.0","poster":"StuMoz","upvote_count":"2"},{"timestamp":"1677654900.0","content":"B\n\nCreate a two-way trust relationship – When two-way trust relationships are created between AWS Managed Microsoft AD and a self-managed directory in AD, users in your self-managed directory in AD can sign in with their corporate credentials to various AWS services and business applications. One-way trusts do not work with IAM Identity Center.\n\nAWS IAM Identity Center (successor to AWS Single Sign-On) requires a two-way trust so that it has permissions to read user and group information from your domain to synchronize user and group metadata. IAM Identity Center uses this metadata when assigning access to permission sets or applications. User and group metadata is also used by applications for collaboration, like when you share a dashboard with another user or group. The trust from AWS Directory Service for Microsoft Active Directory to your domain permits IAM Identity Center to trust your domain for authentication. The trust in the opposite direction grants AWS permissions to read user and group metadata.","upvote_count":"2","comment_id":"825599","poster":"sachin"},{"upvote_count":"2","poster":"sofiella","timestamp":"1676859240.0","content":"The solution that will meet these requirements is option A, which is to enable AWS Single Sign-On (AWS SSO) from the AWS SSO console and create a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory.\n\nThis option provides a secure and efficient way to integrate the company's on-premises Microsoft Active Directory with AWS SSO, allowing users to log in to AWS accounts and applications using their existing Active Directory credentials. A one-way trust enables authentication from the Active Directory to AWS SSO, but not the other way around, ensuring that the Active Directory is not exposed to security risks from AWS SSO.","comment_id":"814736"},{"timestamp":"1674082500.0","upvote_count":"2","poster":"bullrem","comment_id":"780501","content":"D. Deploy an identity provider (IdP) on premises. Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console.\n\nThe company can use AWS SSO to enable SSO across all the company's accounts that are managed by AWS Organizations. To achieve this, the company will need to deploy an identity provider (IdP) on-premises, such as Microsoft Active Directory, and configure it to work with AWS SSO. This will allow the company to continue managing its users and groups in the on-premises self-managed Microsoft Active Directory, while also providing SSO across all the company's AWS accounts."},{"content":"Selected Answer: B\nIt's B. In order to connect an on-premise MS AD to AWS SSO (now AWS Identity Centre), you can either use an AD Connector (not one of the options) or a 2-way trust relationship between an AWS Managed MS AD and an on-premise MS AD. \n\nThe AWS docs specifically say that a 1-way trust relationship does NOT work with SSO.\n\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","timestamp":"1673976600.0","comment_id":"779137","upvote_count":"2","poster":"BlueVolcano1"},{"content":"Selected Answer: A\nI really don't get the two way trust. The question only mentions SSO (federation) to access the AWS console. It doesn't mention what happens in terms of the authentication in each service/app. So I would go for A.","poster":"dev1978","timestamp":"1673609220.0","comment_id":"774379","upvote_count":"2"},{"upvote_count":"4","poster":"SilentMilli","timestamp":"1673040600.0","comment_id":"768092","content":"Selected Answer: A\nAWS Single Sign-On (AWS SSO) does not require a two-way trust. It allows you to manage user identities and group membership in your self-managed Microsoft Active Directory and to use those identities to grant users access to your AWS accounts.\nA two-way trust relationship is not required for AWS SSO to function. A one-way forest trust or a one-way domain trust is sufficient.","comments":[{"poster":"BlueVolcano1","comment_id":"779142","upvote_count":"4","timestamp":"1673976720.0","content":"AWS docs specifically say this: \"One-way trusts do not work with IAM Identity Center.\" (Identity Centre is the successor to AWS SSO)\n\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html"}]},{"poster":"techhb","upvote_count":"1","content":"Udp is possible in aws global accelrator,so its a better choice.","comment_id":"763510","timestamp":"1672637820.0"},{"comment_id":"763505","poster":"techhb","content":"Selected Answer: B\nChoose B","upvote_count":"1","timestamp":"1672636980.0"},{"comment_id":"754690","timestamp":"1671854520.0","upvote_count":"2","content":"Should I believe the most voted or the solution shown in this website? As it always differ...","comments":[{"timestamp":"1713852960.0","poster":"lofzee","upvote_count":"1","comment_id":"1200503","content":"Use Google so it takes you directly to the AWS page where it tells you the answer is B. It'll take you about 5 seconds of work."}],"poster":"waiyiu9981"},{"comment_id":"750928","poster":"pazabal","upvote_count":"2","timestamp":"1671543060.0","content":"Selected Answer: B\nmust continue managing the users and groups in its on-premises self-managed Microsoft Active Directory = two-way forest trust"},{"timestamp":"1671503160.0","upvote_count":"5","content":"Selected Answer: A\nThe solution that will meet these requirements is A: Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console. Create a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory.\n\nAWS Single Sign-On (AWS SSO) is a service that enables users to sign in to all of their accounts in AWS Organizations centrally by using their corporate credentials. To use AWS SSO with a self-managed Microsoft Active Directory, the company can enable AWS SSO from the AWS SSO console and create a one-way forest trust or a one-way domain trust by using AWS Directory Service for Microsoft Active Directory. This will allow the company to continue managing the users and groups in its on-premises self-managed Microsoft Active Directory while providing a single sign-on solution across all the company's accounts.","comments":[{"comment_id":"750409","timestamp":"1671503160.0","upvote_count":"5","comments":[{"poster":"pentium75","content":"\"Deploying an identity provider (IdP) on premises, is not a good choice because it would not provide a single sign-on solution across all the company's accounts in AWS Organizations.\" Why not? IdP provider on premises (such as ADFS), connected to AWS SSO via SAML?","timestamp":"1703426340.0","comment_id":"1104634","upvote_count":"1"}],"poster":"Buruguduystunstugudunstuy","content":"Option B, creating a two-way forest trust, is not a good choice because it would allow the self-managed Microsoft Active Directory to manage the AWS SSO directory and potentially make unauthorized changes.\n\nOption C, using AWS Directory Service, is not a good choice because it would require the company to manage the directory in the cloud and would not allow the company to continue using its self-managed Microsoft Active Directory.\n\nOption D, deploying an identity provider (IdP) on premises, is not a good choice because it would not provide a single sign-on solution across all the company's accounts in AWS Organizations."},{"upvote_count":"3","content":"Per the URL provided by 17Master, Amazon Single Sign On requires a two way trust relationship as shown in scenario 2 https://aws.amazon.com/es/blogs/security/everything-you-wanted-to-know-about-trusts-with-aws-managed-microsoft-ad/","poster":"secdaddy","comment_id":"761687","timestamp":"1672377240.0"}],"poster":"Buruguduystunstugudunstuy","comment_id":"750408"},{"upvote_count":"4","comment_id":"749408","poster":"Richaqua","content":"You need one way trust if it is an AD connector. With MS AD, two way trust will be required","timestamp":"1671420000.0"},{"comment_id":"743296","timestamp":"1670876400.0","poster":"Shasha1","content":"Answer D \ndeploy an identity provider (IdP) on premises and enable AWS Single Sign-On (AWS SSO) from the AWS SSO console. This solution will allow the company to use its on-premises Active Directory for user authentication and access control, and will enable the company to use AWS SSO to provide SSO across its AWS accounts. Option B is not correct for me, it is because, creating a two-way forest trust using AWS Directory Service for Microsoft Active Directory is not necessary in this scenario. A two-way trust relationship can be established by deploying an on-premises IdP and enabling AWS SSO","upvote_count":"2"},{"content":"i choose A","poster":"reeba_908","upvote_count":"1","comment_id":"736947","comments":[{"upvote_count":"1","content":"why did you choose A? is it because it is one way from on premise to the cloud?","timestamp":"1671209340.0","comment_id":"747429","poster":"yoben84"}],"timestamp":"1670340480.0"},{"timestamp":"1669035480.0","poster":"Wpcorgan","upvote_count":"1","comment_id":"723501","content":"B is correct"},{"content":"Selected Answer: B\nhttps://docs.aws.amazon.com/singlesignon/latest/userguide/connectonpremad.html","comment_id":"719876","upvote_count":"2","timestamp":"1668620700.0","poster":"pepgua"},{"poster":"dave9994","upvote_count":"1","comment_id":"701345","content":"B should be the correct answer. To access AWS Console, two-way trust is required.","timestamp":"1666416540.0"},{"content":"Selected Answer: B\nb가 정답입니다","upvote_count":"3","comment_id":"699624","poster":"cark0728","timestamp":"1666249620.0"},{"timestamp":"1665808860.0","upvote_count":"5","poster":"KVK16","content":"Selected Answer: B\nIn this there is requirement of trust two ways - from On Prem domain to AWS domain. They both will trust each other. One-way trust : If Domain A is trusting Domain B , users from Domain B can access resources of Domain A but not vice-versa. So for A - its Outgoing trust and for B its incoming trust. \n\n AWS applications (Amazon Chime, Amazon Connect, Amazon QuickSight, AWS Single Sign-On, Amazon WorkDocs, Amazon WorkMail, Amazon WorkSpaces, AWS Client VPN, AWS Management Console, and AWS Transfer Family) need to be able to look up objects from the on-premises domain in order for them to function. This tells you that authentication needs to flow both ways.\n\nFor Elaborate details refer \nhttps://aws.amazon.com/blogs/security/everything-you-wanted-to-know-about-trusts-with-aws-managed-microsoft-ad/","comment_id":"695181"},{"poster":"bluer1","content":"The answer should be B, \n\nYou can configure one and two-way external and forest trust relationships between your AWS Directory Service for Microsoft Active Directory and self-managed (on-premises) directories, as well as between multiple AWS Managed Microsoft AD directories in the AWS cloud. AWS Managed Microsoft AD supports all three trust relationship directions: Incoming, Outgoing and Two-way (Bi-directional).","comment_id":"693356","timestamp":"1665604320.0","upvote_count":"2"},{"comment_id":"692742","timestamp":"1665555240.0","content":"old question : https://aws.amazon.com/fr/about-aws/whats-new/2022/07/aws-single-sign-on-aws-sso-now-aws-iam-identity-center/\n\nhttps://aws.amazon.com/fr/about-aws/whats-new/2022/04/aws-single-sign-on-configurable-synchronization-microsoft-active-directory/","poster":"masetromain","upvote_count":"1"},{"comment_id":"692675","content":"Selected Answer: A\nSSO is suitable for the senario. Because it's intergrated with AWS Organizations and on-premise Active Directory. You can centrally manage Single Sign-On to access multiple accounts .\nBut I don't know the one-way/two-way forest trust thing...","poster":"BoboChow","timestamp":"1665552780.0","upvote_count":"1"}],"answer_images":[],"question_text":"A company is migrating applications to AWS. The applications are deployed in different accounts. The company manages the accounts centrally by using AWS Organizations. The company's security team needs a single sign-on (SSO) solution across all the company's accounts. The company must continue managing the users and groups in its on-premises self-managed Microsoft Active Directory.\nWhich solution will meet these requirements?","topic":"1","answer":"B","isMC":true,"question_images":[],"choices":{"D":"Deploy an identity provider (IdP) on premises. Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console.","C":"Use AWS Directory Service. Create a two-way trust relationship with the company's self-managed Microsoft Active Directory.","A":"Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console. Create a one-way forest trust or a one-way domain trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory.","B":"Enable AWS Single Sign-On (AWS SSO) from the AWS SSO console. Create a two-way forest trust to connect the company's self-managed Microsoft Active Directory with AWS SSO by using AWS Directory Service for Microsoft Active Directory."},"url":"https://www.examtopics.com/discussions/amazon/view/85231-exam-aws-certified-solutions-architect-associate-saa-c03/","answer_ET":"B","question_id":221,"answer_description":"","exam_id":31},{"id":"F3kJ0wtzl16dbJVl5lWE","question_id":222,"topic":"1","question_images":[],"answer_images":[],"exam_id":31,"answer":"B","isMC":true,"question_text":"A company is using Amazon CloudFront with its website. The company has enabled logging on the CloudFront distribution, and logs are saved in one of the company’s Amazon S3 buckets. The company needs to perform advanced analyses on the logs and build visualizations.\n\nWhat should a solutions architect do to meet these requirements?","discussion":[{"poster":"pentium75","content":"Selected Answer: B\nData is in S3 -> Athena, not DynamoDB (thus A or B)\nVisualize -> QuickSight, not Glue (thus B or D)","comment_id":"1108605","timestamp":"1719650880.0","upvote_count":"9"},{"poster":"rrharris","content":"Answer is B - Quicksite creating data visualizations\n\nhttps://docs.aws.amazon.com/quicksight/latest/user/welcome.html","comment_id":"811337","upvote_count":"8","timestamp":"1692234420.0"},{"content":"Selected Answer: B\nGlue is meant to prepare and transform data for analytics, not to build visualizations. Hence A and C are out.\nAthena is used to analyze data stored in S3 and it is commonly used with QuickSight, thus B is the answer","timestamp":"1722238800.0","comment_id":"1134792","poster":"LoXoL","upvote_count":"4"},{"content":"Admin please remove my comment. That answer was for another question.","poster":"[Removed]","timestamp":"1718073300.0","upvote_count":"1","comment_id":"1093084"},{"comments":[{"upvote_count":"2","poster":"pentium75","content":"Why 'use queries in DynamoDB\" when the data is in S3? And why Glue?","comment_id":"1108604","timestamp":"1719650820.0"}],"timestamp":"1718061480.0","comment_id":"1092990","upvote_count":"1","poster":"[Removed]","content":"A & C combined make sense isn't it?"},{"comment_id":"1000574","poster":"Guru4Cloud","content":"Selected Answer: B\nOptionB: Amazon Athena allows you to run standard SQL queries directly on the data stored in the S3 bucket.\nAmazon QuickSight is a business intelligence (BI) service that allows you to create interactive and visual dashboards to analyze data. You can connect Amazon QuickSight to Amazon Athena to visualize the results of your SQL queries from the CloudFront logs.","upvote_count":"4","timestamp":"1709733900.0"},{"timestamp":"1706846100.0","comment_id":"969563","content":"Selected Answer: B\nOptionB: Amazon Athena allows you to run standard SQL queries directly on the data stored in the S3 bucket. \nAmazon QuickSight is a business intelligence (BI) service that allows you to create interactive and visual dashboards to analyze data. You can connect Amazon QuickSight to Amazon Athena to visualize the results of your SQL queries from the CloudFront logs.","upvote_count":"2","poster":"A1975"},{"timestamp":"1700236140.0","upvote_count":"2","poster":"ajay258","comment_id":"900213","content":"Answer is B"},{"timestamp":"1697050680.0","upvote_count":"2","comment_id":"867600","poster":"FFO","content":"Selected Answer: B\nAthena and Quicksight. Glue is for ETL transformation"},{"poster":"TariqKipkemei","upvote_count":"2","content":"Answer is B\nAnalysis on S3 = Athena\nVisualizations = Quicksight","timestamp":"1695873960.0","comment_id":"852749"},{"content":"Why the Hell A?","poster":"GalileoEC2","upvote_count":"1","timestamp":"1695562920.0","comment_id":"849440"},{"comment_id":"842993","timestamp":"1695050220.0","upvote_count":"2","content":"Why A! as far as I know Glue is not used for visualization","poster":"GalileoEC2"},{"content":"Selected Answer: B\nB because athena can be used to analyse data in s3 buckets and AWS quicksight is literally used to create visual representation of data","upvote_count":"2","timestamp":"1692634200.0","poster":"Bhrino","comment_id":"816969"},{"content":"Selected Answer: B\nUsing Athena to query the CloudFront logs in the S3 bucket and QuickSight to visualize the results is the best solution because it is cost-effective, scalable, and requires no infrastructure setup. It also provides a robust solution that enables the company to perform advanced analysis and build interactive visualizations without the need for a dedicated team of developers.","comment_id":"816808","upvote_count":"2","timestamp":"1692627060.0","poster":"LuckyAro"},{"upvote_count":"2","comment_id":"814173","timestamp":"1692448440.0","poster":"skiwili","content":"Selected Answer: B\nYes B is the answer"},{"content":"Selected Answer: B\nCorrect answer should be B.","comment_id":"814144","poster":"obatunde","timestamp":"1692446520.0","upvote_count":"2"},{"poster":"Namrash","upvote_count":"2","content":"B is correct","comment_id":"813608","timestamp":"1692398340.0"},{"upvote_count":"5","timestamp":"1692355800.0","comment_id":"812955","poster":"kpato87","content":"Selected Answer: B\nAmazon Athena can be used to analyze data in S3 buckets using standard SQL queries without requiring any data transformation. By using Athena, a solutions architect can easily and efficiently query the CloudFront logs stored in the S3 bucket. The results of the queries can be visualized using Amazon QuickSight, which provides powerful data visualization capabilities and easy-to-use dashboards. Together, Athena and QuickSight provide a cost-effective and scalable solution to analyze CloudFront logs and build visualizations."},{"comment_id":"812713","upvote_count":"4","content":"Selected Answer: B\nshould be B","poster":"Joan111edu","timestamp":"1692332640.0"},{"content":"Selected Answer: D\nhttps://aws.amazon.com/blogs/big-data/harmonize-query-and-visualize-data-from-various-providers-using-aws-glue-amazon-athena-and-amazon-quicksight/\nhttps://docs.aws.amazon.com/comprehend/latest/dg/tutorial-reviews-visualize.html","timestamp":"1692297660.0","upvote_count":"2","poster":"bdp123","comments":[{"comment_id":"823097","upvote_count":"2","timestamp":"1693091520.0","content":"attached file realted with B","poster":"tellmenowwwww"}],"comment_id":"812347"}],"answer_ET":"B","choices":{"B":"Use standard SQL queries in Amazon Athena to analyze the CloudFront logs in the S3 bucket. Visualize the results with Amazon QuickSight.","D":"Use standard SQL queries in Amazon DynamoDB to analyze the CloudFront logs in the S3 bucket. Visualize the results with Amazon QuickSight.","C":"Use standard SQL queries in Amazon DynamoDB to analyze the CloudFront logs in the S3 bucket. Visualize the results with AWS Glue.","A":"Use standard SQL queries in Amazon Athena to analyze the CloudFront logs in the S3 bucket. Visualize the results with AWS Glue."},"unix_timestamp":1676603220,"url":"https://www.examtopics.com/discussions/amazon/view/99508-exam-aws-certified-solutions-architect-associate-saa-c03/","answer_description":"","timestamp":"2023-02-17 04:07:00","answers_community":["B (95%)","5%"]},{"id":"a7QhNkH9sHmwgRNhSgLJ","isMC":true,"question_images":[],"answers_community":["A (88%)","6%"],"unix_timestamp":1676604480,"question_text":"A company runs a fleet of web servers using an Amazon RDS for PostgreSQL DB instance. After a routine compliance check, the company sets a standard that requires a recovery point objective (RPO) of less than 1 second for all its production databases.\n\nWhich solution meets these requirements?","answer_description":"","question_id":223,"answer":"A","answer_ET":"A","discussion":[{"content":"A:\nBy using Multi-AZ deployment, the company can achieve an RPO of less than 1 second because the standby instance is always in sync with the primary instance, ensuring that data changes are continuously replicated.","timestamp":"1692654960.0","poster":"KZM","upvote_count":"24","comment_id":"817294"},{"comment_id":"971563","timestamp":"1707014040.0","content":"Selected Answer: A\nRead Replicas:\nRead Replicas are asynchronous and support read scalability.\nIt is uese to improve performance.\nRead Replicas can be in the same region or in a different region for disaster recovery purposes, but this involves manual intervention,\nwhich means Read Replicas do not provide automatic failover and requires DNS updates and application changes\n\nMulti-AZ:\nMulti-AZ maintains a synchronous standby replica of the primary instance in a different Availability Zone within the same region.\nMulti-AZ deployments provide high availability and automatic failover. \n\nOption A is better choice with respect to below statement,\n\"the company sets a standard that requires a recovery point objective (RPO) of less than 1 second for all its production databases.\"","poster":"A1975","upvote_count":"14"},{"timestamp":"1737386280.0","comment_id":"1343680","content":"Selected Answer: B\nSolução Detalhada:\nConfigure o grupo de segurança do EC2 com uma regra de entrada para permitir conexões apenas do grupo de segurança do ALB.\nA AWS permite essa associação dinâmica, o que garante que apenas o tráfego legítimo roteado pelo ALB possa chegar às instâncias.\nEssa é uma prática recomendada e atende ao objetivo de restringir o acesso às instâncias do EC2.","poster":"Rcosmos","upvote_count":"1"},{"poster":"manoj6992","content":"Correct answer is A","timestamp":"1727650680.0","upvote_count":"2","comment_id":"1185765"},{"content":"Same question old from SAA-C02 \n08.2021\n\nhttps://www.examtopics.com/discussions/amazon/view/61072-exam-aws-certified-solutions-architect-associate-saa-c02/","poster":"Uzbekistan","upvote_count":"2","comment_id":"1184752","timestamp":"1727518800.0"},{"upvote_count":"2","comment_id":"1184746","content":"Selected Answer: C\nC. Configure the DB instance in one Availability Zone, and create multiple read replicas in a separate Availability Zone.\nHere's why:\nRead Replicas: By configuring read replicas in a separate Availability Zone, you can leverage asynchronous replication to replicate data from the primary DB instance to the read replicas with minimal latency. This setup allows for near real-time data replication and can help achieve a low RPO.\n\nIn contrast, Multi-AZ deployments (Option A) provide high availability by maintaining a standby replica but may not guarantee an RPO of less than 1 second due to synchronous replication and failover considerations. Options B and D are not directly related to achieving a low RPO for the databases.","poster":"Uzbekistan","timestamp":"1727517900.0"},{"content":"I'm unsure with A, because the term RPO is not only applied to datacenter outages. Say, an application error corrupts the database, or an administrator accidentally overwrites all records. With answer A, Multi-AZ, these changes would be instantly copied to the replica.\n\nOnly reason why A might still be correct is that the other answers don't make much more sense.\n\nB has nothing to do with RPO at all\nC could lose more than 1 second since read replicas are asynchronous\nD could be part of a solution but the CDC ask alone won't help","comment_id":"1108613","upvote_count":"7","poster":"pentium75","timestamp":"1719651540.0"},{"comment_id":"944507","timestamp":"1704542160.0","upvote_count":"1","poster":"narddrer","content":"Selected Answer: D\noption A doesn't provide Data integrity only achieved in Option D using CDC."},{"poster":"FFO","content":"Selected Answer: A\nUsed for DR. Every single change is replicated in a standby AZ. If we lose the main AZ, (uses the same DNS name) standby becomes automatic failover and the new main DB.","timestamp":"1697051220.0","comment_id":"867604","upvote_count":"4"},{"upvote_count":"2","comment_id":"852750","poster":"TariqKipkemei","content":"Answer is A\nHigh availability = Multi AZ","timestamp":"1695874200.0"},{"upvote_count":"2","poster":"Steve_4542636","timestamp":"1693673640.0","comment_id":"827264","content":"Selected Answer: A\nMy vote is A"},{"content":"Agree with A","timestamp":"1692654420.0","poster":"ManOnTheMoon","upvote_count":"2","comment_id":"817290"},{"comment_id":"816091","poster":"LuckyAro","content":"Selected Answer: A\nMulti-AZ is a synchronous communication with the Master in \"real time\" and fail over will be almost instant.","timestamp":"1692575220.0","upvote_count":"4"},{"comment_id":"814690","timestamp":"1692483960.0","upvote_count":"2","content":"Selected Answer: A\ncorrect is A","poster":"GwonLEE"},{"comment_id":"813606","content":"A should be correct","timestamp":"1692398340.0","upvote_count":"3","poster":"Namrash"},{"upvote_count":"3","content":"Selected Answer: A\nshould be A","comment_id":"812714","timestamp":"1692332700.0","poster":"Joan111edu"},{"timestamp":"1692235680.0","upvote_count":"8","content":"Correct Answer is A","comment_id":"811348","poster":"rrharris"}],"answer_images":[],"topic":"1","timestamp":"2023-02-17 04:28:00","exam_id":31,"url":"https://www.examtopics.com/discussions/amazon/view/99511-exam-aws-certified-solutions-architect-associate-saa-c03/","choices":{"C":"Configure the DB instance in one Availability Zone, and create multiple read replicas in a separate Availability Zone.","A":"Enable a Multi-AZ deployment for the DB instance.","D":"Configure the DB instance in one Availability Zone, and configure AWS Database Migration Service (AWS DMS) change data capture (CDC) tasks.","B":"Enable auto scaling for the DB instance in one Availability Zone."}},{"id":"l1V5jpNny80BeEntvOs3","topic":"1","question_text":"A company runs a web application that is deployed on Amazon EC2 instances in the private subnet of a VPC. An Application Load Balancer (ALB) that extends across the public subnets directs web traffic to the EC2 instances. The company wants to implement new security measures to restrict inbound traffic from the ALB to the EC2 instances while preventing access from any other source inside or outside the private subnet of the EC2 instances.\n\nWhich solution will meet these requirements?","answer":"B","timestamp":"2023-02-17 16:04:00","question_images":[],"discussion":[{"poster":"Abrar2022","content":"Read the discussion, that’s the whole point why examtopics picks the wrong answer. Follow most voted answer not examtopics answer","comment_id":"912558","timestamp":"1701502860.0","upvote_count":"13"},{"timestamp":"1709733360.0","content":"Selected Answer: B\nConfigure the security group for the EC2 instances to only allow traffic that comes from the security group for the ALB","upvote_count":"8","poster":"Guru4Cloud","comment_id":"1000567"},{"upvote_count":"1","timestamp":"1737386280.0","comment_id":"1343682","content":"Selected Answer: B\nSolução Detalhada:\nConfigure o grupo de segurança do EC2 com uma regra de entrada para permitir conexões apenas do grupo de segurança do ALB.\nA AWS permite essa associação dinâmica, o que garante que apenas o tráfego legítimo roteado pelo ALB possa chegar às instâncias.\nEssa é uma prática recomendada e atende ao objetivo de restringir o acesso às instâncias do EC2.","poster":"Rcosmos"},{"timestamp":"1737386100.0","comment_id":"1343678","poster":"Rcosmos","upvote_count":"1","content":"Selected Answer: B\nExplicação\nRequisito: Garantir que o tráfego para as instâncias do EC2 só venha do Application Load Balancer (ALB) e não de outras fontes dentro ou fora da sub-rede privada.\nComo funciona:\nO grupo de segurança associado às instâncias do EC2 pode ser configurado para aceitar tráfego apenas de outro grupo de segurança, neste caso, o do ALB.\nIsso cria uma relação explícita, onde as instâncias do EC2 só aceitam conexões originadas pelo ALB, independentemente de sua localização (sub-rede pública ou privada)."},{"comments":[{"comment_id":"1060783","content":"is just admins fault dont worry, he just made a mistake, because \"C\" doesnt make any sence","timestamp":"1714667760.0","upvote_count":"1","poster":"David_Ang"},{"upvote_count":"1","poster":"theochan","content":"i don't even understand what the question is trying to ask","timestamp":"1721284140.0","comment_id":"1125626"}],"upvote_count":"2","poster":"awslearner7","timestamp":"1705939500.0","content":"can anybody explains the question?","comment_id":"959597"},{"upvote_count":"3","content":"Selected Answer: B\nIt's very confusing that the system marks C as correct.","timestamp":"1700983140.0","poster":"antropaws","comment_id":"907072"},{"comment_id":"867608","timestamp":"1697051580.0","content":"Selected Answer: B\nThis is B. Question already tells us they only want ONLY traffic from the ALB.","poster":"FFO","upvote_count":"2"},{"content":"Answer is B","comments":[{"timestamp":"1712031360.0","content":"A security group acts as a firewall that controls the traffic allowed to and from the resources in your virtual private cloud (VPC).","comment_id":"1022795","poster":"TariqKipkemei","upvote_count":"2"}],"poster":"TariqKipkemei","upvote_count":"2","comment_id":"852752","timestamp":"1695874320.0"},{"content":"Why C! another cazy answer , If i am concern about security why I would want to expose my EC2 to the public internet,not make sense at all, am I \ncorrect with this? I also go with B","comment_id":"843008","timestamp":"1695051000.0","upvote_count":"3","poster":"GalileoEC2"},{"poster":"LuckyAro","content":"Selected Answer: B\nB is the correct answer.","timestamp":"1692575280.0","comment_id":"816093","upvote_count":"3"},{"comment_id":"812960","upvote_count":"5","poster":"kpato87","timestamp":"1692356040.0","content":"Selected Answer: B\nconfigure the security group for the EC2 instances to only allow traffic that comes from the security group for the ALB. This ensures that only the traffic originating from the ALB is allowed access to the EC2 instances in the private subnet, while denying any other traffic from other sources. The other options do not provide a suitable solution to meet the stated requirements."},{"poster":"Bhawesh","comment_id":"812029","content":"Selected Answer: B\nB. Configure the security group for the EC2 instances to only allow traffic that comes from the security group for the ALB.","timestamp":"1692277440.0","upvote_count":"4"}],"answer_ET":"B","question_id":224,"answer_description":"","url":"https://www.examtopics.com/discussions/amazon/view/99660-exam-aws-certified-solutions-architect-associate-saa-c03/","answer_images":[],"isMC":true,"unix_timestamp":1676646240,"answers_community":["B (100%)"],"exam_id":31,"choices":{"C":"Move the EC2 instances into the public subnet. Give the EC2 instances a set of Elastic IP addresses.","A":"Configure a route in a route table to direct traffic from the internet to the private IP addresses of the EC2 instances.","B":"Configure the security group for the EC2 instances to only allow traffic that comes from the security group for the ALB.","D":"Configure the security group for the ALB to allow any TCP traffic on any port."}},{"id":"QVtWGhmjLA4RWBdiVrOi","timestamp":"2023-02-17 04:33:00","answer_images":[],"answer":"D","question_text":"A research company runs experiments that are powered by a simulation application and a visualization application. The simulation application runs on Linux and outputs intermediate data to an NFS share every 5 minutes. The visualization application is a Windows desktop application that displays the simulation output and requires an SMB file system.\n\nThe company maintains two synchronized file systems. This strategy is causing data duplication and inefficient resource usage. The company needs to migrate the applications to AWS without making code changes to either application.\n\nWhich solution will meet these requirements?","url":"https://www.examtopics.com/discussions/amazon/view/99512-exam-aws-certified-solutions-architect-associate-saa-c03/","unix_timestamp":1676604780,"question_id":225,"answers_community":["D (98%)","2%"],"answer_ET":"D","choices":{"D":"Migrate the simulation application to Linux Amazon EC2 instances. Migrate the visualization application to Windows EC2 instances. Configure Amazon FSx for NetApp ONTAP for storage.","A":"Migrate both applications to AWS Lambda. Create an Amazon S3 bucket to exchange data between the applications.","C":"Migrate the simulation application to Linux Amazon EC2 instances. Migrate the visualization application to Windows EC2 instances. Configure Amazon Simple Queue Service (Amazon SQS) to exchange data between the applications.","B":"Migrate both applications to Amazon Elastic Container Service (Amazon ECS). Configure Amazon FSx File Gateway for storage."},"question_images":[],"exam_id":31,"isMC":true,"discussion":[{"comments":[{"upvote_count":"1","comment_id":"1314745","poster":"JA2018","timestamp":"1732028760.0","content":"https://aws.amazon.com/fsx/netapp-ontap/features/#:~:text=Amazon%20FSx%20for%20NetApp%20ONTAP%20offers%20high%2Dperformance%20file%20storage,NVMe%2Dover%2DTCP%20protocols."}],"comment_id":"816102","poster":"LuckyAro","upvote_count":"27","content":"Selected Answer: D\nAmazon FSx for NetApp ONTAP provides shared storage between Linux and Windows file systems.","timestamp":"1676944740.0"},{"upvote_count":"9","timestamp":"1682783100.0","comment_id":"884466","comments":[{"comment_id":"1314746","timestamp":"1732028820.0","poster":"JA2018","upvote_count":"1","content":"lift-and-shift aka rehost => minimal/ no code change required (caveat: it depends on the original application design)."},{"poster":"kruasan","upvote_count":"1","content":"The other options would require more significant changes:\nA. Migrating to Lambda would require re-architecting both applications and not meet the requirement to avoid code changes. S3 does not provide file system access. \nB. While ECS could run the apps without code changes, FSx File Gateway only provides S3 or EFS storage, neither of which offer both NFS and SMB access. Data exchange would still be an issue.\nC. Using SQS for data exchange between EC2 instances would require code changes to implement a messaging system rather than a shared file system.","timestamp":"1682783100.0","comments":[{"comment_id":"974287","poster":"mr_kanchan","upvote_count":"2","content":"How does the data duplication issue get addressed on selecting D ?","timestamp":"1691364660.0","comments":[{"upvote_count":"2","content":"Maybe I'm wrong, but I feel like the data is duplicated between the two types of EC2 instances. By using the FSX ONTAP will address this issue.","comment_id":"987017","timestamp":"1692672780.0","poster":"Reckless_Jas"},{"content":"Because FSx for ONTAP provides THE SAME STORAGE via NFS and SMB. Duplication issue occured because Linux saved the files via NFS to one storage, then the data was copied to ANOTHER storage that shared it via SMB.","comment_id":"1108621","timestamp":"1703847780.0","poster":"pentium75","upvote_count":"3"}]}],"comment_id":"884469"}],"poster":"kruasan","content":"Selected Answer: D\nThis solution satisfies the needs in the following ways:\n• Amazon EC2 provides a seamless migration path for the existing server-based applications without code changes. The simulation app can run on Linux EC2 instances and the visualization app on Windows EC2 instances.\n• Amazon FSx for NetApp ONTAP provides highly performant file storage that is accessible via both NFS and SMB. This allows the simulation app to write to NFS shares as currently designed, and the visualization app to access the same data via SMB.\n• FSx for NetApp ONTAP ensures the data is synchronized and up to date across the file systems. This addresses the data duplication issues of the current setup. \n• Resources can be scaled efficiently since EC2 and FSx provide scalable compute and storage on demand."},{"comment_id":"1314747","content":"Selected Answer: D\nAmazon FSx for NetApp ONTAP offers high-performance file storage that’s broadly accessible from Linux, Windows, and macOS compute instances via the industry-standard NFS, SMB, iSCSI, and NVMe-over-TCP protocols. It enables you to use ONTAP’s widely adopted data management capabilities, like snapshots, clones, and replication, with the click of a button. In addition, it provides low-cost storage capacity that’s fully elastic and virtually unlimited in size, and supports compression and deduplication to help you further reduce storage costs.","upvote_count":"1","timestamp":"1732028940.0","poster":"JA2018"},{"content":"Selected Answer: D\nIt is D but I think NetApp ONTAP is an oversell in this context. They just needed a FSx solution not a whole expensive managed service... \n\nABC are a lot of change to the code so D is the only choice here anyway","upvote_count":"3","poster":"awsgeek75","timestamp":"1705532940.0","comment_id":"1125407"},{"content":"Selected Answer: D\nAmazon FSx for NetApp ONTAP \nFully managed service offering shared storage between Linux and Windows file systems (Multi & Single-AZ) up to petabytes datasets and 10+Gbps. \n- Allows Multi-protocol access to data using the (NFS), Server Message Block (SMB), and Internet Small Computer Systems Interface (iSCSI) protocols\n- Integrated with other AWS services (KMS, IAM, CloudTrail, amazon workspace)\n- ideal solution to migrate, back up, or burst your file-based applications from on-prem to AWS without application code change.","poster":"djgodzilla","timestamp":"1704582720.0","upvote_count":"3","comment_id":"1115492"},{"comment_id":"1108625","upvote_count":"2","timestamp":"1703847960.0","poster":"pentium75","content":"Selected Answer: D\nA would require code changes\nB might also require code changes, and \"FSx File Gateway\" provides SMB access (not NFS)\nC uses SQS which has no place here\nD can provide same storage via SMB and NFS"},{"content":"https://docs.aws.amazon.com/fsx/latest/ONTAPGuide/what-is-fsx-ontap.html","comment_id":"1097392","upvote_count":"2","poster":"osmk","timestamp":"1702650360.0"},{"timestamp":"1696220640.0","content":"Selected Answer: D\nOne of the use cases for Amazon FSx for NetApp ONTAP is when you need to move workloads running on NetApp or other NFS/SMB/iSCSI servers to AWS without modifying application code or how you manage data.","comment_id":"1022801","upvote_count":"5","poster":"TariqKipkemei"},{"poster":"Guru4Cloud","content":"Selected Answer: D\nThe key requirements are:\n\nSimulation app runs on Linux, outputs data to NFS\nVisualization app runs on Windows, requires SMB file system\nMigrate apps to AWS without code changes\nEliminate data duplication and inefficient resource usage","upvote_count":"3","comment_id":"1000543","timestamp":"1693999380.0"},{"upvote_count":"3","comment_id":"912563","poster":"Abrar2022","content":"For shared storage between Linux and windows you need to implement Amazon FSx for NetApp ONTAP","timestamp":"1685684700.0"},{"comment_id":"827221","timestamp":"1677781380.0","upvote_count":"3","poster":"Wael216","content":"Selected Answer: D\nwindows => FSX\nwe didn't mention containers => can't be ECS"},{"poster":"everfly","content":"Selected Answer: D\nAmazon FSx for NetApp ONTAP is a fully managed service that provides shared file storage built on NetApp’s popular ONTAP file system. It supports NFS, SMB, and iSCSI protocols2 and also allows multi-protocol access to the same data","timestamp":"1676879760.0","upvote_count":"2","comment_id":"814976"},{"content":"Selected Answer: D\nAmazon FSx for NetApp ONTAP is a fully-managed shared storage service built on NetApp’s popular ONTAP file system. Amazon FSx for NetApp ONTAP provides the popular features, performance, and APIs of ONTAP file systems with the agility, scalability, and simplicity of a fully managed AWS service, making it easier for customers to migrate on-premises applications that rely on NAS appliances to AWS. FSx for ONTAP file systems are similar to on-premises NetApp clusters. Within each file system that you create, you also create one or more storage virtual machines (SVMs). These are isolated file servers each with their own endpoints for NFS, SMB, and management access, as well as authentication (for both administration and end-user data access). In turn, each SVM has one or more volumes which store your data.\nhttps://aws.amazon.com/de/blogs/storage/getting-started-cloud-file-storage-with-amazon-fsx-for-netapp-ontap-using-netapp-management-tools/","timestamp":"1676799540.0","poster":"Yechi","comment_id":"813916","upvote_count":"5"},{"comments":[{"comment_id":"1108622","timestamp":"1703847840.0","upvote_count":"2","poster":"pentium75","content":"\"FSx File Gateway\" is a gateway, and ECS would require code changes."}],"upvote_count":"1","timestamp":"1676710980.0","poster":"zTopic","content":"Selected Answer: B\nB is correct I believe","comment_id":"812799"},{"timestamp":"1676604780.0","comment_id":"811350","content":"Answer is D","upvote_count":"8","poster":"rrharris"}],"answer_description":"","topic":"1"}],"exam":{"provider":"Amazon","isBeta":false,"numberOfQuestions":1019,"isMCOnly":true,"id":31,"lastUpdated":"11 Apr 2025","isImplemented":true,"name":"AWS Certified Solutions Architect - Associate SAA-C03"},"currentPage":45},"__N_SSP":true}