{"pageProps":{"questions":[{"id":"zW4WSSb7qZ8BcC81x0Pc","discussion":[{"comments":[{"content":"The good answer was B before may 2022, because the rotation schedule for AWS managed keys was 3 years (SSE-S3 is based on it)... \n\nFrom may 2022 the schedule rotation is 1 year, then A is now the best answer because there is NO operational task to do: S3 is by default encrypted at rest with SSE-S3 (rotation every year)... So it depends if the question has been updated since 2022","timestamp":"1700054880.0","poster":"bicrasse","comment_id":"1071482","upvote_count":"17"},{"comments":[{"upvote_count":"29","content":"But...\n\nFor A there is no reference to how often these keys are rotated, and to rotate to a new key, you need to upload it, which is operational overhead. So not only does it not necessarily meet the 'rotate keys every year' requirement, but every year it requires operational overhead.\n\nMore importantly, the question states move the objects first, and then configure encryption, but ...\"There is no change to the encryption of the objects that existed in the bucket before default encryption was enabled.\" from https://docs.aws.amazon.com/AmazonS3/latest/userguide/default-bucket-encryption.html\n\nSo A is clearly wrong.\n\nFor B, whilst you have to set up KMS once, you then don't have to anything else, which i would say is LEAST operational overhead.","timestamp":"1673334540.0","comment_id":"771140","poster":"JayBee65"},{"content":"God bless you, man! The most articulated answers, easy to understand. Good job!","comment_id":"765300","upvote_count":"4","poster":"ocbn3wby","comments":[{"poster":"jerryl","upvote_count":"1","comment_id":"1409839","timestamp":"1742858820.0","content":"\"no change before default encryption is enabled\" is still stated there, but also aws says currently all S3 already enabled default encryption, so i think here is quite confusing\nand, I can't really find a source talking about the rotation config for SSE-S3 (it only says rotation available)\nso I will vote for B"},{"poster":"ocbn3wby","upvote_count":"1","comment_id":"800122","timestamp":"1675708680.0","content":"Reviewed it the second time. Some of them are wrong, indeed."}],"timestamp":"1672811880.0"}],"comment_id":"754474","content":"Option B involves using a customer-managed AWS KMS key and enabling automatic key rotation, but this requires the company to manage the KMS key and monitor the key rotation process. \n\nOption C involves using a customer-managed AWS KMS key, but this requires the company to manually rotate the key every year, which introduces additional operational overhead. \n\nOption D involves encrypting the data with customer key material and creating a KMS key without key material, but this requires the company to manage the customer key material and import it into the KMS key, which introduces additional operational overhead.","upvote_count":"3","timestamp":"1671824820.0","poster":"Buruguduystunstugudunstuy"},{"comments":[{"content":"Ignoring the new changes that the default encryption is already enabled. I agree that the encryption should be configured before moving the data into the bucket. Otherwise, the existing objects will remain unencrypted.\n\nCorrect Answer is B. \n\nAdditionally, where is the reference that SSE-S3 will rotate keys every year (which is the question's requirement).","upvote_count":"3","timestamp":"1690995300.0","comment_id":"970398","poster":"Smart"},{"timestamp":"1674842580.0","comment_id":"789868","comments":[{"upvote_count":"4","content":"SSE DOES not rotate encryption keys, it changes master key used to lock encryption keys which creates new ciphered key and stores it.","comment_id":"1113603","timestamp":"1704366060.0","poster":"Wang87"}],"poster":"LuckyAro","content":"https://docs.aws.amazon.com/AmazonS3/latest/userguide/default-bucket-encryption.html","upvote_count":"2"}],"content":"The order of these events is being ignored here in my opinion. The encryption checkbox needs to be checked before data is moved into the S3 bucket or it will not be encrypted otherwise, you'll have to encrypt manually and reload into S3 bucket. If the box was checked before moving data into S3 then you are good to go !","upvote_count":"9","poster":"LuckyAro","comment_id":"789864","timestamp":"1674842400.0"},{"poster":"pentium75","upvote_count":"3","comments":[{"poster":"pentium75","comments":[{"comment_id":"1111197","upvote_count":"3","timestamp":"1704115980.0","comments":[{"upvote_count":"2","comment_id":"1162017","content":"https://repost.aws/questions/QUES_1VN01TU-eRSO3LXergA/s3-managed-key-sse-s3-rotation-period","timestamp":"1709156940.0","comments":[{"poster":"JA2018","content":"Check out the AWs link mentioned in the response:\n\nhttps://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#key-mgmt\n\nFor AWS managed key (https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#aws-managed-cmk)\n\nAutomatic rotation (https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html) --> Required. Every year (approximately 365 days).","upvote_count":"1","comment_id":"1313990","timestamp":"1731934620.0"}],"poster":"Maru86"},{"timestamp":"1709157120.0","content":"02.2024:\"AWS doesn't have a published frequency to rotate the keys used in SSE-S3.\"","comment_id":"1162018","upvote_count":"2","poster":"Maru86"},{"timestamp":"1704116400.0","comment_id":"1111207","content":"Never mind: https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html#rotating-kms-keys\n\nFound the doc link.","poster":"awsgeek75","comments":[{"comment_id":"1116893","timestamp":"1704739500.0","upvote_count":"4","poster":"SVDK","content":"Where on the page does it mention SSE-S3 yearly rotation???"}],"upvote_count":"2"}],"poster":"awsgeek75","content":"I want to find a source for this yearly rotation because SSE-S3 just rotates periodically and doesn't say it follows the same policy as other managed key. I think you may be right but just need a doc link"},{"timestamp":"1704133740.0","content":"https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#master_keys","upvote_count":"1","comments":[{"poster":"FlyingHawk","timestamp":"1738527780.0","upvote_count":"1","comment_id":"1350642","content":"Amazon S3 encrypts each object with a unique key. As an additional safeguard, it encrypts the key itself with a root key that it regularly rotates. However, AWS does not publicly disclose the specific frequency of these rotations"}],"comment_id":"1111382","poster":"tohegajaf"}],"timestamp":"1703662680.0","upvote_count":"5","content":"No, I stand corrected.\n\nAll AWS managed keys are automatically rotated every year. You cannot change this rotation schedule.","comment_id":"1106645"}],"timestamp":"1703662500.0","content":"SSE-S3 rotates the keys when AWS wants it, not \"every year\" like required here.","comment_id":"1106644"}],"upvote_count":"44","comment_id":"754472","content":"Selected Answer: A\nKEYWORD: LEAST operational overhead\n\nTo encrypt the data when it is stored in the S3 bucket and automatically rotate the encryption key every year with the least operational overhead, the company can use server-side encryption with Amazon S3-managed encryption keys (SSE-S3). SSE-S3 uses keys that are managed by Amazon S3, and the built-in key rotation behavior of SSE-S3 encryption keys automatically rotates the keys every year.\n\nTo meet the requirements of the company, the solutions architect can move the data to the S3 bucket and enable server-side encryption with SSE-S3. This solution requires no additional configuration or maintenance and has the least operational overhead.\n\nHence, the correct answer is;\n\nOption A. Move the data to the S3 bucket. Use server-side encryption with Amazon S3-managed encryption keys (SSE-S3). Use the built-in key rotation behavior of SSE-S3 encryption keys.","poster":"Buruguduystunstugudunstuy","timestamp":"1671824760.0"},{"timestamp":"1671582720.0","comment_id":"751708","poster":"techhb","upvote_count":"33","content":"Selected Answer: B\nSSE-S3 - is free and uses AWS owned CMKs (CMK = Customer Master Key). The encryption key is owned and managed by AWS, and is shared among many accounts. Its rotation is automatic with time that varies as shown in the table here. The time is not explicitly defined.\n\nSSE-KMS - has two flavors:\n\nAWS managed CMK. This is free CMK generated only for your account. You can only view it policies and audit usage, but not manage it. Rotation is automatic - once per 1095 days (3 years),\nCustomer managed CMK. This uses your own key that you create and can manage. Rotation is not enabled by default. But if you enable it, it will be automatically rotated every 1 year. This variant can also use an imported key material by you. If you create such key with an imported material, there is no automated rotation. Only manual rotation.\nSSE-C - customer provided key. The encryption key is fully managed by you outside of AWS. AWS will not rotate it.","comments":[{"comment_id":"905609","content":"AWS managed CMK rotates every 365 days (not 1095 days). Reference: \n https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#key-mgmt","poster":"ruqui","timestamp":"1684914360.0","upvote_count":"3"}]},{"content":"Selected Answer: B\nWhy it is not B - we can not rely on implicit period of rotation for S3 kry.","comment_id":"1559021","upvote_count":"1","comments":[{"poster":"chest_jd","upvote_count":"1","timestamp":"1744134000.0","content":"Sorry - it is not A - we can not rely on implicit period of rotation for S3 key.","comment_id":"1559022"}],"timestamp":"1744133940.0","poster":"chest_jd"},{"content":"Selected Answer: B\nAmazon S3 managed encryption keys (SSE-S3), Amazon S3 handles the key rotation automatically and regularly. Key points regarding the rotation schedule:\nSSE-S3 uses a unique encryption key for each object. \nThese individual object keys are themselves encrypted with a root key.\nAmazon S3 regularly rotates this root key as an additional security measure.\nThe exact rotation schedule for the root key is not publicly disclosed for security reasons.\n\nHence Answer is B","upvote_count":"1","comment_id":"1411043","poster":"AwsAbhiKumar","timestamp":"1743109560.0"},{"content":"Selected Answer: B\nThe answer should be B in this case cause we exactly know that AWS Managed (SSE-KMS) is automatically rotated annually. AWS does not disclose the rotation schedule of SSE-S3 keys","upvote_count":"1","poster":"SirDNS","comment_id":"1401878","timestamp":"1742639280.0"},{"poster":"yangbo","upvote_count":"2","timestamp":"1740895680.0","comment_id":"1363836","content":"Selected Answer: B\nSSE-S3 is not rotate keys every year"},{"poster":"Dharmarajan","comment_id":"1352695","upvote_count":"1","timestamp":"1738882500.0","content":"Selected Answer: A\nIt can be done with A & B, but with A, SSE-S3 there are no charges."},{"timestamp":"1738527900.0","content":"Selected Answer: B\nAWS does not specify the exact rotation frequency for SSE-S3 root keys, AWS Managed Keys are rotated annually, and Customer Managed Keys offer customizable rotation options.","upvote_count":"1","comment_id":"1350644","poster":"FlyingHawk"},{"comment_id":"1346441","poster":"suresh_01","timestamp":"1737808860.0","content":"Selected Answer: A\nAmazon S3 now applies server-side encryption with Amazon S3 managed keys (SSE-S3) as the base level of encryption for every \nbucket in Amazon S3. Starting January 5, 2023, all new object uploads to Amazon S3 are automatically encrypted at no additional \ncost and with no impact on performance. The automatic encryption status for S3 bucket default encryption configuration and for \nnew object uploads is available in AWS CloudTrail logs, S3 Inventory, S3 Storage Lens, the Amazon S3 console, and as an \nadditional Amazon S3 API response header in the AWS Command Line Interface and AWS SDKs.","upvote_count":"1"},{"poster":"4729e6c","upvote_count":"1","timestamp":"1736898780.0","content":"Selected Answer: B\nA is incorrect because SSE-S3 rotates keys when AWS thinks is right, not when customer wants (\"every year\") \nB is correct because AWS KMS customer managed keys allow automatic key rotation every year, meeting the requirement while minimizing operational overhead.","comment_id":"1340563"},{"upvote_count":"1","content":"Selected Answer: B\nEncryption in S3: S3 supports encryption at rest using Server-Side Encryption (SSE).\nKey Rotation:\nSSE-S3 (Option A): Uses Amazon S3-managed encryption keys, but these keys do not provide configurable automatic rotation or fine-grained control over key management.\nCustomer Managed Keys in AWS KMS (Option B): Allow full control, including automatic key rotation every year, meeting the requirement with low operational overhead.\nManually rotating keys (Option C) adds operational overhead and is unnecessary since AWS KMS supports automatic rotation.\nClient-Side Encryption (Option D) increases operational complexity unnecessarily.","poster":"RakshithKV","comment_id":"1335448","timestamp":"1735810380.0"},{"poster":"HiraPBI","timestamp":"1735294740.0","comment_id":"1332350","upvote_count":"1","content":"Selected Answer: B\nB seems correct option as AWS does not specify the keys rotation period for SSE-S3. So, it cannot be A."},{"comment_id":"1331672","poster":"hilker1983","upvote_count":"1","content":"Selected Answer: B\nAWS Key Management Service (KMS) customer managed keys support automatic annual rotation.\nBy setting the S3 bucket's default encryption to use this KMS key, data is encrypted automatically when stored.\nMeets both the encryption and rotation requirements with low operational overhead.","timestamp":"1735152360.0"},{"content":"Selected Answer: B\nWhy Option B is Correct:\n\n AWS KMS Customer Managed Keys (CMKs):\n Customer managed KMS keys allow you to control encryption and enable automatic key rotation.\n Key rotation is handled seamlessly by AWS KMS, with no manual intervention required.\n Default S3 Encryption Behavior:\n Setting the S3 bucket’s default encryption to use the KMS CMK ensures all objects are automatically encrypted as they are uploaded.\n Operational Overhead:\n AWS automatically rotates the keys annually without impacting existing encrypted data, reducing operational overhead.","comment_id":"1327811","upvote_count":"1","timestamp":"1734425040.0","poster":"dipenich"},{"timestamp":"1734184560.0","upvote_count":"1","comment_id":"1326482","content":"Selected Answer: A\nAgree with A - Least operational overhead is the word we should be looking for.","poster":"GilbertMuneka"},{"content":"Selected Answer: B\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html#rotate-keys-manually\nAWS owned keys\nYou cannot enable or disable key rotation for AWS owned keys. The key rotation strategy for an AWS owned key is determined by the AWS service that creates and manages the key. For details, see the Encryption at Rest topic in the user guide or developer guide for the service.","comment_id":"1325889","poster":"ARV14","upvote_count":"1","timestamp":"1734041520.0"},{"upvote_count":"1","comment_id":"1324447","poster":"SteveNguyen","content":"Selected Answer: B\nSSE-S3 does not support automatic key rotation.\nhttps://repost.aws/questions/QUES_1VN01TU-eRSO3LXergA/s3-managed-key-sse-s3-rotation-period","timestamp":"1733819460.0"},{"upvote_count":"2","comment_id":"1311147","content":"Selected Answer: A\nnowhere in question they mentioned about control over keys or customization of keys, so choosing option B shouldnt be considered. In Option A SSE-S3, AWS manages everything . Primary concern raised in question is operational overhead with autorotation of keys.","poster":"jayessh","timestamp":"1731482160.0"},{"comments":[{"timestamp":"1731934680.0","poster":"JA2018","upvote_count":"1","content":"For AWS managed key (https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#aws-managed-cmk)\n\nAutomatic rotation (https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html) --> Required. Every year (approximately 365 days).","comment_id":"1313992"},{"content":"Rotation on a yearly basis.","comment_id":"1276215","timestamp":"1725218340.0","upvote_count":"3","poster":"Johnoppong101"}],"content":"Selected Answer: A\nSSE-S3 is powerful for data encryption at rest guys. Each single object is encrypted with a different key. SSE-S3 automatically rotates all keys. However, SSE-S3 does not log any information concerning key encryption or rotation.","timestamp":"1725218280.0","poster":"Johnoppong101","upvote_count":"3","comment_id":"1276213"},{"timestamp":"1723452840.0","comment_id":"1264561","poster":"Sgigi","content":"Selected Answer: B\nAs far as I know, SSE-S3 encryption uses keys which we can't view, nor do we know the rotation period of them.\nSSE-S3 and AWS-Managed KMS Keys are not the same:\nAWS Managed KMS Keys are rotated every 365 days\nAWS Customer-Managed Keys have optional rotation\nSSE-S3 Encryption is not either of them, thus A should be eliminated.\nSince we do not have an option here to use an AWS-managed KMS key, the only valid option is to use a customer-managed key and enable key rotation.","upvote_count":"3"},{"upvote_count":"3","timestamp":"1720481820.0","content":"Selected Answer: A\nAll options except A suggesting cusomer key, why customer key would be needed here.","poster":"jatric","comment_id":"1244612"},{"comment_id":"1237219","upvote_count":"1","timestamp":"1719381240.0","poster":"ChymKuBoy","content":"Selected Answer: B\nB for sure"},{"upvote_count":"2","timestamp":"1717821720.0","poster":"rohitph","content":"Selected Answer: B\nAWS can change rotation period anytime but Customer says 'must be automatically rotated' hence answer should be B in this case.","comment_id":"1226525"},{"content":"Selected Answer: A\nInterestingly the answer for this used to be B, and now its A.\nAfter May 2022 AWS changed the rotation schedule for SSE-S3. See documentation here: \nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html#rotate-aws-managed-keys .\n\nAWS managed keys\nAWS KMS automatically rotates AWS managed keys every year (approximately 365 days). You cannot enable or disable key rotation for AWS managed keys.\nIn May 2022, AWS KMS changed the rotation schedule for AWS managed keys from every three years (approximately 1,095 days) to every year (approximately 365 days).\nNew AWS managed keys are automatically rotated one year after they are created, and approximately every year thereafter.\nExisting AWS managed keys are automatically rotated one year after their most recent rotation, and every year thereafter.\n\n----\nIf this comes up in the exam, remember ! you can use SSE-S3 for yearly rotation now.","comment_id":"1220216","poster":"lofzee","upvote_count":"8","timestamp":"1716898260.0"},{"poster":"ManikRoy","upvote_count":"2","content":"Selected Answer: B\nSSE-KMS - Customer managed keys - Automatic rotation - Guarantees yearly key rotation (unlike SSE-S3 where you do not have control on key rotation) and also meets the least operational overhead.","timestamp":"1714913520.0","comment_id":"1206895"},{"poster":"Solomon2001","content":"Selected Answer: A\nOption A:\nUtilizes server-side encryption with Amazon S3 managed encryption keys (SSE-S3), which is the simplest and most straightforward way to encrypt data stored in Amazon S3.\nSSE-S3 automatically handles key rotation, eliminating the need for manual key rotation.\nThis solution provides encryption for the data in the S3 bucket without requiring any additional setup or management.\nOption B:\n\nInvolves setting up a customer managed KMS key, enabling automatic key rotation, and then setting the S3 bucket's default encryption behavior to use the customer managed KMS key.\nWhile this option also provides encryption and automatic key rotation, it involves more setup and management compared to SSE-S3.","timestamp":"1714884840.0","upvote_count":"4","comment_id":"1206775"},{"timestamp":"1706583240.0","upvote_count":"2","content":"It's A. Because it's said that they need with LEAST operation overhead and S3 Managed Keys can rotate automatically every year without needing the user intervention. For the Customer Managed Keys, you need to do some configuration for that.","poster":"demigodnyi","comment_id":"1135455"},{"comment_id":"1111195","content":"Selected Answer: A\nBoth A and B are viable answers but A with SSE-S3 is least operational overhead. B will require customer to manage the key.\n***HOWEVER*** note that SSE-S£ managed keys are rotated periodically so there is no user control on limiting the rotation to \"once a year\". For exam, probably read the question with full context and hope there is more detail in the actual exam!","poster":"awsgeek75","upvote_count":"4","timestamp":"1704115860.0"},{"upvote_count":"1","timestamp":"1703916540.0","content":"Selected Answer: B\nPlease see JayBee response below. Make sense.","poster":"SinghJagdeep","comment_id":"1109472"},{"upvote_count":"3","timestamp":"1703662920.0","poster":"pentium75","content":"Selected Answer: A\nNow \"all AWS managed keys are automatically rotated every year. You cannot change this rotation schedule\". However, if you insist that option A also specifies the order of steps then it would be wrong, you'd need to enable encryption BEFORE moving the data to the bucket. But per my understanding of English, the order is not specified, it's just a combination of things you do.\n\nOtherwise B would be the correct answer, but it has more operational overhead than A, at least now. Probably the question is old.","comment_id":"1106646"},{"content":"Selected Answer: B\nnowhere in this documentation states how often the keys are rotated, and only the key that encrypts the S3 encryption key actually gets to rotate.\n\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/UsingServerSideEncryption.html","comment_id":"1097360","poster":"ale_brd_111","timestamp":"1702648140.0","upvote_count":"1"},{"upvote_count":"1","comment_id":"1068164","poster":"xdkonorek2","timestamp":"1699741080.0","content":"Selected Answer: B\nI'm voting B \nEach object in s3 using SSE-S3 uses separate key, this key is encrypted using another master key that is regularly rotated but AWS doesn't share how often it happens.\n\nWith SSE-KMS you have option to tick: \"Automatically rotate this KMS key every year.\"."},{"content":"In 2023 the answer would be A. https://docs.aws.amazon.com/AmazonS3/latest/userguide/UsingServerSideEncryption.html states that S3 automatically uses SSE, and rotates the keys \"regularly\" which as far as I've understood is yearly","upvote_count":"2","poster":"bogobob","comments":[{"comment_id":"1083021","upvote_count":"1","poster":"theonlyhero","content":"but based on this reference:\nhttps://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#master_keys\n\nit mentions varies, so i would stick with B","timestamp":"1701214980.0"}],"comment_id":"1067098","timestamp":"1699606920.0"},{"upvote_count":"2","poster":"rlamberti","timestamp":"1698020880.0","comment_id":"1051267","content":"Selected Answer: A\nSSE-S3 are rotated automatically every year. Default behaviour."},{"comment_id":"1010261","timestamp":"1695012840.0","content":"Selected Answer: A\nLEAST operational overhead = Amazon S3 managed encryption keys","upvote_count":"4","poster":"TariqKipkemei"},{"poster":"XCheng","content":"https://docs.aws.amazon.com/zh_cn/AmazonS3/latest/userguide/default-bucket-encryption.html","timestamp":"1694982600.0","upvote_count":"2","comment_id":"1010051"},{"poster":"roggerrubens","upvote_count":"1","timestamp":"1694731140.0","content":"Resposta A , todo objeto que é colocado no S3 , e automaticamente criptografado por padrão SSE-S3 , não ???","comment_id":"1007951"},{"poster":"Guru4Cloud","upvote_count":"3","timestamp":"1694542860.0","content":"Selected Answer: B\nB. Create an AWS Key Management Service (AWS KMS) customer managed key. Enable automatic key rotation. Set the S3 bucket’s default encryption behavior to use the customer managed KMS key. Move the data to the S3 bucket.","comment_id":"1005983"},{"timestamp":"1694070660.0","upvote_count":"2","comment_id":"1001270","poster":"Jeyaluxshan","content":"Answer is B.\nSSE-S3 encryption will not apply to existing objects in S3 bucket.\nQuestion is when it is stored in S3, data must be encrypted.\nIf you already stored and later enable SSE-S3, will not be a solution. \nSo A is not the correct answer."},{"comment_id":"998190","upvote_count":"2","poster":"omar_bahrain","timestamp":"1693801440.0","content":"Selected Answer: A\nOnce you enable SSE-S3 encryption for your S3 bucket, Amazon automatically rotates the data encryption keys for your objects every 365 days. This means that your data encryption keys are automatically replaced with new ones every year. You can also manually rotate the encryption keys for your objects at any time.\n\nhttps://saturncloud.io/blog/how-does-amazon-sses3-key-rotation-work/#:~:text=Once%20you%20enable%20SSE%2DS3,your%20objects%20at%20any%20time."},{"poster":"Sutariya","content":"B is right Answer : If you need more control over your keys, such as managing key rotation and access policy grants, you can choose to use server-side encryption with AWS Key Management Service (AWS KMS) keys (SSE-KMS), or dual-layer server-side encryption with AWS KMS keys (DSSE-KMS). For more information about editing KMS keys","upvote_count":"1","timestamp":"1693800540.0","comment_id":"998182"},{"poster":"Aelodus","timestamp":"1692167640.0","comment_id":"982256","upvote_count":"3","comments":[{"comment_id":"1313994","content":"For AWS managed key (https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#aws-managed-cmk)\n\nAutomatic rotation (https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html) --> Required. Every year (approximately 365 days).","timestamp":"1731934980.0","upvote_count":"1","poster":"JA2018"}],"content":"Selected Answer: B\nWent to AWS office for a cloud developer course, I asked the trainer what is SSE-S3's key rotation frequency, the trainer mentioned that the information for the rotation frequency is not publicly available. This was done intentionally. He also said that if we truly wanted to know, we had to hold a private consultation with them, as a representative of our company. \n\nGoing back to the question, since we cannot confirm the frequency of SSE-S3's key rotation the best answer for this question is B. It might have higher operational overhead compared to A, but it is the only one that fulfills the requirements."},{"comment_id":"974349","poster":"npraveen","upvote_count":"3","content":"Selected Answer: A\nOnce you enable SSE-S3 encryption for your S3 bucket, Amazon automatically rotates the data encryption keys for your objects every 365 days. This means that your data encryption keys are automatically replaced with new ones every year.","timestamp":"1691376540.0"},{"content":"Answer is A\nWith server side encryption S3 will automatically manages the necryption keys and their rotation. The questions is specifically asking least operational overhead. \n\nOption B also provides a valid solution, but it involves more manual configuration and management of a customer-managed AWS Key Management Service (AWS KMS) key, including enabling and configuring automatic key rotation.","comment_id":"971185","upvote_count":"2","timestamp":"1691072520.0","poster":"oguzbeliren"},{"timestamp":"1687848480.0","comment_id":"935074","upvote_count":"4","content":"Selected Answer: B\nA. While using SSE-S3 the key rotation is handled automatically by AWS. AWS rotates the encryption keys at least once every 1095 days (3 years) on your behalf.\n\nB. By using a customer managed key in AWS KMS with automatic key rotation enabled, and setting the S3 bucket's default encryption behavior to use this key, the data stored in the S3 bucket will be encrypted and the encryption key will be automatically rotated every year.\n\nC. This answer is not the most optimal solution as it suggests manually rotating the KMS key every year, which introduces manual intervention and increases operational overhead.\n\nD. This answer is not the most suitable option as it involves encrypting the data with customer key material and managing the key rotation manually. It adds complexity and management overhead compared to using AWS KMS for key management and encryption.","poster":"cookieMr"},{"comment_id":"932265","poster":"pisica134","content":"chat gpt says it's B","upvote_count":"1","timestamp":"1687588620.0"},{"content":"AWS KMS automatically rotates AWS managed keys (SSE-S3) every year (approximately 365 days). You cannot enable or disable key rotation for AWS managed keys.\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html","comment_id":"899648","upvote_count":"2","timestamp":"1684287900.0","poster":"danghh"},{"comments":[{"poster":"studynoplay","content":"Just created a bucket and it says: The default encryption configuration of an S3 bucket is always enabled and is at a minimum set to server-side encryption with Amazon S3 managed keys (SSE-S3). With server-side encryption, Amazon S3 encrypts an object before saving it to disk and decrypts it when you download the object. Encryption doesn't change the way that you access data as an authorized user. It only further protects your data.\n\nYou can configure default encryption for a bucket. You can use either server-side encryption with Amazon S3 managed keys (SSE-S3) (the default) or server-side encryption with AWS Key Management Service (AWS KMS) keys (SSE-KMS).","upvote_count":"3","comment_id":"898421","timestamp":"1684162980.0"}],"poster":"studynoplay","timestamp":"1684162560.0","upvote_count":"3","comment_id":"898416","content":"Selected Answer: A\nThis question is old and written when there was no default encryption on S3.\nChoosing A because Amazon S3 now applies server-side encryption with Amazon S3 managed keys (SSE-S3) as the base level of encryption for every bucket in Amazon S3. Starting January 5, 2023, all new object uploads to Amazon S3 are automatically encrypted at no additional cost and with no impact on performance."},{"comment_id":"893741","timestamp":"1683706260.0","poster":"WilliamHoac","content":"B is correct answer.\nKEYWORD: LEAST operational overhead and the encryption key must be automatically rotated every year\nSSE-S3: cannot rotation.\nBase on aws site: If you need more control over your keys, such as managing key rotation and access policy grants, you can choose to use server-side encryption with AWS Key Management Service (AWS KMS) keys (SSE-KMS)","upvote_count":"1"},{"upvote_count":"1","content":"Selected Answer: B\nBecause of the chronology of the events and the operational overhead of maintaining the key rotation process I vote for B. With SSE KMS CMK + enabling automatic key rotation every year you will suffice all the requirements.","timestamp":"1680214620.0","comment_id":"856362","poster":"kraken21"},{"timestamp":"1679757780.0","comment_id":"850240","poster":"Santosh43","upvote_count":"2","content":"the question did ask about customer-managed keys so my answer is A.."},{"poster":"udo2020","upvote_count":"2","timestamp":"1679413620.0","content":"Answer is A.\nWhy? \nServer-side encryption protects data at rest. Amazon S3 encrypts each object with a unique key. As an additional safeguard, it encrypts the key itself with a key that it rotates regularly. Amazon S3 server-side encryption uses one of the strongest block ciphers available to encrypt your data, 256-bit Advanced Encryption Standard (AES-256).","comment_id":"846120"},{"poster":"ThiruKrish","comments":[],"content":"the encryption key must be automatically rotated every year --> SSE-S3 has default rotation which rotate regularly but for SSE-KMS it can be enabled to rotate every year","comment_id":"845430","upvote_count":"2","timestamp":"1679362380.0"},{"timestamp":"1679059140.0","upvote_count":"2","comment_id":"841998","content":"Selected Answer: A\nI would like to go for option A due to the least operational work.","poster":"AravindG"},{"poster":"AravindG","upvote_count":"2","comment_id":"841997","timestamp":"1679059080.0","content":"I would like to say the Answer suppose to be A due to the least operation overhead."},{"comment_id":"833893","poster":"LanoraMoe","content":"Selected Answer: A\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/UsingServerSideEncryption.html","upvote_count":"2","timestamp":"1678360560.0"},{"poster":"Sdraju","upvote_count":"3","comment_id":"830436","timestamp":"1678060140.0","content":"Selected Answer: B\nBecause in Option - A : Amazon S3 encrypts each object with a unique key. As an additional safeguard, it encrypts the key itself with a key that it rotates regularly.\nDoes this mean Amazon does not rotate the keys with which the objects are encrypted - rather the root key is the one that is rotated regularly"},{"poster":"Steve_4542636","timestamp":"1677592980.0","content":"Selected Answer: B\nOption B allows me to set the auto rotation every year. SSE-S3 doesn't allow me to control *when* a key gets auto-rotated.","comment_id":"824880","upvote_count":"2"},{"upvote_count":"1","comment_id":"807523","content":"Selected Answer: B\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html","poster":"Stanislav4907","timestamp":"1676300940.0"},{"content":"Selected Answer: A\nSSE-S3 also uses key and rotates automatically.","comment_id":"797238","timestamp":"1675446660.0","poster":"remand","upvote_count":"3"},{"poster":"aakashkumar1999","content":"Selected Answer: A\nDocumentation says sse-s3 keys are rotated every year, so practically have to do nothing for this kind of encryption hence least operational overhead","upvote_count":"2","timestamp":"1675428840.0","comment_id":"797040"},{"upvote_count":"5","comment_id":"770637","timestamp":"1673281140.0","content":"Selected Answer: B\nIn May 2022, AWS KMS changed the rotation schedule for AWS managed keys from every three years (approximately 1,095 days) to every year (approximately 365 days).\n\nNew AWS managed keys are automatically rotated one year after they are created, and approximately every year thereafter.\n\nExisting AWS managed keys are automatically rotated one year after their most recent rotation, and every year thereafter.\n\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html#rotate-aws-managed-keys\n\nSo, SSE-KMS with AWS-managed keys is least operational overhead (unlike customer managed CMK where the user has to provide cryptographic key material for rotation). Supports Auto-rotation (SSE-S3 does not specify the time duration required for auto-rotation).","poster":"Mahadeva"},{"content":"Selected Answer: B","timestamp":"1673178000.0","comment_id":"769336","poster":"raf123123","upvote_count":"1"},{"comments":[{"comment_id":"1313996","timestamp":"1731935040.0","content":"For AWS managed key (https://docs.aws.amazon.com/kms/latest/developerguide/concepts.html#aws-managed-cmk)\n\nAutomatic rotation (https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html) --> Required. Every year (approximately 365 days).","poster":"JA2018","upvote_count":"1"},{"poster":"HayLLlHuK","comment_id":"768741","comments":[{"comments":[],"upvote_count":"2","poster":"HayLLlHuK","content":"If someone finds the article where the SSE-S3 encryption keys rotation frequency says that it can be rotate every year, than yes, the correct solution is A.\nAs of now, I'll go for A","comment_id":"768742","timestamp":"1673110200.0"}],"timestamp":"1673110140.0","content":"https://docs.aws.amazon.com/AmazonS3/latest/userguide/UsingServerSideEncryption.html","upvote_count":"2"}],"content":"Selected Answer: B\nSorry, guys, but we can’t rely on SSE-S3 encryption keys rotation. \nI've investigated tons of information, but I didn’t find any concrete information about the frequency of SSE-S3 keys rotation. The only one thing mentioned in aws articles is \"it rotates regularly\".\nBased on it, we can't rely on SSE. The question ask us \"key must be automatically rotated every year.\" I'll vote for B - KMS.","poster":"HayLLlHuK","timestamp":"1673110080.0","comment_id":"768740","upvote_count":"5"},{"upvote_count":"2","poster":"Zerotn3","comment_id":"763562","timestamp":"1672642920.0","content":"Selected Answer: A\nThe correct answer is A. Move the data to the S3 bucket. Use server-side encryption with Amazon S3 managed encryption keys (SSE-S3). Use the built-in key rotation behavior of SSE-S3 encryption keys.\n\nBy using SSE-S3, you can encrypt your data at rest in the S3 bucket without having to manage any encryption keys yourself. SSE-S3 automatically rotates the encryption keys for you, so you don't have to worry about manually rotating them every year. This option has the least operational overhead, as you don't have to manage any encryption keys or manually rotate them.\n\nOption B is incorrect because you would still need to manually rotate the KMS key every year. Option C is incorrect for the same reason. Option D is incorrect because you would need to manage the customer key material yourself, which is more operational overhead than using SSE-S3."},{"comment_id":"757853","poster":"PassNow1234","content":"Selected Answer: A\nI agree with A. However aws is easy enough to do with both A or B. This is one question I hope I don't get.","upvote_count":"1","timestamp":"1672089240.0"},{"comment_id":"749022","timestamp":"1671379440.0","upvote_count":"5","poster":"nexus2020","content":"Selected Answer: B\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html\n\nCustomer managed keys\nAutomatic key rotation is disabled by default on customer managed keys but authorized users can enable and disable it. When you enable (or re-enable) automatic key rotation, AWS KMS automatically rotates the KMS key one year (approximately 365 days) after the enable date and every year thereafter."},{"comment_id":"747753","poster":"career360guru","timestamp":"1671251100.0","upvote_count":"3","content":"Selected Answer: A\nA is the right answer. \nOption B is not a good choice because though Automatic rotation of the keys is possible incase of Customer Managed is is possible but it is not mentioned as requirement here. There is additional operation overhead for customer for Managing the Keys if customer Managed keys are used."},{"content":"Selected Answer: B\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html","upvote_count":"3","timestamp":"1671116340.0","comment_id":"746220","poster":"k1kavi1"},{"comments":[{"content":"Yes you can from https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html\n\"Automatic rotation is optional for customer managed KMS keys\"","upvote_count":"1","comment_id":"771137","poster":"JayBee65","timestamp":"1673334120.0"}],"upvote_count":"3","content":"Selected Answer: A\nwhen you use customer managed key, you can not automatically rotate. cusomer needs to upload the key first!\n\nso A","poster":"nexus2020","timestamp":"1671062880.0","comment_id":"745544"},{"timestamp":"1670911920.0","content":"Answer is A: Data to be encrypted in S3 bucket and Key rotated yearly without operational overhead- SSE-S3. \nKMS is managed by customers with causes operational overhead.","upvote_count":"2","comment_id":"743647","poster":"Qjb8m9h","comments":[{"comment_id":"745419","content":"After doing another research, I agree with the rest Answer is B \n\nCryptographic best practices discourage extensive reuse of encryption keys. To create new cryptographic material for your customer managed keys, you can create new KMS keys, and then change your applications or aliases to use the new KMS keys. Or, you can enable automatic key rotation for an existing KMS key.\n\nWhen you enable automatic key rotation for a KMS key, AWS KMS generates new cryptographic material for the KMS key every year. AWS KMS saves all previous versions of the cryptographic material in perpetuity so you can decrypt any data encrypted with that KMS key\n\n\nhttps://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html","timestamp":"1671049140.0","poster":"Qjb8m9h","upvote_count":"1"}]},{"timestamp":"1670840400.0","upvote_count":"2","poster":"Shasha1","content":"A\nUsing server-side encryption with Amazon S3 managed encryption keys (SSE-S3) and enabling the built-in key rotation behavior of SSE-S3 encryption keys will meet the requirements with the least operational overhead. This approach will automatically encrypt the data when it is stored in the S3 bucket and automatically rotate the encryption key every year without requiring any additional configuration or management efforts. customer managed key, which would require additional operational overhead compared to using SSE-S3 encryption keys.","comment_id":"742652"},{"poster":"Certified101","upvote_count":"2","comment_id":"741617","timestamp":"1670756400.0","content":"Selected Answer: A\nWhy not A surely that's least operational overhead?"},{"timestamp":"1670649660.0","comments":[{"timestamp":"1670925720.0","poster":"kmliuy73","comments":[{"poster":"Zerotn3","timestamp":"1672644420.0","upvote_count":"2","comment_id":"763575","content":"*You cannot access this key or use it manually for any other encryption processing. The key is itself encrypted with a master key that is regularly rotated."}],"content":"must be automatically rotated \"every year\"","upvote_count":"2","comment_id":"743863"}],"upvote_count":"2","content":"The new answer is A https://catalog.us-east-1.prod.workshops.aws/workshops/aad9ff1e-b607-45bc-893f-121ea5224f24/en-US/s3/serverside/sses3","poster":"stepman","comment_id":"740691"},{"comment_id":"731015","upvote_count":"1","poster":"TonyghostR05","timestamp":"1669773720.0","content":"Just like old question before, B"},{"timestamp":"1669654200.0","content":"Selected Answer: B\nit's B -","comment_id":"729439","upvote_count":"2","poster":"Gabs90"},{"comment_id":"729361","content":"Selected Answer: B\nCMK automatically rotates every year as optional.","upvote_count":"2","poster":"leonnnn","timestamp":"1669651800.0"},{"poster":"Nigma","upvote_count":"3","timestamp":"1669645440.0","comment_id":"729213","content":"Selected Answer: B\nAnswer : B"}],"choices":{"C":"Create an AWS Key Management Service (AWS KMS) customer managed key. Set the S3 bucket’s default encryption behavior to use the customer managed KMS key. Move the data to the S3 bucket. Manually rotate the KMS key every year.","D":"Encrypt the data with customer key material before moving the data to the S3 bucket. Create an AWS Key Management Service (AWS KMS) key without key material. Import the customer key material into the KMS key. Enable automatic key rotation.","A":"Move the data to the S3 bucket. Use server-side encryption with Amazon S3 managed encryption keys (SSE-S3). Use the built-in key rotation behavior of SSE-S3 encryption keys.","B":"Create an AWS Key Management Service (AWS KMS) customer managed key. Enable automatic key rotation. Set the S3 bucket’s default encryption behavior to use the customer managed KMS key. Move the data to the S3 bucket."},"topic":"1","answer":"A","answer_ET":"A","answers_community":["A (52%)","B (48%)"],"question_text":"A company is planning to move its data to an Amazon S3 bucket. The data must be encrypted when it is stored in the S3 bucket. Additionally, the encryption key must be automatically rotated every year.\n\nWhich solution will meet these requirements with the LEAST operational overhead?","exam_id":31,"answer_description":"","answer_images":[],"timestamp":"2022-11-28 15:24:00","question_images":[],"isMC":true,"question_id":136,"url":"https://www.examtopics.com/discussions/amazon/view/89081-exam-aws-certified-solutions-architect-associate-saa-c03/","unix_timestamp":1669645440},{"id":"ExJdBVxuPJEgGtQzLeeX","choices":{"C":"Add an Amazon CloudFront distribution. Set the origin as the web application that accepts the appointment requests.","A":"Add a DynamoDB Accelerator (DAX) cluster in front of the DynamoDB database.","B":"Add an Amazon API Gateway API in front of the web application that accepts the appointment requests.","D":"Add an Auto Scaling group for the application that sends meeting invitations. Configure the Auto Scaling group to scale based on the depth of the SQS queue."},"timestamp":"2022-11-28 15:27:00","answer":"D","question_images":[],"question_id":137,"answers_community":["D (100%)"],"question_text":"The customers of a finance company request appointments with financial advisors by sending text messages. A web application that runs on Amazon EC2 instances accepts the appointment requests. The text messages are published to an Amazon Simple Queue Service (Amazon SQS) queue through the web application. Another application that runs on EC2 instances then sends meeting invitations and meeting confirmation email messages to the customers. After successful scheduling, this application stores the meeting information in an Amazon DynamoDB database.\n\nAs the company expands, customers report that their meeting invitations are taking longer to arrive.\n\nWhat should a solutions architect recommend to resolve this issue?","discussion":[{"comment_id":"754462","content":"Selected Answer: D\nOption D. Add an Auto Scaling group for the application that sends meeting invitations. Configure the Auto Scaling group to scale based on the depth of the SQS queue.\n\nTo resolve the issue of longer delivery times for meeting invitations, the solutions architect can recommend adding an Auto Scaling group for the application that sends meeting invitations and configuring the Auto Scaling group to scale based on the depth of the SQS queue. This will allow the application to scale up as the number of appointment requests increases, improving the performance and delivery times of the meeting invitations.","poster":"Buruguduystunstugudunstuy","upvote_count":"17","timestamp":"1687541880.0"},{"poster":"cookieMr","upvote_count":"11","content":"Selected Answer: D\nBy adding an ASG for the application that sends meeting invitations and configuring it to scale based on the depth of the SQS, the system can automatically adjust its capacity based on the number of pending messages in the queue. This ensures that the application can handle increased message load and process the meeting invitations more efficiently, reducing the delay experienced by customers.\n\nA. Adding a DynamoDB Accelerator (DAX) cluster in front of the DynamoDB database would improve read performance for DynamoDB, but it does not directly address the issue of delayed meeting invitations.\n\nB. Adding an API Gateway API in front of the web application that accepts the appointment requests may help with request handling and management, but it does not directly address the issue of delayed meeting invitations.\n\nC. Adding an CloudFront distribution with the web application as the origin would improve content delivery and caching, but it does not directly address the issue of delayed meeting invitations.","comment_id":"935076","timestamp":"1703667240.0"},{"comment_id":"1155757","timestamp":"1724255640.0","poster":"67a3f49","content":"First question with consistent answer :)","upvote_count":"5"},{"comment_id":"1010262","poster":"TariqKipkemei","content":"Selected Answer: D\nAdd an Auto Scaling group for the application that sends meeting invitations. Configure the Auto Scaling group to scale based on the depth of the SQS queue.","timestamp":"1710745020.0","upvote_count":"2"},{"poster":"Guru4Cloud","upvote_count":"2","comment_id":"1005979","timestamp":"1710274320.0","content":"Selected Answer: D\nAdd an Auto Scaling group for the application that sends meeting invitations. Configure the Auto Scaling group to scale based on the depth of the SQS queue."},{"poster":"career360guru","timestamp":"1686968940.0","upvote_count":"3","comment_id":"747754","content":"Selected Answer: D\nOption D is the right Answer,"},{"poster":"k1kavi1","comment_id":"746221","content":"Selected Answer: D\nAgreed","timestamp":"1686834060.0","upvote_count":"2"},{"upvote_count":"2","content":"Selected Answer: D\nANswer d","poster":"jambajuice","comment_id":"729728","timestamp":"1685310420.0"},{"content":"Selected Answer: D\nD meets the requirements","poster":"leonnnn","timestamp":"1685283120.0","upvote_count":"2","comment_id":"729363"},{"timestamp":"1685276820.0","comment_id":"729217","poster":"Nigma","content":"Selected Answer: D\nAnswer : D","upvote_count":"2"}],"exam_id":31,"unix_timestamp":1669645620,"url":"https://www.examtopics.com/discussions/amazon/view/89082-exam-aws-certified-solutions-architect-associate-saa-c03/","answer_description":"","answer_ET":"D","answer_images":[],"topic":"1","isMC":true},{"id":"koUQcFwgaQhOdT0njb4p","exam_id":31,"answer_ET":"C","question_id":138,"discussion":[{"comments":[{"poster":"markw92","timestamp":"1687037940.0","content":"You can manage fine grained using redshift as well - https://aws.amazon.com/blogs/big-data/achieve-fine-grained-data-security-with-row-level-access-control-in-amazon-redshift/\nBut, I believe the keyword to look for is \"minimize operational overhead\", which lakeformation does without duplicating much of the data. Redshift is operational overhead and duplication of data. not sure why the answer is D. i vote C as well.","comments":[{"content":"yeah, most of examtopics answers are wrong","poster":"Olaunfazed","comment_id":"938617","timestamp":"1688082000.0","upvote_count":"9"}],"comment_id":"926298","upvote_count":"9"}],"upvote_count":"27","timestamp":"1670827440.0","content":"Answer : C keyword \"manage-fine-grained\"\nhttps://aws.amazon.com/blogs/big-data/manage-fine-grained-access-control-using-aws-lake-formation/","comment_id":"742474","poster":"anhike"},{"content":"Selected Answer: C\nOption C. Create a data lake by using AWS Lake Formation. Create an AWS Glue JDBC connection to Amazon RDS. Register the S3 bucket in Lake Formation. Use Lake Formation access controls to limit access.\n\nTo make all the data available to various teams and minimize operational overhead, the company can create a data lake by using AWS Lake Formation. This will allow the company to centralize all the data in one place and use fine-grained access controls to manage access to the data.\n\nTo meet the requirements of the company, the solutions architect can create a data lake by using AWS Lake Formation, create an AWS Glue JDBC connection to Amazon RDS, and register the S3 bucket in Lake Formation. The solutions architect can then use Lake Formation access controls to limit access to the data. This solution will provide the ability to manage fine-grained permissions for the data and minimize operational overhead.","timestamp":"1671823560.0","upvote_count":"5","comments":[{"upvote_count":"1","comment_id":"902537","poster":"majdango","content":"..................","timestamp":"1684581840.0"}],"poster":"Buruguduystunstugudunstuy","comment_id":"754458"},{"poster":"ike001","timestamp":"1719113100.0","upvote_count":"3","content":"Answer is C","comment_id":"1235680"},{"upvote_count":"4","timestamp":"1713040200.0","content":"Selected Answer: C\nKeyword: \"manage fine-grained permissions for data\"\nData Lake Using Lake Formation: manage fine-grained permissions for the data with ease.\n\nFine grained permissions for data = Lake Formation\n\nAnswer: C","poster":"MehulKapadia","comment_id":"1195126"},{"upvote_count":"1","timestamp":"1705493700.0","content":"Selected Answer: C\nC represents the easiest way to ingest data from S3 and control accesses.","poster":"LoXoL","comment_id":"1124937"},{"timestamp":"1695918840.0","upvote_count":"4","content":"Selected Answer: C\na fine grained permissons is one of the conditions to acomplishes with the requirement.\nWith the use of AWS Glue you can get acomplishes with this requirement.\nMy answer is: C","poster":"karloscetina007","comment_id":"1020098"},{"poster":"TariqKipkemei","upvote_count":"5","content":"Selected Answer: C\nWith Lake formation you can scale permissions more easily with fine-grained security capabilities, including row- and cell-level permissions and tag-based access control.","timestamp":"1695013500.0","comment_id":"1010265"},{"timestamp":"1694542080.0","poster":"Guru4Cloud","upvote_count":"4","comment_id":"1005976","content":"Selected Answer: C\nLake Formation enables the creation of a secure and scalable data lake on AWS, allowing centralized access controls for both S3 and RDS data. By using Lake Formation, the company can manage permissions effectively and integrate RDS data through the AWS Glue JDBC connection. Registering the S3 in Lake Formation ensures unified access control. This solution reduces operational overhead while providing fine-grained permissions management."},{"content":"Selected Answer: C\nLake Formation enables the creation of a secure and scalable data lake on AWS, allowing centralized access controls for both S3 and RDS data. By using Lake Formation, the company can manage permissions effectively and integrate RDS data through the AWS Glue JDBC connection. Registering the S3 in Lake Formation ensures unified access control. This solution reduces operational overhead while providing fine-grained permissions management.\n\nA. Directly writing purchase data to Amazon RDS with RDS access controls lacks comprehensive permissions management for both S3 and RDS data.\n\nB. Periodically copying data from RDS to S3 using Lambda and using AWS Glue and Athena for querying does not offer fine-grained permissions management and introduces data synchronization complexities.\n\nD. Creating an Redshift cluster and copying data from S3 and RDS to Redshift adds complexity and operational overhead without the flexibility of Lake Formation's permissions management capabilities.","poster":"cookieMr","timestamp":"1687849980.0","comment_id":"935088","upvote_count":"4"},{"content":"Answer is C AWS Lake Formation provides a comprehensive solution for building and managing a data lake. It simplifies data ingestion, organization, and access control. By creating a data lake using AWS Lake Formation, you can centralize and govern access to your data across multiple sources.","comment_id":"932270","poster":"pisica134","timestamp":"1687589100.0","upvote_count":"2"},{"upvote_count":"2","timestamp":"1686560640.0","content":"Selected Answer: C\nOption C is right answer: https://docs.aws.amazon.com/lake-formation/latest/dg/what-is-lake-formation.html","poster":"Bmarodi","comment_id":"921275"},{"poster":"Abrar2022","timestamp":"1685591580.0","comment_id":"911697","upvote_count":"2","content":"Lake Formation helps you manage fine-grained access for internal and external customers from a centralized location and in a scalable way."},{"content":"https://docs.aws.amazon.com/lake-formation/latest/dg/access-control-overview.html","comment_id":"789458","poster":"doorahmie","timestamp":"1674811080.0","upvote_count":"3"},{"comment_id":"779553","timestamp":"1674010920.0","upvote_count":"5","poster":"LuckyAro","content":"Selected Answer: C\nTo me, the give-away was: \"The company wants to make all the data available to various teams\" - Data-Lake - All data in one place."},{"content":"The correct answer is D.\nThe company uses all the data from various teams so that the teams can do their analysis.\nTherefore, it is the best way to separately configure redshift for data warehousing and for all employees to connect to the redshift DB and perform analysis tasks without burdening the operating DB (must minimize operational overhead).","poster":"master1004","comments":[{"upvote_count":"2","comment_id":"915373","timestamp":"1685963040.0","content":"I don't think that \"periodically copy data from Amazon S3 and RDS to Redshift\" minimize the operational overhead. The correct answer for me is C","poster":"ruqui"}],"upvote_count":"4","timestamp":"1673078340.0","comment_id":"768336"},{"poster":"aba2s","comment_id":"766409","content":"Selected Answer: C\nManage fine-grained access control using AWS Lake Formation\nhttps://aws.amazon.com/blogs/big-data/manage-fine-grained-access-control-using-aws-lake-formation/","timestamp":"1672908780.0","upvote_count":"2"},{"timestamp":"1671722220.0","content":"Selected Answer: C\na combination of the following 2 URLs I believe it is C\nhttps://aws.amazon.com/lake-formation/\nhttps://aws.amazon.com/blogs/big-data/manage-fine-grained-access-control-using-aws-lake-formation/","poster":"kvenikoduru","upvote_count":"3","comment_id":"753425"},{"timestamp":"1671251580.0","poster":"career360guru","content":"Option C is the right answer. Fine-grained access-control from different types of data sources is a Lakeformation usecase.","upvote_count":"3","comment_id":"747759"},{"upvote_count":"3","comment_id":"744552","content":"Selected Answer: C\nCCCCCCCCCCCC","poster":"gloritown","timestamp":"1670974740.0"},{"comment_id":"734284","content":"Selected Answer: C\nANSWER IS OF COURSE C","timestamp":"1670055240.0","poster":"9014","upvote_count":"2"},{"upvote_count":"3","content":"Selected Answer: C\nI think the answer is C because the keyword here is \"FINE GRAINED\" which Lake Formation provides","timestamp":"1669683120.0","poster":"Mee6","comment_id":"729759"},{"timestamp":"1669679160.0","upvote_count":"2","comment_id":"729727","poster":"jambajuice","content":"Selected Answer: C\nanswr c"},{"content":"Selected Answer: C\nData lake is for complex data sources","comment_id":"729364","upvote_count":"2","poster":"leonnnn","timestamp":"1669651980.0"},{"content":"Answer : C","upvote_count":"2","comment_id":"729221","poster":"Nigma","timestamp":"1669645740.0"}],"answer_images":[],"url":"https://www.examtopics.com/discussions/amazon/view/89083-exam-aws-certified-solutions-architect-associate-saa-c03/","question_text":"An online retail company has more than 50 million active customers and receives more than 25,000 orders each day. The company collects purchase data for customers and stores this data in Amazon S3. Additional customer data is stored in Amazon RDS.\n\nThe company wants to make all the data available to various teams so that the teams can perform analytics. The solution must provide the ability to manage fine-grained permissions for the data and must minimize operational overhead.\n\nWhich solution will meet these requirements?","timestamp":"2022-11-28 15:29:00","choices":{"B":"Schedule an AWS Lambda function to periodically copy data from Amazon RDS to Amazon S3. Create an AWS Glue crawler. Use Amazon Athena to query the data. Use S3 policies to limit access.","A":"Migrate the purchase data to write directly to Amazon RDS. Use RDS access controls to limit access.","C":"Create a data lake by using AWS Lake Formation. Create an AWS Glue JDBC connection to Amazon RDS. Register the S3 bucket in Lake Formation. Use Lake Formation access controls to limit access.","D":"Create an Amazon Redshift cluster. Schedule an AWS Lambda function to periodically copy data from Amazon S3 and Amazon RDS to Amazon Redshift. Use Amazon Redshift access controls to limit access."},"topic":"1","unix_timestamp":1669645740,"answers_community":["C (100%)"],"isMC":true,"answer_description":"","question_images":[],"answer":"C"},{"id":"2rLYAmaL7Rh61XRLnRps","answer_ET":"C","answer":"C","question_id":139,"question_images":[],"discussion":[{"comment_id":"974806","content":"Selected Answer: C\nThe question here is whether the solution architect can change the requirement. The requirement says very clear about SFTP which cannot be addressed by option C. But the question also gives very clear hint about OAI which cannot be addressed by option D. Option D also doesn't mention anything about CloudFront which is part of the requirement of the question. \nSo, if the requirement cannot be changed, D is the answer; if the requirement can be changed, C is the answer. But if the requirement can be changed, what's the limitation? That will be a Chaos. \nI'm voting C, and curse the question designer.","timestamp":"1691422020.0","poster":"bjexamprep","upvote_count":"24","comments":[{"upvote_count":"8","content":"\"The solutions architect must design the most cost-effective and resilient architecture for website hosting to serve as the CloudFront origin.\" The solution architect is looking for a solution that can fit with CloudFront as origin! So it doesn't matter that option D does not mention CF, CF is part of the solution!\nHaving a marketing website on-premise clearly indicates having S3 as static content.\nAWS Transfer Family is the way to upload files via FTP to S3!\nSo the answer is D.\n\nWhy not C?\nUser is already uploading content via FTP, option C is eliminating this option for him and forces using the CLI. The solution from C does not meet the requirements of having FTP.","comments":[{"timestamp":"1729970820.0","poster":"Tsige","comment_id":"1303399","upvote_count":"3","content":"The main reason Option D is not the best answer is because it involves additional complexity and cost compared to Option C. Here’s a breakdown:\n\nOption D requires setting up AWS Transfer for SFTP, which adds an extra service to manage and incurs additional costs. While it allows the administrator to continue using the SFTP client, it introduces more operational overhead.\nOption C leverages Amazon S3 and CloudFront directly, which is simpler and more cost-effective. By using an S3 bucket policy and CloudFront origin access identity (OAI), you ensure secure access without the need for additional services.\nIn summary, Option C provides a more streamlined and cost-effective solution for hosting the website and serving as the CloudFront origin."}],"poster":"Iconique","comment_id":"1017900","timestamp":"1695740460.0"}]},{"poster":"cookieMr","upvote_count":"9","comment_id":"935092","timestamp":"1687850220.0","content":"Selected Answer: C\nHosting the website in a private S3 provides cost-effective and highly available storage for the static website content. By configuring a bucket policy to allow access from a CloudFront OAI, the S3 can be securely accessed only through CloudFront. This ensures that the website content is served through CloudFront while keeping the S3 private. Uploading website content using the AWS CLI allows for easy and efficient content management.\n\nA. Hosting the website on an Lightsail virtual server would introduce additional management overhead and costs compared to using S3 directly for static content hosting.\n\nB. Using an AWS ASG with EC2 instances and an ALB is not necessary for serving static website content. It would add unnecessary complexity and cost.\n\nD. While using AWS Transfer for SFTP allows for SFTP uploads, it introduces additional costs and complexity compared to directly uploading content to an S3 using the AWS CLI. Additionally, hosting the website content in a public S3 may not be desirable from a security standpoint."},{"comment_id":"1311149","timestamp":"1731482640.0","poster":"jayessh","content":"Selected Answer: C\nOptions A and B involve more complexity and higher costs due to the need for managing instances and load balancers. Option D, while feasible, involves making the S3 bucket public, which is less secure compared to using a private bucket with an OAI.\ncorrect Answer : C","upvote_count":"2"},{"poster":"JohnYu","upvote_count":"2","content":"the option D creating a public S3 bucket could expose the website content to the public, which is a security risk. Using an OAI with a private S3 bucket (as in Option C) is more secure. AWS Transfer for SFTP adds unnecessary complexity unless SFTP specifically is required.","comment_id":"1294494","timestamp":"1728341700.0"},{"content":"Selected Answer: C\n\"The company... use Amazon CloudFront\" = C is the only option that mentions CloudFront.","poster":"MatAlves","timestamp":"1725604200.0","upvote_count":"2","comment_id":"1279392"},{"content":"Selected Answer: C\nThis is another great example of how AWS creates crappy tests. Even internal \nTests for employees have so many flaws that people is always creating tickets challenging Questions poorly worded.","poster":"Pr1est","comment_id":"1204205","upvote_count":"5","timestamp":"1714423440.0"},{"comment_id":"1200099","content":"Another reason why A is better than C:\n“ OAC helps you secure your origins, such as for Amazon S3. We recommend using OAC”\n\n“ If your origin is an Amazon S3 bucket configured as a website endpoint, you must set it up with CloudFront as a custom origin. That means you can't use OAC (or OAI)”\nhttps://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/private-content-restricting-access-to-s3.html","upvote_count":"1","poster":"f761d0e","timestamp":"1713781860.0"},{"content":"Selected Answer: D\nyou can see in this figure that transfer family framework allows for the data to be available for a broad variety of use cases including content distribution (CF) https://d1.awsstatic.com/HIW%20SFTP%20Connectors%20v3.920176622d281d0bd087518827314169b496a055.png","comments":[{"comment_id":"1124921","upvote_count":"2","content":"Two main problems with D: \nIt's public S3 behind CloudFront which is not well-architected\nInfrequent site updates using SFTP so with S3 it will be cli changes. They don't need fancy transfer for this. Right?","poster":"awsgeek75","timestamp":"1705492620.0"}],"upvote_count":"2","timestamp":"1703538000.0","comment_id":"1105539","poster":"djgodzilla"},{"poster":"MiniYang","upvote_count":"3","timestamp":"1701318360.0","comment_id":"1083986","content":"Selected Answer: C\nI think the this is a big misleading \" SFTP\" ( doesn't usally upload) ，and it said clearly need Cloudfront and want a cheep solution. So I chose \"C\""},{"upvote_count":"2","poster":"rlamberti","content":"Selected Answer: C\nTransfering via AWS CLI is cheaper than via Transfer Family.\nIt is not the best option, but will do the job of uploading the data to S3.","timestamp":"1698021660.0","comment_id":"1051277"},{"content":"I'd go with D. In C there is no mention to S3 bucket being configured for web hosting. Simply adding the Cloudfront distribution and pointing that to the S3 won't work out of the box.","comment_id":"1047998","upvote_count":"2","poster":"juanrasus2","timestamp":"1697724900.0"},{"comments":[{"poster":"baku98","content":"D is the only one possible.\nC cannot be because: In Amazon CloudFront: For Restricting access to an Amazon S3 origin: If your origin is an Amazon S3 bucket configured as a website endpoint, you must set it up with CloudFront as a custom origin. That means you can't use OAC (or OAI).\nhttps://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/private-content-restricting-access-to-s3.html","timestamp":"1702546320.0","upvote_count":"2","comment_id":"1096270"},{"poster":"Guru4Cloud","upvote_count":"4","content":"I changed C. is better then D","timestamp":"1694542200.0","comment_id":"1005978"}],"upvote_count":"2","content":"Selected Answer: D\nD - SFTP client to upload new documents.","comment_id":"1005977","timestamp":"1694542080.0","poster":"Guru4Cloud"},{"upvote_count":"2","poster":"eugene_stalker","comment_id":"908178","content":"Selected Answer: D\nD - SFTP client to upload new documents.","timestamp":"1685215860.0"},{"poster":"bdp123","content":"Selected Answer: C\nAWS transfer is a cost and doesn't mention using CloudFront\nhttps://aws.amazon.com/aws-transfer-family/pricing/","upvote_count":"4","timestamp":"1676582100.0","comment_id":"811109"},{"upvote_count":"3","timestamp":"1676305020.0","content":"Selected Answer: C\nIf you don't want to disable block public access settings for your bucket but you still want your website to be public, you can create a Amazon CloudFront distribution to serve your static website. For more information, see Use an Amazon CloudFront distribution to serve a static website in the Amazon Route 53 Developer Guide.\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/WebsiteAccessPermissionsReqd.html","comment_id":"807571","poster":"Yelizaveta"},{"content":"Selected Answer: C\nI at first thought D but it is in fact C because \n\n\"D: Create a public Amazon S3 bucket. Configure AWS Transfer for SFTP. Configure the S3 bucket for website hosting. Upload website content by using the SFTP client.\" questions says that the company has decided to use Amazon Cloudfront and this answer does not reference using CF and setting S3 as the Origin\n\n\n\"C. Create a private Amazon S3 bucket. Use an S3 bucket policy to allow access from a CloudFront origin access identity (OAI). Upload website content by using the AWS CLI.\" - mentions CF and the origin and the AWS CLI does infact support transfer by SFTP (which was the part I originally doubted but this link evidences that it does:\n\nhttps://docs.aws.amazon.com/cli/latest/reference/transfer/describe-server.html","comment_id":"789091","poster":"PDR","upvote_count":"5","timestamp":"1674764760.0"},{"upvote_count":"1","poster":"bullrem","comment_id":"783891","content":"Selected Answer: D\nOption C, creating a private Amazon S3 bucket and using an S3 bucket policy to allow access from a CloudFront origin access identity (OAI), would not be the most cost-effective solution. While it would allow the company to use Amazon S3 for storage, it would also require additional setup and maintenance of the OAI, which would add additional cost. Additionally, this solution would not allow the use of SFTP client for uploading content which is the current method used by the company.","timestamp":"1674354960.0"},{"timestamp":"1673473440.0","poster":"verguy","upvote_count":"3","content":"The Answer is C\nhttps://medium.com/aws-poc-and-learning/how-to-access-s3-hosted-website-via-cloudfront-using-oai-origin-access-identity-720ad7c57f15","comment_id":"772912"},{"upvote_count":"4","poster":"Mahadeva","content":"Selected Answer: C\nOption C is a better choice than D for following reasons:\n(1) Cost effective: data transfer is cheaper for Cloudfront than directly from S3 bucket \n(2) Resilient: recovery from failures. Having a Cloudfront distribution and making S3 bucket policy only for Cloudfront. ie. private bucket (with OAI for access) hardens and betters resiliency.","timestamp":"1673270100.0","comment_id":"770402"},{"content":"Selected Answer: C\nIf you don't do extra setup in AWS, you can not use SFTP connecting to it, so D is not the case","poster":"gustavtd","comment_id":"764562","timestamp":"1672746000.0","upvote_count":"3"},{"poster":"vtbk","upvote_count":"2","comment_id":"764525","timestamp":"1672744800.0","content":"Selected Answer: C\ns3 + Cloudfront. In this case, S3 does not need to be public."},{"upvote_count":"2","content":"Selected Answer: D\nThe most cost-effective and resilient solution for hosting a website on AWS with CloudFront is to create a public Amazon S3 bucket, configure AWS Transfer for SFTP, configure the S3 bucket for website hosting, and then upload website content using the SFTP client.\n\nOption A involves using Amazon Lightsail to create a virtual server, which may not be the most cost-effective solution compared to using S3. Option B involves using an Auto Scaling group with EC2 instances and an Application Load Balancer, which may be more expensive and complex than using S3. Option C involves creating a private S3 bucket, which may not allow CloudFront to access the website content.","comment_id":"763588","poster":"Zerotn3","timestamp":"1672647360.0"},{"timestamp":"1671821580.0","upvote_count":"2","content":"Selected Answer: D\nKEYWORD: most cost-effective and resilient architecture\n\nOption D: Creating a public Amazon S3 bucket, configuring AWS Transfer for SFTP, configuring the S3 bucket for website hosting, and uploading website content by using the SFTP client will meet these requirements with the most cost-effective and resilient architecture.\n\nConfiguring AWS Transfer for SFTP allows the company to securely upload content to the S3 bucket using the SFTP client, which the administrator is already familiar with. This eliminates the need to change the administrator’s workflow or learn new tools.","comment_id":"754432","poster":"Buruguduystunstugudunstuy","comments":[{"poster":"Joxtat","upvote_count":"1","timestamp":"1674103500.0","comment_id":"780729","content":"https://medium.com/aws-poc-and-learning/how-to-access-s3-hosted-website-via-cloudfront-using-oai-origin-access-identity-720ad7c57f15"},{"comments":[{"timestamp":"1673363520.0","comment_id":"771542","poster":"JayBee65","upvote_count":"2","content":"The requirements are \"cost-effective and resilient architecture\", and nothing about least operational overhead so your concerns are not valid. Cloudfront makes it resilient and cuts costs, so far more relevant."},{"timestamp":"1672076220.0","comment_id":"757701","upvote_count":"1","content":". The solutions architect must design the most cost-effective and resilient architecture for website hosting to serve as the CloudFront origin.\n\nAre you sure about D?","comments":[{"content":"An administrator updates the website content infrequently and uses an SFTP client to upload new documents.","comment_id":"778833","timestamp":"1673954400.0","poster":"17Master","upvote_count":"2"}],"poster":"PassNow1234"}],"content":"Option C: Creating a private Amazon S3 bucket and using an S3 bucket policy to allow access from a CloudFront origin access identity (OAI) is not a suitable solution because it does not allow the administrator to use an SFTP client to upload website content. The administrator would need to use the AWS CLI or a different tool to upload content to the S3 bucket, which would require a change in the administrator’s workflow.","timestamp":"1671821700.0","upvote_count":"1","comment_id":"754436","poster":"Buruguduystunstugudunstuy"}]},{"upvote_count":"2","comments":[{"poster":"JayBee65","upvote_count":"2","content":"Yes \" If your use case requires the block public access settings to be turned on, use the REST API endpoint as the origin. Then, restrict access by an origin access control (OAC) or origin access identity (OAI).\"","comment_id":"771348","timestamp":"1673350980.0"}],"comment_id":"751675","content":"Selected Answer: C\nAnswer is C only,Bucket doesn't need to be public when using cloudfront.\nhttps://aws.amazon.com/premiumsupport/knowledge-center/cloudfront-serve-static-website/","poster":"techhb","timestamp":"1671580740.0"},{"poster":"BENICE","timestamp":"1671508500.0","content":"C is correct answer","upvote_count":"2","comment_id":"750467"},{"content":"Selected Answer: C\nOption C is right answer as company has already decided to use Cloudfront.\nOption D is not correct as it does not use Cloudfront. \nAs long as there is way to upload the content using CLI, it is OK as updates are not very frequent.","timestamp":"1671251940.0","poster":"career360guru","upvote_count":"2","comment_id":"747762"},{"content":"Selected Answer: D\nhttps://www.examtopics.com/discussions/amazon/view/81299-exam-aws-certified-solutions-architect-associate-saa-c02/","comment_id":"746229","upvote_count":"2","timestamp":"1671117060.0","poster":"k1kavi1"},{"comment_id":"745554","content":"Selected Answer: D\nD make more sense overall….\n\nwerid question....","poster":"nexus2020","timestamp":"1671064020.0","upvote_count":"2"},{"poster":"bearcandy","content":"it's D - https://aws.amazon.com/about-aws/whats-new/2018/11/aws-transfer-for-sftp-fully-managed-sftp-for-s3/","timestamp":"1670960580.0","upvote_count":"1","comment_id":"744414","comments":[{"content":"and cloud front ?","comment_id":"748999","upvote_count":"2","timestamp":"1671375660.0","poster":"17Master"}]},{"timestamp":"1670944920.0","upvote_count":"3","poster":"invaderfr","content":"Selected Answer: D\nD, using AWS CLI instead of SFTP ? can't be C they don't specifiy to restrict S3 accesses to only Cloudfront. Asking some basic user from SFTP client to AWS cli would be very funny","comment_id":"744198"},{"upvote_count":"1","content":"D .. It would be a bit of a learning curve to learn AWS CLI and overkill.","timestamp":"1670650500.0","poster":"stepman","comment_id":"740693"},{"timestamp":"1669892820.0","upvote_count":"3","comment_id":"732528","poster":"dvine_","content":"answer is C, cost effective and resilient = cloud front and S3"},{"upvote_count":"3","content":"Answer is very clearly D! SFTP = Transfer Family. Also questions say nothing about blocking access OAI or public/private.","comment_id":"732000","poster":"mj98","timestamp":"1669843860.0"},{"poster":"Ekie","upvote_count":"1","timestamp":"1669736400.0","comment_id":"730569","content":"D: S3 must be public to be used by CloudFront"},{"comment_id":"730088","poster":"mbo13","comments":[{"poster":"Dareme88","timestamp":"1670925840.0","content":"Question is asking for origin, cloudfront is already setup by SA..Ans is D in this instance","upvote_count":"4","comment_id":"743867"}],"timestamp":"1669709940.0","content":"Selected Answer: C\nWould have been D if it had Cloudfront in it","upvote_count":"3"},{"comment_id":"729752","poster":"leonnnn","upvote_count":"2","content":"Selected Answer: C\nIt is mentioned that the company uses cloud front to distribute the website. So CloudFront OAI is correct. Although administrator uses SFTP to upload contents, but it is \"infrequent\" so I think we can ignore this.","timestamp":"1669682640.0"},{"timestamp":"1669679160.0","poster":"jambajuice","content":"Selected Answer: C\nAnswer :C","upvote_count":"2","comment_id":"729724"},{"poster":"Nigma","upvote_count":"1","comment_id":"729223","timestamp":"1669645860.0","content":"Answer : D"}],"exam_id":31,"question_text":"A company hosts a marketing website in an on-premises data center. The website consists of static documents and runs on a single server. An administrator updates the website content infrequently and uses an SFTP client to upload new documents.\n\nThe company decides to host its website on AWS and to use Amazon CloudFront. The company’s solutions architect creates a CloudFront distribution. The solutions architect must design the most cost-effective and resilient architecture for website hosting to serve as the CloudFront origin.\n\nWhich solution will meet these requirements?","answer_images":[],"answers_community":["C (81%)","D (19%)"],"topic":"1","url":"https://www.examtopics.com/discussions/amazon/view/89085-exam-aws-certified-solutions-architect-associate-saa-c03/","unix_timestamp":1669645860,"choices":{"C":"Create a private Amazon S3 bucket. Use an S3 bucket policy to allow access from a CloudFront origin access identity (OAI). Upload website content by using the AWS CLI.","A":"Create a virtual server by using Amazon Lightsail. Configure the web server in the Lightsail instance. Upload website content by using an SFTP client.","D":"Create a public Amazon S3 bucket. Configure AWS Transfer for SFTP. Configure the S3 bucket for website hosting. Upload website content by using the SFTP client.","B":"Create an AWS Auto Scaling group for Amazon EC2 instances. Use an Application Load Balancer. Upload website content by using an SFTP client."},"isMC":true,"timestamp":"2022-11-28 15:31:00","answer_description":""},{"id":"5ukp0PEFXISpITcTZLZL","answer_ET":"C","unix_timestamp":1669646040,"question_images":[],"isMC":true,"discussion":[{"timestamp":"1669750860.0","comments":[{"timestamp":"1690228320.0","poster":"MutiverseAgent","content":"C is correct > https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitor-ami-events.html","comment_id":"962000","upvote_count":"2"},{"timestamp":"1673363820.0","comment_id":"771545","upvote_count":"6","content":"That link contains the exact use case and explains how C can be used. \nOption B requires you to send logs to S3 and use Athena, 2 additional services that are not required, so this does not meet the \"LEAST operational overhead?\" requirement, since these are extra services requiring management.","poster":"JayBee65"}],"comment_id":"730792","content":"Selected Answer: C\nI'm team C.\nhttps://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html#:~:text=For%20example%2C%20you%20can%20create%20an%20EventBridge%20rule%20that%20detects%20when%20the%20AMI%20creation%20process%20has%20completed%20and%20then%20invokes%20an%20Amazon%20SNS%20topic%20to%20send%20an%20email%20notification%20to%20you.","upvote_count":"23","poster":"[Removed]"},{"timestamp":"1671932820.0","upvote_count":"15","comments":[{"upvote_count":"5","content":"\"Least operational overhead\" is when the event triggers an action, not when you run a scheduled task that searches logs for the event.","comment_id":"1106666","poster":"pentium75","timestamp":"1703665980.0"}],"comment_id":"755371","poster":"Wajif","content":"Selected Answer: A\nWhy not A? API calls are already logged in Cloudtrail."},{"content":"Selected Answer: C\nC all day. Trust me","comment_id":"1220245","upvote_count":"3","timestamp":"1716900240.0","poster":"lofzee"},{"timestamp":"1714917600.0","poster":"ManikRoy","comment_id":"1206916","upvote_count":"3","content":"Selected Answer: C\nIt can be done with option A but you'll have to write a lambda function. option C is least operational overhead."},{"content":"Selected Answer: C\nMonitor AMI events using Amazon EventBridge is possible and here is the \nlink:\nhttps://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html","upvote_count":"2","poster":"zinabu","timestamp":"1713621660.0","comment_id":"1199182"},{"content":"Just took the exam today, most of the questions were from here wish I saw them all to be honest before entering the exam. Anyways, this question was at the exam, I picked option A because as the question stated it wanted two things not one thing only an aplication that CAPTURES API calls and SEND ALERTS WHENEVER Createimage API call is made, OPTION C CLEARLY STATES THAT IN THIS CASE IT WILL ONLYYY LOOK FOR CREATEIMAGE API CALL it will not capture other API calls like the lambda in option A would! Am i the only one that is thinks that or what? TBH I am not sure about anything in this question but that is why I did not pick option C during the exam.","timestamp":"1711070340.0","comment_id":"1179756","poster":"Mahmouddddddddd","upvote_count":"3","comments":[{"poster":"JA2018","content":"Hi Mahmouddddddddd, care to share which answer did you actually choose in your exam? Thanks.","comment_id":"1314007","upvote_count":"1","timestamp":"1731935820.0"}]},{"timestamp":"1706797740.0","upvote_count":"1","comment_id":"1137682","poster":"bujuman","content":"Selected Answer: D\nOn of the requirements is LEAST operational overhead\nCloudTrail sends a notification when log files are written to the Amazon S3 bucket. An active account can generate a large number of notifications. If you subscribe with email or SMS, you can receive a large volume of messages. We recommend that you subscribe using Amazon Simple Queue Service (Amazon SQS), which lets you handle notifications programmatically. For more information, see Subscribing a Queue to an Amazon SNS Topic in the Amazon Simple Queue Service Developer Guide."},{"comment_id":"1113622","content":"Selected Answer: C\nAnswer is c.","timestamp":"1704367320.0","poster":"Wang87","upvote_count":"2"},{"upvote_count":"2","poster":"farnamjam","content":"Selected Answer: C\nC is correct","comment_id":"1108233","timestamp":"1703813520.0"},{"upvote_count":"1","poster":"master9","comment_id":"1104613","comments":[{"upvote_count":"2","poster":"pentium75","comment_id":"1106667","content":"But this is not about \"auditing and recording\", you don't want to create reports who created images during the last year, you want an instant alert when someone creates an image. Thus CloudWatch Events.","timestamp":"1703676300.0"}],"content":"Selected Answer: D\nAWS CloudTrail primarily focuses on auditing and recording API calls made in your AWS account. It logs all API requests made via the AWS Management Console, AWS SDKs, command line tools, and other AWS services. This includes the identity of the caller, the time of the API call, the source IP address of the caller, the request parameters, and the response elements returned by the AWS service. This information is useful for security analysis, resource change tracking, and troubleshooting.","timestamp":"1703424360.0"},{"timestamp":"1703176320.0","comment_id":"1102742","upvote_count":"4","content":"Cloud Watch = AWS Monitoring service for any AWS resources \nCloud Trail = AWS API monitoring service with respect to application event that are hosted on AWS. \nAnswer would be \"C\" \n\nhttps://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html\nservice","poster":"[Removed]"},{"poster":"rlamberti","content":"Selected Answer: C\n\"LEAST operational overhead\"\n\nOption A envolves coding a Lamba. Not good!\nOption C seems to be the correct.","timestamp":"1698021780.0","comment_id":"1051282","upvote_count":"3"},{"timestamp":"1695096300.0","content":"Selected Answer: C\nEvent bridge was built specifically to handle this kind of scenario:\nCreateImage API call (Event Source) -> Event bus -> Rules - > Amazon SNS (Event target)","upvote_count":"7","poster":"TariqKipkemei","comment_id":"1011045"},{"comment_id":"1005204","upvote_count":"4","poster":"Guru4Cloud","content":"Selected Answer: C\nC. Create an Amazon EventBridge (Amazon CloudWatch Events) rule for the CreateImage API call. Configure the target as an Amazon Simple Notification Service (Amazon SNS) topic to send an alert when a CreateImage API call is detected","timestamp":"1694470800.0"},{"poster":"Nava702","comment_id":"998533","content":"Selected Answer: A\nA look like the least overhead option to capture an API call.","timestamp":"1693830840.0","upvote_count":"2"},{"timestamp":"1688703900.0","upvote_count":"1","poster":"Mia2009687","comment_id":"945302","content":"Selected Answer: B\nThe company needs to design an application that captures AWS API calls and sends alerts whenever the Amazon EC2 CreateImage API operation is called within the company’s account.\n\nWith option C, it won't \"The company needs to design an application that captures AWS API calls\". it only sends the \"CreateImage API \" event. We need to store the AWS API calls as well."},{"content":"EventBridge (formerly CloudWatch Events) is a fully managed event bus service that allows you to monitor and respond to events within your AWS environment. By creating an EventBridge rule specifically for the CreateImage API call, you can easily detect and capture this event. Configuring the target as an SNS topic allows you to send an alert whenever a CreateImage API call occurs. This solution requires minimal operational overhead as EventBridge and SNS are fully managed services.\n\nA. While using an Lambda to query CloudTrail logs and send an alert can achieve the desired outcome, it introduces additional operational overhead compared to using EventBridge and SNS directly.\n\nB. Configuring CloudTrail with an SNS notification and using Athena to query on CreateImage API calls would require more setup and maintenance compared to using EventBridge and SNS.\n\nD. Configuring an SQS FIFO queue as a target for CloudTrail logs and using a function to send an alert to an SNS topic adds unnecessary complexity to the solution and increases operational overhead. Using EventBridge and SNS directly is a simpler and more efficient approach.","poster":"cookieMr","upvote_count":"9","comment_id":"935102","timestamp":"1687850820.0"},{"timestamp":"1687589220.0","poster":"pisica134","comment_id":"932272","upvote_count":"2","content":"D makes no sense, FIFO is not required, SQS is not used for sending notifications...C all the way"},{"comment_id":"928300","content":"Selected Answer: D\nAs the link shared by who chose C, it said EventBrigde can catch event ( available/failed/deregistered). In this doc, CreateImage not distinct with CopyImage/RegisterImage/CreateRestoreImageTask.\nSo It not C.\nIt not B because it very overhead.\nAnd the question say \"whenever', means quick as possible, so It not A.\nThe right answer is D","upvote_count":"1","timestamp":"1687252260.0","poster":"edric1998"},{"content":"Selected Answer: C\nhttps://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html#:~:text=For%20example%2C%20you%20can%20create%20an %20EventBridge%20regla%20que%20detecta%20cuando%20el%20creación%20AMI%20proceso%20ha%20completado%20y%20entonces%20invoca%20un%20Amazon%20SNS%20tema%20para%20enviar%20un%20correoelectrónico%20notificación%20para%20usted","upvote_count":"2","poster":"TheAbsoluteTruth","comment_id":"860855","timestamp":"1680601740.0"},{"poster":"test_devops_aws","upvote_count":"3","content":"Selected Answer: C\nhttps://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html","timestamp":"1679336760.0","comment_id":"845146","comments":[{"content":"Option C makes sense here.","poster":"kraken21","timestamp":"1680215460.0","upvote_count":"2","comment_id":"856372"}]},{"timestamp":"1672647840.0","comment_id":"763590","upvote_count":"2","content":"Selected Answer: C\nLEAST operational overhead","poster":"Zerotn3"},{"timestamp":"1671821040.0","poster":"Buruguduystunstugudunstuy","comment_id":"754426","upvote_count":"11","content":"Selected Answer: C\nThe correct solution is Option C. Creating an Amazon EventBridge (Amazon CloudWatch Events) rule for the CreateImage API call and configuring the target as an Amazon Simple Notification Service (Amazon SNS) topic to send an alert when a CreateImage API call is detected will meet the requirements with the least operational overhead.\n\nAmazon EventBridge is a serverless event bus that makes it easy to connect applications together using data from your own applications, integrated Software as a Service (SaaS) applications, and AWS services. By creating an EventBridge rule for the CreateImage API call, the company can set up alerts whenever this operation is called within their account. The alert can be sent to an SNS topic, which can then be configured to send notifications to the company's email or other desired destination. \n\nThis solution does not require the company to create a Lambda function or query CloudTrail logs, which makes it the most cost-effective and efficient option."},{"content":"Selected Answer: C\nOption C is right answer.\nEventbridge has integration with CloudTrail as source of events (using pipes).\nOption D is incorrect as Cloudtrail can not automatically send its API event logs to SQS.","timestamp":"1671260520.0","poster":"career360guru","comment_id":"747832","upvote_count":"3"},{"upvote_count":"3","poster":"Shasha1","content":"C\nOption B is not correct because it involves using Amazon Athena to query AWS CloudTrail logs, which can be a time-consuming and error-prone process. Additionally, it requires the company to manage the underlying infrastructure for Amazon Athena, which adds operational overhead.","timestamp":"1670851980.0","comment_id":"742843"},{"content":"Selected Answer: C\nanswer is c","poster":"Sahilbhai","upvote_count":"2","timestamp":"1670830080.0","comment_id":"742506"},{"poster":"javitech83","content":"Selected Answer: C\nit is C","timestamp":"1670434680.0","upvote_count":"2","comment_id":"738179"},{"content":"Selected Answer: B\nThe Goal is to trigger AMI create event from API Call, for me B because C mentioned EventBridge will only focuses on state change (available, failed, deregistered) so we don't need these details according the question.","comments":[{"upvote_count":"5","comment_id":"746970","timestamp":"1671180060.0","comments":[{"poster":"HayLLlHuK","comment_id":"769257","upvote_count":"2","timestamp":"1673171100.0","content":"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitor-ami-events.html"}],"content":"Please read documentation:\n\" you can create an EventBridge rule that detects when the AMI creation process has completed and then invokes an Amazon SNS topic to send an email notification to you.\"\n\nSo it do send event when AMI is created, so C is correct.","poster":"romko"}],"comment_id":"736886","upvote_count":"1","timestamp":"1670336160.0","poster":"invaderfr"},{"content":"Selected Answer: C\nOption B and C seems right but \"LEAST operational overhead\" eliminates B. So, C is the right answer.","comment_id":"735420","upvote_count":"2","timestamp":"1670184540.0","poster":"Rameez1"},{"upvote_count":"1","content":"Selected Answer: B\nB - https://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html","poster":"mj98","timestamp":"1669844160.0","comment_id":"732003","comments":[{"upvote_count":"2","comment_id":"732006","content":"typo - it's C","timestamp":"1669844160.0","poster":"mj98"}]},{"poster":"kmaneith","upvote_count":"2","content":"why it is not D? I think this is the correct answer","comment_id":"731076","timestamp":"1669781460.0","comments":[{"content":"D is incorrect because it requires the company to configure an SQS FIFO queue as a target for CloudTrail logs, create a Lambda function, and send an alert to an SNS topic. \n\nThis option is more complex and requires more operational overhead than creating an EventBridge rule. \n\nHence, the correct solution is Option C.","comment_id":"754425","poster":"Buruguduystunstugudunstuy","upvote_count":"2","timestamp":"1671820860.0"}]},{"content":"what's the correct answer?","upvote_count":"1","poster":"lakshmilnj","timestamp":"1669753740.0","comments":[{"timestamp":"1669844100.0","comments":[],"poster":"mj98","comment_id":"732002","upvote_count":"1","content":"B - https://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html"}],"comment_id":"730831"},{"poster":"JCH760310","content":"the key \"The company needs to design an application that captures AWS API calls\" not how can they capture AWS API calls :-)","comment_id":"730312","timestamp":"1669721280.0","upvote_count":"3"},{"content":"Selected Answer: B\nhttps://docs.aws.amazon.com/AWSEC2/latest/APIReference/using-cloudtrail.html","poster":"jambajuice","comment_id":"729693","timestamp":"1669676640.0","upvote_count":"2"},{"timestamp":"1669654920.0","comment_id":"729450","poster":"Gabs90","comments":[{"content":"But option C - they are trying to mention about cloudwatch events. Eventbridge monitors the state change of AMI's. Will go for Option B","upvote_count":"2","timestamp":"1669706640.0","comment_id":"730050","poster":"KADSM"}],"content":"Selected Answer: C\nIt's C to me : https://www.examtopics.com/discussions/amazon/view/82701-exam-aws-certified-solutions-architect-associate-saa-c02/\nUse Event bridge seems to be the best choice","upvote_count":"7"},{"poster":"leonnnn","upvote_count":"1","content":"Selected Answer: B\nI choose B","comment_id":"729368","timestamp":"1669652280.0"},{"content":"Selected Answer: C\nAnswer : C","poster":"Nigma","timestamp":"1669646040.0","upvote_count":"3","comment_id":"729230","comments":[{"upvote_count":"1","comment_id":"729723","comments":[{"poster":"Nigma","timestamp":"1669698600.0","content":"https://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/monitor-ami-events.html","upvote_count":"5","comment_id":"729926"}],"timestamp":"1669679040.0","content":"Why C , Why not B.?","poster":"jambajuice"}]}],"exam_id":31,"answer_description":"","timestamp":"2022-11-28 15:34:00","question_id":140,"choices":{"D":"Configure an Amazon Simple Queue Service (Amazon SQS) FIFO queue as a target for AWS CloudTrail logs. Create an AWS Lambda function to send an alert to an Amazon Simple Notification Service (Amazon SNS) topic when a CreateImage API call is detected.","C":"Create an Amazon EventBridge (Amazon CloudWatch Events) rule for the CreateImage API call. Configure the target as an Amazon Simple Notification Service (Amazon SNS) topic to send an alert when a CreateImage API call is detected.","A":"Create an AWS Lambda function to query AWS CloudTrail logs and to send an alert when a CreateImage API call is detected.","B":"Configure AWS CloudTrail with an Amazon Simple Notification Service (Amazon SNS) notification that occurs when updated logs are sent to Amazon S3. Use Amazon Athena to create a new table and to query on CreateImage when an API call is detected."},"answers_community":["C (77%)","A (15%)","5%"],"answer":"C","question_text":"A company wants to manage Amazon Machine Images (AMIs). The company currently copies AMIs to the same AWS Region where the AMIs were created. The company needs to design an application that captures AWS API calls and sends alerts whenever the Amazon EC2 CreateImage API operation is called within the company’s account.\n\nWhich solution will meet these requirements with the LEAST operational overhead?","url":"https://www.examtopics.com/discussions/amazon/view/89086-exam-aws-certified-solutions-architect-associate-saa-c03/","topic":"1","answer_images":[]}],"exam":{"isImplemented":true,"lastUpdated":"11 Apr 2025","id":31,"isBeta":false,"name":"AWS Certified Solutions Architect - Associate SAA-C03","provider":"Amazon","numberOfQuestions":1019,"isMCOnly":true},"currentPage":28},"__N_SSP":true}