{"pageProps":{"questions":[{"id":"yJ5HE6UCo3wYLNFR11lC","discussion":[{"upvote_count":"21","content":"This question seems to go a little bit too far into the weeds for what this test is supposed to be. The AWS documentation specifically mentions TrustedAdvisor in the article about unrestricted security groups, but Trusted advisor isn't focused on security specifically like GuardDuty. However, GuardDuty doesn't focus on this issue specifically, either.\n\nA. AWS Trusted Advisor: A service that provides best practices and recommendations for your AWS environment. It includes security checks, such as identifying security groups with unrestricted access.\n\nB. Amazon CloudWatch: A monitoring service, and while it can provide insights into resource utilization and logs, it doesn't specifically focus on identifying misconfigured security groups.\n\nC. Amazon GuardDuty: A threat detection service that continuously monitors for malicious activity and unauthorized behavior in AWS accounts. GuardDuty doesn't specifically perform configuration checks for security groups with unrestricted access.\n\nD. AWS Health Dashboard: Provides information about the status of AWS services. It doesn't typically perform detailed security configuration checks.","poster":"TheFivePips","comments":[{"timestamp":"1706266140.0","content":"Very much agreed. A little to in depth for what the purpose of the test is. But good knowledge to have if going for the security specialty certificate later on. Also, A is correct.","poster":"blehbleh","upvote_count":"1","comment_id":"1132452"}],"comment_id":"1131056","timestamp":"1706124900.0"},{"timestamp":"1698948900.0","comment_id":"1060763","upvote_count":"12","content":"Based on Chat GPT:\n\nC. Amazon GuardDuty\n\nAmazon GuardDuty is an AWS service that is designed to monitor and detect potential security threats in your AWS environment. It helps to identify unusual and unauthorized activities, including misconfigured security groups that may be allowing unrestricted access to specific ports. GuardDuty uses machine learning and threat intelligence to analyze data and generate alerts, making it an effective tool for enhancing the security of your AWS infrastructure.\n\nWhile options like AWS Trusted Advisor and Amazon CloudWatch offer valuable monitoring capabilities, they do not specifically focus on detecting security group misconfigurations. Therefore, in this scenario, Amazon GuardDuty is the most appropriate choice.","poster":"morccini"},{"poster":"Inptic","upvote_count":"2","content":"Selected Answer: A\nThe correct answer is:\n\nA. AWS Trusted Advisor\n\nAWS Trusted Advisor provides real-time guidance to help provision your resources following AWS best practices. It includes a security check that identifies security groups with rules that allow unrestricted access (0.0.0.0/0) to specific ports, which could pose a security risk. This service helps you monitor and remediate misconfigured security groups.\n\nWhy not the others?\nB. Amazon CloudWatch: CloudWatch is used for monitoring and observability, such as collecting logs, metrics, and setting alarms. It does not specifically identify misconfigured security groups.\n\nC. Amazon GuardDuty: GuardDuty is a threat detection service that uses machine learning to identify malicious activity or unauthorized behavior. It does not focus on identifying misconfigured security groups.\n\nD. AWS Health Dashboard: This service provides information about the health of AWS services and resources, but it does not monitor for misconfigured security groups.","comment_id":"1348206","timestamp":"1738100760.0"},{"upvote_count":"2","timestamp":"1737320820.0","content":"Selected Answer: C\nThe correct answer is C. Amazon GuardDuty.\n\nAmazon GuardDuty is a threat detection service that monitors AWS accounts and resources for malicious activity. It can detect misconfigured security groups that allow unrestricted access to specific ports, among other security issues.","comment_id":"1343206","poster":"Frankdespi"},{"comment_id":"1334111","timestamp":"1735561800.0","poster":"Amin_013","upvote_count":"1","content":"Selected Answer: A\nA. AWS Trusted Advisor"},{"content":"Selected Answer: A\nA. AWS Trusted Advisor","poster":"ShaiTay","comment_id":"1312282","timestamp":"1731611580.0","upvote_count":"1"},{"timestamp":"1727809380.0","upvote_count":"1","poster":"yaralexie","comment_id":"1292080","content":"Selected Answer: C\nI honestly think GuardDuty is the correct answer here"},{"comment_id":"1283368","content":"Selected Answer: A\nGuardduty uses machine learning on various events and logs. If a misconfiguration is never abused, Guardduty cannot detect it as no logs are generated.","upvote_count":"1","poster":"Strawberryq","timestamp":"1726258260.0"},{"upvote_count":"1","content":"Selected Answer: A\na is ok","comment_id":"1270853","poster":"GPFT","timestamp":"1724345160.0"},{"content":"Selected Answer: A\na is ok","comment_id":"1270852","upvote_count":"1","timestamp":"1724345100.0","poster":"GPFT"},{"content":"As i think GuardDuty coccrect answer, because in the question you can notice word MONITOR, which indicate to GuardDuty service, which is monitor services. Trusted advisor just give some recommendations, TrustedAdvisor under the hood work based on AWS specialist reviews , but not used monitoring.","comment_id":"1243144","timestamp":"1720235340.0","poster":"griggrig","upvote_count":"1"},{"upvote_count":"1","timestamp":"1716981660.0","poster":"Supercell","content":"Selected Answer: C\nThe AWS service that can monitor for misconfigured security groups allowing unrestricted access to specific ports is:\nC. Amazon GuardDuty\nAmazon GuardDuty is a threat detection service that continuously monitors for malicious activity and unauthorized behavior to protect your AWS accounts, workloads, and data stored in Amazon S3. One of the key features of GuardDuty is its ability to detect security misconfigurations, including misconfigured security groups that allow unrestricted access to specific ports.\n\nNOT AWS Trusted Advisor because:\n- While Trusted Advisor does provide recommendations for security best practices, it does not actively monitor for real-time security threats or misconfigurations like misconfigured security groups.","comment_id":"1220854"},{"timestamp":"1715711040.0","comment_id":"1211612","poster":"chalaka","content":"Selected Answer: A\nA. AWS Trusted Advisor\n\nAWS Trusted Advisor includes a security check that examines security groups for unrestricted access to specific ports. It can identify security groups with overly permissive rules that may pose security risks, such as allowing unrestricted access to SSH (port 22) or RDP (port 3389) from any IP address. By regularly running this check, the company can identify and address any misconfigurations in their security groups to enhance their security posture.","upvote_count":"2"},{"timestamp":"1714955640.0","upvote_count":"2","poster":"chalaka","content":"Selected Answer: A\nA. AWS Trusted Advisor\n\nAWS Trusted Advisor includes a security check called \"Security Groups - Specific Ports Unrestricted\" that analyzes your security groups and identifies any that have rules allowing unrestricted access to specific ports. It alerts you to these misconfigurations, enabling you to review and modify your security group rules to ensure appropriate access control.","comment_id":"1207106"},{"poster":"chalaka","timestamp":"1714226880.0","content":"Selected Answer: A\nA. AWS Trusted Advisor\n\nAWS Trusted Advisor is a service that provides real-time guidance to help you provision your resources following AWS best practices. It includes checks for security configurations, cost optimization, performance, and fault tolerance. Specifically, Trusted Advisor includes checks for security groups that have unrestricted access (e.g., security groups with inbound rules allowing access to all IP addresses) and can provide recommendations to remediate these issues.","comment_id":"1203148","upvote_count":"2"},{"poster":"Frank3108","comment_id":"1169537","timestamp":"1709993400.0","upvote_count":"1","content":"C. Amazon GuardDuty\n\nAmazon GuardDuty is getting the inputs through VPC flow logs, like unusual internal traffic and unusual IP address."},{"content":"Correct answer is A.\n\nAWS Trusted Advisor: This service provides real-time guidance to help you provision your resources following AWS best practices. It includes checks for security groups that are allowing unrestricted access to specific ports, among other checks. Trusted Advisor can help you identify and resolve issues related to security groups and other AWS resources.\n\nAmazon GuardDuty: Amazon GuardDuty is a threat detection service that continuously monitors for malicious or unauthorized behavior to help protect your AWS accounts and workloads. It does not specifically focus on monitoring for misconfigured security groups.","timestamp":"1709431980.0","upvote_count":"4","comment_id":"1164451","poster":"pure_edge"},{"content":"Selected Answer: A\nTwo Trusted Advisor checks are available to all Amazon Web Services customers to help improve security and performance: Service Limits, and Security Groups - Specific Ports Unrestricted.\n\nhttps://www.amazonaws.cn/en/support/trustedadvisor/best-practices/#:~:text=Two%20Trusted%20Advisor%20checks%20are,Security%20Groups%20%2D%20Specific%20Ports%20Unrestricted.","upvote_count":"2","poster":"[Removed]","timestamp":"1709147880.0","comment_id":"1161934"},{"content":"C is the correct answer as the Guard Duty is constantly on alert for measures like this.","upvote_count":"1","comment_id":"1157503","timestamp":"1708721820.0","poster":"kelito"},{"comment_id":"1149390","comments":[{"timestamp":"1708088940.0","content":"A = CORRECT > https://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-specific-ports-unrestricted","poster":"LinuxChamp","upvote_count":"3","comment_id":"1152008"}],"timestamp":"1707844440.0","content":"C = CORRECT","upvote_count":"1","poster":"LinuxChamp"},{"comment_id":"1145905","poster":"James_Srm","upvote_count":"6","timestamp":"1707534480.0","content":"Selected Answer: A\nA.AWS Trusted Advisor\nyou guy stop arguing and please look at this official docs here: https://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-specific-ports-unrestricted\ncheck on \"Security Groups – Unrestricted Access\" and you will see the answer is choice A."},{"upvote_count":"1","timestamp":"1706724720.0","content":"Selected Answer: C\nI think that the correct answer is C, the Trusted Advisor is used more for recommendations not for monitoring. For monitoring is Amazon GuardDuty\n\"\n\nQ: Can I take automated preventative actions using Amazon GuardDuty?\n\nWith Amazon GuardDuty, Amazon CloudWatch Events, and Amazon Lambda, you have the flexibility to set up automated preventative actions based on a security finding. For example, you can create a Lambda function to modify your Amazon Web Services security group rules based on security findings. If you get a GuardDuty finding indicating one of your Amazon EC2 instances is being probed by a known malicious IP, you can address it through a CloudWatch Events rule that triggers a Lambda function to automatically modify your security group rules and restrict access on that port.\n\"","poster":"Eleftheriia","comment_id":"1137013"},{"comment_id":"1136346","poster":"BobFar","timestamp":"1706669160.0","content":"C is the correct answer \nAmazon GuardDuty is the most aligned AWS service. Its built-in capabilities for detecting misconfigured security groups and unauthorized port access, combined with its threat intelligence and actionable insights, make it an exceptional choice for proactive security monitoring and prevention.","upvote_count":"1"},{"content":"Selected Answer: A\n\"Amazon Web Services (AWS) Trusted Advisor monitors security groups for rules that allow unrestricted access to specific ports.\"","upvote_count":"2","timestamp":"1705684560.0","poster":"blehbleh","comment_id":"1126839"},{"comment_id":"1126454","timestamp":"1705642860.0","content":"Selected Answer: C\nAmazon GuardDuty is an AWS service that can help monitor for misconfigured security groups by identifying suspicious or malicious activity. It analyzes VPC flow logs and DNS logs to detect various types of threats, including unauthorized access through security groups.","upvote_count":"1","poster":"Niro2023"},{"comment_id":"1123850","content":"What are the 7 core checks trusted advisor?\nThese seven checks are:\n1>S3 Bucket Permissions.\n2>Security Groups – Specific Ports Unrestricted.\n3>IAM Use.\n4>MFA on Root Account.\n5>EBS Public Snapshots.\n6>RDS Public Snapshots.\n7>Service Limits.\n\nHence , the Answer is Trusted advisor as question mentioned about Security groups.","poster":"BabiRahul","upvote_count":"4","timestamp":"1705379100.0"},{"upvote_count":"1","content":"Selected Answer: A\nhttps://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-specific-ports-unrestricted:~:text=Devices%20with%20AWS-,Security%20Groups%20%E2%80%93%20Specific%20Ports%20Unrestricted,-Description\n\nhttps://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-unrestricted-access:~:text=To%20Port-,Security%20Groups%20%E2%80%93%20Unrestricted%20Access,-Description\n\nhttps://docs.aws.amazon.com/guardduty/latest/ug/what-is-guardduty.html\n\nGuardDuty is all about monitoring various kind of logs including Cloud trail logs to watch for malicious activities, malware detection, unauthorized infrastructure deployments and intelligently detecting threats. It does NOT deal with or detect misconfigurations including security groups misconfigurations.","comment_id":"1116766","poster":"BShelat","timestamp":"1704731160.0"},{"upvote_count":"3","comment_id":"1105451","content":"Selected Answer: A\nTrusted advisor security has the capability of monitoring SGs. Guardduty don't alerts about security groups.","poster":"stheno","timestamp":"1703527140.0"},{"timestamp":"1702292160.0","content":"Selected Answer: A\nhttps://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-specific-ports-unrestricted","upvote_count":"1","comment_id":"1093382","poster":"Mike_84"},{"content":"Selected Answer: C\nThe answer is C. Amazon GuardDuty.","poster":"VikJo1978","timestamp":"1702144080.0","comment_id":"1091949","upvote_count":"1"},{"poster":"db97","timestamp":"1701902880.0","comment_id":"1089814","upvote_count":"2","content":"Selected Answer: A\nAWS Trust Advisor:\nThis is the correct answer since this feature is commonly used to verify best practices throughout the entire environment even from the security perspective.\n\nAmazon GuardDuty is more focused on other type of threats, threat intelligence + threat hunting to be specific.\n\nA is the correct answer here."},{"comment_id":"1084971","poster":"cloudrishank","timestamp":"1701409860.0","content":"Selected Answer: A\nSecurity Groups - Specific Ports Unrestricted\n\n\nChecks security groups for rules that allow unrestricted access (0.0.0.0/0) to specific ports. Unrestricted access increases opportunities for malicious activity (hacking, denial-of-service attacks, loss of data). The ports with highest risk are flagged red, and those with less risk are flagged yellow. Ports flagged green are typically used by applications that require unrestricted access, such as HTTP and SMTP.\nIf you have intentionally configured your security groups in this manner, we recommend using additional security measures to secure your infrastructure (such as IP tables).","upvote_count":"4"},{"upvote_count":"3","timestamp":"1701205920.0","poster":"6aa026b","content":"1 of the 7 core checks for trusted advisor \" Security Groups – Specific Ports Unrestricted\"","comment_id":"1082955"},{"comment_id":"1073648","content":"Selected Answer: A\nGPT:\nTo monitor for misconfigured security groups that are allowing unrestricted access to specific ports, the most suitable AWS service is:\n\nA. AWS Trusted Advisor: AWS Trusted Advisor is a service that analyzes your AWS environment and provides recommendations for saving money, improving system performance, and closing security gaps. It includes checks for common misconfigurations in security groups, such as open ports to the internet, which could pose a security risk. Trusted Advisor can alert you to these potential vulnerabilities, helping you ensure that your security groups are configured properly.","timestamp":"1700257920.0","poster":"tqiu654","upvote_count":"1"},{"timestamp":"1699962300.0","content":"Amazon GuardDuty is an AWS service that is designed to monitor and detect potential security threats in your AWS environment. It helps to identify unusual and unauthorized activities, including misconfigured security groups that may be allowing unrestricted access to specific ports.Oct 13, 2023","upvote_count":"1","comment_id":"1070315","poster":"rebelfourkix"},{"poster":"bn04","upvote_count":"1","content":"Selected Answer: A\ncorrect answer is A","timestamp":"1699468500.0","comment_id":"1065846"},{"poster":"AgPhyo","timestamp":"1699177260.0","upvote_count":"1","content":"The answer is B. Amazon cloudwatch\nAmazon CloudWatch is the AWS service that allows you to monitor and collect data from various AWS resources and services. It provides the capability to create custom alarms and dashboards to monitor specific events and metrics. In the context of the scenario described, CloudWatch is the most suitable choice for monitoring misconfigured security groups that allow unrestricted access to specific ports.","comment_id":"1062745"},{"content":"Selected Answer: A\nI choose answer A \n\nSecurity Groups – Unrestricted Access\nChecks security groups for rules that allow unrestricted access to a resource.\nUnrestricted access increases opportunities for malicious activity (hacking, denial-of-service attacks, loss of data).\n\n For more information, see the Trusted Advisor FAQ\nhttps://docs.aws.amazon.com/awssupport/latest/user/security-checks.html","comment_id":"1059191","upvote_count":"4","poster":"Ellbi","timestamp":"1698785040.0"},{"poster":"GSMUTTA","timestamp":"1698775140.0","comments":[{"poster":"GSMUTTA","comment_id":"1059123","upvote_count":"1","timestamp":"1698775740.0","content":"Because it monitors and aws trusted advisor recommends"}],"comment_id":"1059119","upvote_count":"3","content":"C is correct: \nAmazon GuardDuty is a threat detection service that continuously monitors for suspicious activity and unauthorized access within your AWS environment, including identifying misconfigured security groups. It can detect unusual behavior related to network traffic, access patterns, and security group rules, which can help identify and address security issues."},{"timestamp":"1698703020.0","content":"Selected Answer: A\nKeywords: \"monitor of misconfigured security groups\"","upvote_count":"1","comment_id":"1058309","poster":"dmeen21"},{"comment_id":"1057857","upvote_count":"1","timestamp":"1698675540.0","content":"Selected Answer: A\nTrusted Advisor can help improve the security of your AWS environment by suggesting foundational security best practices curated by security experts. Examples include identifying RDS security group access risk, exposed access keys, and unnecessary S3 bucket permissions.\n\nC is not good IMO: GuardDuty is capable of analyzing tens of billions of events across multiple AWS data sources, such as AWS CloudTrail event logs, Amazon Virtual Private Cloud (VPC) Flow Logs, Amazon Elastic Kubernetes Service (EKS) audit and system-level logs, and DNS query logs.","poster":"PorkChop1999"},{"timestamp":"1698539640.0","comment_id":"1056520","content":"Selected Answer: A\nGuard duty - account and workloads security against malicious activities.\nOne of the 7 core checks in Trusted Advisor is to look for Security groups - specific ports unrestricted","poster":"jeevamini","upvote_count":"1"},{"comment_id":"1056219","upvote_count":"1","timestamp":"1698498540.0","content":"Selected Answer: C\nkey word: monitor","poster":"anita_likes_cloud"},{"comments":[],"comment_id":"1055098","poster":"petercorn","timestamp":"1698379800.0","upvote_count":"1","content":"Selected Answer: A\nTrusted Advisor can help improve the security of your AWS environment by suggesting foundational security best practices curated by security experts. Examples include identifying RDS security group access risk, exposed access keys, and unnecessary S3 bucket permissions.\nhttps://aws.amazon.com/premiumsupport/technology/trusted-advisor/"},{"upvote_count":"3","content":"Selected Answer: C\nAmazon GuardDuty is a threat detection service that continuously monitors for suspicious and unauthorized activity in your AWS environment. It can help you identify security group misconfigurations that may lead to unrestricted access to specific ports, among other security issues.","poster":"Premji","comment_id":"1053037","timestamp":"1698164580.0"},{"timestamp":"1697651100.0","upvote_count":"1","comment_id":"1047116","poster":"Aman_JS","content":"Selected Answer: A\nhttps://docs.aws.amazon.com/awssupport/latest/user/security-checks.html#security-groups-specific-ports-unrestricted"},{"upvote_count":"2","timestamp":"1697640360.0","comment_id":"1047009","content":"A. AWS Trusted Advisor\n\nAWS Trusted Advisor is a service that provides recommendations for optimizing your AWS infrastructure. It includes checks for security best practices, such as identifying security groups that have overly permissive rules, which would allow unrestricted access to specific ports. It offers guidance on how to address these misconfigurations.","comments":[{"poster":"rebelfourkix","content":"Amazon GuardDuty is an AWS service that is designed to monitor and detect potential security threats in your AWS environment. It helps to identify unusual and unauthorized activities, including misconfigured security groups that may be allowing unrestricted access to specific ports.Oct 13, 2023","timestamp":"1699962360.0","comment_id":"1070319","upvote_count":"2"}],"poster":"felixlugo06"},{"poster":"parrtner73","comment_id":"1046986","upvote_count":"1","content":"A - https://aws.amazon.com/blogs/security/learn-and-use-13-aws-security-tools-to-implement-sec-recommended-protection-stored-customer-data-cloud/","timestamp":"1697638680.0"},{"upvote_count":"1","content":"Selected Answer: C\nWhile AWS Trusted Advisor (option A) provides recommendations for optimizing security, cost, performance, and fault tolerance of AWS resources, it does not specifically focus on monitoring misconfigured security groups.\n\nAmazon GuardDuty (option C), on the other hand, is a threat detection service that continuously monitors for malicious activities and unauthorized behavior within your AWS environment, including detecting potential security group misconfigurations.\n\nTherefore, in this case, Amazon GuardDuty (option C) is the more appropriate service for monitoring misconfigured security groups.","timestamp":"1697551560.0","comment_id":"1046084","comments":[{"timestamp":"1697799420.0","comment_id":"1048697","poster":"ezeadnah","content":"Amazon GuardDuty is a threat detection service that monitors for malicious activity in AWS accounts. However, GuardDuty does not specifically monitor for misconfigured security groups.","upvote_count":"1"}],"poster":"NayeraB"},{"upvote_count":"1","poster":"FedeLocoLette","content":"A. AWS Trusted Advisor\n\nAWS Trusted Advisor includes a \"Security Groups - Specific Ports Unrestricted\" check, which can help you identify security groups that may have overly permissive rules, allowing unrestricted access to specific ports. This check provides recommendations to enhance security by tightening access control.","timestamp":"1697496300.0","comment_id":"1045331"},{"upvote_count":"1","timestamp":"1697475480.0","comment_id":"1045169","content":"Selected Answer: C\nIMO should be guardduty, as it monitors threats.","poster":"Tomatensaft"},{"timestamp":"1697464320.0","upvote_count":"1","comment_id":"1045036","content":"Selected Answer: A\nThe Trusted Advisor monitors and notifies organizations of any permissive access to EC2 Instances. It checks security group rules that allow unrestricted access to specific ports (0.0.0.0/0).","poster":"parrtner73"},{"comment_id":"1042720","upvote_count":"3","content":"Selected Answer: B\nmonitoring is Amazon CloudWatch","poster":"Ailil","timestamp":"1697204820.0"}],"answers_community":["A (74%)","C (21%)","5%"],"question_id":611,"unix_timestamp":1697204820,"question_images":[],"choices":{"A":"AWS Trusted Advisor","D":"AWS Health Dashboard","B":"Amazon CloudWatch","C":"Amazon GuardDuty"},"isMC":true,"timestamp":"2023-10-13 15:47:00","question_text":"A company wants to monitor for misconfigured security groups that are allowing unrestricted access to specific ports.\nWhich AWS service will meet this requirement?","answer_ET":"A","exam_id":19,"answer_description":"","answer_images":[],"answer":"A","topic":"1","url":"https://www.examtopics.com/discussions/amazon/view/123528-exam-aws-certified-cloud-practitioner-clf-c02-topic-1/"},{"id":"NONktLyqx6WkxDtEFHYT","topic":"1","question_id":612,"question_images":[],"unix_timestamp":1726443480,"url":"https://www.examtopics.com/discussions/amazon/view/147679-exam-aws-certified-cloud-practitioner-clf-c02-topic-1/","answers_community":["B (100%)"],"answer_images":[],"answer":"B","discussion":[{"content":"Selected Answer: B\nThe correct answer is **B. AWS Identity and Access Management (IAM)**. AWS IAM is always available free of charge to users¹². It allows you to securely manage access to AWS services and resources for your users.\n\n(1) Get started with the AWS Free Tier - How AWS Pricing Works. https://docs.aws.amazon.com/whitepapers/latest/how-aws-pricing-works/get-started-with-the-aws-free-tier.html.\n(2) Did You Know About AWS Always-Free Services - DEV Community. https://dev.to/aws-builders/did-you-know-about-aws-always-free-services-3lgk.\n(3) Trying services using AWS Free Tier. https://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/billing-free-tier.html.","timestamp":"1734227040.0","comment_id":"1326652","poster":"Yak_Yeti","upvote_count":"1"},{"content":"B. AWS Identity and Access Management (IAM)","upvote_count":"1","poster":"d00b229","comment_id":"1284375","timestamp":"1726443480.0"}],"answer_description":"","choices":{"C":"AWS Secrets Manager","D":"Amazon ElastiCache","A":"Amazon Athena","B":"AWS Identity and Access Management (IAM)"},"exam_id":19,"answer_ET":"B","isMC":true,"timestamp":"2024-09-16 01:38:00","question_text":"Which AWS service is always available free of charge to users?"},{"id":"pX2ayLlxQPtQktKeG6dU","question_images":[],"timestamp":"2024-09-16 01:39:00","url":"https://www.examtopics.com/discussions/amazon/view/147680-exam-aws-certified-cloud-practitioner-clf-c02-topic-1/","topic":"1","choices":{"C":"Availability Zones","A":"Dedicated Hosts","B":"AWS Outposts","D":"AWS Wavelength"},"isMC":true,"question_id":613,"exam_id":19,"unix_timestamp":1726443540,"answer":"B","question_text":"A company needs to run some of its workloads on premises to comply with regulatory guidelines. The company wants to use the AWS Cloud to run workloads that are not required to be on premises. The company also wants to be able to use the same API calls for the on-premises workloads and the cloud workloads.\n\nWhich AWS service or feature should the company use to meet these requirements?","answers_community":["B (100%)"],"answer_description":"","answer_images":[],"discussion":[{"upvote_count":"1","timestamp":"1738901820.0","poster":"BlueMan93","content":"Selected Answer: B\nUsing AWS cloud on-prem = Outposts","comment_id":"1352811"},{"poster":"d00b229","comment_id":"1284376","content":"B. AWS Outposts","upvote_count":"1","timestamp":"1726443540.0"}],"answer_ET":"B"},{"id":"7xDj7eGpQ0wu8C0uCkBh","topic":"1","question_images":[],"url":"https://www.examtopics.com/discussions/amazon/view/147681-exam-aws-certified-cloud-practitioner-clf-c02-topic-1/","question_id":614,"timestamp":"2024-09-16 01:40:00","answer_description":"","choices":{"A":"A steady-state workload that requires a particular EC2 instance configuration for a long period of time","C":"An unpredictable workload that does not require a long-term commitment","D":"A workload that is expected to run for longer than 1 year","B":"A workload that can be interrupted for a project that requires the lowest possible cost"},"exam_id":19,"answers_community":["C (100%)"],"answer_images":[],"question_text":"What is the recommended use case for Amazon EC2 On-Demand Instances?","isMC":true,"unix_timestamp":1726443600,"answer":"C","discussion":[{"timestamp":"1744277100.0","upvote_count":"1","poster":"SynikalDemon","comment_id":"1559531","content":"Selected Answer: C\nNot B, On Demand is uninterrupted"},{"comment_id":"1312047","poster":"ShaiTay","timestamp":"1731593580.0","content":"Selected Answer: C\nC. An unpredictable workload that does not require a long-term commitment","upvote_count":"1"},{"poster":"d00b229","comment_id":"1284377","upvote_count":"1","content":"C. An unpredictable workload that does not require a long-term commitment","timestamp":"1726443600.0"}],"answer_ET":"C"},{"id":"tXsam4fiYhXV2mkZPeap","answer":"C","discussion":[{"timestamp":"1742729520.0","upvote_count":"1","comment_id":"1402248","poster":"alokdixit2006","content":"Selected Answer: C\nAWS Transit Gateway connects VPCs and on premises networks through a central hub and spoke (star) connection."},{"timestamp":"1726443660.0","comment_id":"1284378","upvote_count":"1","content":"C. AWS Transit Gateway","poster":"d00b229"}],"answer_images":[],"exam_id":19,"url":"https://www.examtopics.com/discussions/amazon/view/147682-exam-aws-certified-cloud-practitioner-clf-c02-topic-1/","timestamp":"2024-09-16 01:41:00","answers_community":["C (100%)"],"answer_ET":"C","isMC":true,"choices":{"C":"AWS Transit Gateway","B":"AWS Direct Connect","A":"Gateway VPC endpoint","D":"AWS PrivateLink"},"question_id":615,"topic":"1","question_images":[],"unix_timestamp":1726443660,"question_text":"A company wants to use an AWS networking solution that can act as a centralized gateway between multiple VPCs and on-premises networks.\n\nWhich AWS service or feature will meet this requirement?","answer_description":""}],"exam":{"numberOfQuestions":718,"isBeta":false,"isImplemented":true,"isMCOnly":true,"name":"AWS Certified Cloud Practitioner CLF-C02","provider":"Amazon","id":19,"lastUpdated":"11 Apr 2025"},"currentPage":123},"__N_SSP":true}