{"pageProps":{"questions":[{"id":"RyYTv4UDZeTi0fYZQNCR","topic":"1","question_text":"A company is running an online transaction processing (OLTP) workload on AWS. This workload uses an unencrypted Amazon RDS DB instance in a Multi-AZ deployment. Daily database snapshots are taken from this instance.\nWhat should a solutions architect do to ensure the database and snapshots are always encrypted moving forward?","url":"https://www.examtopics.com/discussions/amazon/view/85941-exam-aws-certified-solutions-architect-associate-saa-c03/","exam_id":31,"question_id":46,"answers_community":["A (85%)","Other"],"unix_timestamp":1666205580,"timestamp":"2022-10-19 20:53:00","answer_ET":"A","isMC":true,"answer_description":"","discussion":[{"poster":"123jhl0","comments":[{"comment_id":"1259905","timestamp":"1722605160.0","poster":"1e22522","upvote_count":"2","content":"thats crazy cuh the more you know ig"},{"poster":"Futurebones","timestamp":"1684353960.0","comments":[{"poster":"Smart","timestamp":"1690210260.0","content":"Once DB is encrypted, newer snapshots and read replicas will also be encrypted.","comment_id":"961726","upvote_count":"8"}],"content":"How can A gurantee future encryption?","comment_id":"900484","upvote_count":"4"},{"poster":"JoeGuan","content":"I agree, there is no reason to copy all of the snapshots and ecnrypt them all. You just need one encrypted snapshot, moving forward they will all be encrypted. C is close but I think there is no reason to copy all the snapshots plural. There is a wizard to go through and select the snapshot to encrypt. \"In the Amazon RDS console navigation pane, choose Snapshots, and select the DB snapshot you created. For Actions, choose Copy Snapshot. Provide the destination AWS Region and the name of the DB snapshot copy in the corresponding fields. Select the Enable Encryption checkbox. For Master Key, specify the KMS key identifier to use to encrypt the DB snapshot copy. Choose Copy Snapshot. For more information, see Copying a snapshot in the Amazon RDS documentation\". What if you had 30 snapshotS? You just need to do it once.","comment_id":"978711","comments":[{"content":"In simple terms, you double it the affort of your work and spending money by creating unnessary snapshots... so A is the best choice","timestamp":"1692187440.0","comment_id":"982521","poster":"Guru4Cloud","upvote_count":"2"}],"timestamp":"1691763720.0","upvote_count":"4"}],"content":"Selected Answer: A\n\"You can enable encryption for an Amazon RDS DB instance when you create it, but not after it's created. However, you can add encryption to an unencrypted DB instance by creating a snapshot of your DB instance, and then creating an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot to get an encrypted copy of your original DB instance.\"\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","timestamp":"1666205580.0","upvote_count":"65","comment_id":"699279"},{"comment_id":"880786","timestamp":"1682448780.0","upvote_count":"5","content":"Selected Answer: A\nYou can't restore from a DB snapshot to an existing DB instance; a new DB instance is created when you restore.","poster":"kruasan"},{"timestamp":"1734432180.0","upvote_count":"1","comment_id":"1327850","poster":"rmanuraj","content":"Selected Answer: A\nA seems to be the correct option compared to C. In the question it clearly says the current DB instance is an unencrypted Amazon RDS DB instance. And you can't restore an encrypted snapshot to an unencrypted DB instance."},{"content":"Selected Answer: A\nAns A - I must admit almsot put Ans C, but re-reading question and seeing comments its clear that encryption is needed \"moving forward\" so C is overkill...","timestamp":"1726659360.0","comment_id":"1285694","upvote_count":"2","poster":"PaulGa"},{"upvote_count":"2","comment_id":"1253447","timestamp":"1721716320.0","poster":"jaradat02","content":"Selected Answer: A\nReplacing a snapshots creates a new one instead of restoring the old one."},{"upvote_count":"2","poster":"Saadiii","timestamp":"1714764120.0","comment_id":"1206254","content":"Selected Answer: A\nI feel this is a bit tricky in the way the question is asked, but C implies that you are encrypting the snapshot. You are not. It is the DB that receives a KMS key upon restoring, but the snapshot is still unencrypted"},{"poster":"SinghJagdeep","comment_id":"1103056","content":"Selected Answer: A\nCorrect. Please visit for more details.\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","timestamp":"1703205720.0","upvote_count":"2"},{"poster":"ansagr","timestamp":"1702143780.0","upvote_count":"2","comment_id":"1091947","content":"Selected Answer: A\nAWS RDS does not support direct restoration of an encrypted snapshot to an existing unencrypted DB instance. When you restore a snapshot, it creates a new DB instance with the same configuration as the original instance."},{"upvote_count":"3","content":"Selected Answer: A\nWhat's wrong with C is: \"Copy the snapshots and enable encryption\"","timestamp":"1698681900.0","poster":"tom_cruise","comment_id":"1058006"},{"timestamp":"1697040420.0","content":"Selected Answer: A\nkey: snapshots","poster":"tom_cruise","comment_id":"1040860","upvote_count":"2"},{"content":"Selected Answer: A\nI was undecided if to choose A or C.\nBut since you can't restore a snapshot to an existing instance C is out. You can only create a new one.\nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_RestoreFromSnapshot.html#:~:text=You%20can%27t%20restore%20from%20a%20DB%20snapshot%20to%20an%20existing%20DB%20instance%3B%20a%20new%20DB%20instance%20is%20created%20when%20you%20restore.","timestamp":"1696845360.0","upvote_count":"2","comment_id":"1028716","poster":"AntonioMinolfi"},{"content":"A makes sence","timestamp":"1696612380.0","poster":"TMabs","comment_id":"1026837","upvote_count":"1"},{"comment_id":"930686","poster":"cookieMr","upvote_count":"2","comments":[{"poster":"BartoszGolebiowski24","timestamp":"1698333360.0","upvote_count":"2","content":"From the question:\n\"...What should a solutions architect do to ensure the database and snapshots are always encrypted moving forward?\"\nI think the question is about encrypting current and future snapshots instead of the old snapshots.","comment_id":"1054696"}],"content":"Selected Answer: C\nA. Replacing the existing DB instance with an encrypted snapshot can result in downtime and potential data loss during migration.\n\nB. Creating a new encrypted EBS volume for snapshots does not address the encryption of the DB instance itself.\n\nD. Copying snapshots to an encrypted S3 bucket only encrypts the snapshots, but does not address the encryption of the DB instance.\n\nOption C is the most suitable as it involves copying and encrypting the snapshots using AWS KMS, ensuring encryption for both the database and snapshots.","timestamp":"1687444800.0"},{"poster":"Abrar2022","comment_id":"906432","timestamp":"1684994940.0","content":"If daily snapshots are taken from the daily DB instance. Why create another copy? You just need to encrypt the latest daily DB snapshot and the restore from the existing encrypted snapshot.","upvote_count":"3"},{"comment_id":"872196","timestamp":"1681681080.0","comments":[{"poster":"JoeGuan","timestamp":"1691763900.0","upvote_count":"1","content":"I agree, in the wizard you would select ONE SNAPSHOT (singular in A), not all of the SNAPSHOTS (Plural in C)","comment_id":"978715"}],"upvote_count":"3","poster":"C_M_M","content":"A and C are almost similar except that A is latest snapshot, while C is snapshots (all the snapshots).\nI don't see any other difference btw those two options. \nOption A is clearly the correct on as all you need is the latest snapshot."},{"content":"A\nYou can only encrypt an Amazon RDS DB instance when you create it, not after the DB instance is created.\nHowever, because you can encrypt a copy of an unencrypted snapshot, you can effectively add encryption to an unencrypted DB instance. That is, you can create a snapshot of your DB instance, and then create an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot, and thus you have an encrypted copy of your original DB instance. \nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Overview.Encryption.html","timestamp":"1681483980.0","comment_id":"870261","upvote_count":"2","poster":"rushlav"},{"timestamp":"1679711280.0","comment_id":"849757","poster":"Abhineet9148232","upvote_count":"1","content":"Selected Answer: C\nEncryption is enabled during the Copy process itself.\nhttps://repost.aws/knowledge-center/encrypt-rds-snapshots"},{"poster":"Bang3R","comments":[{"timestamp":"1680788640.0","comment_id":"863005","content":"BUT you can't restore encrypted snapshot to an existing DB instance.Only no NEW DB (not an existing one). The procedure described in this way:\n\"(...) you can add encryption to an unencrypted DB instance by creating a snapshot of your DB instance, and then creating an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot to get an encrypted copy of your original DB instance.\"\n\nrefers to create a NEW DB instance (this encrypted), never restoring in a existing one.\nThe RDB engine understands that restoring from a encrypted snapshot is form create an encrypted NEW database.","upvote_count":"2","poster":"jdr75"}],"upvote_count":"1","content":"Selected Answer: C\nC is the more complete answer as you need KMS to encrypt the snapshot copy prior to restoring it to the Database instance.","timestamp":"1679603460.0","comment_id":"848641"},{"comment_id":"834577","poster":"TungPham","content":"Selected Answer: C\nA not resolve data create in future. \nYou can enable encryption for an Amazon RDS DB instance when you create it, but not after it's created.\nC will make this, see image below \nArchitecture\nSource architecture\n\nUnencrypted RDS DB instance\n\nTarget architecture \n\nEncrypted RDS DB instance\n\nThe destination RDS DB instance is created by restoring the DB snapshot copy of the source RDS DB instance.\n\nAn AWS KMS key is used for encryption while restoring the snapshot.\n\nAn AWS DMS replication task is used to migrate the data.\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","upvote_count":"1","comments":[{"content":"Option A seems correct.\nWith option (A) we already have DB snapshots. Just encrypt the latest available copy of snapshot, why to copy the snapshot once again (as told in option C).","timestamp":"1679517000.0","comment_id":"847496","upvote_count":"2","poster":"jaswantn"}],"timestamp":"1678416960.0"},{"content":"A\nYou can enable encryption for an Amazon RDS DB instance when you create it, but not after it's created. However, you can add encryption to an unencrypted DB instance by creating a snapshot of your DB instance, and then creating an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot to get an encrypted copy of your original DB instance. If your project allows for downtime (at least for write transactions) during this activity, this is all you need to do. When the new, encrypted copy of the DB instance becomes available, you can point your applications to the new database.","upvote_count":"2","comment_id":"808069","timestamp":"1676348580.0","poster":"jkmaws"},{"upvote_count":"2","comment_id":"798910","timestamp":"1675608900.0","content":"It's A for the following reasons : \n--> To restore an Encrypted DB Instance from an encrypted snapshot we'll need to replace the old one - as we cannot enable encryption on an existing DB Instance\n--> We have both Snap/Db Instance encrypted moving forward since all the daily Backups on an already encrypted DB Instance would be encrypted","poster":"CaoMengde09"},{"upvote_count":"2","poster":"sassy2023","content":"Selected Answer: C\nC is right\nYou can enable encryption for an Amazon RDS DB instance when you create it, but not after it's created. However, you can add encryption to an unencrypted DB instance by creating a snapshot of your DB instance, and then creating an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot to get an encrypted copy of your original DB instance.\n\nTools used to enable encryption:\n\nAWS KMS key for encryption – When you create an encrypted DB instance, you can choose a customer managed key or the AWS managed key for Amazon RDS to encrypt your DB instance. If you don't specify the key identifier for a customer managed key, Amazon RDS uses the AWS managed key for your new DB instance. Amazon RDS creates an AWS managed key for Amazon RDS for your AWS account.\n\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","timestamp":"1674744720.0","comment_id":"788822"},{"upvote_count":"1","timestamp":"1674401460.0","poster":"bullrem","content":"The correct answer is C,\n\nCopy the snapshots and enable encryption using AWS Key Management Service (AWS KMS)\nRestore encrypted snapshot to an existing DB instance.\nThis is the correct approach as it allows you to encrypt the existing snapshots and the existing DB instance using AWS KMS. This way, you can ensure that all data stored in the DB instance and the snapshots are encrypted at rest, providing an additional layer of security.","comments":[],"comment_id":"784440"},{"comment_id":"779152","upvote_count":"1","timestamp":"1673977200.0","poster":"remand","content":"Selected Answer: D\nD. Copy the snapshots to an Amazon S3 bucket that is encrypted using server-side encryption with AWS Key Management Service (AWS KMS) managed keys (SSE-KMS).\n\nThis option ensures that the database snapshots are encrypted at rest by copying them to an S3 bucket that is encrypted using SSE-KMS. This option also provides the flexibility to restore the snapshots to a new RDS DB instance in the future, which will also be encrypted by default."},{"comment_id":"775492","timestamp":"1673705880.0","content":"Selected Answer: A\nIf C means doing encryption while making snapshot, then it is incorrect. It is not able to make an encrypted snapshot from unencrypted RDS. But it will be correct if it means enabling KMS function when restoring DB instance. Bad in wordings.","upvote_count":"2","poster":"goodmail"},{"upvote_count":"2","content":"The correct answer is A. Check this link \" https://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html \"\n\" However, you can add encryption to an unencrypted DB instance by creating a snapshot of your DB instance, and then creating an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot to get an encrypted copy of your original DB instance\".","poster":"imisioluwa","timestamp":"1673650200.0","comment_id":"774907"},{"upvote_count":"3","timestamp":"1673265300.0","comments":[{"poster":"lfrad","timestamp":"1673265960.0","content":"Also C does not make mention of replacing the base DB, which means you would need to copy the snapshot every time a new one is created to encrypt it, and the base DB would remain unencrypted. The solution in A takes the root of the problem by replacing the unencrypted RDS DB with a new encrypted one, thus making every snapshot created in the future automatically encrypted.","upvote_count":"1","comment_id":"770334"}],"content":"Selected Answer: A\nI feel this is a bit tricky in the way the question is asked, but C implies that you are encrypting the snapshot. You are not. It is the DB that receives a KMS key upon restoring, but the snapshot is still unencrypted.","comment_id":"770319","poster":"lfrad"},{"content":"Selected Answer: C\nThe correct answer is Option C. To ensure that the database and snapshots are always encrypted moving forward, the solutions architect should copy the snapshots and enable encryption using AWS Key Management Service (AWS KMS). Then, the encrypted snapshot can be restored to the existing DB instance.\n\nOption A involves creating an encrypted copy of the latest DB snapshot and replacing the existing DB instance by restoring the encrypted snapshot. This option would result in the database being encrypted, but it would not ensure that future snapshots are encrypted.\n\nOption B involves creating a new encrypted Amazon Elastic Block Store (Amazon EBS) volume and copying the snapshots to it. While this option would encrypt the snapshots, it would not encrypt the existing DB instance.\n\nOption D involves copying the snapshots to an Amazon S3 bucket that is encrypted using server-side encryption with AWS KMS-managed keys (SSE-KMS). While this option would encrypt the snapshots, it would not ensure that the existing DB instance is encrypted.","poster":"Buruguduystunstugudunstuy","timestamp":"1672185000.0","comment_id":"759169","upvote_count":"3"},{"timestamp":"1671846120.0","upvote_count":"1","content":"Selected Answer: C\nC is better answer than A as snapshot has to be encrypted using KMS keys.","comment_id":"754644","poster":"career360guru"},{"comment_id":"749128","upvote_count":"1","timestamp":"1671392820.0","comments":[{"content":"C Is more Accurate answer as snapshot has to be encrypted using KMS keys.","comment_id":"754640","upvote_count":"1","timestamp":"1671845400.0","poster":"career360guru"}],"poster":"career360guru","content":"Selected Answer: A\nA is the right answer"},{"timestamp":"1669615620.0","content":"Selected Answer: A\nYou cannot restore to existing DB (hence answer C is wrong). You create new DB for which you choose new unique Identifier.\n\nhttps://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","comment_id":"728822","upvote_count":"2","poster":"ocbn3wby"},{"content":"Selected Answer: A\nCant be C - you cant restore it to an existing DB instance","timestamp":"1669119780.0","poster":"mricee9","comment_id":"724311","upvote_count":"3"},{"content":"C is correct","timestamp":"1669065540.0","upvote_count":"1","poster":"Wpcorgan","comment_id":"723938"},{"upvote_count":"1","poster":"Jtic","comment_id":"717043","content":"Selected Answer: C\nIt seems that D is the correct answer\n\nDatabase and snapshots \"are always encrypted moving forward?\"\nA. is only one time implementation\n\nIn the same document : https://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html\nIt stated the steps moving forward under section \"Encrypt the snapshot.\"\n\nSelect the Enable Encryption checkbox. For Master Key, specify the KMS key identifier to use to encrypt the DB snapshot copy\n\nPrerequisites - Familiarity with AWS Key Management Service (AWS KMS) for encrypting databases\n\nArchitecture:\nThe destination RDS DB instance is created by restoring the DB snapshot copy of the source RDS DB instance.\nAn AWS KMS key is used for encryption while restoring the snapshot.\n\nTools: used to enable encryption\nAWS KMS key for encryption","comments":[{"comment_id":"717047","poster":"Jtic","upvote_count":"1","timestamp":"1668303120.0","content":"sorry typo error: My vote is C"}],"timestamp":"1668302820.0"},{"poster":"tubtab","comments":[{"comment_id":"728821","content":"Please provide arguments to your response.","poster":"ocbn3wby","timestamp":"1669615560.0","upvote_count":"1"}],"comment_id":"714360","timestamp":"1667979180.0","upvote_count":"2","content":"Selected Answer: C\nccccccccc"},{"content":"Selected Answer: C\nRestore to existing not replace instance. This link says copy and encrypt using KMS. https://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","poster":"Bevemo","upvote_count":"3","timestamp":"1667934540.0","comment_id":"714057","comments":[]},{"timestamp":"1667674440.0","upvote_count":"4","content":"Selected Answer: A\nA is the correct option based on this document - https://docs.aws.amazon.com/prescriptive-guidance/latest/patterns/encrypt-an-existing-amazon-rds-for-postgresql-db-instance.html","poster":"backbencher2022","comment_id":"711960"}],"choices":{"A":"Encrypt a copy of the latest DB snapshot. Replace existing DB instance by restoring the encrypted snapshot.","D":"Copy the snapshots to an Amazon S3 bucket that is encrypted using server-side encryption with AWS Key Management Service (AWS KMS) managed keys (SSE-KMS).","C":"Copy the snapshots and enable encryption using AWS Key Management Service (AWS KMS) Restore encrypted snapshot to an existing DB instance.","B":"Create a new encrypted Amazon Elastic Block Store (Amazon EBS) volume and copy the snapshots to it. Enable encryption on the DB instance."},"answer_images":[],"answer":"A","question_images":[]},{"id":"ojz1EJU30g4A9GLm2KEN","choices":{"B":"Use AWS Key Management Service (AWS KMS) to protect the encryption keys.","A":"Use multi-factor authentication (MFA) to protect the encryption keys.","D":"Use an IAM policy to limit the scope of users who have access permissions to protect the encryption keys.","C":"Use AWS Certificate Manager (ACM) to create, store, and assign the encryption keys."},"answer":"B","answer_ET":"B","isMC":true,"url":"https://www.examtopics.com/discussions/amazon/view/85942-exam-aws-certified-solutions-architect-associate-saa-c03/","question_id":47,"exam_id":31,"topic":"1","answer_images":[],"question_images":[],"answer_description":"","answers_community":["B (100%)"],"question_text":"A company wants to build a scalable key management infrastructure to support developers who need to encrypt data in their applications.\nWhat should a solutions architect do to reduce the operational burden?","timestamp":"2022-10-19 21:01:00","unix_timestamp":1666206060,"discussion":[{"timestamp":"1666206060.0","comments":[{"poster":"ocbn3wby","comment_id":"728825","content":"Most documented answers. Thank you, 123jhl0.","timestamp":"1669615740.0","upvote_count":"5"}],"poster":"123jhl0","upvote_count":"24","comment_id":"699283","content":"Selected Answer: B\nIf you are a developer who needs to digitally sign or verify data using asymmetric keys, you should use the service to create and manage the private keys you’ll need. If you’re looking for a scalable key management infrastructure to support your developers and their growing number of applications, you should use it to reduce your licensing costs and operational burden...\nhttps://aws.amazon.com/kms/faqs/#:~:text=If%20you%20are%20a%20developer%20who%20needs%20to%20digitally,a%20broad%20set%20of%20industry%20and%20regional%20compliance%20regimes."},{"timestamp":"1672185120.0","comment_id":"759170","content":"Selected Answer: B\nThe correct answer is Option B. To reduce the operational burden, the solutions architect should use AWS Key Management Service (AWS KMS) to protect the encryption keys.\n\nAWS KMS is a fully managed service that makes it easy to create and manage encryption keys. It allows developers to easily encrypt and decrypt data in their applications, and it automatically handles the underlying key management tasks, such as key generation, key rotation, and key deletion. This can help to reduce the operational burden associated with key management.","poster":"Buruguduystunstugudunstuy","upvote_count":"8"},{"poster":"PaulGa","comment_id":"1285695","content":"Selected Answer: B\nAns B - AWS KMS does it all as a managed service...","timestamp":"1726659480.0","upvote_count":"2"},{"poster":"jaradat02","timestamp":"1721720640.0","upvote_count":"2","comment_id":"1253478","content":"Selected Answer: B\nto reduce the operational burden, option B is the best choice."},{"timestamp":"1714764600.0","upvote_count":"2","poster":"Dani29","content":"Selected Answer: B\nThe correct answer is Option B. To reduce the operational burden, the solutions architect should use AWS Key Management Service (AWS KMS) to protect the encryption keys","comment_id":"1206255"},{"comment_id":"1057317","poster":"Ruffyit","content":"AWS KMS handles the encryption key management, rotation, and auditing. This removes the undifferentiated heavy lifting for developers.\nKMS integrates natively with many AWS services like S3, EBS, RDS for encryption. This makes it easy to encrypt data.\nKMS scales automatically as key usage increases. Developers don't have to worry about provisioning key infrastructure.\nFine-grained access controls are available via IAM policies and grants. KMS is secure by default.\nFeatures like envelope encryption make compliance easier for regulated workloads.\nAWS handles the hardware security modules (HSMs) for cryptographic key storage","upvote_count":"2","timestamp":"1698635880.0"},{"content":"Selected Answer: B\nThe main reasons are:\n\nAWS KMS handles the encryption key management, rotation, and auditing. This removes the undifferentiated heavy lifting for developers.\nKMS integrates natively with many AWS services like S3, EBS, RDS for encryption. This makes it easy to encrypt data.\nKMS scales automatically as key usage increases. Developers don't have to worry about provisioning key infrastructure.\nFine-grained access controls are available via IAM policies and grants. KMS is secure by default.\nFeatures like envelope encryption make compliance easier for regulated workloads.\nAWS handles the hardware security modules (HSMs) for cryptographic key storage","poster":"Guru4Cloud","timestamp":"1692188340.0","comment_id":"982533","upvote_count":"3"},{"content":"Selected Answer: B\nBy utilizing AWS KMS, the company can offload the operational responsibilities of key management, including key generation, rotation, and protection. AWS KMS provides a scalable and secure infrastructure for managing encryption keys, allowing developers to easily integrate encryption into their applications without the need to manage the underlying key infrastructure.\n\nOption A (MFA), option C (ACM), and option D (IAM policy) are not directly related to reducing the operational burden of key management. While these options may provide additional security measures or access controls, they do not specifically address the scalability and management aspects of a key management infrastructure. AWS KMS is designed to simplify the key management process and is the most suitable option for reducing the operational burden in this scenario.","comment_id":"930709","timestamp":"1687445460.0","upvote_count":"3","poster":"cookieMr"},{"timestamp":"1682816400.0","content":"Selected Answer: B\nB is correct.","upvote_count":"1","comment_id":"884803","poster":"cheese929"},{"upvote_count":"1","poster":"career360guru","comment_id":"749132","content":"Selected Answer: B\nOption B","timestamp":"1671393060.0"},{"comment_id":"723941","upvote_count":"1","timestamp":"1669065840.0","content":"B is correct","poster":"Wpcorgan"},{"content":"B is correct","upvote_count":"1","poster":"Wpcorgan","comment_id":"723940","timestamp":"1669065660.0"},{"upvote_count":"2","comment_id":"717481","content":"Selected Answer: B\nIf you are responsible for securing your data across AWS services, you should use it to centrally manage the encryption keys that control access to your data. If you are a developer who needs to encrypt data in your applications, you should use the AWS Encryption SDK with AWS KMS to easily generate, use and protect symmetric encryption keys in your code.","poster":"Jtic","timestamp":"1668368400.0"}]},{"id":"B7EEZbXhaqi49gE45h2g","unix_timestamp":1666206540,"url":"https://www.examtopics.com/discussions/amazon/view/85943-exam-aws-certified-solutions-architect-associate-saa-c03/","choices":{"A":"Create a new SSL certificate using AWS Certificate Manager (ACM). Install the ACM certificate on each instance.","B":"Create an Amazon S3 bucket Migrate the SSL certificate to the S3 bucket. Configure the EC2 instances to reference the bucket for SSL termination.","C":"Create another EC2 instance as a proxy server. Migrate the SSL certificate to the new instance and configure it to direct connections to the existing EC2 instances.","D":"Import the SSL certificate into AWS Certificate Manager (ACM). Create an Application Load Balancer with an HTTPS listener that uses the SSL certificate from ACM."},"question_id":48,"answers_community":["D (96%)","4%"],"answer_ET":"D","question_text":"A company has a dynamic web application hosted on two Amazon EC2 instances. The company has its own SSL certificate, which is on each instance to perform SSL termination.\nThere has been an increase in traffic recently, and the operations team determined that SSL encryption and decryption is causing the compute capacity of the web servers to reach their maximum limit.\nWhat should a solutions architect do to increase the application's performance?","discussion":[{"poster":"123jhl0","content":"Selected Answer: D\nThis issue is solved by SSL offloading, i.e. by moving the SSL termination task to the ALB.\nhttps://aws.amazon.com/blogs/aws/elastic-load-balancer-support-for-ssl-termination/","upvote_count":"23","comment_id":"699292","timestamp":"1666206540.0"},{"comment_id":"759173","upvote_count":"14","timestamp":"1672185240.0","content":"Selected Answer: D\nThe correct answer is D. To increase the application's performance, the solutions architect should import the SSL certificate into AWS Certificate Manager (ACM) and create an Application Load Balancer with an HTTPS listener that uses the SSL certificate from ACM.\n\nAn Application Load Balancer (ALB) can offload the SSL termination process from the EC2 instances, which can help to increase the compute capacity available for the web application. By creating an ALB with an HTTPS listener and using the SSL certificate from ACM, the ALB can handle the SSL termination process, leaving the EC2 instances free to focus on running the web application.","poster":"Buruguduystunstugudunstuy"},{"timestamp":"1736335440.0","comment_id":"1337908","upvote_count":"1","content":"Selected Answer: D\nSince the company has its own SSL certificate so its more suitable to import the company's SSL certificate and using HTTPS.","poster":"satyaammm"},{"upvote_count":"2","content":"Ans D - well explained by Buruguduystunstugudunstuy (1yr, 8mth): \n\"To increase the application's performance, the solutions architect should import the SSL certificate into AWS Certificate Manager (ACM) and create an Application Load Balancer with an HTTPS listener that uses the SSL certificate from ACM.\n\nAn Application Load Balancer (ALB) can offload the SSL termination process from the EC2 instances, which can help to increase the compute capacity available for the web application. By creating an ALB with an HTTPS listener and using the SSL certificate from ACM, the ALB can handle the SSL termination process, leaving the EC2 instances free to focus on running the web application.\"","timestamp":"1726659720.0","poster":"PaulGa","comment_id":"1285697"},{"content":"Selected Answer: D\nD is the correct answer.","comment_id":"1253479","timestamp":"1721720880.0","poster":"jaradat02","upvote_count":"1"},{"content":"This issue is solved by SSL offloading, i.e. by moving the SSL termination task to the ALB.\nhttps://aws.amazon.com/blogs/aws/elastic-load-balancer-support-for-ssl-termination","poster":"Ruffyit","comment_id":"1057319","upvote_count":"4","timestamp":"1698636120.0"},{"comment_id":"982539","upvote_count":"3","content":"Selected Answer: D\nThe key reasons are:\n\nUsing an Application Load Balancer with an HTTPS listener allows SSL termination to happen at the load balancer layer.\nThe EC2 instances behind the load balancer receive only unencrypted traffic, reducing load on them.\nImporting the custom SSL certificate into ACM allows the ALB to use it for HTTPS listeners.\nThis removes the need to install and manage SSL certificates on each EC2 instance.\nALB handles the SSL overhead and scales automatically. The EC2 fleet focuses on app logic.\nOptions A, B, C don't offload SSL overhead from the EC2 instances themselves.","poster":"Guru4Cloud","timestamp":"1692188880.0"},{"content":"Selected Answer: D\nBy using ACM to manage the SSL certificate and configuring an ALB with HTTPS listener, the SSL termination will be handled by the load balancer instead of the web servers. This offloading of SSL processing to the ALB reduces the compute capacity burden on the web servers and improves their performance by allowing them to focus on serving the dynamic web application.\n\nOption A suggests creating a new SSL certificate using ACM, but it does not address the SSL termination offloading and load balancing capabilities provided by an ALB.\n\nOption B suggests migrating the SSL certificate to an S3 bucket, but this approach does not provide the necessary SSL termination and load balancing functionalities.\n\nOption C suggests creating another EC2 instance as a proxy server, but this adds unnecessary complexity and management overhead without leveraging the benefits of ALB's built-in load balancing and SSL termination capabilities.\n\nTherefore, option D is the most suitable choice to increase the application's performance in this scenario.","timestamp":"1687445700.0","poster":"cookieMr","upvote_count":"3","comment_id":"930715"},{"comment_id":"802012","content":"Selected Answer: A\nWhy is A wrong?","poster":"dejung","comments":[{"timestamp":"1683076860.0","poster":"Yadav_Sanjay","content":"Company uses its own SSL certificate. Option A says.. Create a SSL certificate in ACM","comment_id":"888047","upvote_count":"4"},{"content":"ec2 instances still would be responsible for decrypting traffic and it wouldn't solve load issue","upvote_count":"2","poster":"xdkonorek2","comment_id":"1062764","timestamp":"1699179780.0"}],"upvote_count":"2","timestamp":"1675859280.0"},{"comment_id":"779135","content":"Selected Answer: D\nSSL termination is the process of ending an SSL/TLS connection. This is typically done by a device, such as a load balancer or a reverse proxy, that is positioned in front of one or more web servers. The device decrypts incoming SSL/TLS traffic and then forwards the unencrypted request to the web server. This allows the web server to process the request without the overhead of decrypting and encrypting the traffic. The device then re-encrypts the response from the web server and sends it back to the client. This allows the device to offload the SSL/TLS processing from the web servers and also allows for features such as SSL offloading, SSL bridging, and SSL acceleration.","upvote_count":"5","timestamp":"1673976480.0","poster":"remand"},{"upvote_count":"2","timestamp":"1671393180.0","content":"Selected Answer: D\nOption D to offload the SSL encryption workload","poster":"career360guru","comment_id":"749133"},{"upvote_count":"1","content":"Selected Answer: D\nDue to this statement particularly: \"The company has its own SSL certificate\" as it's not created from AWS ACM itself.","poster":"Aamee","comment_id":"738320","timestamp":"1670444580.0"},{"poster":"Wpcorgan","comment_id":"723942","content":"D is correct","timestamp":"1669065900.0","upvote_count":"1"},{"timestamp":"1666800720.0","content":"Selected Answer: D\nagree with D","comment_id":"704852","upvote_count":"1","poster":"Six_Fingered_Jose"}],"timestamp":"2022-10-19 21:09:00","answer":"D","answer_images":[],"answer_description":"","exam_id":31,"question_images":[],"isMC":true,"topic":"1"},{"id":"Fp5QWa4wU5EjJVTFyrPp","answer_description":"","exam_id":31,"discussion":[{"poster":"Kapello10","comment_id":"728811","upvote_count":"25","timestamp":"1669614420.0","content":"Selected Answer: A\nCant be implemented on Lambda because the timeout for Lambda is 15mins and the Job takes 60minutes to complete\n\nAnswer >> A"},{"poster":"Evangelia","timestamp":"1666269420.0","upvote_count":"6","content":"spot instances","comment_id":"699912"},{"content":"Selected Answer: B\nSpot is a bad choice because process takes up to 60 mins and instances can be down at any time","comment_id":"1416097","poster":"Kazmin","upvote_count":"1","timestamp":"1743482160.0"},{"comment_id":"1360035","poster":"Neil_12345678","timestamp":"1740206160.0","upvote_count":"1","content":"Selected Answer: D\nEc2 by themselves are not \"scalable\" unless they are under an autoscaling group.The question also says that the job can be started and stopped with no negative impact.So even if the execution time of 15mins runs out, it can be started again to complete the 60 mins job. Hence my answer is D"},{"comment_id":"1253481","content":"Selected Answer: A\nA is the correct answer, we can't use lambda because it's limit is 15 mins.","poster":"jaradat02","upvote_count":"2","timestamp":"1721721000.0"},{"upvote_count":"4","comment_id":"1134833","timestamp":"1706524680.0","content":"Selected Answer: A\nThere is a chance of interrupting the jobs, but as they can be started and stopped at any given time, the MOST COST effective is going for Spot.","poster":"thewalker"},{"content":"Spot Instances provide significant cost savings for flexible start and stop batch jobs.\nPurchasing Reserved Instances (B) is better for stable workloads, not dynamic ones.\nOn-Demand Instances (C) are costly and lack potential cost savings like Spot Instances.\nAWS Lambda (D) is not suitable for long-running batch jobs.","upvote_count":"3","timestamp":"1698636600.0","poster":"Ruffyit","comment_id":"1057321"},{"poster":"tom_cruise","timestamp":"1697040720.0","content":"Selected Answer: A\nkey: can be started and stopped at any given time with no negative impact","comment_id":"1040871","upvote_count":"4"},{"content":"Selected Answer: A\nSpot can do that","poster":"AbhilashDyadav","timestamp":"1696426200.0","upvote_count":"1","comment_id":"1024816"},{"comment_id":"982541","upvote_count":"4","content":"Selected Answer: A\nThe key reasons are:\n\nSpot can provide significant cost savings (up to 90%) compared to On-Demand.\nSince the job is stateless and can be stopped/restarted anytime, the intermittent availability of Spot is not an issue.\nSpot supports the same instance types as On-Demand, so optimal instance types can be chosen.\nFor a 60+ minute batch job, the chance of Spot interruption is low. But if it happens, the job can just be restarted.\nReserved Instances don't offer any advantage for a highly dynamic job like this.\nLambda is not a good fit given the long runtime requirement.","timestamp":"1692189060.0","poster":"Guru4Cloud"},{"timestamp":"1687502580.0","upvote_count":"1","comment_id":"931286","content":"Selected Answer: A\nSpot Instances provide significant cost savings for flexible start and stop batch jobs.\nPurchasing Reserved Instances (B) is better for stable workloads, not dynamic ones.\nOn-Demand Instances (C) are costly and lack potential cost savings like Spot Instances.\nAWS Lambda (D) is not suitable for long-running batch jobs.","poster":"cookieMr"},{"poster":"beginnercloud","upvote_count":"1","content":"Selected Answer: A\nA is correct","comment_id":"919202","timestamp":"1686307500.0"},{"upvote_count":"1","content":"Answer A:\ntypically takes upwards of 60 minutes total to complete.","comment_id":"855240","timestamp":"1680146640.0","poster":"alexiscloud"},{"content":"Selected Answer: A\nThe correct answer is Option A. To design a scalable and cost-effective solution for the batch processing job, the solutions architect should recommend implementing EC2 Spot Instances.\n\nEC2 Spot Instances allow users to bid on spare Amazon EC2 computing capacity and can be a cost-effective solution for stateless, interruptible workloads that can be started and stopped at any time. Since the batch processing job is stateless, can be started and stopped at any time, and typically takes upwards of 60 minutes to complete, EC2 Spot Instances would be a good fit for this workload.","comment_id":"759175","timestamp":"1672185240.0","upvote_count":"2","poster":"Buruguduystunstugudunstuy"},{"content":"Selected Answer: A\nSpot Instances should be good enough and cost effective because the job can be started and stopped at any given time with no negative impact.","timestamp":"1671950400.0","poster":"k1kavi1","comment_id":"755445","upvote_count":"1"},{"content":"Selected Answer: A\nOption A","upvote_count":"1","poster":"career360guru","comment_id":"749135","timestamp":"1671393300.0"},{"comment_id":"723943","content":"A is correct","upvote_count":"1","poster":"Wpcorgan","timestamp":"1669065960.0"},{"upvote_count":"1","content":"Selected Answer: A\nA is the answer","comment_id":"707611","timestamp":"1667106060.0","poster":"SimonPark"}],"topic":"1","answer":"A","question_text":"A company has a highly dynamic batch processing job that uses many Amazon EC2 instances to complete it. The job is stateless in nature, can be started and stopped at any given time with no negative impact, and typically takes upwards of 60 minutes total to complete. The company has asked a solutions architect to design a scalable and cost-effective solution that meets the requirements of the job.\nWhat should the solutions architect recommend?","url":"https://www.examtopics.com/discussions/amazon/view/86038-exam-aws-certified-solutions-architect-associate-saa-c03/","choices":{"C":"Implement EC2 On-Demand Instances.","A":"Implement EC2 Spot Instances.","D":"Implement the processing on AWS Lambda.","B":"Purchase EC2 Reserved Instances."},"unix_timestamp":1666269420,"timestamp":"2022-10-20 14:37:00","answer_images":[],"question_id":49,"question_images":[],"answer_ET":"A","answers_community":["A (96%)","2%"],"isMC":true},{"id":"mpXN66foHqWzLWgGL6Oq","exam_id":31,"question_id":50,"isMC":true,"answer_ET":"AD","topic":"1","url":"https://www.examtopics.com/discussions/amazon/view/85221-exam-aws-certified-solutions-architect-associate-saa-c03/","answers_community":["AD (62%)","AB (19%)","Other"],"answer_images":[],"answer_description":"","question_text":"A company runs its two-tier ecommerce website on AWS. The web tier consists of a load balancer that sends traffic to Amazon EC2 instances. The database tier uses an Amazon RDS DB instance. The EC2 instances and the RDS DB instance should not be exposed to the public internet. The EC2 instances require internet access to complete payment processing of orders through a third-party web service. The application must be highly available.\nWhich combination of configuration options will meet these requirements? (Choose two.)","timestamp":"2022-10-12 03:45:00","answer":"AD","question_images":[],"choices":{"D":"Configure a VPC with one public subnet, one private subnet, and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the public subnet.\nD. Configure a VPC with two public subnets, two private subnets, and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the public subnets.","B":"Configure a VPC with two private subnets and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the private subnets.","C":"Use an Auto Scaling group to launch the EC2 instances in public subnets across two Availability Zones. Deploy an RDS Multi-AZ DB instance in private subnets.","A":"Use an Auto Scaling group to launch the EC2 instances in private subnets. Deploy an RDS Multi-AZ DB instance in private subnets."},"unix_timestamp":1665539100,"discussion":[{"comments":[{"comments":[{"content":"It looks like there could be a typo error in the list of option. HayLLiHuK is referring to Option 'E' which is missing.","upvote_count":"1","timestamp":"1731768240.0","poster":"JA2018","comment_id":"1313089"},{"content":"Because NAT gateways are availability zone specific, if you need HA you will need a NAT gateway in each availability zone.","upvote_count":"1","timestamp":"1709802000.0","comment_id":"1167811","poster":"cheroh_tots"},{"timestamp":"1701962220.0","content":"cus application has to be HA, if one NAT gateway fails the other could take the traffic","comment_id":"1090401","poster":"ale_brd_111","upvote_count":"4"}],"comment_id":"874946","poster":"darn","upvote_count":"3","timestamp":"1681923900.0","content":"your link is right but your voting is wrong, should be AD, although that still doesnt explain why 2 NAT gateways"}],"poster":"HayLLlHuK","upvote_count":"30","content":"A and E!\nApplication has to be highly available while the instance and database should not be exposed to the public internet, but the instances still requires access to the internet. NAT gateway has to be deployed in public subnets in this case while instances and database remain in private subnets in the VPC, therefore answer is (A) and (E).\nhttps://docs.aws.amazon.com/vpc/latest/userguide/vpc-nat-gateway.html\n\nIf the instances did not require access to the internet, then the answer could have been\n(B) to use a private NAT gateway and keep it in the private subnets to communicate only to the VPCs.\n\nhttps://docs.aws.amazon.com/vpc/latest/userguide/VPC_Scenario2.html","comment_id":"763916","timestamp":"1672685040.0"},{"content":"Selected Answer: AD\nAnswer A for: The EC2 instances and the RDS DB instance should not be exposed to the public internet. Answer D for: The EC2 instances require internet access to complete payment processing of orders through a third-party web service. Answer A for: The application must be highly available.","upvote_count":"28","comments":[{"comment_id":"968366","poster":"oguzbeliren","comments":[{"upvote_count":"3","content":"B is wrong because you can't deploy NAT GW in a private subnet. Correct answer is E (mislabelled as a second D). Stem says that the EC2 instances (!) must not be exposed to the Internet, the Load Balancer can be exposed.","poster":"pentium75","timestamp":"1703572800.0","comment_id":"1105770"}],"content":"D allows public internet access which is not desired. The answer is not d. \nThe most accurate answers are AB","timestamp":"1690824900.0","upvote_count":"2"},{"comments":[{"content":"Why do we require 2?","timestamp":"1735215900.0","comment_id":"1331906","poster":"OluwaZettai","upvote_count":"1"},{"content":"There's two D options ;) second is correct","comment_id":"1105773","timestamp":"1703572860.0","poster":"pentium75","upvote_count":"4"}],"poster":"AbhiJo","upvote_count":"4","content":"We will require 2 private subnets, D does mention 1 subnet","comment_id":"721948","timestamp":"1668855300.0"},{"timestamp":"1683021540.0","poster":"smd_","comments":[{"timestamp":"1684672680.0","comment_id":"903215","upvote_count":"8","content":"B option wrong! NAT gateways must be created in public subnets!!","poster":"ruqui","comments":[{"comments":[{"poster":"RNess","timestamp":"1697630820.0","comment_id":"1046889","upvote_count":"4","content":"NAT Gateway can’t be used by EC2 instance in the same subnet (only from other\nsubnets)"}],"poster":"x33","content":"I think you are wrong on this. In fact, NAT gateways are typically created in private subnets.","comment_id":"998625","timestamp":"1693839480.0","upvote_count":"3"}]}],"upvote_count":"2","content":"why not option B.The EC2 instances can be launched in private subnets across two Availability Zones, and the Application Load Balancer can be deployed in the private subnets. NAT gateways can be configured in each private subnet to provide internet access for the EC2 instances to communicate with the third-party web service.","comment_id":"887202"}],"timestamp":"1668258000.0","poster":"mabotega","comment_id":"716691"},{"timestamp":"1743854400.0","poster":"CloudExpert01","comment_id":"1533270","upvote_count":"1","content":"Selected Answer: AD\nIf D is chosen: An additional private subnet in the second Availability Zone is needed for high availability."},{"timestamp":"1738195200.0","content":"Selected Answer: AD\nTheright one is A and D. The last option (with numbering incorrectly shown as the second \"D\") is not correct, since a load balancer is not per AZ, rather for the entire VPC.","poster":"Dharmarajan","comment_id":"1348826","upvote_count":"1"},{"timestamp":"1729789020.0","poster":"mzeynalli","comment_id":"1302541","content":"Selected Answer: AD\nAE\nThe goal is to create a highly available architecture with EC2 instances and RDS instances that are not exposed to the public internet, while still allowing the EC2 instances to access external services.","upvote_count":"1"},{"timestamp":"1726661400.0","content":"Selected Answer: AD\nAnd A,D - keeps EC2 and RDS private and highly available, but with public front-end\n\n(Not sure why Author's highlighted answer is C?)","comment_id":"1285710","upvote_count":"1","poster":"PaulGa"},{"poster":"Shailesh1717","upvote_count":"1","content":"AD are correct ans","timestamp":"1726501680.0","comment_id":"1284826"},{"upvote_count":"1","poster":"scaredSquirrel","content":"AE\nA because the EC2 can't be exposed to public\nE because each subnet must reside entirely within one Availability Zone and cannot span zones. \n\nsource: https://docs.aws.amazon.com/vpc/latest/userguide/configure-subnets.html#:~:text=Delete%20a%20subnet-,Subnet%20basics,of%20a%20single%20Availability%20Zone.","comment_id":"1261575","timestamp":"1722935580.0"},{"comment_id":"1253495","poster":"jaradat02","content":"A and D is the best combination, it achieves all of the desired requirements.","timestamp":"1721721720.0","upvote_count":"1"},{"comment_id":"1224219","upvote_count":"3","timestamp":"1717521480.0","content":"Selected Answer: AD\nOption A ensures that EC2 instances and RDS DB instance are not exposed to the public internet, as they are launched in private subnets. Auto Scaling group will also ensure high availability of EC2 instances.\nOption D configures a VPC with a public subnet for the load balancer, and a private subnet for the EC2 instances and RDS DB instance. NAT gateways in both Availability Zones will allow EC2 instances to access the internet for payment processing, while keeping them private.","poster":"shil_31"},{"timestamp":"1716838620.0","content":"A and E (the second D option) .","poster":"lofzee","upvote_count":"1","comment_id":"1219814"},{"comment_id":"1216777","poster":"Yash2804","timestamp":"1716484080.0","content":"There might be error in question. i modified it now CE answer seems to be correct \n\nA company runs its two-tier ecommerce website on AWS. The web tier consists of a load balancer that sends traffic to Amazon EC2 instances. The database tier uses an Amazon RDS DB instance. The RDS DB instance should not be exposed to the public internet. The The RDS DB instance require internet access to complete payment processing of orders through a third-party web service. The application must be highly available.\n\nWhich combination of configuration options will meet these requirements? (Choose two.)","upvote_count":"1"},{"poster":"Solomon2001","upvote_count":"2","content":"Selected Answer: AB\nUse an Auto Scaling group to launch the EC2 instances in private subnets. Deploy an RDS Multi-AZ DB instance in private subnets.\nThis ensures that the EC2 instances and the RDS DB instance are not exposed to the public internet.\nConfigure a VPC with two private subnets and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the private subnets.\nThis allows the EC2 instances in private subnets to access the internet for payment processing through the NAT gateways while keeping them private.","timestamp":"1715050440.0","comment_id":"1207692"},{"upvote_count":"1","poster":"EMPERBACH","comment_id":"1197964","content":"App layer & DB Layer does not expose to Internet -> both in private subnet, access through NAT Gateway\nIt's enough for all requirements!","timestamp":"1713448380.0"},{"timestamp":"1703046780.0","poster":"SaurabhTiwari1","upvote_count":"1","comment_id":"1101215","content":"Selected Answer: AD\nAD is right , last one D"},{"content":"Selected Answer: AD\nAE\nTwo public subnets = two addresses for ALB = high availability\ntwo private subnets with NAT gateway to allow eggress traffic to internet - application tier will be able to complete payment","poster":"rlamberti","comment_id":"1048989","upvote_count":"5","timestamp":"1697824080.0"},{"upvote_count":"4","poster":"RNess","timestamp":"1697631000.0","comment_id":"1046891","content":"Selected Answer: AD\nAE\nhttps://docs.aws.amazon.com/vpc/latest/userguide/vpc-nat-gateway.html"},{"upvote_count":"2","content":"Selected Answer: AD\nAE. There are two Ds, the last option should be E.","poster":"tom_cruise","comment_id":"1040884","timestamp":"1697041320.0"},{"comment_id":"977137","upvote_count":"1","content":"Selected Answer: AB\nAB. should not be exposed to the public internet => private subnet","timestamp":"1691629260.0","comments":[{"timestamp":"1703572920.0","content":"EC2 instances should not be exposed to the public Internet, LB should","comment_id":"1105774","poster":"pentium75","upvote_count":"1"}],"poster":"tungnguyenduy"},{"comment_id":"954230","upvote_count":"1","timestamp":"1689597720.0","content":"Selected Answer: C\nCE\nHighly Available and Secure","comments":[{"poster":"bahaa_shaker","upvote_count":"1","timestamp":"1693056900.0","comment_id":"990805","content":"read the question again, it aks to make the ec2 and rds in privete subnet\ndo not mislead others if u are not sure of ur answer\nC is wrong answer bt 1000000%\nits A and D"}],"poster":"ayrus1992"},{"timestamp":"1687779480.0","comment_id":"934348","upvote_count":"1","poster":"omerap12","content":"Selected Answer: AD\nAnswer A for: The EC2 instances and the RDS DB instance should not be exposed to the public internet. Answer D for: The EC2 instances require internet access to complete payment processing of orders through a third-party web service. Answer A for: The application must be highly available."},{"comment_id":"931297","timestamp":"1687503960.0","content":"Selected Answer: AD\nOption D configures a VPC with a public subnet for the web tier, allowing customers to access the website. The private subnet provides a secure environment for the EC2 instances and the RDS DB instance. NAT gateways are used to provide internet access to the EC2 instances in the private subnet for payment processing.\n\nOption A uses an Auto Scaling group to launch the EC2 instances in private subnets, ensuring they are not directly accessible from the public internet. The RDS Multi-AZ DB instance is also placed in private subnets, maintaining security.","upvote_count":"1","poster":"cookieMr"},{"upvote_count":"2","content":"Selected Answer: AD\nSecond D so like E.","comment_id":"923840","timestamp":"1686815640.0","poster":"beginnercloud"},{"content":"Selected Answer: CD\nI had it as AD, but for me the question asked for high availability, and A doesn't specify across availability zones. So, A is more secure but not highly available. C is less secure but highly available","poster":"fishy_resolver","upvote_count":"1","comment_id":"917797","timestamp":"1686199500.0"},{"content":"Selected Answer: AD\nAD because 2 NAT gateways in 2 public subnets in 2 AZs.","comment_id":"911789","poster":"antropaws","upvote_count":"2","timestamp":"1685600280.0"},{"timestamp":"1684567680.0","poster":"bgsanata","upvote_count":"1","comment_id":"902407","content":"Selected Answer: CD\nC - provide required HA\nE - Best answer to the access requirements. The NAT gateway is required for the EC2 instances to access the third-party web service. This do not expose them for inbound connections from Internet."},{"upvote_count":"2","poster":"studynoplay","comment_id":"893406","content":"Selected Answer: AD\nA & the 2nd D. You have to put each NAT gateway in each public subnet","timestamp":"1683662520.0"},{"content":"Selected Answer: AD\nA and the second D are the correct choices. ALB in the public subnet for access from the internet. NAT gateways and the EC2s in the private subnet over 2 AZs to meet the requirements. \nA. Use an Auto Scaling group to launch the EC2 instances in private subnets. Deploy an RDS Multi-AZ DB instance in private subnets.\nD. Configure a VPC with two public subnets, two private subnets, and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the public subnets.","timestamp":"1682818860.0","poster":"cheese929","comment_id":"884816","upvote_count":"1"},{"poster":"kruasan","upvote_count":"2","content":"Selected Answer: AD\nAE\nOption B is not a valid solution as it only includes private subnets, and both the NAT gateway and Application Load Balancer require public subnets.","timestamp":"1682450100.0","comment_id":"880796"},{"comment_id":"880792","content":"Selected Answer: AB\nIn option B, an Application Load Balancer (ALB) is deployed in the private subnets, and two NAT gateways are configured across two Availability Zones to provide internet access to the instances in the private subnets. This allows the web tier to be accessed publicly through the ALB while still keeping the instances in private subnets. The NAT gateways act as a proxy between the instances and the internet, allowing only necessary traffic to pass through while blocking all other inbound traffic. This configuration provides additional security to the application by keeping the instances in private subnets and minimizing the exposure of the infrastructure to the public internet","upvote_count":"2","timestamp":"1682449740.0","poster":"kruasan"},{"comments":[{"content":"my bad, only RDS are private","timestamp":"1681923780.0","upvote_count":"1","poster":"darn","comment_id":"874941"}],"poster":"darn","upvote_count":"2","content":"Selected Answer: AB\nprivate subnets, meaning C D E are not","timestamp":"1681923720.0","comment_id":"874939"},{"timestamp":"1681467960.0","upvote_count":"2","poster":"Manjunathkb","content":"None of the answers provided ensures internet connectivity. NAT gateway alone doesnt provide internet access, it needs internet gateway. Also, once you have NAT and IGW, you need to edit route tables and then you get internet access","comment_id":"870120"},{"upvote_count":"2","content":"Answer AE:","timestamp":"1680147000.0","comment_id":"855241","poster":"alexiscloud"},{"timestamp":"1679287680.0","upvote_count":"1","comment_id":"844542","poster":"SuketuKohli","content":"https://docs.aws.amazon.com/prescriptive-guidance/latest/load-balancer-stickiness/subnets-routing.html ALB should be in Public Subnet"},{"poster":"Sdraju","comment_id":"829427","timestamp":"1677965640.0","upvote_count":"1","content":"A&D\nALb associated with public subnets and the route table configured for local traffic flow. \nNAT gateways allow for internet connectivity for EC2 instances"},{"comments":[{"comment_id":"836826","poster":"VeseljkoD","timestamp":"1678611780.0","content":"How to implement NAT GW if you don't have public subnet?","upvote_count":"3"}],"timestamp":"1677627360.0","content":"Selected Answer: AB\nNo public subnet is needed I think.","comment_id":"825389","poster":"KZM","upvote_count":"2"},{"comment_id":"815917","upvote_count":"1","poster":"SmartDude","content":"Selected Answer: AD\nA&D(First D) as EC2 is in AutoScaling group.","timestamp":"1676929560.0"},{"upvote_count":"3","timestamp":"1676909460.0","comment_id":"815505","poster":"Alhaz","content":"Selected Answer: AB\nA NAT gateway is a Network Address Translation (NAT) service. You can use a NAT gateway so that instances in a private subnet can connect to services outside your VPC but external services cannot initiate a connection with those instances. \nWe dont need to use any public subnet hence D and E is out","comments":[{"comment_id":"833127","timestamp":"1678290240.0","upvote_count":"4","poster":"Ndekeh1","content":"if you don't use public subnet,where will you place ur LB and NAT gateway"}]},{"comment_id":"795819","poster":"wchoi189","content":"If the ec2 instances should not be exposed to the internet how can they be able to connect to the internet to process the payments? I don't think the question makes much sense to me. I think the question intended to say that the RDS should not be exposed to the internet. If so, CE would be correct. Otherwise, AE.","comments":[{"timestamp":"1677459540.0","comment_id":"823089","poster":"MYN","upvote_count":"2","content":"Exposing to internet means, a connection originated from internet can target your EC2 instance.\nWhile have internet access to payment gateways, you can use NAT gateway and only traffic from internet will be allowed for which a session was originated from your EC2 instance. Hope it helps."}],"timestamp":"1675319100.0","upvote_count":"2"},{"timestamp":"1673977080.0","upvote_count":"2","poster":"remand","content":"Selected Answer: AB\nA. Use an Auto Scaling group to launch the EC2 instances in private subnets. Deploy an RDS Multi-AZ DB instance in private subnets.\nB. Configure a VPC with two private subnets and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the private subnets.\n\nOption A meets the requirement of keeping the EC2 instances and the RDS DB instance private by launching them in private subnets. Option B meets the requirement of providing internet access to the EC2 instances for payment processing by configuring NAT gateways in the VPC, and also meets the requirement of high availability by deploying the Application Load Balancer across multiple availability zones.","comment_id":"779147"},{"poster":"Ello2023","content":"Selected Answer: AD\nA and E.","comment_id":"777646","upvote_count":"3","timestamp":"1673873100.0"},{"content":"A and B. Privates subnets\n\nhttps://docs.aws.amazon.com/pt_br/vpc/latest/userguide/vpc-nat-gateway.html","comment_id":"775945","upvote_count":"1","timestamp":"1673731560.0","poster":"marcioicebr"},{"upvote_count":"1","content":"Selected Answer: AD\nD here is the last D. There is mistake on the letter with two D.\nThe following link can help getting an idea.\nhttps://medium.com/awesome-cloud/aws-vpc-difference-between-internet-gateway-and-nat-gateway-c9177e710af6","comment_id":"764486","poster":"aba2s","timestamp":"1672743720.0"},{"content":"AE = correct answer \nES2 Instances, RDS DB instances must not be exposed to the internet. So it's to be deployed in private subnet. Public subnet is needed so the resources in the private subnet can access the internet by using NAT gateway. \nShould be highly available - Auto Scaling group and RDS Multi-AZ DB instance across Availability Zones\nReason for 2 public and 2 private subnets and 2 NAT gateways is that the subnets don't span across availability zones.","comment_id":"763285","timestamp":"1672594980.0","poster":"Mindvision","upvote_count":"3"},{"timestamp":"1672498800.0","upvote_count":"1","comments":[{"content":"What is the reason to not expose the ALB to public? I have seen architectures, where ALBs or NLs are part of public subnets, :)","comment_id":"767792","upvote_count":"1","timestamp":"1673015280.0","poster":"Mahadeva"},{"comment_id":"762687","poster":"Zerotn3","content":"Option C is incorrect because it places the EC2 instances in public subnets, which exposes them to the public internet.\nOption D is incorrect because it has only one NAT gateway, which does not meet the requirement for high availability.\nOption E is incorrect because it has both public and private subnets, but the EC2 instances and the RDS DB instance should be placed in private subnets to prevent them from being exposed to the public internet.","timestamp":"1672498800.0","upvote_count":"1"},{"upvote_count":"2","comment_id":"775518","timestamp":"1673706900.0","poster":"goodmail","content":"NAT gateway should be in public subnet, so B is incorrect. The answers of this question are very unclear by not clearly mentioning how NAT GW is configured."}],"poster":"Zerotn3","comment_id":"762686","content":"Selected Answer: AB\nThe EC2 instances and the RDS DB instance should not be exposed to the public internet, so they should be placed in private subnets.\nTo ensure high availability, the EC2 instances should be launched in an Auto Scaling group, and the RDS DB instance should be deployed as a Multi-AZ (multi-availability zone) instance.\nTo allow the EC2 instances to access the internet for payment processing, the VPC should have NAT gateways in multiple availability zones.\nThe Application Load Balancer should be deployed in the private subnets to ensure that it is not exposed to the public internet."},{"upvote_count":"1","content":"E option is not available here","poster":"jayshinde","comment_id":"761717","timestamp":"1672381140.0"},{"content":"Selected Answer: AB\nThe correct answers are Option A and Option B. To meet the requirements of the eCommerce website, the solutions architect should use an Auto Scaling group to launch the EC2 instances in private subnets and deploy an RDS Multi-AZ DB instance in private subnets. Additionally, the VPC should be configured with two private subnets and two NAT gateways across two Availability Zones, and an Application Load Balancer should be deployed in the private subnets.","timestamp":"1672205940.0","poster":"Buruguduystunstugudunstuy","comments":[{"content":"Options A & B meet the requirements because it ensures that the EC2 instances and the RDS DB instance are not exposed to the public internet and are highly available.\n\nThe Auto Scaling group in Option A provides scalability, and the use of private subnets and a Multi-AZ RDS DB instance ensures high availability. The use of two NAT gateways in Option B across two Availability Zones provides high availability, and the Application Load Balancer in the private subnets ensures that traffic to the web tier is not exposed to the public internet.","poster":"Buruguduystunstugudunstuy","comment_id":"759403","upvote_count":"2","timestamp":"1672206240.0"},{"timestamp":"1672884660.0","content":"A NAT Gateway must be in a public subnet because only devices on public subnets can actually use a public IP address. https://serverfault.com/questions/854475/aws-nat-gateway-in-public-subnet-why","upvote_count":"5","comment_id":"766199","poster":"kmliuy73"}],"comment_id":"759395","upvote_count":"2"},{"upvote_count":"2","timestamp":"1672156980.0","comment_id":"758757","content":"Answer should be A and E","poster":"Chirantan"},{"content":"Selected Answer: AD\nA&D, EC2 and RDS DB cannot be exposed to the internet, but EC2 requires internet connectivity to upload payment processing.","poster":"anonymouscloudguy","upvote_count":"2","timestamp":"1672108860.0","comment_id":"758091"},{"upvote_count":"2","timestamp":"1672075140.0","poster":"techhb","comment_id":"757678","content":"a & e ,not C as EC2 must be in private gate way,Not D as NAT must be in public gateway to connecto t third party service.\nFix option please"},{"poster":"career360guru","content":"Selected Answer: AD\nA and D option.","comment_id":"754666","timestamp":"1671850140.0","upvote_count":"1"},{"poster":"duriselvan","timestamp":"1671796800.0","comment_id":"754173","content":"C and D correct ans","upvote_count":"1"},{"timestamp":"1671786900.0","content":"Selected Answer: AD\nI'll take A and part of D. The options are poorly presented.\n\n*****I'll take A and part of D. The options are poorly presented.\n\npoor approach to the answers.****","upvote_count":"1","comment_id":"754080","poster":"DavidNamy"},{"comment_id":"750802","timestamp":"1671536760.0","poster":"Manoj26","content":"Answer is AE","upvote_count":"2"},{"poster":"career360guru","content":"Selected Answer: A\nA and E. \nPlease correct the typo in options as the last option E is not shown.","timestamp":"1671394080.0","comment_id":"749141","upvote_count":"3"},{"timestamp":"1670810280.0","content":"Selected Answer: A\nA & E are the answers","comment_id":"742314","poster":"tz1","upvote_count":"2"},{"poster":"Wpcorgan","comment_id":"723945","timestamp":"1669066200.0","upvote_count":"4","content":"A and E"},{"poster":"AbhiJo","content":"Selected Answer: A\nAE, E is not shown in voting, \n\nE is correct, 2 subnets","comment_id":"721946","upvote_count":"4","timestamp":"1668855180.0"},{"poster":"pspinelli19","timestamp":"1668680340.0","comments":[{"timestamp":"1672324860.0","comment_id":"761131","content":"ok except 'AE' in the link you shared for SAA-C02 is actually 'AD' here (i.e. 2 private subnets, 2 public subnets is correct)","poster":"FNJ1111","upvote_count":"1","comments":[{"upvote_count":"1","comment_id":"761132","poster":"FNJ1111","timestamp":"1672324980.0","content":"my bad - ignore my comment"}]}],"upvote_count":"5","content":"AE --> https://www.examtopics.com/discussions/amazon/view/60023-exam-aws-certified-solutions-architect-associate-saa-c02/","comment_id":"720389"},{"comment_id":"719496","upvote_count":"3","timestamp":"1668589200.0","poster":"Newptone","content":"AE \nThis link should be clear: https://aws.amazon.com/premiumsupport/knowledge-center/public-load-balancer-private-ec2/"},{"comment_id":"717973","poster":"mabotega","upvote_count":"2","timestamp":"1668432780.0","content":"Selected Answer: AB\nsorry guys, reading better, all instances should be in private subnets, so, answers should be A and B.","comments":[{"timestamp":"1671623940.0","content":"All EC2 instances are in the private subnet using E, & the ALB is in the public subnet. If you pout the ALB in a private subnet nobody on the internet will be able to access it","upvote_count":"1","poster":"JayBee65","comment_id":"752248"}]},{"comment_id":"716438","poster":"Pamban","content":"Selected Answer: A\nmoderator, please correct the answers. there should be 2 answers and options are A B C D E. correct answer would be A &E. letter D has been duplicated\n\nhttps://docs.aws.amazon.com/vpc/latest/userguide/vpc-nat-gateway.html","upvote_count":"4","timestamp":"1668220020.0"},{"poster":"mabotega","upvote_count":"1","timestamp":"1668097140.0","content":"Selected Answer: AB\nA and B are the correct choices \nhttps://www.examtopics.com/discussions/amazon/view/60023-exam-aws-certified-solutions-architect-associate-saa-c02/","comment_id":"715378"},{"comment_id":"713981","poster":"PS_R","content":"Selected Answer: A\nA E (Last option) looks to be more efficient","upvote_count":"1","timestamp":"1667925600.0"},{"upvote_count":"1","content":"\"E\" for request of network segmentation.\n\"A\" for highly available\nThe two options together offer the indicated requirements","timestamp":"1667887740.0","comment_id":"713519","poster":"Nigma"},{"content":"First of all, due to typo error in the options, last option typed as D is actually E. For the sake of simplicity, we can say First (A) and Last option (E mistyped as D) are the correct options. Here is the explanation and reference to AWS document which helps us choose First (A) and Last (E) options as correct answer\nhttps://aws.amazon.com/premiumsupport/knowledge-center/public-load-balancer-private-ec2/#","timestamp":"1667676660.0","comment_id":"711976","upvote_count":"4","poster":"backbencher2022"},{"upvote_count":"2","timestamp":"1667438760.0","content":"where option E ????","comment_id":"710168","poster":"TaiTran1994"},{"poster":"Six_Fingered_Jose","timestamp":"1666801080.0","comment_id":"704857","upvote_count":"2","content":"Selected Answer: A\nA and E is the answer"},{"timestamp":"1666717920.0","upvote_count":"1","poster":"ManoAni","content":"Selected Answer: A\nA & E is the answer","comment_id":"704049"},{"comment_id":"703412","timestamp":"1666653600.0","poster":"dave9994","upvote_count":"1","content":"A & E should be the answer."},{"comment_id":"700286","content":"A - since EC2 instances should not be exposed to the Internet\n+E","timestamp":"1666298100.0","poster":"palermo777","upvote_count":"1"},{"poster":"LukM","comment_id":"698871","upvote_count":"5","content":"E there is not. It would be:\nE. Configure a VPC with two public subnets, two private subnets, and two NAT gateways across two Availability Zones. Deploy an Application Load Balancer in the public subnets.","timestamp":"1666171560.0"},{"timestamp":"1665810000.0","upvote_count":"1","content":"Selected Answer: A\nAnswer is A & E","comment_id":"695199","poster":"windy700"},{"timestamp":"1665710460.0","upvote_count":"3","poster":"Lilibell","content":"the answer is A&E","comment_id":"694423"},{"poster":"Stiffler1","upvote_count":"2","content":"where is e?","comments":[{"timestamp":"1671624000.0","poster":"JayBee65","content":"It's the 2nd D","comment_id":"752249","upvote_count":"1"}],"comment_id":"692556","timestamp":"1665539100.0"}]}],"exam":{"isImplemented":true,"provider":"Amazon","id":31,"isMCOnly":true,"lastUpdated":"11 Apr 2025","numberOfQuestions":1019,"isBeta":false,"name":"AWS Certified Solutions Architect - Associate SAA-C03"},"currentPage":10},"__N_SSP":true}