{"pageProps":{"questions":[{"id":"DB4ioSAvLOaNN6zyGzm3","unix_timestamp":1665505020,"question_text":"A company has more than 5 TB of file data on Windows file servers that run on premises. Users and applications interact with the data each day.\nThe company is moving its Windows workloads to AWS. As the company continues this process, the company requires access to AWS and on-premises file storage with minimum latency. The company needs a solution that minimizes operational overhead and requires no significant changes to the existing file access patterns. The company uses an AWS Site-to-Site VPN connection for connectivity to AWS.\nWhat should a solutions architect do to meet these requirements?","question_id":621,"question_images":[],"topic":"1","answer_ET":"D","answer_description":"","timestamp":"2022-10-11 18:17:00","discussion":[{"upvote_count":"26","timestamp":"1665650700.0","content":"Selected Answer: D\nhttps://www.examtopics.com/discussions/amazon/view/83281-exam-aws-certified-solutions-architect-associate-saa-c02/","poster":"sba21","comment_id":"693749","comments":[{"poster":"MutiverseAgent","timestamp":"1688753820.0","upvote_count":"5","comment_id":"945921","content":"Agree answer is D)\n---\nRequirements are:\n- \"Users and applications interact with the data each day\"\n- \"the company requires access to AWS and on-premises file storage with minimum latency\"\n---\nExplanation: Answer A) will work with the same on-prem <> aws latency as in answer D) as both use the VPN Connection. Having said this, by using an Amazon FSx File Gateway on premise as the D) scenario mentioned, all users will have a great benefit on using the cache that the FSx File Gateway has on their daily workloads. And that is part of the requierements: \"users\", \"each day\", \"latency\""}]},{"upvote_count":"19","comment_id":"779380","timestamp":"1673995620.0","content":"D IS WRONG - Its used for caching. you cannot 'Move the on-premises file data to the FSx File Gateway.' which is stated in answer D. It pretty sure AWS employee's are spamming this site with the wrong answers intentionally.","poster":"MrAWS","comments":[{"comment_id":"1217349","poster":"Rabbit117","timestamp":"1716543120.0","upvote_count":"3","content":"I think D is correct. The FSx File gateway will look like any other Windows file share to the on-prem clients so when they write, or \"Copy\" data to the share it will be be cached locally and also written to the FSx service in the cloud. https://docs.aws.amazon.com/filegateway/latest/filefsxw/file-gateway-fsx-concepts.html"},{"comment_id":"1016867","comments":[{"content":"The problem with cache is - It needs to refreshed, which is an overkill for a migration project\nThe cache refresh requires another solution since the users/applications interact with it daily which means it does modify often.","timestamp":"1708773840.0","poster":"dsshahu01","comment_id":"1157841","upvote_count":"2"},{"timestamp":"1701618120.0","upvote_count":"1","comment_id":"1086905","poster":"chagantik90","content":"you don't move data to gateway, its cached when people use those files from Fsx server"}],"content":"What's the problem with it being a cache? They did say \"the company requires access to AWS and on-premises file storage with minimum latency.\"\nNot discarding what you said but what's wrong here?","upvote_count":"4","timestamp":"1695650340.0","poster":"DarthVaper"}]},{"comment_id":"1348177","upvote_count":"1","timestamp":"1738095660.0","poster":"Dharmarajan","content":"Selected Answer: D\nOn reconsidering, A might be incorrect. First part of te answer looks ok, but later it says \"Configure apps to use FSx in AWS\". So that doesnt make sense - what about the on prem data?\nSo perhaps its better to simply move all data to FSx on AWS. I think none of the choices are perfect. So D comes close."},{"timestamp":"1738095480.0","upvote_count":"1","comment_id":"1348173","poster":"Dharmarajan","content":"Selected Answer: A\nD is incorrect choice.The documentation describes the FSx File Gateway as:\n\"FSx for Windows File Server makes all the shares on the server available as shares on your Amazon FSx File Gateway.\" - so it is simply a fronting for the FSx Windows File Server, not an independent storage FSx system.\nSo I would choose A as a more appropriate response."},{"timestamp":"1737732300.0","comment_id":"1346171","upvote_count":"1","poster":"dariar","content":"Selected Answer: A\nYou can't migrate data to FSx File Gateway\n---\nMigrate your files to FSx for Windows File Server. For more information, see Migrating existing file storage to FSx for Windows File Server."},{"content":"Selected Answer: A\nAns A - it can only be A or D. With D introducing unnecessary operations for an eventual AWS migration","upvote_count":"1","poster":"PaulGa","timestamp":"1726059720.0","comment_id":"1282116"},{"upvote_count":"3","poster":"iyiola_daniel","comment_id":"1278212","content":"Selected Answer: A\nThe question says the company is moving it's workload from windows to AWS. Plus D involves operational overhead.","timestamp":"1725447060.0"},{"upvote_count":"4","poster":"MatAlves","timestamp":"1723694340.0","comment_id":"1266183","content":"Selected Answer: D\nBad question.\nA - Doesn't meet the \"low latency\" requirement due to VPN connection.\nD - It's not possible to \"move file data to FSx File Gateway\". Instead, it provides improved latency with local caching.\nB and C - wrong, since the question requires \"no significant changes to the existing file access patterns\"\n\nI'd go with D, but not 100% happy with it."},{"poster":"hieunt.hus","comment_id":"1250162","content":"Selected Answer: A\nA. Deploy and configure Amazon FSx for Windows File Server on AWS. Move the on-premises file data to FSx for Windows File Server. Reconfigure the workloads to use FSx for Windows File Server on AWS.","timestamp":"1721283300.0","upvote_count":"2"},{"upvote_count":"2","timestamp":"1719895980.0","poster":"jatric","content":"Selected Answer: D\nkeyword as company continue to migrate workload from om-prem to cloud","comment_id":"1240528"},{"content":"I would go with option A as question mentions \"solution that minimizes operational overhead\" . Adding FSx File Gateway would add more complexity. They already have Site to Site VPN. This way min change required.","upvote_count":"2","comment_id":"1210915","timestamp":"1715611620.0","poster":"Abhi2024"},{"comment_id":"1202034","upvote_count":"3","comments":[{"comments":[{"timestamp":"1717521300.0","poster":"3680113","comment_id":"1224217","upvote_count":"1","content":"*on-prem*"}],"poster":"3680113","content":"Option D is Correct, D provides low latency options for both of premium and the cloud loads.","comment_id":"1224216","timestamp":"1717521240.0","upvote_count":"2"}],"timestamp":"1714052880.0","content":"Selected Answer: D\nWill go with option D as option A is missing the Fsx File gateway component deployed on-premise which will provide the low latency access.","poster":"ManikRoy"},{"timestamp":"1713306840.0","comment_id":"1196854","upvote_count":"1","content":"Selected Answer: A\nmin. operational overhead.","poster":"stormbreaker7"},{"poster":"Uzbekistan","upvote_count":"1","comment_id":"1186917","comments":[{"content":"Both Amazon FSx file gateway on-prem and Amazon FSx for windows file server goes hand in hand. So there is no way you can use the file gateway on-Prem and not use the Fsx for windows file server. Your conclusion of adding more overhead does not hold. Hence D is the perfect answer.\nConfigure the cloud workloads to use FSx for Windows File Server on AWS. Configure the on-premises workloads to use the FSx File Gateway.","timestamp":"1717521660.0","comment_id":"1224221","upvote_count":"1","poster":"3680113"},{"content":"A VPN or DX connection is required for FSx File gateway. Option D provides low mantiance as FSx for Windows is a managed service and the file gateway will provide the low latency access required by the on-prem services.","timestamp":"1716543540.0","poster":"Rabbit117","comment_id":"1217357","upvote_count":"1"}],"timestamp":"1711906620.0","content":"Selected Answer: A\nOption D suggests deploying both Amazon FSx for Windows File Server on AWS and an Amazon FSx File Gateway on premises. While this option may provide a solution for accessing on-premises file data in AWS, it introduces additional complexity and potential overhead that may not be necessary given the company's existing AWS Site-to-Site VPN connectivity.\n\nHere are some reasons why Option D may not be the most suitable choice:\nComplexity, Cost, Redundancy and Operational Overhead."},{"comment_id":"1179244","upvote_count":"2","poster":"LIORAGE","timestamp":"1711025760.0","content":"Selected Answer: D\nD: FSX File gateway is nessary for communication between on-premise and aws FSX for window"},{"comment_id":"1122672","timestamp":"1705249680.0","content":"Selected Answer: D\nWindows File Servers + Preserve compatibility so BC is wrong due to S3\nA does not provide on-premise access and suggest to move the files which is wrong as company wants to keep on-prem access\nD meets all the requirements.","upvote_count":"3","poster":"awsgeek75"},{"timestamp":"1703936580.0","content":"Selected Answer: A\nTo meet the company's requirements of accessing both AWS and on-premises file storage with minimum latency, while minimizing operational overhead and maintaining existing file access patterns, a solutions architect should choose\n\nOption A: Deploy and configure Amazon FSx for Windows File Server on AWS. This option allows for the deployment of FSx for Windows File Server on AWS, facilitating the migration of on-premises file data to FSx.\n\nBy reconfiguring the workloads to use FSx for Windows File Server on AWS, the company can ensure seamless access to the file data while leveraging the benefits of AWS infrastructure.\n\nThis solution aligns with the company's objective of moving Windows workloads to AWS and utilizes the existing AWS Site-to-Site VPN connection for connectivity.","upvote_count":"1","comment_id":"1109697","poster":"ROBERTXLION"},{"poster":"ignajtpolandstrong","comment_id":"1107741","timestamp":"1703765580.0","content":"Selected Answer: D\nAmazon FSx File Gateway is a service that provides low latency and efficient access to Amazon FSx for Windows File Server shares from on-premises facilities. It helps eliminate on-premises file servers and consolidates all the data into AWS to take advantage of the scale and economics of cloud storage","upvote_count":"1"},{"content":"Selected Answer: D\nA does not include any on-premises component, thus it can't meet the \"access to ... on-premises file storage with minimum latency\" requirement. B and C use S3 which cannot be directly accessed by the Windows servers they are going to move to AWS.","upvote_count":"1","poster":"pentium75","timestamp":"1703494740.0","comment_id":"1105121"},{"comments":[{"timestamp":"1703494620.0","upvote_count":"2","content":"A does not include any on-premises component, how would it meet the \"access to ... on-premises file storage with minimum latency\" requirement?","comment_id":"1105118","poster":"pentium75"}],"upvote_count":"2","content":"Selected Answer: A\nOption A is correct because \n- minimum latency\n-minimum operational overhead\n-requires no significant changes to the existing file access patterns\n\nOption D is incorrect -\n-Amazon FSx File Gateway on premises, which would add additional complexity and potential latency, , as the data would need to be transferred between the on-premises gateway and AWS. These options would also require reconfiguring the workloads to use the gateways, which could involve significant changes to the existing file access patterns.\n-unnecessary complexity and potential latency","timestamp":"1702880400.0","poster":"SaurabhTiwari1","comment_id":"1099449"},{"timestamp":"1701618360.0","upvote_count":"1","poster":"chagantik90","comment_id":"1086908","comments":[],"content":"Selected Answer: A\nMoving data to Gateway doesn't makes sense and splitting cloud workload and onprem workload doesn't make sense in D. So closest is A and i know A doesn't really cover about latency but A looks the best option here"},{"timestamp":"1700544720.0","comment_id":"1076039","upvote_count":"1","content":"Selected Answer: A\nAmazon FSx for Windows File Server provides the feel of a native Windows file server while providing low-latency access on AWS. This allows your local users and applications to seamlessly access file systems in AWS without requiring significant changes to their access.\n\nAlthough D also mentions Amazon FSx for Windows File Server, it also includes Amazon FSx File Gateway, which may introduce additional complexity. So, for the need to minimize latency without making major changes while minimizing operational overhead, A looks to fit those criteria better. The company uses an AWS site-to-site VPN connection and may prefer option A over D due to some added latency that the VPN may cause, as well as possible bandwidth limitations.","poster":"MiniYang","comments":[{"comment_id":"1105120","poster":"pentium75","content":"Yes, FSx provides \"low-latency access on AWS\", but we also need \"access to ... on-premises file storage with minimum latency\". A does not include any on-premises component.","upvote_count":"1","timestamp":"1703494680.0"}]},{"upvote_count":"2","timestamp":"1698585240.0","content":"Selected Answer: D\nKey: minimum latency and on premise:\n\n\"The Amazon FSx File Gateway extends Amazon FSx for Windows File Server to any site with an internet connection. It provides a scalable local cache, up to 64 TB, for low latency access to most recently used files. By deploying an Amazon FSx File Gateway within your data center or remote and branch offices, your Windows clients are able to connect over the LAN. As Amazon FSx File Gateway is a local cache of most recently accessed data backed by an Amazon FSx file system, it looks like a local file server to users and applications.\"\n\nhttps://aws.amazon.com/blogs/storage/accessing-your-file-workloads-from-on-premises-with-file-gateway/","comment_id":"1056833","poster":"tom_cruise"},{"content":"Agree answer is D)\n---\nRequirements are:\n- \"Users and applications interact with the data each day\"\n- \"the company requires access to AWS and on-premises file storage with minimum latency\"\n---\nExplanation: Answer A) will work with the same on-prem <> aws latency as in answer D) as both use the VPN Connection. Having said this, by using an Amazon FSx File Gateway on premise as the D) scenario mentioned, all users will have a great benefit on using the cache that the FSx File Gateway has on their daily workloads. And that is part of the requierements: \"users\", \"each day\", \"latency\"","poster":"Ruffyit","timestamp":"1698406200.0","comment_id":"1055528","upvote_count":"2"},{"poster":"AWSStudyBuddy","comment_id":"1048935","content":"Selected Answer: D\nAmazon FSx for Windows File Server and Amazon FSx File Gateway are two extremely effective file storage options that offer minimal latency access to AWS and on-premises file storage. They offer low-latency access to file data for users and programs, independent of the location of the data.\nreduces overhead: Amazon File Server for Windows and Amazon File Gateway are managed services provided by Amazon. Therefore, the management of the underlying infrastructure is not a concern for the organization.\nNot much has to be changed about the current file access patterns in order to achieve this: Protocols for the Windows file system are used by Amazon FSx for Windows File Server and Amazon FSx File Gateway. Consequently, the workloads of the organization can access the file data in the same manner that they","upvote_count":"1","timestamp":"1697817240.0"},{"poster":"jibsy","comment_id":"1040020","timestamp":"1696986780.0","content":"from ChatGPT\n\nA. Deploy and configure Amazon FSx for Windows File Server on AWS. Move the on-premises file data to FSx for Windows File Server. Reconfigure the workloads to use FSx for Windows File Server on AWS.\n\nThis option is a suitable choice for several reasons:\n\nAmazon FSx for Windows File Server is designed to provide Windows-compatible file storage in AWS.\nIt minimizes operational overhead as Amazon FSx is a managed service.\nNo significant changes to the existing file access patterns are required, as FSx is Windows-compatible and allows for seamless integration with existing workloads.\nUsing an AWS Site-to-Site VPN connection is consistent with the existing connectivity method.","upvote_count":"1"},{"poster":"Abitek007","timestamp":"1696330320.0","comment_id":"1023851","upvote_count":"2","content":"Selected Answer: A\nthey already have a site to site VPN connection"},{"content":"Selected Answer: D\nAnswer is D\nsomewhere, the 6xx question gives the correct answer as D.","poster":"paniya93","timestamp":"1696144800.0","comment_id":"1022075","upvote_count":"2"},{"timestamp":"1694434560.0","comment_id":"1004759","content":"Selected Answer: D\nD is the correct answer","poster":"axelrodb","upvote_count":"1"},{"upvote_count":"3","comment_id":"990606","timestamp":"1693040700.0","poster":"bahaa_shaker","content":"Selected Answer: A\nITs A and the company use site 2 site VPN which means they can connect to fsx."},{"timestamp":"1691670480.0","comment_id":"977645","upvote_count":"1","poster":"Guru4Cloud","content":"Selected Answer: D\nthe requirements are to provide access to both on-premises and AWS file storage with minimum latency, while minimizing operational overhead and avoiding significant changes to existing file access patterns. Additionally, an AWS Site-to-Site VPN connection is in place for connectivity."},{"poster":"miki111","timestamp":"1689782520.0","content":"Option D is the right answer.","comment_id":"956797","upvote_count":"1"},{"poster":"cookieMr","comment_id":"929477","upvote_count":"8","timestamp":"1687350180.0","content":"Selected Answer: D\nAmazon FSx File Gateway (FSx File Gateway) is a new File Gateway type that provides low latency and efficient access to in-cloud FSx for Windows File Server file shares from your on-premises facility. If you maintain on-premises file storage because of latency or bandwidth requirements, you can instead use FSx File Gateway for seamless access to fully managed, highly reliable, and virtually unlimited Windows file shares provided in the AWS Cloud by FSx for Windows File Server.\n\nFSx File Gateway provides the following benefits:\n1. Helps eliminate on-premises file servers and consolidates all their data in AWS to take advantage of the scale and economics of cloud storage.\n2. Provides options that you can use for all your file workloads, including those that require on-premises access to cloud data.\n3. Applications that need to stay on premises can now experience the same low latency and high performance that they have in AWS, without taxing your networks or impacting the latencies experienced by your most demanding applications."},{"timestamp":"1685983740.0","poster":"Bmarodi","upvote_count":"1","content":"Selected Answer: D\nOption D meets these requirements.","comment_id":"915595"},{"timestamp":"1684404420.0","content":"Selected Answer: D\nD is correct\n\nhttps://aws.amazon.com/blogs/storage/accessing-your-file-workloads-from-on-premises-with-file-gateway/","poster":"beginnercloud","upvote_count":"1","comment_id":"901048"},{"comment_id":"886814","poster":"Rahulbit34","upvote_count":"1","timestamp":"1682983020.0","content":"Amazon Fix File Gateway for low latency and efficient access to in-cloud FSx for windows File server."},{"content":"Selected Answer: D\nhttps://aws.amazon.com/blogs/storage/accessing-your-file-workloads-from-on-premises-with-file-gateway/","comment_id":"868952","poster":"Thief","timestamp":"1681346280.0","upvote_count":"1"},{"content":"Selected Answer: A\n1.you cannot move on-prem files to FSX FGW as it has limited storage and is is being used for caching only.\n2.you need to migrate the on-prem file server to aws fsx file server for windows and let on prem users access the file server through sfx FGW.\n3.configure apps to use aws file server for on-prem apps\n4.configure aws apps to access fsx files directly through the app.\n5. A is the correct answer.","upvote_count":"3","poster":"apchandana","timestamp":"1680547080.0","comment_id":"860240"},{"content":"Selected Answer: D\nthe company stated that they wanted to move the data from onprem to AWS with 'low latency' and 'no changes on current file access patterns', so FSx File Gateway is still needed in onprem to cache the data and then to the cloud, plus a secured data/file move. The Site2Site VPN is for users accessing the data from onprem and cloud within premise network. \n\nCheck on the Conclusion section for summary: https://aws.amazon.com/blogs/storage/accessing-your-file-workloads-from-on-premises-with-file-gateway/","poster":"Loti2807","comment_id":"788202","upvote_count":"2","timestamp":"1674688920.0"},{"content":"Selected Answer: D\nThis solution will meet the requirements because it allows the company to continue using a file server with minimal changes to the existing file access patterns. FSx for Windows File Server integrates with the on-premises Active Directory, so users can continue accessing the file data with their existing credentials. The Site-to-Site VPN connection can be used to establish low-latency connectivity between the on-premises file servers and FSx for Windows File Server on AWS. FSx for Windows File Server is also highly available and scalable, so it can handle the workloads' file storage needs.","poster":"SilentMilli","comment_id":"768204","timestamp":"1673058060.0","upvote_count":"1"},{"content":"Selected Answer: D\nFSx is for windows file, other options like S3 certainly can handle files but might bring compatibility issue. and a FSx gateway might have sort of cache mechanism that make the users feel they are accessing local file system.","poster":"gustavtd","timestamp":"1672599060.0","comment_id":"763307","upvote_count":"2"},{"poster":"PassNow1234","upvote_count":"1","timestamp":"1672094640.0","comment_id":"757905","content":"Benefits of using Amazon FSx File Gateway ****WINDOWS FILE SERVERS***\n\nFSx File Gateway provides the following benefits:\n\nHelps eliminate on-premises file servers and consolidates all their data in AWS to take advantage of the scale and economics of cloud storage.\n\nProvides options that you can use for all your file workloads, including those that require on-premises access to cloud data.\n\nApplications that need to stay on premises can now experience the same low latency and high performance that they have in AWS, without taxing your networks or impacting the latencies experienced by your most demanding applications."},{"comment_id":"754464","content":"Selected Answer: C\nI think it is C. To meet these requirements, the solutions architect could recommend using AWS Storage Gateway to provide file-based storage access between the on-premises file servers and AWS.\n\nAWS Storage Gateway is a hybrid storage service that connects on-premises storage environments with AWS storage infrastructure. It provides low-latency file-based storage access to AWS, enabling users and applications to access data in AWS as if it were stored on-premises.","upvote_count":"2","poster":"kurinei021","timestamp":"1671824460.0"},{"comments":[{"timestamp":"1671557760.0","comment_id":"751286","poster":"Buruguduystunstugudunstuy","content":"Option A, deploying and configuring Amazon FSx for Windows File Server on AWS, would not meet the requirement to minimize operational overhead, as it would require significant changes to the existing file access patterns.\n\nOption B, deploying and configuring an Amazon S3 File Gateway on-premises and moving the on-premises file data to the S3 File Gateway, would not meet the requirement to minimize operational overhead, as it would require significant changes to the existing file access patterns.\n\nOption D, deploying and configuring Amazon FSx for Windows File Server on AWS and an Amazon FSx File Gateway on-premises, would not meet the requirement to minimize operational overhead, as it would require significant changes to the existing file access patterns.","upvote_count":"1"}],"timestamp":"1671557760.0","comment_id":"751284","poster":"Buruguduystunstugudunstuy","content":"Selected Answer: C\nThe correct solution is C. Deploy and configures an Amazon S3 File Gateway on-premises. Move the on-premises file data to Amazon S3. Reconfigure the workloads to use either Amazon S3 directly or the S3 File Gateway, depending on each workload's location.\n\nAmazon S3 is a highly durable and scalable object storage service that is well-suited for storing large amounts of file data. By moving the on-premises file data to Amazon S3, you can take advantage of its durability, scalability, and global availability, while still allowing users and applications to access the data using their existing file access patterns.\n\nThe Amazon S3 File Gateway can be deployed on-premises and configured to provide file-based access to data stored in Amazon S3. This allows users and applications to access the data stored in Amazon S3 as if it were stored on a local file server, while still taking advantage of the benefits of storing the data in Amazon S3.","upvote_count":"1"},{"upvote_count":"1","poster":"career360guru","comment_id":"749388","timestamp":"1671417480.0","content":"Selected Answer: D\nOption D"},{"content":"Answer C \nOption C will provide low-latency access to the file data from both on-premises and AWS environments, and it will minimize operational overhead by requiring no significant changes to the existing file access patterns. Additionally, the use of the AWS Site-to-Site VPN connection will ensure secure and seamless connectivity between the on-premises and AWS environments. Option A is not correct because it only addresses the requirement to access file data on AWS, but it does not address the requirement to access file data on premises with minimal latency.Option D is not correct because it involves deploying and configuring two different file storage services (FSx for Windows File Server and FSx File Gateway), which would add complexity and operational overhead. It also does not provide a solution for accessing file data on premises with minimal latency.","comments":[{"poster":"PassNow1234","comment_id":"745973","timestamp":"1671102180.0","upvote_count":"1","content":"\"the company requires access to AWS and on-premises file storage\" C is excluding on premises needs."}],"timestamp":"1670941620.0","poster":"Shasha1","comment_id":"744125","upvote_count":"2"},{"comment_id":"726878","comments":[{"timestamp":"1670700180.0","comment_id":"741193","poster":"wh1t4k3r","content":"I was confused with this one, but I would vote for D. My thoughts:\nYou actually need the gateway... you would not need it in case of VPC peerig. Site to site vpn still requires the gateway to serve as endpoint.\nhttps://bluexp.netapp.com/blog/aws-fsxo-blg-fsx-gateway-amazon-fsx-for-windows-at-on-premises-speed","comments":[{"upvote_count":"1","content":"You do not need the gateway if you have already VPN.\nmazon FSx File Gateway is a way to access your Amazon FSx file system from on-premises servers or client devices over a Network File System (NFS) or Server Message Block (SMB) protocol. If you already have an AWS Site-to-Site VPN connection set up between your on-premises environment and your Amazon VPC, you can use that connection to access your Amazon FSx file system from on-premises without using the Amazon FSx File Gateway.","timestamp":"1672736100.0","poster":"zek","comment_id":"764343"}],"upvote_count":"1"}],"content":"Selected Answer: A\nAnswer A is correct. The company has a site to site VPN already.There is no need to install file gateway on-premise. https://docs.aws.amazon.com/fsx/latest/LustreGuide/mounting-on-premises.html","timestamp":"1669388940.0","upvote_count":"4","poster":"Vesperia"},{"comment_id":"723602","upvote_count":"1","timestamp":"1669040700.0","content":"D is correct","poster":"Wpcorgan"},{"content":"Selected Answer: D\nddddddddd","timestamp":"1668449040.0","comment_id":"718151","poster":"Kapello10","upvote_count":"2"},{"timestamp":"1666926660.0","comment_id":"706069","comments":[{"timestamp":"1668271020.0","content":"and VPN S2S?","comments":[{"upvote_count":"4","comment_id":"726297","content":"True, but the other requirement is no \"significant changes to the existing file access patterns\" which would mean mounting File Gateway shares in their on-premises location while they move their workloads to FSx during their migration. So D.","timestamp":"1669337100.0","poster":"rewdboy"}],"poster":"17Master","comment_id":"716805","upvote_count":"2"}],"poster":"goku58","content":"Selected Answer: D\nWindows File server == FSx. \nSince access from both on-prem and AWS is needed, A isn't sufficient. So D.","upvote_count":"5"},{"timestamp":"1666330500.0","upvote_count":"6","comment_id":"700533","content":"Selected Answer: D\nhttps://docs.aws.amazon.com/filegateway/latest/filefsxw/what-is-file-fsxw.html","poster":"BoboChow","comments":[{"timestamp":"1670941620.0","comment_id":"744126","poster":"FNJ1111","content":"From that shared doc: \"Amazon FSx File Gateway (FSx File Gateway) is a new File Gateway type that provides low latency and efficient access to in-cloud FSx for Windows File Server file shares from your on-premises facility. If you maintain on-premises file storage because of latency or bandwidth requirements, you can instead use FSx File Gateway for seamless access to fully managed, highly reliable, and virtually unlimited Windows file shares provided in the AWS Cloud by FSx for Windows File Server.\"","upvote_count":"8"}]},{"content":"Selected Answer: D\ndddddddddd","comment_id":"693144","upvote_count":"4","poster":"tubtab","timestamp":"1665583080.0"},{"content":"Selected Answer: D\ni think its D","comment_id":"692247","upvote_count":"4","timestamp":"1665505020.0","poster":"oldcardigan"}],"answer":"D","answer_images":[],"choices":{"A":"Deploy and configure Amazon FSx for Windows File Server on AWS. Move the on-premises file data to FSx for Windows File Server. Reconfigure the workloads to use FSx for Windows File Server on AWS.","C":"Deploy and configure an Amazon S3 File Gateway on premises. Move the on-premises file data to Amazon S3. Reconfigure the workloads to use either Amazon S3 directly or the S3 File Gateway. depending on each workload's location.","B":"Deploy and configure an Amazon S3 File Gateway on premises. Move the on-premises file data to the S3 File Gateway. Reconfigure the on-premises workloads and the cloud workloads to use the S3 File Gateway.","D":"Deploy and configure Amazon FSx for Windows File Server on AWS. Deploy and configure an Amazon FSx File Gateway on premises. Move the on-premises file data to the FSx File Gateway. Configure the cloud workloads to use FSx for Windows File Server on AWS. Configure the on-premises workloads to use the FSx File Gateway."},"url":"https://www.examtopics.com/discussions/amazon/view/85173-exam-aws-certified-solutions-architect-associate-saa-c03/","exam_id":31,"isMC":true,"answers_community":["D (75%)","A (23%)","3%"]},{"id":"KW8a1dYKdep4G89XzLhD","discussion":[{"timestamp":"1699583940.0","poster":"NickGordon","comment_id":"1066904","content":"Selected Answer: BE\nBE is right.\n\nThe key policy has to be modified to give lambda execution role access. You can't set another resource policy as principle. So C is not right","upvote_count":"9"},{"poster":"MaxMingxing","comment_id":"1335161","timestamp":"1735728120.0","content":"BE, IAM role act as the agent between lambda function and KMS","upvote_count":"1"},{"comment_id":"1241691","timestamp":"1720045680.0","upvote_count":"2","content":"Selected Answer: BD\nE is wrong, AWS Lambda function can hold only one IAM role. This role is known as the execution role. What we should do is: creating an IAM policy that allows the kms:Decrypt action and attach it to the Lambda function’s execution role.","poster":"1166ae3"},{"upvote_count":"1","content":"B D - The combination of Option B (Grant the decrypt permission for the Lambda IAM role in the KMS key's policy) and Option D (Create a new IAM policy with the kms\npermission and attach the policy to the Lambda function) ensures that both the IAM role used by the Lambda function and the KMS key policy are correctly configured to allow decryption of the files. This setup meets the security requirements and ensures the Lambda function can perform its tasks without issues.","timestamp":"1718241540.0","poster":"cjace","comment_id":"1229578"},{"timestamp":"1715804400.0","poster":"wizcloudifa","comment_id":"1212121","content":"Selected Answer: BE\nwhen it comes to permissions look for the \"IAM ROLE\" word, lambda would need a role to decrypt the s3 object, only roles can be attached to a function not policies","upvote_count":"3"},{"comment_id":"1144019","poster":"1Alpha1","timestamp":"1707362400.0","content":"Selected Answer: BE\nB. Grant the decrypt permission for the Lambda ***IAM ROLE*** in the KMS key's policy\nE. Create a new ***IAM ROLE*** with the kms:decrypt permission and attach the execution role to the Lambda function.","upvote_count":"4"},{"content":"Selected Answer: BE\nAC are resource policy, i.e. who can use lambda.\nhttps://docs.aws.amazon.com/lambda/latest/dg/access-control-resource-based.html\nD: The wording is confusing so it sort of sounds as if it is correct but you cannot attach a policy to a function.","poster":"awsgeek75","comment_id":"1121579","timestamp":"1705146660.0","upvote_count":"2"},{"upvote_count":"4","content":"Selected Answer: BE\nNot A and C because they are about function's \"resource policy\" which controls who can manage the function, NOT what the function can do.\nNot D because you attach an IAM policy to an IAM principal, not to a Lambda function.","comment_id":"1111989","poster":"pentium75","timestamp":"1704207420.0"},{"poster":"TariqKipkemei","timestamp":"1701676860.0","upvote_count":"3","content":"Selected Answer: BE\nCreate a new IAM role with the kms:decrypt permission and attach the execution role to the Lambda function then grant the decrypt permission for the Lambda IAM role in the KMS key's policy","comment_id":"1087410"},{"upvote_count":"1","timestamp":"1699496040.0","comment_id":"1066066","poster":"louisaok","content":"Selected Answer: CE\nCE is right","comments":[{"poster":"pentium75","comment_id":"1111985","upvote_count":"2","content":"No, the \"Lambda resource policy\" is about who can manage the Lambda function","timestamp":"1704207300.0"}]},{"comment_id":"1064835","content":"Selected Answer: DE\nDE?\nCreate an IAM role for the Lambda function that also grants decryption permission to the S3 bucket.\nConfigure the IAM role as the Lambda functions execution role.\n\nTo use an IAM policy to control access to a KMS key, the key policy for the KMS key must give the account permission to use IAM policies.\n\nhttps://repost.aws/knowledge-center/lambda-execution-role-s3-bucket\nhttps://docs.aws.amazon.com/kms/latest/developerguide/iam-policies.html","poster":"potomac","timestamp":"1699364880.0","comments":[{"upvote_count":"2","comment_id":"1064845","timestamp":"1699365360.0","comments":[{"comment_id":"1111987","content":"C is about the \"Lambda resource policy\", who can manage the function.","upvote_count":"2","poster":"pentium75","timestamp":"1704207360.0"}],"poster":"potomac","content":"change to CE\nC. Grant the decrypt permission for the Lambda resource policy in the KMS key's policy.\nE. Create a new IAM role with the kms:decrypt permission and attach the execution role to the Lambda function.\n\nhttps://docs.aws.amazon.com/lambda/latest/dg/access-control-resource-based.html\nhttps://docs.aws.amazon.com/kms/latest/developerguide/key-policies.html"}],"upvote_count":"1"}],"answer":"BE","unix_timestamp":1699364880,"answer_ET":"BE","timestamp":"2023-11-07 14:48:00","answers_community":["BE (86%)","7%"],"question_images":[],"topic":"1","url":"https://www.examtopics.com/discussions/amazon/view/125579-exam-aws-certified-solutions-architect-associate-saa-c03/","choices":{"B":"Grant the decrypt permission for the Lambda IAM role in the KMS key's policy","A":"Attach the kms:decrypt permission to the Lambda function’s resource policy","C":"Grant the decrypt permission for the Lambda resource policy in the KMS key's policy.","D":"Create a new IAM policy with the kms:decrypt permission and attach the policy to the Lambda function.","E":"Create a new IAM role with the kms:decrypt permission and attach the execution role to the Lambda function."},"question_text":"A company has an application workflow that uses an AWS Lambda function to download and decrypt files from Amazon S3. These files are encrypted using AWS Key Management Service (AWS KMS) keys. A solutions architect needs to design a solution that will ensure the required permissions are set correctly.\n\nWhich combination of actions accomplish this? (Choose two.)","answer_description":"","answer_images":[],"question_id":622,"exam_id":31,"isMC":true},{"id":"niiBHYrROnm0Jvsm2rTO","topic":"1","url":"https://www.examtopics.com/discussions/amazon/view/125580-exam-aws-certified-solutions-architect-associate-saa-c03/","answer_ET":"B","question_images":[],"exam_id":31,"question_id":623,"answers_community":["B (100%)"],"timestamp":"2023-11-07 14:58:00","isMC":true,"answer_description":"","discussion":[{"poster":"NickGordon","upvote_count":"6","content":"Selected Answer: B\nB\n\nhttps://aws.amazon.com/blogs/big-data/analyze-amazon-s3-storage-costs-using-aws-cost-and-usage-reports-amazon-s3-inventory-and-amazon-athena/","timestamp":"1731206640.0","comment_id":"1066908"},{"upvote_count":"1","poster":"LeonSauveterre","timestamp":"1734073320.0","comment_id":"1326039","content":"Selected Answer: B\nA - EMR is powerful for large-scale data processing, but is overkill for a monthly query since neither Kinesis nor EMR is cost-effective for infrequent processing.\nB - Cost and Usage Reports are already optimized for S3 delivery, and Athena directly integrates with S3.\nC & D - Delivering reports for each member account creates redundant data. That mean extra time, extra work to do manually, extra money to cost, and extra account to manage."},{"timestamp":"1733299500.0","content":"Selected Answer: B\nScalable and cost-effective way = Enable Cost and Usage Reports in the management account. Deliver the reports to Amazon S3 Use Amazon Athena for analysis","upvote_count":"4","comment_id":"1087412","poster":"TariqKipkemei"},{"upvote_count":"4","poster":"potomac","content":"Selected Answer: B\nB\nonce a month","comment_id":"1064847","timestamp":"1730987880.0"}],"unix_timestamp":1699365480,"answer_images":[],"question_text":"A company wants to monitor its AWS costs for financial review. The cloud operations team is designing an architecture in the AWS Organizations management account to query AWS Cost and Usage Reports for all member accounts. The team must run this query once a month and provide a detailed analysis of the bill.\n\nWhich solution is the MOST scalable and cost-effective way to meet these requirements?","answer":"B","choices":{"D":"Enable Cost and Usage Reports for member accounts. Deliver the reports to Amazon Kinesis. Use Amazon QuickSight tor analysis.","B":"Enable Cost and Usage Reports in the management account. Deliver the reports to Amazon S3 Use Amazon Athena for analysis.","A":"Enable Cost and Usage Reports in the management account. Deliver reports to Amazon Kinesis. Use Amazon EMR for analysis.","C":"Enable Cost and Usage Reports for member accounts. Deliver the reports to Amazon S3 Use Amazon Redshift for analysis."}},{"id":"hfdlPv0RY9MCTRvahYAv","answer":"A","exam_id":31,"timestamp":"2023-11-02 21:05:00","unix_timestamp":1698955500,"url":"https://www.examtopics.com/discussions/amazon/view/125215-exam-aws-certified-solutions-architect-associate-saa-c03/","isMC":true,"choices":{"A":"Attach a Network Load Balancer to the Auto Scaling group.","B":"Attach an Application Load Balancer to the Auto Scaling group.","D":"Deploy a NAT instance that is configured with port forwarding to the EC2 instances in the Auto Scaling group.","C":"Deploy an Amazon Route 53 record set with a weighted policy to route traffic appropriately."},"discussion":[{"upvote_count":"11","timestamp":"1698955500.0","comment_id":"1060853","poster":"Sugarbear_01","content":"Selected Answer: A\nhttps://docs.aws.amazon.com/autoscaling/ec2/userguide/autoscaling-load-balancer.html"},{"content":"Selected Answer: A\nUDP packets can scale out and in","upvote_count":"2","timestamp":"1718587560.0","poster":"KennethNg923","comment_id":"1231614"},{"poster":"awsgeek75","timestamp":"1705147920.0","upvote_count":"4","comment_id":"1121590","content":"Selected Answer: A\nUDP can only be monitored by NLB.\nALB is for application layer (HTTP etc)\nR53 is DNS\nNAT is for port forwarding/address translation etc which is not going to help with scaling\n\nA is correct"},{"content":"Selected Answer: A\nUDP packets = Network Load Balancer","comment_id":"1087413","upvote_count":"3","timestamp":"1701677220.0","poster":"TariqKipkemei"}],"answer_ET":"A","question_text":"A company wants to run a gaming application on Amazon EC2 instances that are part of an Auto Scaling group in the AWS Cloud. The application will transmit data by using UDP packets. The company wants to ensure that the application can scale out and in as traffic increases and decreases.\n\nWhat should a solutions architect do to meet these requirements?","question_images":[],"topic":"1","answer_description":"","answer_images":[],"answers_community":["A (100%)"],"question_id":624},{"id":"Ay3x2TXn0nec34lhdvkk","question_text":"A company runs several websites on AWS for its different brands. Each website generates tens of gigabytes of web traffic logs each day. A solutions architect needs to design a scalable solution to give the company's developers the ability to analyze traffic patterns across all the company's websites. This analysis by the developers will occur on demand once a week over the course of several months. The solution must support queries with standard SQL.\n\nWhich solution will meet these requirements MOST cost-effectively?","answers_community":["A (95%)","5%"],"answer_images":[],"timestamp":"2023-11-07 15:23:00","question_id":625,"answer_ET":"A","url":"https://www.examtopics.com/discussions/amazon/view/125581-exam-aws-certified-solutions-architect-associate-saa-c03/","question_images":[],"unix_timestamp":1699366980,"topic":"1","choices":{"D":"Store the logs in an Amazon EMR cluster Use a supported open-source framework for SQL-based analysis.","B":"Store the logs in Amazon RDS. Use a database client for analysis.","C":"Store the logs in Amazon OpenSearch Service. Use OpenSearch Service for analysis.","A":"Store the logs in Amazon S3. Use Amazon Athena tor analysis."},"isMC":true,"answer_description":"","exam_id":31,"discussion":[{"content":"Selected Answer: A\nScalable + \"The solution must support queries with standard SQL\" = A\nB not scalable\nC OpenSearch is like ElasticSearch so does not support SQL syntax\nD EMR is processing not storage. Map-Reduce can use SQL like syntax but this option does not solve scalable storage issues. You normally run EMR on some stored data","poster":"awsgeek75","comments":[{"timestamp":"1709431620.0","content":"OpenSearch can support SQL queries, https://docs.aws.amazon.com/opensearch-service/latest/developerguide/sql-support.html","comment_id":"1164449","upvote_count":"2","poster":"cedser8"}],"upvote_count":"6","comment_id":"1121605","timestamp":"1705148460.0"},{"poster":"tch","upvote_count":"1","content":"Selected Answer: A\nAmazon Athena is an interactive analytics service that makes it simple to analyze data in Amazon Simple Storage Service (S3) using SQL. Athena is serverless, so there is no infrastructure to set up or manage, and you can start analyzing data immediately. You don’t even need to load your data into Athena; it works directly with data stored in Amazon S3. Amazon Athena for SQL uses Trino and Presto with full standard SQL support and works with various standard data formats, including CSV, JSON, Apache ORC, Apache Parquet, and Apache Avro. Athena for Apache Spark supports SQL and allows you to use Apache Spark, an open-source, distributed processing system used for big data workloads. To get started, log in to the Athena Management Console and start interacting with your data using the query editor or notebooks.","timestamp":"1737456360.0","comment_id":"1344104"},{"upvote_count":"2","content":"Selected Answer: A\nstandard SQL + analyze traffic","comment_id":"1231616","timestamp":"1718587620.0","poster":"KennethNg923"},{"comments":[{"comment_id":"1112525","poster":"pentium75","upvote_count":"3","content":"And descriptions of both products, Athena as well as OpenSearch, state that you can use them to \"analyze\" data.","timestamp":"1704260340.0"}],"timestamp":"1704260280.0","content":"Selected Answer: A\nDifficult question because both A and C meet the requirements. (OpenSearch does \"support queries with standard SQL\".)\n\nStill, native S3 storage is slightly cheaper than storage for OpenSearch. Also, Athena does not incur additional cost while OpenSearch does. Question asks for cost efficiency, thus A.\n\nD is out, not only because of the cost but also because you do not 'store logs in (!) an Amazon EMR cluster'; you can use (!) an EMR cluster to analyze data that is stored elsewhere.","upvote_count":"3","poster":"pentium75","comment_id":"1112524"},{"timestamp":"1703225940.0","upvote_count":"1","poster":"[Removed]","content":"Selected Answer: C\nhttps://docs.aws.amazon.com/opensearch-service/latest/developerguide/cold-storage.html","comment_id":"1103187","comments":[{"content":"Seems that even cold storage is still more expensive than S3.","timestamp":"1704260160.0","comment_id":"1112520","poster":"pentium75","upvote_count":"2"}]},{"content":"Selected Answer: A\nsolution must support queries with standard SQL = Amazon S3 with Athena","poster":"TariqKipkemei","timestamp":"1701677400.0","comment_id":"1087416","upvote_count":"4"},{"upvote_count":"3","timestamp":"1699584360.0","content":"Selected Answer: A\nA, most cost effective","comment_id":"1066909","poster":"NickGordon"},{"poster":"potomac","timestamp":"1699366980.0","upvote_count":"2","content":"Selected Answer: A\noption D (using Amazon EMR with an open-source framework) may be overkill for the relatively simple SQL-based analysis.","comment_id":"1064872"}],"answer":"A"}],"exam":{"numberOfQuestions":1019,"lastUpdated":"11 Apr 2025","provider":"Amazon","isMCOnly":true,"isImplemented":true,"id":31,"isBeta":false,"name":"AWS Certified Solutions Architect - Associate SAA-C03"},"currentPage":125},"__N_SSP":true}