{"pageProps":{"questions":[{"id":"OdtuWxpAvYgUts6e9Arz","answer_ET":"CDF","answer_description":"","isMC":true,"answers_community":["CDF (69%)","ACF (15%)","Other"],"url":"https://www.examtopics.com/discussions/oracle/view/22518-exam-1z0-082-topic-1-question-8-discussion/","discussion":[{"timestamp":"1594900080.0","content":"C, D and F. Answer A is wrong, it says - \"All tablespaces may have one or more data files\", but bigfile tablespaces can have only one datafile.","comments":[{"timestamp":"1596534600.0","comments":[{"poster":"adoptc94","upvote_count":"5","timestamp":"1598271120.0","content":"It's just like Rivaldo11 said, not all tablespaces may have one or more data files! Bigfile tablespaces can only have ONE datafile (which can be and in most cases are much bigger in size than smallfile datafiles) - as stated in your statement. \n\nA is definitely incorrect! \n\nMy picks would also be C, D and F","comment_id":"165158"}],"upvote_count":"1","comment_id":"150330","content":"what you think About this Information :\n\nSmallfile tablespaces can contain up to 1024 files, but bigfile tablespaces contain only one file that can be 1024 times larger than a smallfile tablespace.\n\nhttps://web.stanford.edu/dept/itss/docs/oracle/10gR2/server.102/b14220/physical.htm","poster":"ama"},{"comments":[{"comment_id":"601936","timestamp":"1652596920.0","content":"Nope, \"Not All tablespaces might have one or more data files\", this is one of question when they play with your logic and common sense, I fell into the same logic as yours, before I negate the question.","upvote_count":"1","poster":"algerianphoenix"}],"timestamp":"1631338620.0","upvote_count":"3","comment_id":"442831","poster":"nyale","content":"They said one or more!!! so a bigfile can have one and this makes A correct because one more is >=1"}],"upvote_count":"13","poster":"Rivaldo11","comment_id":"136424"},{"upvote_count":"9","timestamp":"1649748180.0","poster":"Franky_T","content":"Selected Answer: CDF\nA is wrong. Because bigfile tablespaces may have only one datafile\nB is wrong. Because if a tablespace has more than one datafile then the extents of the segment can be in any one or all of the data files. Remember that tablespaces are LOGICAL objects and the segment lives in the logical object, regardless of which file the extent exists on. \nC is correct. Smallfile tablespaces may have many datafiles that collectively exceed the the size of the datafile that is in the bigfile tablespace\nD is correct. The opposite of option B. A tablespace is a logical object made up of one or more datafiles. With locally managed tablespaces the server will decide where the next extent allocation should be done for a segment\nE is wrong. A segment must have all it's extents in the same tablespace, and block size is defined at tablespace level\nF is correct. If a segment has row pieces that collectively are less than or equal to the total storage requirement of one extent then the segment will have only one extent allocated to it\nG is wrong. A segment can reside in one tablespace only","comment_id":"584564"},{"upvote_count":"1","content":"Selected Answer: ADF\nA. All tablespaces may have one or more data files\nTrue: A tablespace is a logical storage unit that consists of one or more data files at the physical level.\n\nD. A segment can span multiple data files in some tablespaces (Most Voted)\nTrue: In smallfile tablespaces, a segment can span multiple data files because extents of a segment can be spread across multiple data files.\n\nF. A segment might have only one extent (Most Voted)\n True: A segment (such as a table or index) must have at least one extent, and it is possible for a segment to have only one extent.","comment_id":"1364314","poster":"eaad9dc","timestamp":"1740988380.0"},{"content":"A,D,F may colleagues are the same opinion","comment_id":"1292376","poster":"wgenser","timestamp":"1727867700.0","upvote_count":"1"},{"content":"A B D is correct answers","comment_id":"996910","poster":"SpyderSh","timestamp":"1693660800.0","upvote_count":"1"},{"poster":"SpyderSh","timestamp":"1693660500.0","content":"A C D are correct answers","comment_id":"996909","upvote_count":"1"},{"poster":"Hell3n","content":"Selected Answer: ACF\nA C F, checked.\n\nA is true, it say ---> one OR more\n\nD is false. \n D. A segment can span multiple data files in some tablespaces\n 'A segment can span one or more data files, but it cannot span multiple tablespaces'.\nSo in SOME tablespaces is not correct","timestamp":"1692777840.0","upvote_count":"2","comment_id":"988078"},{"comment_id":"988077","content":"A C F, checked.\n\nA is true, it say ---> one OR more\n\nD is false. \n D. A segment can span multiple data files in some tablespaces\n 'A segment can span one or more data files, but it cannot span multiple tablespaces'.\nSo in SOME tablespaces is not correct","timestamp":"1692777780.0","upvote_count":"1","poster":"Hell3n"},{"upvote_count":"1","timestamp":"1689924600.0","comment_id":"958169","content":"A C F\n\nA is correct. Bigfile tablespace have only one datafile and smallfile tablespace have several datafiles.\nB is wrong. The extents of a segment could reside in the some others datafiles in the same tablepsace\nC is correct. The difference between smallfile tablespace and bigfile tablespace is the number of datafile. The max size of datafile is same.\nD is wrong. A segment can span multiple data files in same tablespace, but not in some tablespaces\nE is wrong. The block size can be defined in tablespace in creation.\nF is correct. \nG is wrong. Refer to D","poster":"linhao"},{"comment_id":"881323","poster":"AliKhan345","upvote_count":"1","timestamp":"1682498460.0","content":"B is wrong . \nIf the initial extent become full, and if more space is required, then the database automatically allocates an incremental extent for this segment. An incremental extent is a subsequent extent created for the segment.\n\nThe allocation algorithm depends on whether the tablespace is locally managed or dictionary-managed. In the locally managed case, the database searches the bitmap of a data file for adjacent free blocks. If the data file has insufficient space, then the database looks in another data file. Extents for a segment are always in the same tablespace but may be in different data files.\n\nhttps://docs.oracle.com/en/database/oracle/oracle-database/19/cncpt/logical-storage-structures.html#GUID-C205981E-182A-466D-B151-090455F9ECE7"},{"comment_id":"870026","upvote_count":"1","timestamp":"1681455000.0","content":"Selected Answer: BCF\nOne tablespace may have multiple datafile.\nA segment can be span multile datafile which reside in the same tablespace. \nA extent, however, should be reside in same datafile. \n\nSo...I think the answer is B,C,AorF\n\nA&F are ambiguous, but D&E&G are wrong. \n\nD - A segment cannot span multiple data files in 'some' tablespaces. They should be reside in one tablespace. \nreference : https://docs.oracle.com/cd/A57673_01/DOC/server/doc/SCN73/ch3.htm#extents\n\"... The segments also can span files, but the individual extents cannot.\"","poster":"j_tw"},{"comment_id":"740389","timestamp":"1670614500.0","content":"Some tests said G is right ... G. Segments can span multiple tablespaces\nA Segment can't span multiple tablespaces ... but the Segments, (table, Indexes,cluster,..) may be span multiple tablespaces .... it is on plural ... so may be possible correct","poster":"Minoro","upvote_count":"1"},{"content":"Hi,\n\nB is correct.\nhttps://docs.oracle.com/en/database/oracle/oracle-database/19/cncpt/logical-storage-structures.html#GUID-E3D8E030-A056-40AC-9B7E-8C957E28EE75\n\"Allocation of Extents\nBy default, the database allocates an initial extent for a data segment when the segment is created. An extent is always contained in one data file.\"","poster":"alan_resende","upvote_count":"1","timestamp":"1670373240.0","comment_id":"737322"},{"comment_id":"610858","poster":"Darkseid1231","timestamp":"1654218360.0","content":"AMA, what is the correct answer please ?\nD & F i'm sure","upvote_count":"1"},{"content":"A segment belongs only to one tablespace, but a segment's extents might span on different Datafiles of a tablespace. \n\nThat's why I vote for B C D","upvote_count":"1","poster":"Aramazd","timestamp":"1649260560.0","comment_id":"581913"},{"timestamp":"1649260200.0","content":"G is wrong because \nEach segment belongs to one and only one tablespace. Thus, all extents for a segment are stored in the same tablespace. Within a tablespace, a segment can include extents from multiple data files, as shown in Figure 12-2. For example, one extent for a segment may be stored in users01.dbf, while another is stored in users02.dbf. A single extent can never span data files.","poster":"Aramazd","comment_id":"581910","upvote_count":"1"},{"poster":"Aramazd","comment_id":"581903","upvote_count":"1","timestamp":"1649259240.0","content":"A segment can have several extents:\n\nSegments\n\nThe level of logical database storage above an extent is called a segment. A segment is a set of extents that have been allocated for a specific type of data structure, and that all are stored in the same tablespace. For example, each table's data is stored in its own data segment, while each index's data is stored in its own index segment."},{"content":"C,D,F is correct\nbut I think A can also be the answer.","poster":"ryuah","upvote_count":"2","comment_id":"520037","timestamp":"1641717480.0"},{"comment_id":"499383","timestamp":"1639224960.0","poster":"adozoo","content":"Answer is C D F","upvote_count":"1"},{"poster":"fadal","content":"A Is Correct \n\nEach tablespace in an Oracle database consists of one or more files called datafiles, which are physical structures that conform to the operating system in which Oracle is running.\n\nhttps://docs.oracle.com/cd/B19306_01/server.102/b14220/physical.htm","timestamp":"1636912860.0","upvote_count":"1","comment_id":"478262"},{"timestamp":"1636912020.0","comment_id":"478256","content":"B is absolutely Correct\n\neach extent can contain data from only one datafile.\n\nhttps://docs.oracle.com/cd/B19306_01/server.102/b14220/logical.htm","poster":"fadal","comments":[{"comment_id":"560655","content":"It says \"The extents of a segment\", and I understand that as \"all the extents of a segment\" must reside in the same datafile. And that is not true.","poster":"Datajimm","timestamp":"1646384700.0","upvote_count":"2"}],"upvote_count":"2"},{"upvote_count":"1","timestamp":"1636911720.0","comment_id":"478254","comments":[{"content":"It says \"might\", in other words \"it is possible\" to have a segment with a single extent. That is true.","upvote_count":"1","poster":"Datajimm","comment_id":"560652","timestamp":"1646384580.0"}],"poster":"fadal","content":"F is wrong \n\nOracle allocates another extent for that segment. Because extents are allocated as needed.\n\nhttps://docs.oracle.com/cd/B19306_01/server.102/b14220/logical.htm"},{"comment_id":"478252","content":"A segment is a set of extents, each of which has been allocated for a specific data structure and all of which are stored in the same tablespace\n\n\nhttps://docs.oracle.com/cd/B19306_01/server.102/b14220/logical.htm","upvote_count":"1","timestamp":"1636911420.0","poster":"fadal"},{"upvote_count":"2","content":"G is wrong because segments is in plural and tablespaces is also in plural","comment_id":"310962","timestamp":"1615759560.0","poster":"Borislone"},{"upvote_count":"1","poster":"Borislone","content":"I read it again A is wrong because of \"All tablespaces\", the answer implies that all tablespace could have one datafile and that is a no no","comment_id":"310940","comments":[{"comment_id":"319353","timestamp":"1616603580.0","upvote_count":"1","content":"The wording is confusing.. It says \"may have one or more\" right.. So it's like implying All tablespace should have a datafile (either one or more) and no tablespace can be created without a datafile something like that?","poster":"Manokim21"}],"timestamp":"1615758480.0"},{"poster":"Borislone","content":"A is correct \nhttps://docs.oracle.com/cd/B19306_01/server.102/b14220/physical.htm#:~:text=A%20tablespace%20in%20an%20Oracle,required%20for%20the%20file%20header.","upvote_count":"3","comment_id":"310937","timestamp":"1615758300.0"},{"upvote_count":"3","comment_id":"225889","timestamp":"1606141920.0","poster":"SimoneF","comments":[{"upvote_count":"2","comments":[{"content":"I read again and again, seem SimoneF is correct.","upvote_count":"1","poster":"Phat","comment_id":"260389","timestamp":"1609862940.0"},{"content":"Exactly, G is absolutely wrong. D is right cause you can have a smallfile TBL (with more data files) or a bigfile TBL (with only one data file).\n\nOracle documentation:\n\"Oracle Database physically stores tablespace data in data files. Tablespaces and data files are closely related, but have important differences:\n\n - Each tablespace consists of one or more data files, which conform to the operating system in which Oracle Database is running.\n - The data for a database is collectively stored in the data files located in each tablespace of the database.\n - A segment can span one or more data files, but it cannot span multiple tablespaces.\n - A database must have the SYSTEM and SYSAUX tablespaces. Oracle Database automatically allocates the first data files of any database for the SYSTEM tablespace during database creation.\"\n\nhttps://docs.oracle.com/cd/E11882_01/server.112/e40540/physical.htm#CNCPT403","upvote_count":"1","timestamp":"1629893220.0","poster":"leozanon94","comment_id":"431418"}],"comment_id":"260364","timestamp":"1609861440.0","poster":"Phat","content":"I think D is correct. segment can span multiple datafiles in \"some\" tablespaces. But in others tablespaces, segment can only on 1 datafile.\nG could be wrong. the wording is only \"segments\" not \"different segments\". in 1 tablespace, we have \"segments\" and they only stay on 1 tablespace."},{"poster":"elbelgounetos","timestamp":"1614931500.0","comment_id":"304068","content":"G is wrong see https://www.slideshare.net/ImranAli102/less05-storage slide 3.\nA segment is tied to a tablespace.","upvote_count":"1"}],"content":"The wording used is misleading, but I think there are some safe points:\nA - Wrong: not all tablespaces may have more than one datafile, since bigfile tablespaces can only have one.\nB - Wrong: Extents of the same segments can be on different datafiles, no doubts here.\nC - Right: A bigfile tablespace could very well be 100MB, and a smallfile tablespace span multiple GB datafiles. So no dobuts here either.\nE - Wrong: A segment resides on a single tablespace and block size is consistent across a tablespace, so no dobuts here as well.\nF - Mostly right: wording is ambiguous but I dare say it's possible for a segment to have only one extent. I'm inclined to think that it would have been different if it said \"A segment might only have one extent\". But I'm not a native English speaker, so a grain of salt here.\n\nD and G are, for me, the trickiest but, the more I read, the more I'm actually convinced that D is wrong and G means that different segments can be on different tablespace, which would clearly be true. So maybe this time, in the end, the marked answers are correct and it is CFG."},{"comment_id":"198054","poster":"Ekos","content":"ACF is the correct answer","upvote_count":"2","timestamp":"1602464520.0","comments":[{"comments":[{"timestamp":"1606139280.0","poster":"SimoneF","content":"\"Almost\" is key here. The question asks if a segment \"might\" have only one extents, not if it's limited to one. I think it's just a misleading wording, but F it's actually true.","comment_id":"225864","upvote_count":"2"}],"upvote_count":"1","comment_id":"207972","poster":"pr0glnx","content":"F: false \nA segment almost always have many extents","timestamp":"1603905900.0"},{"upvote_count":"1","comment_id":"225863","content":"A is wrong, BIGFILE tablespaces may only have one datafile.","poster":"SimoneF","timestamp":"1606139160.0"}]},{"comment_id":"172270","upvote_count":"2","content":"i think it is tricky question answer is ACF","poster":"MS_ORC","timestamp":"1599086760.0"},{"upvote_count":"2","timestamp":"1598016420.0","comments":[{"timestamp":"1598243040.0","upvote_count":"2","comment_id":"164865","poster":"adoptc94","content":"F is not false! A segment can have multiple extents but it also might only have one extent at a time. A segments that currently only holds on extends doensn't exclude itself from having more extends -> so F is correct"}],"content":"A is not right because bigtablespaces....\nB could be right because I coudnt find where someone says that but it is logical were talking about extents which are a group of block in storage\nC it is true\nD it is true\nE: the block size is always the same. false\nF: false. a segment can have several extent https://www.ediciones-eni.com/open/mediabook.aspx?idR=64588a87f879f6babb94c730886c4a36\nG false, a segement can span multiple datafile but not multiple tablespaces\n\nB C D","poster":"danito","comment_id":"162983"},{"upvote_count":"2","poster":"Chansi","comment_id":"157628","content":"It is true that an extent cannot span multiple datafiles but extent of a segment can or else how can a segment span multiple datafiles ?","timestamp":"1597355400.0"},{"comments":[{"poster":"SimoneF","content":"B is wrong in fact. A table CAN span multiple datafiles, and can certainly be bigger than a whole datafile.","timestamp":"1606139100.0","comment_id":"225860","upvote_count":"1"}],"timestamp":"1597354740.0","poster":"Chansi","upvote_count":"1","content":"Here is why I have doubt on B. If extents of a segment always belong to one datafile ,how can the segments then span multiple datafiles ?","comment_id":"157620"},{"poster":"nhsang","comment_id":"152216","content":"B is definitely right. \nF is also right.\nD is completely wrong! How a segment can span in \"SOME\" tablespaces?\nE is also wrong. Although database can use multiple block_size, however, there is only one block_size is allowed on each tablespace.\n\nSo, now we can choose one between A, and C. \n\"A\" does not make sense to me because It's talking to \"ALL\" tablespaces.\n=> So, B C F is my answer.","upvote_count":"2","comments":[{"timestamp":"1606139040.0","poster":"SimoneF","content":"B is definitely wrong: that the extents of a segment must reside on a single datafile would mean that, if a datafile is full and reached its max size, to add data to a table you would have to move said table. Plus, there couldn't be a table bigger than a datafile, and that is quite obviously wrong.","upvote_count":"2","comment_id":"225858"}],"timestamp":"1596757140.0"},{"comments":[{"comments":[{"upvote_count":"1","content":"My only concern is the use of \"segments\", which could, in fact, mean that different segments may span multiple tablespaces. In this case, I would go with G instead of D... quite tricky wording here indeed.","comment_id":"225873","poster":"SimoneF","timestamp":"1606139760.0"}],"comment_id":"225868","timestamp":"1606139460.0","content":"But segments cannot span multiple tablespaces. And I guess D is indeed worded strangely but it's true: in some tablespaces, a segment can span multiple datafiles. Which means in tablespaces made of more than one datafile as opposed to bigfile tablespaces (or even smallfile tablespaces with only one datafile).","poster":"SimoneF","upvote_count":"1"}],"upvote_count":"1","content":"Disregard the earlier post.There is a typo\nI would think D works but the wording is creating a doubt. D. A segment can span multiple data files in some tablespaces Which implies that it can’t on other tablespaces. So the option would be C,FG","comment_id":"152084","poster":"Chansi","timestamp":"1596735120.0"},{"upvote_count":"1","poster":"Chansi","comment_id":"152081","timestamp":"1596735000.0","content":"I would think D works but the wording is creating a doubt.\nD. A segment can span multiple data files in some tablespaces\nWhich implies that it can’t on other tablespaces. So the option would be C,D,E"},{"timestamp":"1596373980.0","upvote_count":"3","comment_id":"149149","comments":[{"upvote_count":"2","timestamp":"1596534480.0","comment_id":"150328","content":"its a tricky Question, you might be Right at least according to this Information : Smallfile tablespaces can contain up to 1024 files, but bigfile tablespaces contain only one file that can be 1024 times larger than a smallfile tablespace.\n\nhttps://web.stanford.edu/dept/itss/docs/oracle/10gR2/server.102/b14220/physical.htm","comments":[{"content":"Ama, I think what you quoted actually proves answer A to be wrong: \"bigfile tablespaces contain only one file\" means exactly that not all tablespaces may have one or more datafiles, because BIGFILE tbs can only have one.","poster":"SimoneF","timestamp":"1606139640.0","upvote_count":"1","comment_id":"225872"}],"poster":"ama"}],"content":"A seems to be correct, all tablespaces will have atleast one datafile or more >=1.\nADF looks correct.","poster":"Sharif1"},{"comment_id":"126307","timestamp":"1593880260.0","content":"A & C & D looks correct answer","comments":[{"poster":"ama","timestamp":"1594102440.0","comment_id":"128667","content":"A segment consists of one or more extents > F is also correct","upvote_count":"2"}],"upvote_count":"2","poster":"you1234"},{"content":"A segment cannot span tablespaces; however, a segment can span multiple data files that belong to the same tablespace … probably D is Right","comment_id":"117402","timestamp":"1592912460.0","upvote_count":"2","poster":"ama"},{"comment_id":"104788","content":"I think ACF","timestamp":"1591556880.0","poster":"danito","upvote_count":"2"}],"question_images":[],"timestamp":"2020-06-07 21:08:00","answer_images":[],"choices":{"D":"A segment can span multiple data files in some tablespaces","A":"All tablespaces may have one or more data files","B":"The extents of a segment must always reside in the same datafile","C":"A smallfile tablespace might be bigger than a bigfile tablespace","F":"A segment might have only one extent","G":"Segments can span multiple tablespaces","E":"A segment's blocks can be of different sizes"},"unix_timestamp":1591556880,"question_text":"Which three statements are true concerning logical and physical database structures? (Choose three.)","topic":"1","question_id":151,"exam_id":380,"answer":"CDF"},{"id":"Kosi8pRwhp8smElrW4ic","answer_description":"","exam_id":380,"answer_ET":"BDF","discussion":[{"upvote_count":"25","poster":"Rivaldo11","timestamp":"1642019760.0","comments":[{"comment_id":"146921","comments":[{"comment_id":"166621","upvote_count":"4","poster":"adoptc94","timestamp":"1645877700.0","comments":[{"poster":"NowOrNever","upvote_count":"2","timestamp":"1648236360.0","comment_id":"187208","content":"Sorry\nBCF of course"}],"content":"Why would D be right? \nThe database checks the users quota in the tablespace that he wants to create the object in. Having quota in another tablespace isn't any issue so why would you need to remove the quota from tablespace users to be able to create objects in tablespace sales_q1? \n\nThe right answers are:\nB -> The user need quota in the tablespace he wants to create the object (sales_q1)\nC -> User needs to be able to create a session (login in) to the database to create objects in the first place\nF -> User needs to have the right privilege to create the object (in this case a table) \n\nD is complete nonsense given the question and won't help in any way to create objects in sales_q1 tablespace"}],"poster":"NowOrNever","content":"BDF\nhttps://blogs.oracle.com/sql/how-to-create-users-grant-them-privileges-and-remove-them-in-oracle-database\n\nhttps://docs.oracle.com/database/121/DBSEG/users.htm#DBSEG002\nYou can assign each user a tablespace quota for any tablespace, except a temporary tablespace.","timestamp":"1643495400.0","upvote_count":"1"}],"content":"B, C and F","comment_id":"133162"},{"comment_id":"903183","poster":"RaNik69","upvote_count":"1","content":"Selected Answer: BCF\nBCF are correct","timestamp":"1732198380.0"},{"poster":"Rcravi","upvote_count":"1","timestamp":"1694900100.0","content":"Correct - CEF\n\nA - you cant assign quota on TEMP tablespace\nB - you do not need any quota for creating table in any tablespace\nD - is wrong as you are not creating table in users, so this is not concerning to the question\n\nCorrect -\nC,F - these are the basic privileges required.\nE - For holding the data, quota is required.","comments":[{"poster":"Rcravi","upvote_count":"3","comment_id":"569382","timestamp":"1694901420.0","content":"Update/correction\nE - is correct when asked for inserting the data. So E is wrong for this question\n\nB- is correct when deferred_segment_creation is set to FALSE, you need quota on sales_Q1 tablespace.\n\ncorrect answers are B C and F."}],"comment_id":"569374"},{"upvote_count":"2","comments":[{"upvote_count":"1","poster":"SimoneF","timestamp":"1657051920.0","comment_id":"260589","content":"Read the question again: it clearly states \"Segment creation is not deferred.\" exactly to prevent this objection.\nAnd E is false anyway, cause the question also asks for the requirements for the creation of the tables, not for their population."},{"upvote_count":"1","comment_id":"260591","poster":"SimoneF","content":"Sorry one more thing: E is also false cause SALES_Q1 is not the only tablespace where sales has quota, so we don't know if all the tables in that schema will reside there or on USERS. So, SALES_Q1 doesn't necessarily have to be as big as all the data that the schema will have.","timestamp":"1657052040.0"}],"comment_id":"242418","timestamp":"1655105040.0","poster":"Ekos","content":"C,E,F is the correct answer.\nb is wrong. we dont need any initial extents when we create table. the segments are needed when we start insert the data."},{"upvote_count":"3","comment_id":"177167","poster":"Mandar79","content":"BCF is correct\nhttps://docs.oracle.com/database/121/DBSEG/users.htm#DBSEG99778\nWhen you create a new user account, you should enable this user to access the database","timestamp":"1646931300.0"},{"comment_id":"152704","poster":"Chansi","content":"Isn't it CEF ? What if the user is executing Create as Select so just B won't work rt ?","comments":[{"timestamp":"1657051740.0","content":"There are two problems with E: \nfirst and most notably, user sales can (and not randomly, does) have quota on other tablespaces, so not all of his tables have to reside on SALES_Q1.\n\nSecond, the question asks what's necessary for the user to be able to create tables. To create a select, meaning creating and filling them, is not a necessary requirement. Even if the space wouldn't be necessary to insert all the data, to be enough for hosting the initial extents would satisfy the minimum requirement, which is to create the tables (hence, the structure) to begin with.","comment_id":"260588","poster":"SimoneF","upvote_count":"1"}],"timestamp":"1644268740.0","upvote_count":"2"}],"isMC":true,"answer":"BCF","question_text":"The SALES_Q1 and USERS tablespaces exist in one of your databases and TEMP is a temporary tablespace.\nSegment creation is not deferred.\nYou execute this command:\n//IMG//\n\nWhich three statements must be true so that the SALES user can create tables in SALES_Q1? (Choose three.)","choices":{"F":"The sales user must have been granted the CREATE TABLE privilege","D":"The sales user must have their quota on the users tablespace removed","A":"The sales user must have a quota on the TEMP tablespace","B":"The sales user must have a quota on the SALES_Q1 tablespace to hold the initial extends of all tables they plan to create in their schema","E":"The sales user must have a quota on the SALES_Q1 tablespace to hold all the rows to be inserted into any table in their schema","C":"The sales user must have been granted the CREATE SESSION privilege"},"question_id":152,"answers_community":["BCF (100%)"],"answer_images":[],"timestamp":"2020-07-12 20:36:00","question_images":["https://www.examtopics.com/assets/media/exam-media/04352/0004900001.png"],"url":"https://www.examtopics.com/discussions/oracle/view/25523-exam-1z0-082-topic-1-question-80-discussion/","topic":"1","unix_timestamp":1594578960},{"id":"ySkwN4LPTSoVsCiQEZ96","answer_images":[],"question_id":153,"unix_timestamp":1593150240,"choices":{"C":"Multiple row pieces from the same row may be stored in different database blocks","F":"Index block free space is always contiguous in the middle of the block","D":"Multiple row pieces from the same row may be stored in the same block","B":"A table row piece can be chained across several database blocks","A":"Data block headers contain their own Data Block Address (DBA)","E":"Data block free space is always contiguous in the middle of the block"},"exam_id":380,"answer":"ACD","timestamp":"2020-06-26 07:44:00","question_text":"Which three statements are true about table data storage in an Oracle Database? (Choose three.)","isMC":true,"discussion":[{"upvote_count":"12","timestamp":"1610881620.0","content":"I would say A, B, C are correct!","comment_id":"137013","poster":"ama","comments":[{"content":"agreed A, B, C are correct","timestamp":"1624125360.0","poster":"baeji","upvote_count":"2","comment_id":"248178"}]},{"comment_id":"1205690","content":"B, C, and D sounds better to me.","upvote_count":"2","poster":"it6567306","comments":[{"comments":[{"content":"DBA (Data Block Address) is an address included in each data block header that uniquely identifies the block within the database. It is essential information used to locate the physical position of blocks in the database, crucial for organizing data and the structure of the block.","comment_id":"1205692","poster":"it6567306","timestamp":"1730569680.0","comments":[{"upvote_count":"1","comments":[{"content":"Instead, choices B, C, and D, which directly relate to how rows are stored and managed across blocks, are more appropriate selections.","timestamp":"1730569680.0","poster":"it6567306","comment_id":"1205694","upvote_count":"1"}],"timestamp":"1730569680.0","comment_id":"1205693","content":"However, this information doesn't directly relate to the actions or functions regarding the storage of table data, which is the focus of \"Question #81.\" The question concentrates on how rows are stored and how rows are placed within blocks. Therefore, choice A does not provide relevant information for the context of this question and is not an appropriate choice for the correct answers.","poster":"it6567306"}],"upvote_count":"1"}],"poster":"it6567306","upvote_count":"1","timestamp":"1730569620.0","comment_id":"1205691","content":"The reason for excluding choice A, \"Data block headers contain their own Data Block Address (DBA),\" from the correct answers is that it is fundamentally true, but it doesn't directly relate to the scenario described in the question."}],"timestamp":"1730569560.0"},{"upvote_count":"1","content":"Selected Answer: ABC\nAfter reviewing this https://antognini.ch/2016/10/whats-the-difference-between-row-migration-and-row-chaining/","poster":"zouve","timestamp":"1708766340.0","comment_id":"988947"},{"upvote_count":"3","poster":"musafir","timestamp":"1706426400.0","comment_id":"965303","content":"Selected Answer: ACD\nA. Data block headers contain their own Data Block Address (DBA) - True\nB. A table row piece can be chained across several database blocks - Wrong, a row may be stored in multiple row pieces which are then chained across several database blocks. The row is chained not the row piece. \nC. Multiple row pieces from the same row may be stored in different database blocks - True\nD. Multiple row pieces from the same row may be stored in the same block - True\nE. Data block free space is always contiguous in the middle of the block - Wrong\nF. Index block free space is always contiguous in the middle of the block - Wrong\n\"As the database fills a data block from the bottom up, the amount of free space between the row data and the block header decreases.\" No mention of middle of the block anywhere in the Oracle Docs.\n\nhttps://docs.oracle.com/en/database/oracle/oracle-database/23/cncpt/tables-and-table-clusters.html#GUID-37546C88-24EE-47BE-8662-A9CED99BB90F"},{"comment_id":"951635","poster":"auwia","upvote_count":"1","content":"Selected Answer: ADE\nA. Data block headers contain their own Data Block Address (DBA) --> True\nB. A table row piece can be chained across several database blocks. --> False, it's not \"database block\", it's \"data block\"\nC. Multiple row pieces from the same row may be stored in different database blocks. --> False, it's not \"database block\", it's \"data block\"\nD. Multiple row pieces from the same row may be stored in the same block --> True\nE. Data block free space is always contiguous in the middle of the block --> True, in the oracle official guide (online) there many pictures showing the \"data block\" and the free space is always included between header and data stored.\nF. Index block free space is always contiguous in the middle of the block. --> False, \"index block\" does not exists, it is \"data block with type table or index, or cluster\".","timestamp":"1705252920.0"},{"content":"Selected Answer: ACD\nA, C, and D sounds better to me.","upvote_count":"1","comments":[{"timestamp":"1705252620.0","content":"Please ignore this comment.","comment_id":"951633","upvote_count":"1","poster":"auwia"}],"comment_id":"948963","poster":"auwia","timestamp":"1704985320.0"},{"timestamp":"1700579100.0","poster":"RaNik69","content":"Selected Answer: ABC\nD is false in 19c because there is no more limitation about the number of \"intra-block\" columns. This is an example for 400 columns\n\ndeclare\n l_txt long;\nbegin\n l_txt := 'create table t (c0 varchar2(20)';\n for i in 1 .. 400\n loop\n l_txt := l_txt || ', c' || i || ' varchar2(20)';\n end loop;\n l_txt := l_txt || ') ' ;\n execute immediate l_txt;\n end;\n/\n\nselect count(dbms_rowid.ROWID_BLOCK_NUMBER(rowid)) BLOCK_NUMBER from t;\n\nBLOCK_NUMBER\n------------\n 0\n\ndeclare\n v_txt varchar2(4000);\nbegin\n v_txt := 'insert into t values ( 0';\n for i in 1 .. 400\n loop\n v_txt := v_txt || ', ' || i ;\n end loop;\n v_txt := v_txt || ') ' ;\n execute immediate v_txt;\n commit;\n end;\n/\n\nselect count(dbms_rowid.ROWID_BLOCK_NUMBER(rowid)) BLOCK_NUMBER from t;\n\nBLOCK_NUMBER\n------------\n 1\n\nso I think the right answers are a (for sure), b, c (for sure)","upvote_count":"1","comment_id":"903245"},{"content":"A. Data block headers contain their own Data Block Address (DBA) ==> Yes\nB. A table row piece can be chained across several database blocks ==> No, ROWS are chained not ROW PIECE\nC. Multiple row pieces from the same row may be stored in different database blocks ==> Yes (Row chaining)\nD. Multiple row pieces from the same row may be stored in the same block ==> Yes (Intra-block chaining e.g. table with more than 255 columns)\nE. Data block free space is always contiguous in the middle of the block ==> NO\nF. Index block free space is always contiguous in the middle of the block ==> NO","upvote_count":"2","timestamp":"1682851800.0","poster":"calibre_04","comment_id":"708414"},{"poster":"emburria","upvote_count":"3","timestamp":"1658673660.0","content":"A, C, D. B is not correct. A row can be chained, but not a row piece...if so, then is another piece","comment_id":"531452"},{"poster":"flaviogcmelo","content":"A,B and C.\nhttps://antognini.ch/2016/10/whats-the-difference-between-row-migration-and-row-chaining/","comment_id":"340465","timestamp":"1634834220.0","upvote_count":"1"},{"timestamp":"1634651520.0","comment_id":"338861","poster":"yukclam9","comments":[{"upvote_count":"2","comment_id":"684817","poster":"saad3577","timestamp":"1680440160.0","content":"B is correct : \nSimply put, chained rows happen when a row is too big to fit into a single database block. Chained rows usually result from an insert. For example, if the blocksize for the database is 4 kilobytes and there is an 8 kilobyte row to be inserted, Oracle will break the data into pieces and store it in 3 different blocks that are chained together. There is forwarding information available to allow the database to collect all of the bits of chained row information from multiple blocks.\n\nhttp://www.dba-oracle.com/t_identify_chained_rows.htm"}],"content":"I dont think B is correct - the most granular unit of row is a single row piece. row piece can not be chained. a row can be chained by multiple row pieces + pointers.","upvote_count":"2"},{"comment_id":"272018","poster":"Phat","content":"so what is the final answers for this?","upvote_count":"3","timestamp":"1626781860.0"},{"upvote_count":"2","timestamp":"1615402920.0","content":"The Oracle block header contains the following:\nhttp://www.dba-oracle.com/t_data_block_format.htm#:~:text=The%20header%20of%20a%20data,and%20a%20%22variable%22%20area.&text=The%20data%20block%20address.,displacement%20into%20the%20data%20file).\nA fixed-size block header.\n\nA block directory.\n\nThe interested transaction list (ITL).\n\nSpace management information.\n\nThe data block address.","poster":"Mandar79","comment_id":"177227"},{"timestamp":"1615398240.0","comment_id":"177192","upvote_count":"1","content":"The header contains general block information, such as the block address and the type of segment (for example, data or index).\nhttps://docs.oracle.com/cd/B10501_01/server.920/a96524/c03block.htm#:~:text=The%20header%20contains%20general%20block,example%2C%20data%20or%20index).","poster":"Mandar79"},{"comments":[{"poster":"KtNow","timestamp":"1626029160.0","comment_id":"265042","comments":[{"upvote_count":"2","content":"so i would say A-B-C-D","poster":"KtNow","timestamp":"1626039420.0","comment_id":"265149"}],"content":"about D. \n--ora.doc--\nOracle Database can only store 255 columns in a row piece. if you insert a row into a table that has 1000 columns, then the database creates 4 row pieces, typically chained over multiple blocks. --\ntypically chained, but possible situation that it can be in one block.\nfor example oracle block 4K(8K). row 1000 columns=4 row pieces, if column is small then at least 2 row pieces possible insert in one block. why not? for my point of view answer D possible also.","upvote_count":"4"}],"comment_id":"166634","upvote_count":"3","poster":"adoptc94","timestamp":"1614342900.0","content":"Right answers: A,B,C\n\nE and F are false because the free space of a block gets fragmented over time as data is added and removed from it -> this is called fragmentation (meaning the free space is not contiguous anymore). If the free space of a block is fragmented to a point where no new rows can be inserted, the free space is coalesced by the oracle server so that it's contiguous again and can be used for inserts or updates. \n\nCoalescing free blocks doesn't change the actual size of free space in the block. \n\nFor why answer D is wrong, I am not completely sure but I guess that you wouldn't store a row as multiple row pieces in one block. If you can fit the whole row into a single block than it would be stored there as a single row piece and not multiple - but that's just my guess"},{"upvote_count":"2","poster":"ama","content":"C is correct > https://antognini.ch/2016/10/whats-the-difference-between-row-migration-and-row-chaining/","comments":[{"content":"Interestingly, this also says that D is true. \nI was actually in doubt on the B answer, which is then false cause it is a row that is chained in different row pieces, while the right ones are A-C-D","comment_id":"260599","poster":"SimoneF","timestamp":"1625518680.0","upvote_count":"6"}],"timestamp":"1612011540.0","comment_id":"147319"},{"comment_id":"137006","poster":"ama","content":"A is correct!!\n\n The header of a data block has two areas a \"common\" area and a \"variable\" area. The Oracle block header contains the following:\nA fixed-size block header.\nA block directory.\nThe interested transaction list (ITL).\nSpace management information.\nThe data block address. This \"DBA\" (48 bytes), consisting of the file number (v$datafile.file#) and the relative block number (the displacement into the data file). Note that the relative block address is not the same as the absolute block address.","timestamp":"1610880840.0","upvote_count":"2"}],"topic":"1","question_images":[],"answers_community":["ACD (57%)","ABC (29%)","14%"],"url":"https://www.examtopics.com/discussions/oracle/view/24116-exam-1z0-082-topic-1-question-81-discussion/","answer_description":"","answer_ET":"ACD"},{"id":"qr5e2JodJ4mbAQQiZcIs","answer_description":"","answer_ET":"CD","exam_id":380,"answers_community":["CD (75%)","A (25%)"],"timestamp":"2020-06-25 17:50:00","answer_images":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04352/0005000001.png"],"question_id":154,"unix_timestamp":1593100200,"question_text":"Examine the description of the BOOKS table:\n//IMG//\n\nThe table has 100 rows.\nExamine this sequence of statements issued in a new session:\nINSERT INTO books VALUES ('ADV112', 'Adventures of Tom Sawyer', NULL, NULL);\nSAVEPOINT a;\nDELETE FROM books;\nROLLBACK TO SAVEPOINT a;\nROLLBACK;\nWhich two statements are true? (Choose two.)","isMC":true,"discussion":[{"upvote_count":"25","comments":[{"comment_id":"242432","upvote_count":"4","content":"i agree","poster":"Ekos","timestamp":"1623570300.0"},{"poster":"Guhborges","comment_id":"486498","upvote_count":"2","timestamp":"1653458760.0","content":"I agree, C & D"}],"timestamp":"1608918600.0","content":"C & D is correct one","poster":"you1234","comment_id":"119583"},{"content":"to me the insert does not make sense. why we are inserting characters to a date column?","timestamp":"1634651880.0","upvote_count":"7","comment_id":"338863","poster":"yukclam9","comments":[{"timestamp":"1684111020.0","content":"That’s why they are trying to rollback the stuff.","upvote_count":"2","comment_id":"718440","poster":"Reiwardy"},{"poster":"LrnsTgh","content":"😂 LOL. very good eyes","comment_id":"431364","upvote_count":"3","timestamp":"1645793520.0"}]},{"content":"I agree C, D is correct","poster":"Oracle2020","comment_id":"1188738","upvote_count":"3","timestamp":"1727969760.0"},{"upvote_count":"2","poster":"ErickZc","comment_id":"1158394","content":"Selected Answer: CD\nThe correct answer is C,D\nI Tested it in my local database 19.11.0.0.0 \n\n COUNT(*)\n----------\n 10\n1 row selected.\n1 row created.\nSavepoint created.\n11 rows deleted.\nRollback complete.\n\n COUNT(*)\n----------\n 11\n1 row selected.\nRollback complete.\n\n COUNT(*)\n----------\n 10\n1 row selected.","timestamp":"1724555160.0"},{"content":"the SQL INSERT is wrong","upvote_count":"2","poster":"feixiang","comment_id":"983324","timestamp":"1708161960.0"},{"content":"Selected Answer: CD\nC D is correct","poster":"musafir","comment_id":"968154","upvote_count":"2","timestamp":"1706715360.0"},{"comment_id":"948876","upvote_count":"2","timestamp":"1704976440.0","comments":[{"timestamp":"1704976560.0","content":"the first rollback finishes the DELETE transaction, so no transaction open for second rollback.","poster":"mamadu","comment_id":"948878","upvote_count":"1"}],"content":"Selected Answer: A\nThere is only one correct answer here A.","poster":"mamadu"},{"content":"Selected Answer: CD\nC , D is correct.","comment_id":"628405","poster":"LeandroHPN","upvote_count":"2","timestamp":"1673113620.0"},{"poster":"algerianphoenix","upvote_count":"1","content":"Even though it is asked for \"two\" correct answers, I only found D as correct, the others make no sense to me, especially the SQL INSERT itself is wrong.","timestamp":"1668444960.0","comment_id":"601649"}],"choices":{"E":"The first ROLLBACK command restores the 101 rows that were deleted and commits the inserted row","B":"The second ROLLBACK command replays the delete","C":"The first ROLLBACK command restores the 101 rows that were deleted, leaving the inserted row still to be committed","D":"The second ROLLBACK command undoes the insert","A":"The second ROLLBACK command does nothing"},"answer":"CD","topic":"1","url":"https://www.examtopics.com/discussions/oracle/view/24046-exam-1z0-082-topic-1-question-82-discussion/"},{"id":"mSCeP7Vbd7LqiTRpvrBO","choices":{"F":"They support UPDATEs but not INSERTs and DELETEs","A":"External table files can be used for other external tables in a different database","E":"The ORACLE_DATAPUMP access driver can be used to load data into a database from an external table","D":"They cannot be partitioned","B":"The ORACLE_LOADER access driver can be used to unload data from a database into an external table","C":"The ORACLE_DATAPUMP access driver can be used to unload data from a database into an external table"},"answer_ET":"ABF","question_id":155,"answer_images":[],"unix_timestamp":1590824820,"timestamp":"2020-05-30 09:47:00","question_images":[],"isMC":true,"answer_description":"","answers_community":["ACE (100%)"],"question_text":"Which three statements are true about external tables in Oracle 18c and later releases? (Choose three.)","url":"https://www.examtopics.com/discussions/oracle/view/21610-exam-1z0-082-topic-1-question-83-discussion/","answer":"ACE","discussion":[{"upvote_count":"22","timestamp":"1591065060.0","content":"ACE. B is wrong. ORACLE_LOADER loads data not unload data. ORACLE_DATAPUMP is able to load and unload data.","poster":"GraceYu","comment_id":"100477","comments":[{"poster":"danito","comment_id":"107996","content":"I agree","timestamp":"1591899360.0","upvote_count":"2"},{"comment_id":"242434","content":"i agree","upvote_count":"1","timestamp":"1607852760.0","poster":"Ekos"}]},{"comment_id":"177632","poster":"Mandar79","content":"ACE - Correct\nhttps://docs.oracle.com/cd/B19306_01/server.102/b14215/et_concepts.htm\nB - Incorrect\nThe ORACLE_LOADER access driver is the default. It can perform only data loads, and the data must come from text datafiles\nC and E - Correct\nThe ORACLE_DATAPUMP access driver can perform both loads and unloads.\nF - Incorrect\nhttps://docs.oracle.com/en/database/oracle/oracle-database/18/admin/managing-tables.html#GUID-697B86CC-875C-4F68-AF80-49B41F33AE45\nYou can, for example, select, join, or sort external table data. You can also create views and synonyms for external tables. However, no DML operations (UPDATE, INSERT, or DELETE) are possible, and no indexes can be created, on external tables.\nD - Incorrect\nPartitioned external tables were introduced in Oracle Database 12c Release 2 (12.2), allowing external tables to benefit from partition pruning and partition-wise. \nhttps://oracle-base.com/articles/12c/partitioned-external-tables-12cr2#:~:text=Partitioned%20external%20tables%20were%20introduced,are%20supported%20with%20some%20restrictions.","upvote_count":"8","timestamp":"1599823860.0"},{"upvote_count":"1","poster":"cf1f99b","timestamp":"1732992960.0","content":"Selected Answer: ACE\nACE is correct","comment_id":"1320351"},{"upvote_count":"1","comments":[{"timestamp":"1712160060.0","upvote_count":"1","poster":"Oracle2020","comment_id":"1188750","content":"sorry ACE is correct for the explanations given above"}],"content":"In Oracle 19c: \nA-correct\nB-correct: Oracle Database provides access drivers for external tables. The default access driver\nis ORACLE_LOADER, which allows the reading of data from external files using the Oracle\nloader technology. The ORACLE_LOADER access driver provides data mapping\ncapabilities which are a subset of the control file syntax of SQL*Loader utility\nC-correct: Another access driver, ORACLE_DATAPUMP, lets you unload data—that is, read data from the\ndatabase and insert it into an external table, represented by one or more external files\nand then reload it into an Oracle Database.\nD-false: Partitioning External Tables:For large amounts of data, partitioning for external tables provides fast query\nperformance and enhanced data maintenance.\nF-false:You can, for example, select, join, or sort external table data. You can also create views and\nsynonyms for external tables. However, no DML operations (UPDATE, INSERT, or DELETE) are\npossible, and no indexes can be created, on external tables.","comment_id":"1188746","timestamp":"1712159820.0","poster":"Oracle2020"},{"upvote_count":"1","poster":"Kuraudio","comment_id":"738812","timestamp":"1670491260.0","content":"Selected Answer: ACE\nACE is correct"},{"poster":"danito","content":"F is wrong. The correct answers are ABC \nhttps://docs.oracle.com/en/database/oracle/oracle-database/18/admin/managing-tables.html#GUID-F6948F0E-0557-4C42-9145-1897DE974CC3\n\nAnother access driver, ORACLE_DATAPUMP, lets you unload data....\nNo DML operations (UPDATE, INSERT, or DELETE) are possibl....","timestamp":"1590824820.0","comment_id":"98706","upvote_count":"1"}],"topic":"1","exam_id":380}],"exam":{"numberOfQuestions":172,"isImplemented":true,"provider":"Oracle","lastUpdated":"12 Apr 2025","id":380,"isMCOnly":true,"isBeta":false,"name":"1z0-082"},"currentPage":31},"__N_SSP":true}