{"pageProps":{"questions":[{"id":"8EKEzOjh1WDC9VXOAh6a","isMC":true,"url":"https://www.examtopics.com/discussions/cisco/view/69691-exam-300-410-topic-1-question-68-discussion/","question_id":586,"answers_community":["D (40%)","B (40%)","C (19%)","2%"],"answer_images":[],"exam_id":303,"unix_timestamp":1641669480,"answer_ET":"D","timestamp":"2022-01-08 20:18:00","discussion":[{"poster":"timtgh","timestamp":"1653844320.0","comment_id":"608858","content":"All answers are wrong. R1 and R4 do not see each other's routes because they are two hops apart. They need a route reflector between them, either R2 or R3.","upvote_count":"19","comments":[{"content":"Indeed the quality of the question is low. To have any solution work, you need to add neighbor config on top of the specified \"directly connected\". Spend you time well and understand why all are wrong.","comment_id":"1073075","upvote_count":"2","timestamp":"1700205000.0","poster":"Pietjeplukgeluk"}]},{"poster":"Iarn","upvote_count":"9","content":"Selected Answer: B\nDont think it possible to be D as the question clearly states there is ONLY BGP relationship between directly connected devices, D is only possible if you stand a BGP relationship between R1 & R4, then you have a full mesh and dont need route reflector at all. \n\n If R2 & R3 are RR clients and R4 The RR. R1 advertises to R2 & R3 they then pas the route to the reflector.","comment_id":"597910","comments":[{"content":"Ehm... wrong, if you have connectivity between loopback via an IGP (or static routing), you can configure peering between two routers that are not directly connected... in my opinion D is not correct, but only because R1 is a border router and it's better not to configure it as a RR","poster":"glbngl91","timestamp":"1676362860.0","upvote_count":"1","comment_id":"808199"}],"timestamp":"1651878720.0"},{"poster":"Aj_1993","content":"Selected Answer: B\nR4 will be RR Server and R2 and R3 will be the RR Clients.","upvote_count":"2","comment_id":"1348529","timestamp":"1738154580.0"},{"content":"Selected Answer: D\nD makes sense if you look at the wording of the answer\n\nConfigure R4 as route reflector client. This doesn't mean your configuring RR client on R4 it means your configuring RR client for R4 from R2 and R3s perceptive","upvote_count":"1","comment_id":"1337434","poster":"yololoy","timestamp":"1736224680.0"},{"comment_id":"1295896","timestamp":"1728632220.0","upvote_count":"1","comments":[{"poster":"tsamoko","upvote_count":"1","timestamp":"1728636180.0","comment_id":"1295928","content":"GUYS , SWITCH your brains off. The answers just saying the role, it doesn't really say make a router client with the other router as the server ( for example D , R1 RR and his client is R4) . C and D can work. So lets pick C : \n1) R1 is RR-client of R2 ---> R2 RR (for R1)\n2) R4 is RR (for R2) ---> R2 is RR-client for R4\n\n(so R2 is server for R1 and client for R4 ) ! \n\nAnd it can work with the same logic with D , but I chose C only because , of RR-client placement one the edge of AS."}],"poster":"tsamoko","content":"Perfect question Cisco , well done !! Professional level certification lol.\nAll questions are wrong , A and B for sure. \nC and D , also. If you go and place the command lets say for example for D, to make the R1 server and R4 client , there is an error command : \"% Specify remote-as or peer-group commands first.\" So you need to make R4 neighbor, so full mesh . So RR config is not needed and used. Same for C. In the end , we need to chose which wrong question is more correct/less wrong. So C ? cause edge router is RR clients ??"},{"timestamp":"1727131560.0","comment_id":"1288334","comments":[{"poster":"tubirubs","content":"So, if R4 is a RR, and R2 and R3 is RR_Client, the NLRI that R1 recive is adverstised to R2 and R3 from R4","comment_id":"1288336","upvote_count":"1","timestamp":"1727131680.0"}],"poster":"tubirubs","upvote_count":"1","content":"Selected Answer: B\nI think that is B, because 1st rule of router reflector: if a RR recive a NLRI from NON_RR_CLient, the RR advertise the NLRI to RR_Client and not advertise to another NON_RR_Client."},{"timestamp":"1726942920.0","content":"Selected Answer: A\nR1 is connected to the external network (AS 65520) via eBGP.\nR1, R2, R3, and R4 are in the same iBGP system (AS 65510).\nR5 is advertising the 192.168.100.0/24 network to R1 over eBGP.\nHowever, R4 is unable to reach the 192.168.100.0/24 network. This is likely because iBGP requires a full-mesh configuration by default, meaning that R4 doesn’t have a direct iBGP session with R1, and so it isn't learning the route to 192.168.100.0/24.\n\nSolution:\nTo fix this without needing full-mesh peering, R1 can be configured as a route reflector server, and R2 and R3 can be configured as route reflector clients. This way, R1 can reflect the route learned from R5 to the other routers in AS 65510, including R4.\n\nThe correct answer is: A\n\nA. Configure R1 as a route reflector server and configure R2 and R3 as route reflector clients.\n\nThis setup will ensure that R4 can learn the route to 192.168.100.0/24 from R1 through the route reflector mechanism.","comment_id":"1287437","poster":"galimuna","upvote_count":"1"},{"comments":[{"content":"R1 as RR and R4 as client means we establish a full mesh, not R4 gets the advertisement of R1, as it didnt get advertisement from iBGP. Now as long as R4 has route to next-hop to eBGP AS, D solves it","comment_id":"1264332","poster":"bk989","upvote_count":"1","timestamp":"1723417440.0"}],"comment_id":"1264331","upvote_count":"1","content":"D, R1 as an RR we build a full mesh, and as long as R4 has next hop reachability to outside then D solves it.","timestamp":"1723417380.0","poster":"bk989"},{"poster":"[Removed]","comment_id":"1249746","content":"Selected Answer: D\nim going with D","upvote_count":"1","timestamp":"1721230920.0"},{"timestamp":"1713959280.0","upvote_count":"1","content":"Selected Answer: B\nI vote for B.\nIt is best practice to not set EDGE ROUTER (R1) as Route Reflector","poster":"cloud29","comment_id":"1201314"},{"upvote_count":"1","content":"B: R1 is out, Can't set reflector at the edge of BGP, Must be centrally located to avoid issues. R4 makes sense to be reflector and the opposite, attached routers to be clients.","comment_id":"1185321","timestamp":"1711704960.0","poster":"Rachness"},{"content":"Selected Answer: C\nDefo C","upvote_count":"1","poster":"brownleaf","comment_id":"1166694","timestamp":"1709665560.0"},{"content":"D Clients may also receive routes from non-clients that have been reflected by the router reflector","comment_id":"1137838","poster":"Omar0563","upvote_count":"2","timestamp":"1706812740.0"},{"comments":[{"upvote_count":"1","comment_id":"1107275","content":"*only way for R4 to see the 192.168.100/24 route","timestamp":"1703721360.0","poster":"JonnyBingo"}],"content":"None of the answers are correct. Lab'd it up. Only way for R4 (based on the question's requirement for directly connected iBGP neighbors) is if R2 or R3 or both to have R4 config'd as a route-reflector-client.","comment_id":"1107273","timestamp":"1703721300.0","upvote_count":"3","poster":"JonnyBingo"},{"timestamp":"1703327520.0","upvote_count":"1","comment_id":"1103971","content":"R4 can only be a route reflector client of either R2 or R3 for the ping to work. This means for this scenario question there is no correct answer, all the answers are incorrect.","poster":"tinoe"},{"content":"D is the only one that works but even then only if there is a direct peering between the routers (and the diagram implies there isnt).","poster":"[Removed]","upvote_count":"1","timestamp":"1702131240.0","comment_id":"1091842"},{"timestamp":"1689002160.0","upvote_count":"2","content":"Selected Answer: D\nThe anwser correct is D, because, router 1 y router 4 have to be RR","poster":"inteldarvid","comment_id":"948232"},{"timestamp":"1688567520.0","poster":"SolidSnake74","upvote_count":"1","content":"Answer is A\nR4 can't reach 192.168.100.0/24\nIt means that R4 has most likely no routes received from any BGP neighbors.\nSo, by setting R1 as RR with R2 & R3 as clients, they will get the routes from remote AS via R1. \nThey can, then, just share it with their local neighbor which is R4.\n\nRoute reflector rule 3 says : If an RR receives a route from an eBGP peer, it advertises the route to RR clients and non-RR clients","comment_id":"943844"},{"upvote_count":"2","content":"Selected Answer: D\nD is correct","poster":"yasiramith","comment_id":"932336","timestamp":"1687594080.0"},{"timestamp":"1685762520.0","content":"Selected Answer: C\naccording to Cisco, R1 has to be RR client.\n\nhttps://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/212881-border-gateway-protocol-bgp-optimal-ro.html\n-The border routers must be RR clients of the RR.","poster":"shiro990127","upvote_count":"1","comment_id":"913214"},{"comments":[{"timestamp":"1685426040.0","poster":"HungarianDish_111","comments":[{"timestamp":"1685426040.0","content":"+R1 needs next-hop-self for sure.","poster":"HungarianDish_111","comment_id":"909951","upvote_count":"1"}],"content":"Normally, R2 OR R3 are the best candidates for becoming RR (the desired connection works without any further configurations), but such option is not given.\nIf setting up R1 or R4 as the RR, we need to add IGP or static routes, so R1 and R4 can become neighbors first. \nIn this case, we build a full mesh and we do not need any RR. \n\nThe question says: \"iBGP is configured for directly connected neighbors\". \n-> It does not mention, but does not exclude either an underlay routing being configured for R1 and R4 neighborship. So, it might be a full mesh.","upvote_count":"1","comment_id":"909950"}],"upvote_count":"3","timestamp":"1685425980.0","content":"I came to the same conclusion as others. Some information is missing from this question, or the question is different in the real exam.\nI tested all \"A\", \"B\", \"C\", \"D\" in CML. The design of \"A\" and \"B\" does not work. \"C\" and \"D\" worked, of course, but not because of the RR configuration. \n\nWe need to avoid setting the border router (R1) as RR. So, we can exclude \"A\" and \"D\".\nhttps://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/212881-border-gateway-protocol-bgp-optimal-ro.html","poster":"HungarianDish_111","comment_id":"909947"},{"comments":[{"content":"Solution \"C\" has the same result, but it has the advantage that it does not use the border router R1 as an RR. The thing is that: If we make R1 and R4 become neighbors, and configure next-hop-self on R1, then it works without RR. Only R2 or R3 work well as RR.","comment_id":"916050","upvote_count":"1","timestamp":"1686040140.0","poster":"HungarianDish_111"}],"upvote_count":"2","poster":"AinsB","content":"Selected Answer: D\nIBGP will not readvertise a BGP learnt route to another IBGP neighbor, that is why we need a RR so that the route can get to R4. If R1 is the RR it can be advertised to R4 because a TCP connection will be created. Based on this scenario R2 & R3 could be RR and accomplish the same thing but they are not a part of the answer , it would be a much better design though","comment_id":"903592","timestamp":"1684714680.0"},{"content":"I don't see a correct answer here, R2 and R3 will received routes from eBGP on R1 because is external so for R4 get those routes and R1 get routes from R4 you need to make them RRC on R2 and R3 with the command neighbor (ip) route-reflector-client for both R1 and R4. In that way R2 and R3 will send the routes to R4 and R1.","upvote_count":"2","poster":"Dacusai","comment_id":"881829","timestamp":"1682526540.0"},{"poster":"forccnp","timestamp":"1679639400.0","content":"Selected Answer: B\ni vote for B","comment_id":"849044","upvote_count":"1"},{"comment_id":"808197","upvote_count":"2","timestamp":"1676362680.0","poster":"glbngl91","content":"Selected Answer: C\nGuys, it's C in my opinion. I tried option A and B on GNS3 and both do not work, and this is obvious since R2 and R3 are not aware of being RR-client, so split horizon is enabled and they won't announce to R4 (answer A) or R1 (answer B) a network learned by another ibgp peer... Answer C and D both work, but the best practise is not to configure the RR on a border router, so for me it's C"},{"comment_id":"774798","upvote_count":"2","timestamp":"1673637780.0","poster":"toto89","content":"Selected Answer: C\nFor me C and D works, but C is better since its better not to place the RR on a boundary router."},{"upvote_count":"5","content":"I think it is D. R2 and R3 being server is implicit (you have to imagine this). I tested GNS all choices and D is the only that works.","poster":"christiannomarcenes","timestamp":"1662485100.0","comment_id":"661510"},{"upvote_count":"2","comment_id":"641359","poster":"doron1122","timestamp":"1659458460.0","content":"i think b\n\nr1 = EBGp \n2+3 ebgp to IBGP\n4 needs to be RR to get from R2 & R3\nSo i choose B"},{"content":"Selected Answer: B\nB is correct because is not the best practise to make a border router a RR","comments":[{"comment_id":"765395","poster":"ericxw","timestamp":"1672821660.0","upvote_count":"5","content":"when u do cisco exams no answer is best practice"}],"timestamp":"1657289100.0","upvote_count":"1","poster":"Reikidude00","comment_id":"628799"},{"upvote_count":"4","content":"?? I think there is no correct answer. \nwhy would R1 be configured as RR? I think either R2 or R3 RR and r1 and R4 RC","timestamp":"1656250800.0","comment_id":"622589","poster":"davdtech"},{"content":"Selected Answer: D\nThe correct answer is: D","upvote_count":"5","comment_id":"594519","poster":"xziomal9","timestamp":"1651243080.0"},{"poster":"Hack4","content":"D is the best Answer","upvote_count":"2","comment_id":"581112","timestamp":"1649146920.0"},{"comments":[{"content":"Agree, both C and D solve the issue. Maybe C because R1 is a busier router and it's preferred to use a router with less traffic? Who knows...","poster":"ookr","upvote_count":"1","timestamp":"1649832300.0","comment_id":"585052"}],"comment_id":"580685","upvote_count":"2","content":"The route to 192.168.100.0/24 can reach R4 only in case of C or D and both options solve the problem. A and B do not imply an iBGP session between R1 and R4. R2 and R3 do not pass routes through themselves further, since they are not reflectors.\n\nIt seems that with the missing problem, you need to choose a more optimal location for the RR. ...any ideas?","poster":"wts","timestamp":"1649073060.0"},{"upvote_count":"1","content":"Selected Answer: C\nBest option seems to be C because The border routers must be RR clients of the RR. \nhttps://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/212881-border-gateway-protocol-bgp-optimal-ro.html","timestamp":"1648927140.0","poster":"cyrus777","comment_id":"580003"},{"content":"Selected Answer: B\nEd394 answer is correct","timestamp":"1646772900.0","poster":"gndrx78","comment_id":"563536","upvote_count":"1"},{"upvote_count":"2","comment_id":"563531","timestamp":"1646772600.0","poster":"gndrx78","content":"IMHO is B since:\n- R1 cannot be RR, being on the edge of AS.\n- R4 can be RR but clients must be directly connected to him\nSo excluding A, C and D, it must be B"},{"comment_id":"561491","upvote_count":"2","timestamp":"1646492580.0","poster":"AliMo123","comments":[{"comment_id":"565031","poster":"gndrx78","timestamp":"1646944860.0","content":"you are right, just labbed it. The only solution is to set R2 or R3 as RR so they can act as bridge between R1 and R4, this means the answers are wrong and we have to pick one. I choose R4 as RR because R1 is on the edge of the AS as stated here:\nhttps://networkdirection.net/articles/routingandswitching/routereflectordesign/","upvote_count":"2","comments":[{"upvote_count":"1","timestamp":"1647829560.0","content":"i tried all the answer, none of them worked.\n\"There is no direct connection from R1 to R4\", so we're unable to configure anything to it. If we configure RR on R1 or R4, it will break the question already.\nIn my lab, configure R2 and R3 as RR, R1 as client so that 192.168.100.0/24 will be advertised to R4.","comment_id":"571931","poster":"LimRS","comments":[{"content":"You don't need a physical connection between R1 and R4, you only need a logical connection between R1 and R4. As long as R1 and R4 can open a TCP connection with each other, BGP is happy. You just need an IGP or static routes so R1 and R4 know how to reach each other..","comment_id":"585034","upvote_count":"1","timestamp":"1649830740.0","poster":"ookr"}]}]}],"content":"None of them is correct as I did lab every single of them"},{"comments":[{"content":"I got exactly the same question. R1 and R4 to form neighborship some additional routing in the underlay will be required. iBGP neighbors do not need to be directly connected, but of course that to form neighborship, they must have IP connectivity","poster":"diogodds","upvote_count":"1","comment_id":"574115","timestamp":"1648106580.0"}],"comment_id":"559321","content":"Can someone please explain how can R1 or R4 been a RR Server without both first becoming BGP neighbors first? Also if R1 and R4 forms BGP neighbor, there is no need for RR Server (on R1 or R4) since R4 would be able to see 192.168.100.0/24.","timestamp":"1646215320.0","poster":"kent2612","upvote_count":"3"},{"upvote_count":"3","content":"Selected Answer: B\nR1 and R4 aren't directly connected. R1 will pass the routes to R2 and R3. So R4 has to be the server and R2 and R3 have to be the clients.","comment_id":"559095","poster":"Ed394","timestamp":"1646182320.0"},{"poster":"Hack4","upvote_count":"1","comments":[{"comment_id":"563533","timestamp":"1646772720.0","upvote_count":"1","content":"why D is the best?","poster":"gndrx78"}],"content":"D is the best answer","timestamp":"1645096200.0","comment_id":"549323"},{"poster":"DonMike","timestamp":"1644337680.0","comments":[{"comments":[{"comment_id":"774797","upvote_count":"1","poster":"toto89","timestamp":"1673637720.0","content":"It could also be D in that case because If a Route comes form an eBGP peer the route reflector client also reflects it to all of its neighbor, including the RR. I would go for C since, it's always better not to place the RR on a ASBR router."}],"comment_id":"625127","timestamp":"1656578040.0","poster":"t1s","content":"I also choose D.\nIf a Route comes form an eBGP peer, Route Reflector reflects this to all the RR Clients in the Cluster and to Non Client peers.\nhttps://ipcisco.com/lesson/bgp-route-reflector/","upvote_count":"1"}],"content":"\"D\" works, but to avoid next-hop issues I added OSPF in the underlay. \n\nr4#show ip route bgp | begin Gateway\nGateway of last resort is not set\n\nB 192.168.100.0/24 [200/0] via 15.15.15.5, 00:08:19\nr4#\nr4#ping 192.168.100.1 \nType escape sequence to abort.\nSending 5, 100-byte ICMP Echos to 192.168.100.1, timeout is 2 seconds:\n!!!!!\nSuccess rate is 100 percent (5/5), round-trip min/avg/max = 3/3/4 ms\nr4#","comment_id":"543189","upvote_count":"3"},{"poster":"Nonono","timestamp":"1644052740.0","upvote_count":"4","comment_id":"540853","content":"Selected Answer: D\nTested this in a LAB. Answer D"},{"poster":"wts","comments":[{"comment_id":"563538","poster":"gndrx78","content":"Usually RR is not a BGP router on the edge","timestamp":"1646773020.0","upvote_count":"1"}],"timestamp":"1643873100.0","content":"Selected Answer: D\nHave you tried D? In general, C and D imply establishing a neighborhood between R1 and R4, and this would be sufficient without the settings of the RR. But it seems that setting R1 as RR is more strategically correct.","comment_id":"539459","upvote_count":"2"},{"upvote_count":"1","poster":"Carl1999","timestamp":"1643853900.0","comment_id":"539321","content":"C seems to be the answer.\nI think R1 needs next-hop-self command, but I wonder."},{"timestamp":"1643728140.0","upvote_count":"1","comments":[{"comment_id":"549673","timestamp":"1645126500.0","upvote_count":"2","poster":"YaPet","content":"Here is exactly pointed that iBGP is configured for directly connected neighbors."},{"content":"If you configure R1and R4 as neighbors without it being directly connected. this question is not make any sense, in this case, it will work without RRs at all\nI think it is a broken question","upvote_count":"1","poster":"Jenia1","timestamp":"1643798580.0","comment_id":"538591"}],"comment_id":"537942","content":"Yea just labbed it and its definitely C. You can configure R1and R4 as neighbors without it being directly connected. You also have to make sure you include the command network x.x.x.x mask x.x.x.x to advertise the network. The issue here is that R4 has a route to the R5 but R5 doesnt have the route back. Once you do the above commands R1 will advertise the 192 net to R4. You can also verify the route being reflected with command sh ip bgp x.x.x.x","poster":"[Removed]"},{"poster":"JingleJangus","comment_id":"535899","timestamp":"1643512200.0","upvote_count":"2","content":"Selected Answer: C\nLabbed it up and got C as a result."},{"content":"I labbed this in GNS3 and I could not get it to work with any of the given answers. If I configured R2 or R3 as an RR then it works.","comments":[{"poster":"[Removed]","upvote_count":"1","timestamp":"1643814540.0","content":"Did you establish the neighbor adjacency between R1 and R4? R4 has a route to R5, R5 just dont have the route back in.","comment_id":"538833"}],"upvote_count":"1","comment_id":"534033","timestamp":"1643309160.0","poster":"myrmike"},{"timestamp":"1642309560.0","poster":"tt15","content":"This question doesn't make sense…\nIf A or B done, R2 and R3 will not advertise 192.168.100.0 prefix to R4 since they are iBGP neighbor.\nC will not best way because R4 will advertise 192.168.100.0 prefix to R2 and R3. Finally R2 and R3 have two routes from both R1 and R4.\nI will choose D at last, though don't need to configure R4 as route reflector client, just neighbor is enough…","comment_id":"524631","upvote_count":"2"},{"comment_id":"521685","poster":"gndrx78","timestamp":"1641924180.0","content":"Cannot be C or D since routers should be directly connected. I would go for B because better have RR not on border.","upvote_count":"2"},{"timestamp":"1641669480.0","content":"B I think no ?","comment_id":"519736","poster":"geek1992","upvote_count":"1"}],"question_text":"Refer to the exhibit.\n//IMG//\n\nAS65510 iBGP is configured for directly connected neighbors. R4 cannot ping or traceroute network 192.168.100.0/24.\nWhich action resolves this issue?","topic":"1","choices":{"A":"Configure R1 as a route reflector server and configure R2 and R3 as route reflector clients.","B":"Configure R4 as a route reflector server and configure R2 and R3 as route reflector clients.","D":"Configure R1 as a route reflector server and configure R4 as a route reflector client.","C":"Configure R4 as a route reflector server and configure R1 as a route reflector client."},"answer_description":"","question_images":["https://www.examtopics.com/assets/media/exam-media/04302/0009600001.png"],"answer":"D"},{"id":"bZmsJg9UIXfZ9Br9jV43","answer_ET":"D","answer":"D","question_id":587,"answers_community":["D (100%)"],"exam_id":303,"answer_images":[],"timestamp":"2022-04-29 16:55:00","choices":{"A":"Configure the area range command on the ASBR.","D":"Configure the area range command on the ABR.","B":"Configure the summary-address command on the ASBR.","C":"Configure the summary-address command on the ABR."},"url":"https://www.examtopics.com/discussions/cisco/view/74911-exam-300-410-topic-1-question-69-discussion/","discussion":[{"content":"Selected Answer: D\nThe question is stupid, but it is indeed D, as that is only thing that makes sense. Anyway, what a bad question.","poster":"Pietjeplukgeluk","upvote_count":"5","comments":[{"poster":"bk989","timestamp":"1725172140.0","comment_id":"1275895","content":"yup the question can be interpreted in different ways. D is the answer though.","upvote_count":"1"}],"comment_id":"1236503","timestamp":"1719249360.0"},{"comment_id":"1249749","poster":"[Removed]","content":"Selected Answer: D\nD is correct","timestamp":"1721231100.0","upvote_count":"1"},{"upvote_count":"3","content":"D is correct answer\n\nThe area range command is used only with area border routers (ABRs). It is used to consolidate or summarize routes for an area. The result is that a single summary route is advertised to other areas by the ABR. Routing information is condensed at area boundaries. External to the area, a single route is advertised for each address range.","timestamp":"1657121700.0","comment_id":"627963","poster":"Nhan"},{"poster":"piojo","content":"Answer should be:\n\nD. Configure the area range command on the ABR CORRECTLY","timestamp":"1654170720.0","upvote_count":"2","comment_id":"610575"},{"comment_id":"608861","content":"All answers are wrong. A and C have invalid syntax. B is for ASBRs, not relevant here. D is the only command that makes sense, but that is the command that was already used to configure the summarization.","poster":"timtgh","upvote_count":"1","timestamp":"1653844620.0"},{"timestamp":"1651244100.0","content":"Selected Answer: D\nThe correct answer is: D","poster":"xziomal9","comment_id":"594531","upvote_count":"1"}],"answer_description":"","question_text":"Users report issues with reachability between areas as soon as an engineer configured summary routes between areas in a multiple area OSPF autonomous system.\nWhich action resolves the issue?","unix_timestamp":1651244100,"isMC":true,"question_images":[],"topic":"1"},{"id":"fIHx8alsLVTyrpwoZydv","answer":"C","isMC":true,"topic":"1","answer_ET":"C","question_id":588,"answer_description":"","discussion":[{"content":"Selected Answer: C\nthe command \"summary-address\" is used to summary external routes (O E1/2) in ASBR. The command \"redistribute static\" in the question makes the router a ASBR.\n\n To summary inter area routes into ABRs you use \"area x range\" command.\n\nIn both cases the summary route is advertised only if the RIB has a route that matches the summary prefix.","upvote_count":"10","comment_id":"897602","poster":"Malasxd","timestamp":"1684073760.0"},{"timestamp":"1727236440.0","poster":"MasoudGhorbani","upvote_count":"3","content":"C is correct. OSPF will only generate a summary route if there are specific subnets within the summary range that are active in the routing table since there are no routes within the 10.0.0.0/8 network in the routing table, OSPF has no more specific routes to summarize and therefore the summary route is not generated. The summary-address command is used on OSPF ASBR.","comment_id":"1159059"},{"upvote_count":"2","content":"Selected Answer: C\nC is correct","timestamp":"1721158860.0","comment_id":"1249188","poster":"[Removed]"},{"poster":"conft","comment_id":"987015","upvote_count":"1","timestamp":"1692672420.0","content":"given answer is the correct."},{"comment_id":"631779","content":"I have tested in lab, the summary-address only worked if you have the valid route on your routing table.","upvote_count":"3","timestamp":"1657893120.0","poster":"Alexloh"},{"content":"What about A? this is not an ABR, it only has area 0","poster":"tefacert","comment_id":"602971","comments":[{"comment_id":"608527","content":"This summary command is not for ABRs, it's for ASBRs, so Option A is wrong.","timestamp":"1653770400.0","upvote_count":"2","poster":"timtgh"}],"timestamp":"1652800320.0","upvote_count":"1"},{"timestamp":"1642773360.0","comment_id":"529173","content":"Selected Answer: C\nThe given answer is correct","upvote_count":"1","poster":"Jenia1"},{"poster":"Stivostine","comment_id":"502820","timestamp":"1639650120.0","upvote_count":"1","content":"Selected Answer: C\nC is ok"},{"upvote_count":"1","content":"The given answer is correct","comment_id":"447602","timestamp":"1632056640.0","poster":"error_909"}],"question_images":["https://www.examtopics.com/assets/media/exam-media/04302/0001300001.png"],"answers_community":["C (100%)"],"url":"https://www.examtopics.com/discussions/cisco/view/58989-exam-300-410-topic-1-question-7-discussion/","unix_timestamp":1627664700,"choices":{"A":"The summary-address command is used only for summarizing prefixes between areas.","B":"The summary route is visible only in the OSPF database, not in the routing table.","D":"The summary route is not visible on this router, but it is visible on other OSPF routers in the same area.","C":"There is no route for a subnet inside 10.0.0.0/8, so the summary route is not generated."},"timestamp":"2021-07-30 19:05:00","answer_images":[],"question_text":"Refer to the exhibit. An engineer is trying to generate a summary route in OSPF for network 10.0.0.0/8, but the summary route does not show up in the routing table.\nWhy is the summary route missing?\n//IMG//","exam_id":303},{"id":"7EOUCWU3QxaI2C10o2p4","topic":"1","answer":"A","url":"https://www.examtopics.com/discussions/cisco/view/70119-exam-300-410-topic-1-question-70-discussion/","answer_description":"","discussion":[{"comment_id":"1275897","upvote_count":"4","timestamp":"1725172380.0","content":"There is only one valid command:\n\nC1(config-router)#int L0\nC1(config-if)#\nC1(config-if)#\nC1(config-if)#\nC1(config-if)#\nC1(config-if)#ip ospf net\nC1(config-if)#ip ospf network\nC1(config-if)#ip ospf network\nC1(config-if)#ip ospf network br\nC1(config-if)#ip ospf network broadcast\nC1(config-if)#ip ospf network broadcast\nC1(config-if)#ip ospf network broadcast\n% OSPF: Invalid type for interface Loopback0\nC1(config-if)#ip ospf interface type network\n ^\n% Invalid input detected at '^' marker.\n\nC1(config-if)#ip ospf interface area 10\n ^\n% Invalid input detected at '^' marker.\n\nC1(config-if)#ip ospf network point-to-point\nC1(config-if)#","poster":"bk989"},{"content":"Selected Answer: A\nA is correct","upvote_count":"1","comment_id":"1249752","poster":"[Removed]","timestamp":"1721231280.0"},{"content":"The network type broadcast is not accepted in the loopback interfaces.\n\nR4(config-if)#ip ospf network broadcast\n% OSPF: Invalid type for interface Loopback0\n\nSo for allow to exchange the loopback as not as a /32 network the only option that we have is use the command ip ospf network point-to-point command under the loopback interface","upvote_count":"3","comments":[{"content":"In case you are going to redistribute the loopbacks instead of advertising these loopbacks with the network command then they will be advertised with the /24 even without the ip ospf network point-to-point command under the loopbacks\n\nR4#show running-config interface lo0\nBuilding configuration...\n\nCurrent configuration : 62 bytes\n!\ninterface Loopback0\n ip address 10.1.0.1 255.255.255.0\nend\n\nR4#sho\nR4#show run\nR4#show running-config | sec router\nrouter ospf 1\n redistribute connected subnets\n network 192.168.24.0 0.0.0.3 area 0\n network 192.168.34.0 0.0.0.3 area 0\nR4#","comments":[{"poster":"XBfoundX","timestamp":"1717939800.0","upvote_count":"1","comment_id":"1227341","content":"R1#show ip route 10.1.0.0\nRouting entry for 10.1.0.0/24\n Known via \"ospf 1\", distance 110, metric 20, type extern 2, forward metric 20\n Last update from 192.168.12.2 on Ethernet0/0, 00:16:54 ago\n Routing Descriptor Blocks:\n * 192.168.13.2, from 10.4.0.1, 00:16:54 ago, via Ethernet0/1\n Route metric is 20, traffic share count is 1\n 192.168.12.2, from 10.4.0.1, 00:16:54 ago, via Ethernet0/0\n Route metric is 20, traffic share count is 1\nR1#"}],"poster":"XBfoundX","timestamp":"1717939740.0","upvote_count":"1","comment_id":"1227340"}],"comment_id":"1227325","poster":"XBfoundX","timestamp":"1717936080.0"},{"poster":"heeeeyajoke","comment_id":"750231","upvote_count":"2","timestamp":"1671481620.0","content":"I have tested the lab, i could still reach the loopback, OSPF advertised a /32 route for the loopback by default. But i would go for the option A for the exam"},{"timestamp":"1668108420.0","poster":"anaisa_goncalves","content":"Here's the explanation:\nhttps://networkengineering.stackexchange.com/questions/13099/why-do-we-use-ospf-point-to-point-networks-for-loopbacks","comment_id":"715506","upvote_count":"2"},{"poster":"Carl1999","comments":[{"comment_id":"566019","content":"The question is really horrible as mentioned by @bogd, with the current interface and ospf configuration, the loopback would also be reachable.","comments":[{"content":"Fully correct, the loopback would be reachable however it would advertise /32 instead of a /24. So there is no need to correct any configuration, changing it would only advertise different mask, but you would not be able to reach any other interface in the actual advertised network. Stupid question.","timestamp":"1700387760.0","comment_id":"1074559","poster":"Pietjeplukgeluk","upvote_count":"1"}],"upvote_count":"4","timestamp":"1647077700.0","poster":"diogodds"}],"comment_id":"539360","timestamp":"1643857740.0","upvote_count":"4","content":"Selected Answer: A\nLoopbacks are considered host routes in Open Shortest Path First (OSPF). \nTo make OSPF advertise the loopback subnet as the actual subnet with the loopback mask, instead of as host route /32, issue the ip ospf network point-to-point command under the loopback interface.\nFor more information, refer to the 9.1. Interface States section of RFC 2328."},{"timestamp":"1642340280.0","poster":"palihaff","comments":[{"upvote_count":"2","poster":"OhBee","comments":[{"content":"Having the route advertised as a /24 or /32 really doesn't matter - 4.4.4.4 would be reachable in both cases. The phrasing of the question is absolutely terrible...","comment_id":"553129","comments":[{"comment_id":"610576","poster":"piojo","upvote_count":"1","timestamp":"1654170900.0","content":"Point is that if you configured the loopback as a /24 is because you need the whole /24 to be advertised as well (for other purposes like NATed addresses). Otherwise you would configure the loopback as /32."}],"poster":"bogd","upvote_count":"7","timestamp":"1645469940.0"}],"timestamp":"1642753740.0","comment_id":"529020","content":"I believe it is because the route is advertised as a /32 (since OSPF does that by default for loopback interfaces). In order for it to be advertised properly as a /24, the configuration shown in A should be done."}],"comment_id":"524968","content":"I understand the answ, but please, somebody explain, to me how the original config can make 4.4.4.4 unreachable. Thanks !","upvote_count":"3"}],"answer_images":[],"isMC":true,"choices":{"D":"interface loopback0 ip address 4.4.4.4 255.255.255.0 ip ospf interface type network","A":"interface loopback0 ip address 4.4.4.4 255.255.255.0 ip ospf network point-to-point","B":"interface loopback0 ip address 4.4.4.4 255.255.255.0 ip ospf interface area 10","C":"interface loopback0 ip address 4.4.4.4 255.255.255.0 ip ospf network broadcast"},"answers_community":["A (100%)"],"timestamp":"2022-01-16 14:38:00","exam_id":303,"answer_ET":"A","question_text":"Refer to the exhibit.\n//IMG//\n\nWhich set of commands restore reachability to loopback0?","unix_timestamp":1642340280,"question_images":["https://www.examtopics.com/assets/media/exam-media/04302/0009800001.png"],"question_id":589},{"id":"kx8j8gH9GOVTUDbvD3aH","answer_ET":"A","unix_timestamp":1643514900,"question_images":["https://www.examtopics.com/assets/media/exam-media/04302/0010000001.png","https://www.examtopics.com/assets/media/exam-media/04302/0010100001.png"],"topic":"1","choices":{"A":"route-map SETLP permit 10 match ip address prefix-list PLIST1 set local-preference 99 route-map SETLP permit 20","B":"router bgp 111 no neighbor 192.168.10.1 route-map SETLP in neighbor 192.168.20.2 route-map SETLP in","D":"router bgp 111 no neighbor 192.168.10.1 route-map SETLP in neighbor 192.168.10.1 route-map SETLP out","C":"route-map SETLP permit 10 match ip address prefix-list PLIST1 set local-preference 110 route-map SETLP permit 20"},"answer":"A","timestamp":"2022-01-30 04:55:00","question_id":590,"answers_community":["A (85%)","C (15%)"],"answer_images":[],"url":"https://www.examtopics.com/discussions/cisco/view/70826-exam-300-410-topic-1-question-71-discussion/","question_text":"//IMG//\nAS 111 wanted to use AS 200 as the preferred path for 172.20.5.0/24 and AS 100 as the backup. After the configuration, AS 100 is not used for any other routes.\n//IMG//\nWhich configuration resolves the issue?","exam_id":303,"discussion":[{"content":"Selected Answer: A\nA works because the default local pref is 100. Making the local pref 99 will decrement the quality of the route enough to install the route from AS200 into the RIB. \n\nThe reason traffic wasnt using AS100 for any other routes is because of the logic of the route map. Seq 10 matches on a specific range of ip's. Therefore traffic that doesnt match that range will move onto the next seq #, but in our case there is none so all other traffic hits the implicit deny at the end of the route map. Adding a seq 20 to match on all traffic (not having a match statement) will allow all other NLRI thru from AS100 to AS111.","poster":"JingleJangus","comment_id":"535913","upvote_count":"15","timestamp":"1643514900.0"},{"content":"Selected Answer: C\nOption C adjusts the local preference for routes matching prefix-list PLIST1 (which should contain the prefix 172.20.5.0/24) and sets the local-preference to 110, which will make AS 200 the preferred path. The permit 20 in the second route-map statement ensures that all other routes are allowed without changing their local preference.","poster":"Sammy3637","comment_id":"1360816","timestamp":"1740361740.0","upvote_count":"1"},{"poster":"131dac4","comment_id":"1351602","upvote_count":"1","content":"Selected Answer: A\nsetting the local preference to a value under the default of 100, will make as 200 the preferred egress. However, what was actually needed for this scenario was the second sequence in the routemap; putting the permit in front of the implicit deny.","timestamp":"1738709220.0"},{"poster":"[Removed]","timestamp":"1721231580.0","upvote_count":"1","content":"Selected Answer: A\nA is correct","comment_id":"1249759"},{"upvote_count":"2","content":"Selected Answer: C\ncorrect answer is C, higher local preference is preferred","poster":"AinsB","timestamp":"1684110600.0","comments":[{"timestamp":"1684847460.0","upvote_count":"2","comment_id":"904936","content":"I am correcting my answer to \"A\" for the reason that we need to route to go to AS200 so if we drop the local preference to 99 for AS100 the route will prefer AS200 \"BUT\" note that there is an implicit deny at the end of the prefix list/access list that we need to override so that other routes an take this path. This is the trick of these exam questions \"good review\"","poster":"AinsB"}],"comment_id":"897946"},{"content":"A is correct","comment_id":"721601","poster":"Noproblem22","upvote_count":"1","timestamp":"1668809580.0"}],"answer_description":"","isMC":true}],"exam":{"name":"300-410","isBeta":false,"lastUpdated":"12 Apr 2025","provider":"Cisco","numberOfQuestions":620,"id":303,"isMCOnly":false,"isImplemented":true},"currentPage":118},"__N_SSP":true}