{"pageProps":{"questions":[{"id":"PFGhR1K4ZHmTOjxehE6L","answer_description":"","question_text":"Following a recent security breach, a company decides to investigate account usage to ensure privileged accounts are only being utilized during typical business hours. During the investigation, a security analyst determines an account was consistently utilized in the middle of the night. Which of the following actions should the analyst take NEXT?","discussion":[{"comment_id":"538051","comments":[{"poster":"mhop321","content":"Totally agree that they might be an insider threat so wouldn't be D, however it states there has been a security breach so I assume the IR plan has already initiated? As there is an ongoing investigation?","comment_id":"792924","upvote_count":"1","timestamp":"1675089240.0"},{"poster":"Joshey","comment_id":"835920","content":"So I'll go with B","upvote_count":"1","timestamp":"1678535160.0"},{"upvote_count":"2","poster":"2Fish","timestamp":"1679440320.0","comment_id":"846435","content":"Agree. Following a breach, meaning post breach where that incident is likely over. Then company decides to monitor off hour logins. Discovers a pattern, what happens next? We initiate the IR plan as this event has kicked off a new investigation. Through the IR process we will find out if it is or is not related to the previous breach."},{"content":"I'm going to have to agree with B - initiate IR plan. The threat of an insider makes me think answer D is not a good idea. Yes the activity may be legitimate, but it can also be nefarious. Better to over-react then under-react and tip off an insider about an investigation.","comment_id":"543356","poster":"mmm55555","timestamp":"1644356880.0","upvote_count":"8"}],"timestamp":"1643733840.0","poster":"JayMus","content":"I think initiating an IR plan will be the best, because the employee might be an insider threat or maybe he might be using it for other reasons. Approaching him without first knowing his intent will be a bad idea.","upvote_count":"25"},{"comments":[{"upvote_count":"1","comment_id":"775770","timestamp":"1673716620.0","content":"Pls disregard my last reply. The question said that it was consistent. No one is patching every night. Could be a service running under a user account instead of a service account, like it should.","poster":"NickDrops"},{"comment_id":"747396","poster":"White_T_10","timestamp":"1671208080.0","upvote_count":"1","content":"I agree. A it is"},{"upvote_count":"2","timestamp":"1673716500.0","comment_id":"775768","content":"Midnight patches and upgrades are a thing. Hopefully, they have an incident response plan for such occasions. I'd hope that one of the 1st steps in that plan would be to check change controls that were planned.","poster":"NickDrops"}],"comment_id":"705937","timestamp":"1666906620.0","upvote_count":"13","content":"Selected Answer: A\nRead the question everyone. There’s been a security breach, there’s already an ongoing investigation, the only correct option is A. The activity is being conducted during non-business hours, that alone is a policy violation. Not D. Not B either because there’s already an ongoing investigation. The next step is to contain.","poster":"forklord72"},{"content":"Selected Answer: B\nB. Initiate the incident response plan.","timestamp":"1721472240.0","upvote_count":"1","comment_id":"1251705","poster":"zecomeia_007"},{"upvote_count":"2","content":"Selected Answer: D\nAs someone who works in a SOC environment, the first thing you do after seeing a user related suspicious behavior is reach out to the user first. Answer is D.","poster":"[Removed]","comment_id":"1081159","comments":[{"timestamp":"1701316380.0","poster":"Sebatian20","content":"I think B is the correct answer. \n\nThe IR plan MIGHT includes reaching out to the user, but it will also contain a flow chart of what to do after.","comment_id":"1083975","upvote_count":"2","comments":[{"upvote_count":"2","poster":"[Removed]","timestamp":"1701409560.0","comment_id":"1084970","content":"I agree what you are saying but just because a user is working during off-hours, it doesn't automatically correlate to the user is doing something bad. You ask the user what they are doing and based on that and the logs you determine the next step."}]}],"timestamp":"1701054600.0"},{"timestamp":"1700316120.0","content":"Selected Answer: B\nFOLLOWING a recent security breach, meaning that breach has already been dealt with. They are investigating potential issues after already resolving the incident, finding a suspicious privileged account should initiate the incident response process. It's absolutely NOT D since it could be an insider threat. A could also be a bad choice since you would immediately alert the attacker.","poster":"dickchappy","upvote_count":"1","comment_id":"1074037"},{"timestamp":"1698989100.0","poster":"Chilaqui1es","upvote_count":"3","content":"Selected Answer: D\nI spent too much time reviewing this question but hear me out....\nIt sounds like D is the answer. Its a tricky worded question. \n\"FOLLOWING a recent security breach (it doesnt say during) ...a company decides to INVESTIGATE account usage... \" \nIRP should not be implemented because there is no proof this is a actual breach thus it should be investigated (as said in the question) \"Review the activity with the user.\" to find out more information before going in to IRP.\nThe account should not be disabled before investigating.","comment_id":"1061095"},{"upvote_count":"1","timestamp":"1698606900.0","comment_id":"1057093","content":"Selected Answer: D\nProbably answer will be disabling the account but at first I will review logs to get more info about this activity then I will disable it","poster":"AhmedSameer"},{"comment_id":"1008538","timestamp":"1694789940.0","content":"what sucks is that it doesn't say a PRIV account was consistently accessed in the middle of the night...","poster":"Dree_Dogg","upvote_count":"1"},{"upvote_count":"1","timestamp":"1694410500.0","comment_id":"1004469","poster":"Big_Dre","content":"Selected Answer: B\ninitiate incident repose plan. it might include reviewing with the account user or disabling the account."},{"content":"Selected Answer: B\nbest option","comment_id":"1004468","poster":"Big_Dre","timestamp":"1694410260.0","upvote_count":"1"},{"content":"Selected Answer: B\nB seems to be the best answer. Follow the IRP/SOP and get more eyes on this.","poster":"Dree_Dogg","comment_id":"1001778","upvote_count":"1","timestamp":"1694107200.0"},{"comments":[{"poster":"Dree_Dogg","upvote_count":"1","comment_id":"1001771","content":"congrats! i wonder where the CS0-002 questions will come from!","timestamp":"1694106960.0"},{"content":"Kickuh06 which answer is it since you just took the exam?","comment_id":"977764","upvote_count":"1","poster":"douglas_smith1","timestamp":"1691677740.0"}],"timestamp":"1691409840.0","poster":"Kickuh06","upvote_count":"3","content":"Passed CS0-003 last week (757), this question was on it! 69 questions, 3 PBQ/SIMs. 25 questions that are in the first 200 questions of this board.","comment_id":"974667"},{"timestamp":"1690957560.0","upvote_count":"2","content":"Selected Answer: B\nRead Below - \nAn Incident Response Plan is a written document, formally approved by the senior leadership team, that helps your \norganization before, during, and after a confirmed or suspected security incident. Your IRP will clarify roles and \nresponsibilities and will provide guidance on key activities. It should also include a cybersecurity list of key people \nwho may be needed during a crisis.","comments":[{"content":"In this case - the guy with Privileged Acct is suspected","upvote_count":"1","comment_id":"969780","poster":"attesco","timestamp":"1690957680.0"}],"comment_id":"969779","poster":"attesco"},{"upvote_count":"1","comment_id":"966652","timestamp":"1690667100.0","poster":"rg00","content":"Selected Answer: D\nI won't do any action without conducting further investigation."},{"comment_id":"939772","upvote_count":"1","content":"Selected Answer: B\nReviewing the activity with the user is part of the incident response, disabling the account is not a good option as the activity might have been legitimate. HR is not an option at this point.","poster":"MartinRB","timestamp":"1688202660.0"},{"content":"D -\nDisabling the privileged account or initiating the incident response plan without further investigation could be an overreaction and may cause unnecessary disruption to business processes. Reporting the discrepancy to human resources may be necessary at some point, but it should not be the first immediate action.\n\nThe next step should be to review the activity with the user to determine if there is a legitimate reason for accessing the account during non-business hours. This conversation can provide further insight into the situation and help the security analyst determine if any malicious activity or policy violations have occurred. Based on the outcome of the conversation, the analyst can then take appropriate actions such as escalating the issue or disabling the account.","upvote_count":"2","timestamp":"1687187700.0","comment_id":"927625","poster":"Nouuv"},{"content":"Selected Answer: A\nI believe the answer is A because the company has a recent security breach, it make sense here that incident response is still on-going. We tend to isolate or contain it first for checking.","upvote_count":"1","comment_id":"873241","poster":"JoshuaXIV","timestamp":"1681785780.0"},{"comment_id":"872282","poster":"RSOC101","timestamp":"1681696140.0","upvote_count":"1","content":"This is a privileged account, and if compromised could be causing a lot more problems than what's been observed. The NEXT step is to disable it. After that you can ask the user, and enable it if it was expected, initiate an incident response plan if unexpected. Contacting HR would be the last step, if there is reason to believe this user is causing malicious activity purposely. Answer is A."},{"upvote_count":"1","poster":"alayeluwa","comment_id":"866483","timestamp":"1681147860.0","content":"Selected Answer: A\nYou are investigating a data breach (IR team is already activated).\nYou found out that an account has been accessing the network at night when it’s not supposed to be happening. Why would you want to do D first? What if the user have nothing to tell you because they truly do not know that their account is being used at night? \n\nI’d disable the shh first and then get the facts from them."},{"poster":"kiduuu","timestamp":"1680784800.0","upvote_count":"1","comment_id":"862960","content":"Selected Answer: B\nAn account consistently being utilized in the middle of the night when it is not typical business hours is an indication of suspicious activity that requires immediate attention. The incident response plan should outline the specific steps that the company needs to take in response to a security incident, including identifying the extent of the damage, containing the incident, eradicating the cause, and recovering from the incident.\n\nBy initiating the incident response plan, the company can determine the scope and severity of the security breach, investigate the cause of the suspicious account activity, and take appropriate actions to contain and mitigate the damage caused by the breach."},{"comment_id":"860973","timestamp":"1680608940.0","content":"Selected Answer: D\nD. Review the activity with the user.\n\nBefore taking any drastic action, it's important to gather more information and investigate the situation further. The security analyst should speak with the user who was utilizing the privileged account during the night to understand why this was happening. It's possible that there is a valid reason for this activity, such as performing critical maintenance tasks during off-hours. Alternatively, it could be a sign of malicious activity. By reviewing the activity with the user, the security analyst can determine whether further action is needed, such as disabling the account, initiating the incident response plan, or reporting the discrepancy to human resources.","poster":"HereToStudy","upvote_count":"1"},{"timestamp":"1680305100.0","upvote_count":"2","poster":"Cookieman","comment_id":"857473","content":"The word INVESTIGATE is used twice here. They didn’t say REMEDIATE, they say INVESTIGATE"},{"poster":"Joshey","comment_id":"835922","upvote_count":"1","timestamp":"1678535220.0","content":"Selected Answer: B\nhttps://www.cisa.gov/sites/default/files/publications/Incident-Response-Plan-Basics_508c.pdf An Incident Response Plan is a written document, formally approved by the senior leadership team, that helps your\norganization before, during, and after a confirmed or suspected security incident"},{"upvote_count":"1","content":"Selected Answer: D\nWe must not action before reviwe the users activity. So, A and B out. Also, we dont write report about topic that we have dont knowledge. I am going with d.","timestamp":"1676227440.0","poster":"absabs","comment_id":"806679"},{"content":"Selected Answer: D\nThe late night account usage identified may not necessarily be an issue. How do you find out if it could be? You ask, it's that simple. D","timestamp":"1676222700.0","upvote_count":"2","poster":"AaronS1990","comment_id":"806605","comments":[{"comment_id":"807421","upvote_count":"2","content":"When it could be an insider threat?","timestamp":"1676294280.0","poster":"mhop321"},{"poster":"absabs","upvote_count":"2","timestamp":"1676493360.0","content":"i agree with you, first thing is reviewing..","comment_id":"809962"}]},{"timestamp":"1675713900.0","content":"Selected Answer: D\nThe next step should be to review the activity with the user to determine the reason for the unusual behavior. This could be due to a legitimate reason, such as working on an important project outside of normal business hours, or it could be indicative of malicious activity. The review with the user will allow the security analyst to gather additional information and determine the best course of action, which may include disabling the privileged account or initiating the incident response plan, as well as reporting the discrepancy to human resources if necessary.","poster":"gnnggnnggnng","upvote_count":"2","comment_id":"800219"},{"content":"Selected Answer: D\nI would say the first thing you would always do is review the activity. I suppose the argument could be raised that you could always unblock it later if it's a false alarm but i don't think that's what they're going for","comment_id":"798830","timestamp":"1675601820.0","poster":"AaronS1990","upvote_count":"1"},{"poster":"IanRogerStewart","content":"Selected Answer: D\nI'm assuming that the IR has already been initiated due to the recent breach and that this is the clean up stage of that plan. Talking to the user will take 5 minutes and if there's not a good explanation then disabling the account and escalating is easy enough to do afterwards.","upvote_count":"1","comment_id":"798493","timestamp":"1675554900.0"},{"timestamp":"1675080300.0","content":"Correct is A. Disable privilege account, 2. investigate including review with the user. based on the info open IR","upvote_count":"1","poster":"MokokaR","comment_id":"792713"},{"upvote_count":"2","comments":[{"poster":"mhop321","timestamp":"1675089120.0","comment_id":"792923","upvote_count":"2","content":"When they could be an insider threat?"}],"comment_id":"787729","timestamp":"1674656460.0","content":"Got to agree with @ CyberNoob404. First thing on any suspicious account activity is, QUESTION THE USER!! then take it from there. If I get this in the exam I will pick D.","poster":"Stiobhan"},{"timestamp":"1674155940.0","content":"Selected Answer: D\nD is correct","poster":"david124","comments":[{"comment_id":"787761","poster":"mhop321","upvote_count":"1","content":"When they could be an insider threat?","timestamp":"1674658500.0"}],"upvote_count":"1","comment_id":"781520"},{"poster":"david124","content":"Selected Answer: C\nC is correct","upvote_count":"1","timestamp":"1674155880.0","comment_id":"781519"},{"content":"Selected Answer: B\nchat GPT says B","timestamp":"1674096360.0","comment_id":"780663","poster":"david124","upvote_count":"1","comments":[{"timestamp":"1675954980.0","poster":"CatoFong","comment_id":"803356","upvote_count":"1","content":"Also says D."}]},{"content":"The IR is already in place.\nBased on my experience first I would disable the account first and then I would indagate with the user because at least I contained the potential attack/breach using this user's credentials. So I will choose option A. Then I can go and ask the owner of this account and grab answers.","timestamp":"1673760540.0","poster":"db97","comment_id":"776180","upvote_count":"2"},{"comments":[{"poster":"catastrophie","upvote_count":"2","comment_id":"791915","timestamp":"1675015740.0","content":"A. Because it's a great precaution to take. It's like an officer arriving to a scene where a crime has taken place and they see an individual walking around with a pistol. They are not going to go chat it up with him while checking out the scene. His weapon is going to be taken and then questions asked regardless if he was the perpetrator or not. Same thing here, the potential perpetrator is the user and his weapon is his privileged account. \nB. As states, it's already in progress.\nC. 1000000% needs to be done before the user is brought in to speak about the issues. HR needs to be not only made aware but must be present in all interactions dealing with employees and investigations. Try to speak with, question, or interrogate an employee without HR in regards to a legal issue and see how that plays out.\nD. Absolutely needs to be done.\n\nPicture this situation as the criminal activity I put above. Arrive on the scene, see a crime, de-arm possible suspect, suspect should have lawyers present prior to questioning."}],"content":"Selected Answer: D\n\"FOLLOWING a RECENT security breach (already happened), a company DECIDES to investigate account usage to ENSURE privileged accounts are only being utilized during typical business hours\" (Proactivly investigating to ENSURE the accounts are properly being utilized based on the RECENT security breach, not ACTIVE security breach, past tense)\n\n\"DURING the INVESTIGATION, a security analyst determines an account was consistently utilized in the middle of the night.\" (This happened only during the INVESTIGATION, not during the RECENT security breach)\n\n\"Which of the following actions should the analyst take NEXT?\"\n\nA. Why would you disable the privileged account NEXT if you do not know WHY its being used at night?\n\nB. Why would you initiate an incident response plan if you have not DETERMINED WHY the account is being used at night?\n\nC. This is an obvious wrong answer, HR has nothing to do with this.\n\nD. Review the activity with the user (This will help you determine WHY the privileged is being used at night, which in my opinion in the appropriate NEXT action)","upvote_count":"4","timestamp":"1673542140.0","poster":"CyberNoob404","comment_id":"773710"},{"upvote_count":"1","poster":"f3lix","timestamp":"1672596600.0","comment_id":"763293","comments":[{"timestamp":"1673716800.0","upvote_count":"1","poster":"NickDrops","comment_id":"775772","content":"If that was the case, Comptia would be pretty smart. Some of these questions have bad, decent/meh, good, and best answers. If partial credit is a thing, that'd be really intuitive!"}],"content":"I am begining to think that for this type of question - Comptia is looking to fail whoever pics the most ridiculous answer. Given that the context isnt particularly clear, I'll attend to this in this order: B - A - Maybe D, I'm not responsible for C."},{"content":"A is not possible: Disabling the user would be a bit hard for a Security Analyst, usually he doesn't have the rights to do so. I would go for the IR plan","comment_id":"750253","poster":"corboonstra","timestamp":"1671485160.0","upvote_count":"2"},{"upvote_count":"3","content":"Selected Answer: B\nB is the best option because A and D are part of the IR plan and C just doesn't fit anywhere.","comment_id":"729835","timestamp":"1669685940.0","poster":"mrodmv"},{"upvote_count":"1","timestamp":"1668892260.0","content":"whatever event security related happen that looks suspicious after first look should trigger the incident response plan and continue from there.","poster":"mrodmv","comment_id":"722254"},{"upvote_count":"2","content":"Selected Answer: B\nWhy would you discuss an issue with a potential insider threat? It's so B","poster":"TheStudiousPeepz","timestamp":"1667572080.0","comment_id":"711213"},{"upvote_count":"3","comment_id":"710781","timestamp":"1667507640.0","poster":"TweakableCipher","content":"Selected Answer: D\nPrivileged accounts are often used to do overnight tasks such as server patching, vulnerability management tasks, etc. This could be legitimate activity. I say review with the user. Disabling the account, or any of the other choices could be too extreme a first step."},{"upvote_count":"2","comments":[{"timestamp":"1667934660.0","upvote_count":"1","content":"still surprised no one thought of this. they want to know that you understand the concept","poster":"Cizzla7049","comment_id":"714059"},{"poster":"TeyMe","content":"Im changing mind on this, after careful reading.. IR phase: Preapare > detect & ANALYSIS > contain... we need to analyse this further, locating the user and knowing their intent is good step forward. D","timestamp":"1667977080.0","comment_id":"714352","upvote_count":"1"}],"poster":"TeyMe","content":"Selected Answer: A\norder of IR phase is what the questions is asking here.. Prepare>Detect>contain>Eradicate>Lessonlearned. Of cos, to contain would be the next step after investigating (detection) of the breach.","timestamp":"1667106660.0","comment_id":"707616"},{"content":"Selected Answer: B\nComing from working in a PCI environment:\nA. Possible? depends how much power your department has and who the person is. It really matters. \nB. Stating \"Following a breach\" does imply this is after actions. The question implies this investigation is post incident. \nC. lol not my job. \nD. Do Not Do This. The user will plead ignorant, they now have the opportunity to cover their tracks, perform more malicious activity, ect. \n\nThe order these actions would go in would be B, A, D, then C. \nB would give authorization to perform A, which would eliminate the risk of D, which could lead to someone (Not you) performing C.","poster":"A_Shadows_Soul","upvote_count":"2","comment_id":"706613","timestamp":"1666973580.0"},{"poster":"wico1337","upvote_count":"1","content":"Even if you have a 1% suspicion that an account has been compromised. Enough to open an IR plan. Why would your first action not be to Disable the account? An attack with those elevated privileges could happen while you are running your little IR.","timestamp":"1666562460.0","comment_id":"702490"},{"content":"Selected Answer: A\nMy take on this is, the IR has already been initiated. \nThe company has policies in place >> no account usage outside of business hours. \nWhoever has a high PR account already should know the companies policy well enough to be promoted and to have his/her account roles increased, thats not a newbie mistake (if it were actually company staff using the account) .\nRegardless if it was the staff or someone else, we dont know for certain and we definitely do not want to tip them off (in the event that its actually the company staff).\nSo whats the next step? another data breach can occur at any time, probably even during the IR. The most evidence or suspicion we have at this point is that this particular account is being used consistently off hours which violates company policy and is cause for concern. So, disable the account is the \"NEXT\" step. \n\"Then\" we \"can\" approach the user if thats what you want to do \nContainment is priority tho","upvote_count":"2","comment_id":"690149","poster":"Tag","timestamp":"1665317520.0"},{"timestamp":"1665116940.0","comment_id":"688283","content":"Selected Answer: D\nWe are not sure if there is an incident going on so we have to make sure that the connection out of business hours are legit or not. Then we can initiate an IR plan or not.","poster":"arctanx","upvote_count":"3"},{"content":"Selected Answer: D\nI believe it to be D.\n\nThe question states \"during the investigation.\" The investigation would be part of the incident response plan, indicating that it's already been initiated.","poster":"jchutch2","upvote_count":"4","timestamp":"1664816040.0","comment_id":"685688"},{"comment_id":"684772","comments":[{"timestamp":"1665316980.0","content":"i agree with this.. lets not overthink","poster":"Tag","upvote_count":"1","comment_id":"690140"}],"timestamp":"1664710080.0","content":"Selected Answer: A\nI choose A. Breach already occured so you're already in IR. The question becomes what stage of IR. You have investigated and found discrepancy already of logging in at unusual hours. Next step is to contain the system and start asking questions and analyzing system. My take on this","poster":"Cizzla7049","upvote_count":"3"},{"poster":"nonjabusiness","timestamp":"1663445040.0","comment_id":"671787","content":"Selected Answer: B\nB is the best answer, D could tip off an inside threat of a possible investigation","upvote_count":"1"},{"timestamp":"1659529560.0","content":"Selected Answer: B\nlooks good to me","upvote_count":"1","comment_id":"641866","poster":"miabe"},{"upvote_count":"1","comment_id":"640304","content":"Selected Answer: B\nI believe the Initiate the incident response plan includes (analyzing) talking to customer or (containment) disabling the privileged account. So will go with B","poster":"FrancisBakon","timestamp":"1659315900.0"},{"content":"Selected Answer: D\nD is the correct answer! No indicators that the account usage was related to the breach","comment_id":"637698","poster":"juninho12","timestamp":"1658881620.0","upvote_count":"3"},{"comments":[{"timestamp":"1659315660.0","comment_id":"640302","poster":"FrancisBakon","upvote_count":"2","content":"It is a tricky situation because we are not sure if it is breach. Following a breach means we are going for post incident activities and preparing for another IR plan. This could be a new incident we need to identify and analyse first."}],"comment_id":"628020","timestamp":"1657128180.0","poster":"Craiggyt","content":"Selected Answer: A\nI can't see why no one is saying (A), maybe I'm missing something. I agree with talking to the user; however, wouldn't the proactive approach would be to disable the account first then have a talk with the user to find out what it is that they are doing.","upvote_count":"1"},{"timestamp":"1655314020.0","upvote_count":"2","content":"Selected Answer: B\nB, start the response plan. \n\nDO NOT approach the user. Ever.","poster":"MacherGaming","comment_id":"616881"},{"content":"Selected Answer: B\nAlways assume a breach. I will go with B","upvote_count":"2","timestamp":"1647557100.0","comment_id":"570101","poster":"JENNER_ROCKA"},{"poster":"Droozdz","upvote_count":"4","timestamp":"1644135780.0","comment_id":"541582","content":"It is actually good idea to aoproach user. This could be legitimate activity. Some special task. Not sure now if this should not be part of response plan... Both answers seems correct.","comments":[{"content":"Even if the activity was legitimate would the analyst approach the user though? Any thoughts?","timestamp":"1655744280.0","upvote_count":"4","poster":"Davar39","comment_id":"619383"}]}],"exam_id":346,"answer":"D","answer_ET":"D","url":"https://www.examtopics.com/discussions/comptia/view/70916-exam-cs0-002-topic-1-question-32-discussion/","choices":{"D":"Review the activity with the user.","B":"Initiate the incident response plan.","A":"Disable the privileged account.","C":"Report the discrepancy to human resources."},"answer_images":[],"answers_community":["D (40%)","B (30%)","A (28%)","1%"],"question_id":246,"unix_timestamp":1643733840,"isMC":true,"timestamp":"2022-02-01 17:44:00","question_images":[],"topic":"1"},{"id":"CyDiiSObhhhMSxKkkHUP","exam_id":346,"topic":"1","answer":"C","answer_images":[],"timestamp":"2023-02-04 15:33:00","answer_description":"","choices":{"C":"/bin/ls -1 /proc/1301/exe","D":"kill -9 1301","B":"rpm -V openssh-server","A":"strace /proc/1301"},"question_id":247,"isMC":true,"question_text":"A security analyst is investigating a compromised Linux server. The analyst issues the ps command and receives the following output:\n\n//IMG//\n\n\nWhich of the following commands should the administrator run NEXT to further analyze the compromised system?","discussion":[{"timestamp":"1675521180.0","content":"Selected Answer: C\nC. /bin/ls -1 /proc/1301/exe. This command will show the absolute path to the executed binary file associated with the process ID 1301, which is ./usr/sbin/sshd. This information can help the security analyst determine if the binary is an official version and has not been modified, which could be an indicator of a compromise.","comments":[{"poster":"2Fish","timestamp":"1679355120.0","content":"Agree. Also, the given answer does not look to have the correct syntax. strace should be used with the -p (to define the process number.) So I think it would look like strace -p 1301","upvote_count":"3","comment_id":"845347"},{"content":"This person only puts answers from ChatGPT -- I literally put this question in ChatGPT 4.0 and it gave me a different answer. Although C is correct imo, I wouldn't just trust this guys answers.","upvote_count":"2","comment_id":"912390","poster":"[Removed]","timestamp":"1685657160.0"}],"upvote_count":"13","comment_id":"798036","poster":"gnnggnnggnng"},{"poster":"Stiobhan","upvote_count":"6","timestamp":"1676886120.0","content":"Selected Answer: A\nThink I am going to stick with given answer. I am not a Linux expert but this has given me enough info to make a good educated guess - https://man7.org/linux/man-pages/man1/strace.1.html","comment_id":"815058"},{"poster":"rmwilsn","timestamp":"1680858540.0","content":"uh... C is not a command and will not provide any more information. A is the correct answer.","upvote_count":"1","comments":[{"content":"i just used C in my linux machine. it works","poster":"Jacobmy98","timestamp":"1680968940.0","comment_id":"864818","upvote_count":"2"}],"comment_id":"863677"},{"timestamp":"1679767200.0","upvote_count":"1","comment_id":"850332","content":"Selected Answer: C\nA. would be the correct answer if it has the -p flag, which is needed for the command syntax. \nB. Doesn't give us any additional info\nD. Terminates any connections, but won't give any additional insight.\nSo C. has to be the answer.","poster":"OnA_Mule"},{"timestamp":"1678632900.0","upvote_count":"1","comment_id":"837130","poster":"Kashim","content":"Selected Answer: A\nThe strace command is used to trace the system calls and signals of a running process, which can help a security analyst identify the root cause of a compromise. \n\nGoing with A"}],"unix_timestamp":1675521180,"answers_community":["C (67%)","A (33%)"],"url":"https://www.examtopics.com/discussions/comptia/view/97976-exam-cs0-002-topic-1-question-320-discussion/","answer_ET":"C","question_images":["https://img.examtopics.com/cs0-002/image26.png"]},{"id":"KzWmdy7bGsxVYnptvV3R","answer":"","answers_community":[],"timestamp":"2023-02-22 15:30:00","answer_images":["https://img.examtopics.com/cs0-002/image28.png"],"isMC":false,"answer_description":"","url":"https://www.examtopics.com/discussions/comptia/view/100375-exam-cs0-002-topic-1-question-321-discussion/","discussion":[{"timestamp":"1688404980.0","upvote_count":"6","comment_id":"942082","content":"This question and #14 are duplicates. #14 has the proper exhibits where 321 does not. The conclusion from both discussions is that Server4 and Svchost.exe are correct.","poster":"Starburst"},{"timestamp":"1680644460.0","comment_id":"861515","upvote_count":"3","comments":[{"timestamp":"1698374280.0","comment_id":"1055073","content":"Correct me if I'm wrong, but in the actual PBQ the Svchost.exe associated with Server 4 looked most suspicious, so I don't think it's server 1 or notepad.","upvote_count":"3","poster":"SpeedyG"}],"content":"1.) SERVER 1\n2.) Notepad\n\nThis was from the previous question.","poster":"[Removed]"},{"upvote_count":"1","comments":[{"content":"this is completely different than 6. read the question","comments":[{"poster":"rmwilsn","content":"this is the same as 14","timestamp":"1680857100.0","upvote_count":"2","comment_id":"863663"}],"comment_id":"862848","poster":"rmwilsn","upvote_count":"1","timestamp":"1680776280.0"},{"comment_id":"859363","content":"Ugh.. the link is incorrect.","poster":"2Fish","upvote_count":"1","timestamp":"1680471060.0","comments":[{"comment_id":"881834","content":"https://www.examtopics.com/exams/comptia/cs0-002/view/2/\n#14","poster":"NerdAlert","timestamp":"1682526900.0","upvote_count":"1"}]}],"content":"Same as #6. https://www.examtopics.com/exams/comptia/cs0-002/view/","comment_id":"857487","poster":"2Fish","timestamp":"1680307680.0"},{"upvote_count":"1","timestamp":"1679767500.0","poster":"OnA_Mule","comment_id":"850335","content":"https://www.examtopics.com/discussions/comptia/view/20574-exam-cs0-001-topic-1-question-141-discussion/"},{"timestamp":"1677076200.0","upvote_count":"1","comment_id":"817920","comments":[{"timestamp":"1677138000.0","poster":"AaronS1990","upvote_count":"7","content":"This seems like a mixture of the first PBQ in this dump and another PBQ that is early on. Either way neither the question nor the answer are clear","comment_id":"818932"}],"poster":"engindn","content":"where is the answer?"}],"exam_id":346,"topic":"1","unix_timestamp":1677076200,"answer_ET":"","question_id":248,"question_images":["https://img.examtopics.com/cs0-002/image27.png"],"question_text":"HOTSPOT\n-\n\nMalware is suspected on a server in the environment.\n\nThe analyst is provided with the output of commands from servers in the environment and needs to review all output files in order to determine which process running on one of the servers may be malware.\n\n\nINSTRUCTIONS\n-\n\nServers 1, 2, and 4 are clickable. Select the Server and the process that host the malware.\n\nIf at any time you would like to bring back the initial state of the simulation, please click the Reset All button.\n\n//IMG//"},{"id":"yZaVIajkQXldl7OfiFtF","timestamp":"2023-02-14 16:13:00","discussion":[{"content":"Selected Answer: D\nD is a better choice. Browser XSS Protection is already deprecated by Edge, Chrome, and Firefox. Server-side XSS not only protect the end-user, but many other users.","comment_id":"1063460","upvote_count":"1","poster":"SecurityGuyPP","timestamp":"1699236300.0"},{"timestamp":"1696445220.0","comment_id":"1025094","content":"Selected Answer: A\nThe OWASP ZAP output indicates that the web browser's XSS (Cross-Site Scripting) protection is not enabled or is disabled by the configuration of the HTTP Response header. To address this vulnerability, you should enable the browser's XSS filter. This filter helps protect against certain types of client-side XSS attacks by identifying and blocking malicious scripts from executing in the browser.","upvote_count":"3","poster":"skibby16"},{"comment_id":"997045","poster":"rg00","upvote_count":"1","timestamp":"1693676640.0","content":"Selected Answer: D\nA security analyst should also consider that other users will also access the website, so a server side fix is necessary.\nImplementing a fix on your own machine/browser will not fix the vulnerability on another users' machines/browsers."},{"timestamp":"1687832820.0","comment_id":"934973","poster":"justauser","upvote_count":"1","content":"Selected Answer: D\nAgree with karpal, source cited is very clear."},{"comment_id":"931546","upvote_count":"3","content":"Selected Answer: D\n\"Web Browser XSS Protection not enabled\" means that Web browser XSS protection is not enabled or is disabled by the configuration of the 'X-XSS-Protection' HTTP response header on the webserver.\nRefrence:\nhttps://www.ibm.com/docs/en/cdfsp/7.6.1.x?topic=checklist-vulnerability-web-browser-xss-protection","timestamp":"1687521120.0","poster":"karpal"},{"content":"Selected Answer: A\nGPT: To mitigate this vulnerability, you should enable the browser's XSS filter. This is the most appropriate solution among the given options because it directly addresses the issue identified in the scan output.\n\nHere's a brief explanation of the other options:\nB. Enable Windows XSS protection: This is not the correct solution because the issue is related to the web browser and not the underlying Windows operating system.\nC. Enable the browser's protected pages mode: While this might provide some protection against certain attacks, it is not specifically related to XSS protection and would not fully address the identified vulnerability.\nD. Enable server-side XSS protection: While server-side XSS protection is important, it is not the direct solution to the issue identified in the scan output. The vulnerability in question is related to the browser's XSS filter, which is a client-side protection mechanism","timestamp":"1681956000.0","comments":[{"comment_id":"997033","upvote_count":"1","content":"Browser XSS Protection is already deprecated.\nD would be the better choice.","timestamp":"1693675920.0","poster":"rg00"}],"poster":"justauser","comment_id":"875222","upvote_count":"1"},{"comment_id":"864072","timestamp":"1680884040.0","poster":"HereToStudy","content":"Selected Answer: A\nEnabling server-side XSS protection is not a direct solution to the vulnerability identified in the alert, as it would not address the configuration of the HTTP Response header.","upvote_count":"1"},{"timestamp":"1679768160.0","comment_id":"850346","upvote_count":"4","poster":"OnA_Mule","content":"Selected Answer: A\nI'm going with A. There's nothing that says that domain.com is your company's webserver, so implementing a server-side fix may not be an option. A client-side fix is certainly under your control, so I think it's the best answer.","comments":[{"comments":[{"content":"Thank you for your explanation.","timestamp":"1680000720.0","upvote_count":"1","poster":"Adji91","comment_id":"853125"}],"upvote_count":"1","poster":"2Fish","content":"After seeing this again, I am thinking A is correct for exactly what you are saying. We as users do have the ability to adjust our browser. The configuration could have been changed from a malicious site.","timestamp":"1679865180.0","comment_id":"851501"},{"upvote_count":"1","content":"As a security analyst, you should not scan a web app without consent/permission.\nA security analyst should also consider that other users will also access the website, so a server side fix is more suitable. Implementing a client-side fix on YOUR machine will not fix the vulnerability on ANOTHER machine.","comment_id":"997043","timestamp":"1693676580.0","poster":"rg00"}]},{"timestamp":"1676956560.0","content":"Agree with D","poster":"db97","comment_id":"816219","upvote_count":"2"},{"content":"\"while testing for client-side vulnerabilities\"\nWhy then would we use XSS on the server side?","comment_id":"808504","poster":"AaronS1990","timestamp":"1676387580.0","upvote_count":"1","comments":[{"poster":"robullo","comment_id":"812721","comments":[{"timestamp":"1679355480.0","content":"Thanks for the added context. Agreed!","comment_id":"845351","poster":"2Fish","upvote_count":"1"},{"content":"Thank you for the response","poster":"AaronS1990","timestamp":"1677077940.0","comment_id":"817955","upvote_count":"1"}],"upvote_count":"6","content":"OWASP ZAP checks for a specific record in the response header, so it must be configured on the server.","timestamp":"1676702160.0"}]}],"answer_images":[],"url":"https://www.examtopics.com/discussions/comptia/view/99176-exam-cs0-002-topic-1-question-322-discussion/","choices":{"C":"Enable the browser’s protected pages mode.","B":"Enable Windows XSS protection.","A":"Enable the browsers XSS filter","D":"Enable server-side XSS protection."},"topic":"1","question_images":[],"isMC":true,"exam_id":346,"answer_description":"","answers_community":["A (60%)","D (40%)"],"question_text":"A security analyst sees the following OWASP ZAP output from a scan that was performed against a modern version of Windows while testing for client-side vulnerabilities:\n\n\nAlert Detail -\nLow (Medium) Web Browser XSS Protection not enabled\nDescription: Web browser XSS protection not enabled, or disabled by the configuration of the HTTP Response header\n\nURL: https://domain.com/sun/ray -\n\nWhich of the following is the MOST likely solution to the listed vulnerability?","answer_ET":"A","answer":"A","question_id":249,"unix_timestamp":1676387580},{"id":"snjDwo8bg7RNqe9WqvCO","question_images":[],"question_text":"A new variant of malware is spreading on the company network using TCP/443 to contact its command-and-control server. The domain name used for callback continues to change, and the analyst is unable to predict future domain name variance. Which of the following actions should the analyst take to stop malicious communications with the LEAST disruption to service?","timestamp":"2023-02-21 06:15:00","url":"https://www.examtopics.com/discussions/comptia/view/100176-exam-cs0-002-topic-1-question-323-discussion/","isMC":true,"answer_ET":"A","answer_description":"","answer":"A","unix_timestamp":1676956500,"answer_images":[],"question_id":250,"answers_community":["A (100%)"],"discussion":[{"timestamp":"1687522080.0","poster":"karpal","content":"Selected Answer: A\nA. Implement a sinkhole with a high entropy level. // I chosed it as the rest do not make sense\n B. Disable TCP/53 at the perimeter firewall. // DNS will stop working \n C. Block TCP/443 at the edge router. // internet will stop working for all emplolyees in the company.\n D. Configure the DNS forwarders to use recursion. // all DNS forwarderds are using recursion anyhow...","upvote_count":"2","comment_id":"931558"},{"comments":[{"poster":"2Fish","upvote_count":"1","timestamp":"1679355900.0","comment_id":"845359","content":"Agree. Sinkhole with high entropy to make it more difficult for attackers to figure out where the sinkhole is."}],"content":"Selected Answer: A\noption A, implementing a sinkhole with a high entropy level, would be the best action to take to stop the malicious communications with the least disruption to service.","poster":"Farzananazy","timestamp":"1677795480.0","upvote_count":"2","comment_id":"827493"},{"upvote_count":"2","poster":"db97","timestamp":"1676956500.0","content":"Agree with A","comment_id":"816218"}],"choices":{"A":"Implement a sinkhole with a high entropy level.","D":"Configure the DNS forwarders to use recursion.","C":"Block TCP/443 at the edge router.","B":"Disable TCP/53 at the perimeter firewall."},"topic":"1","exam_id":346}],"exam":{"isBeta":false,"name":"CS0-002","isMCOnly":false,"numberOfQuestions":422,"isImplemented":true,"id":346,"provider":"Comptia","lastUpdated":"12 Apr 2025"},"currentPage":50},"__N_SSP":true}