{"pageProps":{"questions":[{"id":"veBpw1SnQfpt9hICaoAJ","timestamp":"2023-05-02 15:52:00","answer_ET":"A","discussion":[{"content":"Selected Answer: C\nI do not think this is mac flooding as each port only has one mac address, but if you look closely we can see duplicate MACs indicating a man in the middle attach which leverages ARP poisoning.","upvote_count":"19","timestamp":"1695720840.0","comment_id":"1017584","poster":"Lost_Memo"},{"timestamp":"1684287180.0","content":"Selected Answer: A\nBoth A and C could be plausible answers given different circumstances. In the context of the question, MAC flooding seems more likely for a few reasons. In a MAC flooding attack, the attacker tries to overwhelm the switch's MAC address table with many different MAC addresses, often fake or spoofed, in an attempt to make the switch behave like a hub and broadcast all traffic. In the output provided, we see a single MAC address (00-04-18-EB-14-30) appearing on two different ports, which could be an indication of such an attack. ARP poisoning, on the other hand, involves sending spoofed ARP messages over a local area network. This could also be a possibility, but the question does not provide direct evidence of this. In an ARP poisoning attack, we would expect to see MACs associated with IPs they shouldn't be, but the output provided doesn't include any IP addresses, so it's difficult to identify ARP poisoning based on the information given. Given these considerations, the evidence provided in the question makes A (MAC flooding) a more likely answer.","upvote_count":"13","poster":"justauser","comment_id":"899645"},{"poster":"Alcpt","upvote_count":"1","timestamp":"1727413080.0","comment_id":"1289813","content":"Selected Answer: A\nim going for A. \nif this was hinting towards C then surely they would provide added info eg multiples IPs using the same macs | or false ARP messages. \nthis question is lazer focused on a full arp table - which to me = A."},{"poster":"shady23","comment_id":"1221822","timestamp":"1717102980.0","upvote_count":"1","content":"Selected Answer: C\nC. ARP poisoning"},{"content":"ARP poisoning corrupts the ARP cache of a victim by assigning the attacker's MAC address to a legitimate IP address in the network through an ARP response to the victim.\nMAC flooding, on the other hand, aims to overwhelm the MAC address table of a switch by flooding it with an excessive number of fake source Ethernet frames.\n\nThe attack described above is a MAC cloning attack. In MAC cloning, instead of compromising the switch's resources, the attacker spoofs the MAC address of a victim, impersonating him/her by assigning that MAC address to another Ethernet port on a switch. The attacker can now evade detection and spoof any packets destined for the victim.\n\nTherefore, the answer should be MAC cloning!","comment_id":"1221336","comments":[{"upvote_count":"2","timestamp":"1717962480.0","comment_id":"1227497","poster":"Gigi42","content":"Agreed. MAC Cloning seems to be what is shown in the table. Duplicate MAC addresses. I don't see how this is MAC flooding or ARP poisoning."}],"timestamp":"1717026900.0","poster":"AbdullahMohammad251","upvote_count":"2"},{"comment_id":"1210743","timestamp":"1715581020.0","poster":"shady23","content":"Selected Answer: C\nC. ARP poisoning\nThis is an attempt to redirect traffic to an attacking host by sending an ARP packet that contains the forged address of the next hop router. The attacker tricks the victim into believing that it is the legitimate router by sending a spoofed ARP reply with its own MAC address. This causes the victim to send all its traffic to the attacker instead of the router. The attacker can then intercept, modify, or drop the packets as they please.","upvote_count":"1"},{"content":"Selected Answer: A\nMAC Flooding related to ports\nARP poisoning related to IP","upvote_count":"3","comment_id":"1204096","timestamp":"1714405500.0","poster":"Nemish71"},{"comment_id":"1190039","content":"A - MAC flooding is an attempt to overwhelm, the questions states speed and latency issues. The picture also shows only a MAC address table so there is no way to confirm it is an ARP poison without a an IP. Similar picture on question 149, and the answer is the MAC flood.\n\nhttps://www.examtopics.com/discussions/comptia/view/80644-exam-sy0-601-topic-1-question-149-discussion/","upvote_count":"2","poster":"_deleteme_","timestamp":"1712345100.0"},{"content":"Selected Answer: A\nAfter much research and considering the question further, I am able to find the clue that leads the answer to being MAC flooding: Sudden speed and latency issues. ARP poisoning will not have a sudden dramatic impact as it does cause a flood of traffic on the network quite like a MAC flood. When the switch's MAC table is full, it reverts to a hub mode and forwards all packets to all ports, vs 1-to-1 in a normal switching operation, the reason being is that it can no longer direct traffic as it has no idea where it should go.","comment_id":"1187112","timestamp":"1711932480.0","poster":"BD69","upvote_count":"1"},{"upvote_count":"3","content":"Selected Answer: C\nThere's an evidence of MAC Cloning/Spoofing (Port Fa0/1 and Fa0/4). No overwhelmingly use of different MAC addresses in the table attacking a single or multiple ports; so I would say this is NOT a MAC flooding. I'll go with ARP Poisoning from On-path attack (MITM) that also able to send a CLONED MAC to attack.","comment_id":"1183054","timestamp":"1711431120.0","poster":"gab2024"},{"timestamp":"1710425940.0","comment_id":"1173478","upvote_count":"1","poster":"Ryan7933","content":"Selected Answer: C\nIt is ARP poisoning"},{"poster":"slapster","content":"Selected Answer: A\nIn MAC Flooding, the target is a switch, whereas in ARP poisoning, the target is often the subnet's default gateway. The fact that we are looking at a MAC table and seeing that VLAN1 has each of its ports being forwarded traffic implies MAC flooding. In ARP Poisoning, a packet crafter is used to broadcast ARP reply packets to a receiving device so it will update its MAC:IP address table with a spoofed address. Therefore, I personally do not see enough evidence within the question to justify selecting ARP poisoning.","timestamp":"1708298640.0","upvote_count":"2","comment_id":"1153622"},{"upvote_count":"1","timestamp":"1708257300.0","comment_id":"1153241","poster":"[Removed]","content":"Selected Answer: A\nThis is more of a mac cloning attack than flooding, but flooding is the closest thing to it. From the output given, we cannot definitively say it's ARP poisoning."},{"poster":"zecomeia_007","comment_id":"1142141","content":"Selected Answer: C\nThe MAC is Clone, C is correct.","timestamp":"1707222120.0","upvote_count":"4"},{"poster":"Hardware_guy","content":"Selected Answer: C\nARP poisoning involves sending forged ARP messages to network devices, tricking them into associating an attacker's MAC address with a legitimate IP address. This allows the attacker to intercept traffic meant for the legitimate device. \nTherefore, considering the presence of multiple MAC addresses associated with the same IP address, ARP poisoning is the most likely attack scenario depicted in the image.\n\nThe table shows devices on the same VLAN (1), suggesting they are on the same network segment and could be targeted by ARP poisoning.\nThe attacker's MAC address (00-04-18-EB-14-30) appears multiple times in the table, further indicating ARP poisoning attempts.","timestamp":"1707072180.0","comment_id":"1140427","upvote_count":"3"},{"comment_id":"1134827","content":"Selected Answer: A\nIn a MAC flooding attack, the attacker sends a large number of frames with different source MAC addresses to fill up the CAM (Content Addressable Memory) table on a switch. Once the table is full, the switch enters a \"fail-open\" state, where it starts flooding traffic to all ports, essentially turning into a hub. This can lead to network congestion, speed issues, and increased latency.","upvote_count":"1","timestamp":"1706523720.0","poster":"whoamyou"},{"content":"Selected Answer: C\nARP POISONING\n\nMac flooding occurs on one port.","comments":[{"upvote_count":"2","comment_id":"1141419","poster":"kewokil120","timestamp":"1707163500.0","content":"That not an arp table. Rules out arp."}],"comment_id":"1134066","upvote_count":"3","timestamp":"1706444340.0","poster":"klinkklonk"},{"content":"Selected Answer: A\nThere are no IPs for us to assume its ARP poisoning. Based on the facts we have, which are latency and speed issues, the only reasonable option is A - MAC Flooding.\n\nI believe the duplicate MAC in the table is meant as a trick for over-thinkers to fall for it. I see why you'd think it might be C but again, based on the context of this question it cannot. You're going on a limb and assuming something thats not in the Q!!!! pay attention","upvote_count":"2","timestamp":"1705252860.0","poster":"david124","comment_id":"1122708"},{"timestamp":"1704919680.0","poster":"MortG7","comment_id":"1119021","content":"experiencing speed and latency issues = MAC Flooding","upvote_count":"2","comments":[{"content":"You have the same MAC on two different ports. ARP is the mapping of IP's to MAC's..do you see any IP's in the table?","comment_id":"1196794","timestamp":"1713297660.0","upvote_count":"1","poster":"MortG7"}]},{"content":"Selected Answer: C\nMAC flooding is unique MACs. ARP Poisoning is identical MACs.","timestamp":"1704856680.0","upvote_count":"2","comment_id":"1118105","poster":"MrKyle"},{"timestamp":"1698762600.0","poster":"[Removed]","content":"Selected Answer: C\nDiff port, MAC flooding shouldn't that be on the same port ?","comment_id":"1058903","upvote_count":"4"},{"comment_id":"1055509","poster":"[Removed]","upvote_count":"3","timestamp":"1698405300.0","content":"Selected Answer: A\nMAC flooding is a type of denial-of-service (DoS) attack in which an attacker sends a large number of MAC addresses to a switch, overloading the switch's MAC address table. This can cause the switch to drop legitimate traffic, resulting in speed and latency issues for devices connected to the switch.\n\nThe output of the show mac address-table command shows that the switch is flooded with MAC addresses, with multiple devices using the same MAC address. This is a classic sign of a MAC flooding attack."},{"comment_id":"1046872","comments":[{"content":"Can't modify the answer at the moment, I will go with C.\nBut, as someone already stated, would be probably ARP poisoning as the ports are all differents and in MAC flooding are usually on the same port.\nA couple more details would have been better.","timestamp":"1697630460.0","comment_id":"1046883","upvote_count":"4","poster":"qwes333"}],"content":"Selected Answer: A\nMust be MAC flooding as I don't see any IP here","timestamp":"1697629920.0","poster":"qwes333","upvote_count":"5"},{"comment_id":"1044854","content":"Option A. Quote from Wikipedia \"Switches maintain a MAC table that maps individual MAC addresses on the network to the physical ports on the switch. This allows the switch to direct data out of the physical port where the recipient is located, as opposed to indiscriminately broadcasting the data out of all ports as an Ethernet hub does. The advantage of this method is that data is bridged exclusively to the network segment containing the computer that the data is specifically destined for.\"","poster":"fercho2023","timestamp":"1697451840.0","upvote_count":"1"},{"comment_id":"1044697","upvote_count":"4","content":"Selected Answer: A\n\"MAC address flooding is an attempt to force a switch to send all information out every port by overloading the MAC address table.\"\nSigns of MAC flooding - speed and latency issues.\n\n\"ARP poisoning - Besides Man-in-the-Middle Attacks, ARP Poisoning can be used to cause a denial-of-service condition over a LAN by simply intercepting or dropping and not forwarding the target's packets.\"\n\nIn this case no IP addresses are not manipulated. \nIt is the table with MAC and Ports.","timestamp":"1697436420.0","comments":[{"poster":"bzona","content":"Changing answer to C\n\nMAC flooding would be a table with lots of MAC addresses and the same Port, however this table indicates that same MAC address is listed on two different port. \nThis is most likely a MAC spoofing performing an ARP poisoning attack.","timestamp":"1697438040.0","comment_id":"1044708","upvote_count":"3"}],"poster":"bzona"},{"content":"If the same MAC address is found on different ports in the same VLAN, it is likely to be caused by MAC flooding. MAC flooding is a type of attack that involves sending a large number of fake MAC addresses to a switch in order to overload its MAC address table. When the table becomes full, the switch enters into a fail-open mode, which means that it starts broadcasting all incoming traffic to all ports in the same VLAN. This can cause the same MAC address to be learned on multiple ports in the same VLAN.\n\nARP poisoning, on the other hand, is a type of attack that involves sending fake ARP messages to a network in order to associate a different MAC address with an IP address. This can be used to intercept network traffic or launch other types of attacks.","upvote_count":"1","poster":"James_Tye","comment_id":"1041091","timestamp":"1697056260.0"},{"content":"Selected Answer: A\nIf the issue in on switch, certainly is MAC Flooding.","timestamp":"1694385240.0","upvote_count":"4","comment_id":"1004349","poster":"32d799a"},{"comment_id":"1000885","poster":"rline63","upvote_count":"1","content":"I think the smoking gun is the duplicate mac addresses on different ports. It is definitely mac flooding.","timestamp":"1694025300.0"},{"timestamp":"1690152480.0","upvote_count":"4","poster":"ccnaexam28","comments":[{"upvote_count":"1","poster":"bzona","timestamp":"1697437980.0","comment_id":"1044706","content":"MAC flooding would be a table with lots of MAC addresses and the same Port, however this table indicates that same MAC address is listed on another port. This would be a MAC spoofing performing an ARP poisoning attack."}],"comment_id":"960904","content":"Selected Answer: A\nleaning more towards MAC flooding due to the fact that this isn't an ARP table. not enough info indicating this is ARP poisoning as there's no IP."},{"timestamp":"1690067400.0","content":"Selected Answer: A\nDefinitely a MAC flooding attack. Same MAC on more than one port is a clear indication of it (or it can also be a broadcast domain which will take the network downs as well bit it is not an objective of this exam). There is not information that indicate an ARP poisoning (there are not even IP address in the info provided)","poster":"pachosinfortuna","comment_id":"959895","upvote_count":"4"},{"comment_id":"955221","comments":[{"content":"MAC Flooding can also include the same MAC address, and MAC Flooding primarily focuses on exploiting the way Ethernet switches handle MAC addresses. The Ethernet switches use MAC address tables to associate MAC addresses with port locations.","poster":"CS3000","comment_id":"990434","timestamp":"1693006500.0","upvote_count":"1"}],"content":"Selected Answer: C\nArp poisoning- The same MAC address is listed for multiple IP addresses. This is a clear indication that ARP poisoning is happening, as the attacker's MAC address is being spoofed to appear as the MAC address of multiple devices on the network.","poster":"dsiisus","timestamp":"1689675360.0","upvote_count":"3"},{"timestamp":"1687567140.0","comments":[{"timestamp":"1687567200.0","comment_id":"932042","upvote_count":"2","content":"Look below at question #464 for an example of MAC flooding\n\n\"MAC flooding is an attack against a switch that attempts to overload it with different MAC addresses associated with each physical port. You typically have only one device connected to any physical port. During normal operation, the switch’s internal table stores the MAC address associated with this device and maps it to the port. An attacker sends a\nlarge amount of traffic with spoofed MAC addresses to the same port in a MAC flooding attack.\"\n-Security+ Get Certified Get Ahead SY0-601 by Darril Gibson","poster":"LeonardSnart"}],"content":"Selected Answer: C\nARP poisoning involves the hacker altering the ARP cache on a system, or group of systems, so that all systems have the wrong MAC address stored in the ARP cache for a specific IP address—maybe the address of the default gateway. Typically, the hacker will poison the ARP cache so that the default gateway IP address (your router’s IP address) points to the hacker’s MAC address. This will ensure that every time a system tries to send data to the router, it will retrieve the hacker’s MAC address from the local ARP cache and then send the data to the hacker’s system instead of to the router.\"\n\n-Security+ Certification Guide Fourth Edition by Glen Clarke","upvote_count":"3","poster":"LeonardSnart","comment_id":"932041"},{"upvote_count":"3","timestamp":"1684525680.0","poster":"ronah","comment_id":"902211","content":"Selected Answer: A\nBased on the provided output of the \"show mac address-table\" command, it appears that there are MAC addresses associated with multiple ports on the switch. This situation suggests that a MAC flooding attack may be in progress.\n\nMAC flooding is a type of attack where an attacker floods the switch with a large number of fake MAC addresses, exceeding the capacity of the MAC address table. As a result, the switch goes into a fail-open mode and starts behaving like a hub, broadcasting network traffic to all ports instead of forwarding it selectively based on the MAC address table. This flood of traffic can lead to speed and latency issues for legitimate devices connected to the switch.\n\nIn this case, the MAC address \"00-04-18-EB-14-30\" is associated with two different ports (Fa0/1 and Fa0/2), which indicates a potential MAC flooding attack. Additionally, the MAC address \"88-CD-34-19-E8-98\" is associated with two different ports (Fa0/4 and Fa0/5), further supporting the suspicion of a MAC flooding attack."},{"comment_id":"900488","comments":[{"upvote_count":"4","poster":"ApplebeesWaiter1122","comment_id":"900499","timestamp":"1684356240.0","comments":[{"timestamp":"1692072540.0","content":"Same as Apple, i had confusion between A&C. But this was how i rationalised:\n\nConsidering the key phrase \"The devices have suddenly been experiencing speed and latency issues while connecting to network resources,\" the better answer would be MAC flooding.\n\nMAC flooding causes the switch to enter a fail-open mode, where it behaves like a hub and broadcasts traffic to all ports. As a result, network performance can degrade significantly, leading to speed and latency issues.\n\nARP poisoning, Evil twin, and DHCP spoofing are also forms of network attacks, but they typically don't directly result in speed and latency issues.","upvote_count":"1","comment_id":"981272","poster":"je123"}],"content":"some indications that may suggest a MAC flooding attack include:\n\nA high number of MAC addresses associated with a single interface or port in the MAC table.\n\nThe same MAC address appearing multiple times with different ports in the MAC table.\n\nSlow network performance or connectivity issues due to the high volume of traffic caused by the MAC flooding attack."}],"content":"Selected Answer: A\nLike Justauser said it could be A or C but I'm going with A. MAC flooding can affect the switch ports. When a switch receives a lot of unknown MAC addresses, it starts to flood all the incoming traffic out to all the ports. This can cause network congestion and can lead to a denial of service (DoS) attack, as legitimate traffic is dropped or slowed down due to the high volume of traffic generated by the attack.","poster":"ApplebeesWaiter1122","upvote_count":"4","timestamp":"1684354740.0"},{"timestamp":"1684017000.0","content":"Selected Answer: C\nMAC flooding usually shares the same ports and is associated with sending a lot of frames; the probability of a single duplication of the same MAC addresses is low for such a small number of records (if not properly prepared).\n\nIn the other hand, duplicated MAC addresses on multiple ports within the same VLAN could indicate that ARP poisoning is taking place. ARP poisoning typically involves a lower amount of packets compared to MAC flooding.","comment_id":"897081","upvote_count":"2","poster":"b0nd1"},{"timestamp":"1683153180.0","poster":"workhard","comment_id":"889008","upvote_count":"3","comments":[{"poster":"Dutch012","upvote_count":"2","timestamp":"1683450120.0","comment_id":"891259","content":"But I think form what I know ARP poisoning does not cause a latency and speed issues,"},{"comment_id":"897825","poster":"Xabovion","timestamp":"1684088460.0","upvote_count":"4","content":"That is not an arp table. ARP is the corelation between IP and MAC. This is MAC flooding multiple MAC addresses on a single switch inteface."}],"content":"Selected Answer: C\nI think it is ARP poisoning. Two ports (0/1 and 0/4) have the same MAC addresses. A possible scenario is that an attacker sent ARP commands to the switch to impersonate another system by spoofing its MAC address. The system plugged on port 0/1 could be the router and the attacking system could be trying to redirect traffic to it through port 0/4. I hope my explanation is not too confusing."},{"poster":"mouettespaghetti","comments":[{"poster":"workhard","content":"actually, only the MAC addresses on port 0/1 and 0/4 are the same","timestamp":"1683151860.0","upvote_count":"2","comment_id":"888997"}],"timestamp":"1683035520.0","comment_id":"887445","content":"-A is correct\nBased on the given output, it appears that two MAC addresses (00-04-18-EB-14-30 and 88-CD-34-19-E8-98) are present on multiple ports. This is an indication of MAC address spoofing or MAC flooding attack, where an attacker floods the switch with fake MAC addresses to overload the switch's MAC address table, causing it to malfunction and forward traffic to incorrect destinations.","upvote_count":"1"}],"url":"https://www.examtopics.com/discussions/comptia/view/108254-exam-sy0-601-topic-1-question-460-discussion/","question_images":["https://img.examtopics.com/sy0-601/image46.png"],"question_text":"A network engineer receives a call regarding multiple LAN-connected devices that are on the same switch. The devices have suddenly been experiencing speed and latency issues while connecting to network resources. The engineer enters the command show mac address-table and reviews the following output:\n\n//IMG//\n\n\nWhich of the following best describes the attack that is currently in progress'?","answer_description":"","unix_timestamp":1683035520,"answers_community":["A (51%)","C (49%)"],"isMC":true,"exam_id":367,"choices":{"B":"Evil twin","A":"MAC flooding","C":"ARP poisoning","D":"DHCP spoofing"},"answer_images":[],"topic":"1","question_id":401,"answer":"A"},{"id":"odiQkpSjODhAssQeI2vN","discussion":[{"timestamp":"1683035580.0","upvote_count":"7","comment_id":"887448","content":"-A is correct\nthe best choice to achieve fault tolerance and load balancing for the connection from the file server to the backup storage is A. Multipath.\n\nMultipath is a technique that uses multiple paths between two devices to provide fault tolerance and load balancing. With Multipath, if one path fails, traffic is automatically rerouted to the available path, ensuring high availability and data access. It also provides load balancing by distributing traffic across multiple paths, reducing congestion on individual links and improving performance.","poster":"mouettespaghetti"},{"content":"Selected Answer: A\nA- Multipath is a fault-tolerant technique used to enhance network reliability. It involves the use of multiple physical connections between two devices, providing redundancy in case one of the paths fails. It also improves performance by load balancing the traffic across the multiple paths.\n\n-RAID (Redundant Array of Independent Disks) is a data storage technology that combines multiple physical disks into a single logical unit to provide redundancy and improve performance. However, RAID does not provide fault tolerance or load balancing for network connections.\n-Segmentation is a network design technique that involves dividing a network into smaller segments to reduce network congestion and improve security. However, segmentation does not provide fault tolerance or load balancing for network connections.\n-802.11 is a family of wireless networking standards commonly known as Wi-Fi. It is not applicable in this scenario as it is a wireless technology and does not provide fault tolerance or load balancing for wired network connections.","timestamp":"1684355520.0","upvote_count":"7","poster":"ApplebeesWaiter1122","comment_id":"900494"},{"timestamp":"1702577520.0","comment_id":"1096714","content":"Selected Answer: A\nA. Multipath","upvote_count":"1","poster":"ganymede"},{"upvote_count":"1","timestamp":"1698901980.0","comment_id":"1060272","poster":"ComPCertOn","content":"Selected Answer: A\nMultipath"},{"timestamp":"1687566480.0","upvote_count":"3","poster":"LeonardSnart","comment_id":"932032","content":"Multipath - Another method to add redundancy to data or disks is to use multipath, also known as multipath I/O. Multipath is the creation of multiple pathways to access data wherever it may be stored. For example, if you store data on a SAN, your server may have multiple fiber channel controllers connected to the SAN, which is made up of multiple switches so that there are multiple pathways to access the data on the SAN.\"\n\n-Security+ Certification Study Guide Fourth Edition SY0-601 by Glen Clarke"}],"exam_id":367,"answers_community":["A (100%)"],"timestamp":"2023-05-02 15:53:00","unix_timestamp":1683035580,"answer":"A","question_id":402,"question_text":"A security administrator needs to add fault tolerance and load balancing to the connection from the file server to the backup storage. Which of the following is the best choice to achieve this objective?","isMC":true,"topic":"1","choices":{"B":"RAID","D":"802.11","A":"Multipath","C":"Segmentation"},"answer_images":[],"answer_description":"","answer_ET":"A","question_images":[],"url":"https://www.examtopics.com/discussions/comptia/view/108256-exam-sy0-601-topic-1-question-461-discussion/"},{"id":"TTRpJptV5em0g94wkD4x","answer_images":[],"question_text":"Which of the following incident response phases should the proper collection of the detected IoCs and establishment of a chain of custody be performed before?","choices":{"C":"Preparation","D":"Recovery","A":"Containment","B":"Identification"},"timestamp":"2023-05-02 16:00:00","answers_community":["A (95%)","5%"],"isMC":true,"question_images":[],"discussion":[{"upvote_count":"59","content":"I had a stroke trying to read this question","timestamp":"1700671800.0","poster":"[Removed]","comment_id":"1077568"},{"poster":"NetTech","timestamp":"1692297960.0","comment_id":"983927","upvote_count":"19","content":"Selected Answer: A\nThe wording of this question is tricky.","comments":[{"poster":"zits88","comment_id":"990085","comments":[{"content":"I went over the question 5 times and I still don't understand. GL 2 me ^.^","comment_id":"990436","timestamp":"1693006860.0","poster":"CS3000","upvote_count":"7","comments":[{"content":"Even my text-to-speech on my computer had a hard time getting it out","comment_id":"1171938","upvote_count":"3","poster":"LongfellowDeeds","timestamp":"1710267720.0"}]}],"upvote_count":"12","timestamp":"1692968640.0","content":"Yeah, even as a native English speaker this was hard, I can't imagine for others. I actually switched it around mentally to say \"Which phase is after {all that stuff}\". Made it a little easier"}]},{"content":"Selected Answer: A\nQuestion rephrased to comprehend it: Which of the following incident response phases should be performed after properly collecting the detected IoCs and establishing a chain of custody?\nProper collection of IOCs(indicators of compromise) and a chain of custody is done in the 3rd step of an Incident response.\nThese are the phases in order: \nPrepare > Identify > Contain > Eradicate > Recover > Review \nThe answer is A. The next step after identifying a security incident is to contain the attack and prevent it from spreading!","timestamp":"1715576940.0","poster":"AbdullahMohammad251","comments":[{"poster":"AbdullahMohammad251","timestamp":"1715576940.0","comment_id":"1210708","upvote_count":"1","content":"https://newsletter.stratussc.com/p/do-you-need-an-incident-response"}],"comment_id":"1210707","upvote_count":"1"},{"upvote_count":"2","timestamp":"1713297900.0","content":"What a real world question? smh","comment_id":"1196797","poster":"MortG7"},{"upvote_count":"2","comment_id":"1190076","poster":"_deleteme_","content":"Before containment (the answer), the identification phase should establish the collection of indicators of compromise along with chain of custody. I'm going with A because of the fact that they said \"BEFORE\" collection. Comptia is really terrible for trying to trick people instead of allowing them to show knowledge of the study.","timestamp":"1712348340.0"},{"upvote_count":"1","comment_id":"1149321","timestamp":"1707839220.0","poster":"alicia2024","content":"Selected Answer: B\nThe proper collection of Indicators of Compromise (IoCs) and the establishment of a chain of custody typically occur during the identification phase of incident response. During this phase, security teams detect and verify potential security incidents, gather evidence, and classify the incident based on its severity and impact. Containment, on the other hand, focuses on preventing further spread of the incident and minimizing its impact on the organization's systems and data.","comments":[{"upvote_count":"1","content":"I agree, but the question states \"be performed before\" hence, its containment.","timestamp":"1708288920.0","comment_id":"1153558","poster":"memodrums"}]},{"comment_id":"1096825","upvote_count":"2","poster":"cyberPunk28","content":"Selected Answer: A\nA. Containment \nthis wording is tricky confusing, I had to re-read this multiple times .","timestamp":"1702587060.0"},{"upvote_count":"1","poster":"bzona","content":"Selected Answer: A\nTricky question. I thought it was (B) Identification initially, but was wrong. Read carefully and you will get it.\nYou cannot collect and establish anything before Identifying it, can you?\nIdentify -> *collection and establishment Happens Here* -> Containment -> Eradication -> Recovery -> Lessons Learned.","timestamp":"1697438280.0","comment_id":"1044710"},{"poster":"James_Tye","comment_id":"1041097","content":"The collection of IOCs (Indicators of Compromise) and establishment of chain of custody are part of the Detection and Analysis phase of the incident response process. In this phase, an organization detects and analyzes the incident to determine its scope, impact, and root cause. The collection of IOCs is a critical step in identifying the nature of the incident and determining the appropriate response. The establishment of chain of custody is also important to ensure that evidence is properly preserved and can be used in legal proceedings if necessary.","timestamp":"1697056680.0","upvote_count":"1"},{"content":"Selected Answer: A\nCollecting IoCs and establishing a chain of custody is an essential step in the “Identification” phase of incident response. It involves gathering evidence and information about the incident, which is crucial for understanding the nature and scope of the security breach. Once this data has been collected and properly handled, the “Containment” phase follows to prevent further damage and mitigate the incident.","timestamp":"1695120480.0","upvote_count":"1","poster":"sujon_london","comment_id":"1011198"},{"timestamp":"1694025660.0","upvote_count":"1","poster":"rline63","comment_id":"1000888","content":"Kinda dumb because it happens before recovery as well. The way I thought about the question is obviously the latest step happens after this so might as well choose that. And I'm pretty sure it's correct but comp tia wants you to pick the step that happens immediately after yet they are too lazy to properly specify that in their wording.","comments":[{"timestamp":"1715577180.0","poster":"AbdullahMohammad251","comment_id":"1210710","upvote_count":"2","content":"Yes but containment is done right after the identify phase, so A is the correct answer."}]},{"comment_id":"976314","upvote_count":"1","timestamp":"1691562060.0","poster":"AmesCB","content":"Selected Answer: B\nI think what has been described is preparation, which comes before identification"},{"upvote_count":"3","timestamp":"1684355640.0","content":"Selected Answer: A\nEstablishing a proper chain of custody for the collected evidence is crucial for the preservation of its integrity and admissibility in potential legal proceedings. Therefore, it is necessary to collect and maintain the evidence in a controlled and secure environment, ensuring that it remains unaltered and tamper-proof. This process should occur before the containment phase, where the security team isolates and limits the scope of the incident to prevent further damage or compromise to the systems or data.","comment_id":"900496","poster":"ApplebeesWaiter1122"},{"upvote_count":"11","comment_id":"895602","timestamp":"1683859860.0","poster":"chocopiess","content":"Selected Answer: A\nThe keyword here is the word before, the collection of IoCs and establishment of chain of custody typically occurs during the identification phase, which is before the containment phase."},{"comment_id":"892554","upvote_count":"1","content":"Selected Answer: A\nThe proper collection of the detected IoCs and establishment of a chain of custody should be performed before the Containment phase.","timestamp":"1683586500.0","poster":"staoic"},{"timestamp":"1683556620.0","upvote_count":"1","content":"Selected Answer: A\nThe proper collection of the detected IoCs and establishment of a chain of custody should be performed before the Containment phase of the incident response process. During the Containment phase, the goal is to prevent further damage or loss by isolating affected systems and preventing the spread of the incident. Proper collection of evidence and establishment of a chain of custody are important steps to ensure that any evidence collected during the incident response process is admissible in legal proceedings.","comment_id":"892257","poster":"fouserd"},{"poster":"mouettespaghetti","upvote_count":"3","timestamp":"1683036000.0","content":"The wording is vicious on this one,\n-A containment\nThe proper collection of the detected IoCs and establishment of a chain of custody should be performed before the Containment phase in incident response.","comment_id":"887457"}],"answer_ET":"A","unix_timestamp":1683036000,"question_id":403,"exam_id":367,"answer":"A","answer_description":"","topic":"1","url":"https://www.examtopics.com/discussions/comptia/view/108257-exam-sy0-601-topic-1-question-462-discussion/"},{"id":"D5iSXmaWNDPdKMMwL2a3","question_images":[],"answer_images":[],"isMC":true,"answers_community":["B (100%)"],"question_id":404,"answer":"B","discussion":[{"content":"-B is correct\nThe measure that determines the average time that equipment will operate before it breaks is MTBF (Mean Time Between Failures).\n\nMTBF is a reliability metric that measures the expected time between two failures of a piece of equipment. It is calculated by dividing the total operating time of the equipment by the number of failures that occurred during that time.\n\nSLE (Single Loss Expectancy) measures the monetary value expected from a single loss event.\n\nRTO (Recovery Time Objective) is the duration of time that an organization can tolerate being without a specific system, service, or application after a disruption or outage.\n\nARO (Annualized Rate of Occurrence) is a measure of how often a specific event or threat is expected to occur in a year.","comment_id":"887462","poster":"mouettespaghetti","timestamp":"1683036060.0","upvote_count":"9"},{"timestamp":"1710938460.0","content":"Selected Answer: B\nMean time between failure","comment_id":"1178266","upvote_count":"1","poster":"Gabuu"},{"upvote_count":"1","poster":"cyberPunk28","content":"Selected Answer: B\nB. MTBF","timestamp":"1702587180.0","comment_id":"1096827"},{"poster":"Rhots","comment_id":"1083800","content":"Selected Answer: B\nB is correct.","timestamp":"1701290220.0","upvote_count":"1"},{"comment_id":"1044713","content":"\"average time that equipment will operate before it breaks\"\nMTBF - Mean Time Between Failures","upvote_count":"2","poster":"bzona","timestamp":"1697438340.0"},{"timestamp":"1684355760.0","content":"Selected Answer: B\nkey word- average","upvote_count":"2","comment_id":"900497","poster":"ApplebeesWaiter1122"},{"comment_id":"892556","poster":"staoic","content":"Selected Answer: B\nMTBF (Mean Time Between Failures","upvote_count":"2","timestamp":"1683586620.0"}],"exam_id":367,"choices":{"A":"SLE","C":"RTO","D":"ARO","B":"MTBF"},"question_text":"Which of the following measures the average time that equipment will operate before it breaks?","topic":"1","timestamp":"2023-05-02 16:01:00","answer_ET":"B","url":"https://www.examtopics.com/discussions/comptia/view/108258-exam-sy0-601-topic-1-question-463-discussion/","unix_timestamp":1683036060,"answer_description":""},{"id":"HLo2hwuKLFAbXEBFanhi","question_images":["https://img.examtopics.com/sy0-601/image47.png"],"answers_community":["B (100%)"],"question_id":405,"answer_ET":"B","timestamp":"2023-05-02 16:06:00","topic":"1","url":"https://www.examtopics.com/discussions/comptia/view/108259-exam-sy0-601-topic-1-question-464-discussion/","answer":"B","discussion":[{"comment_id":"1008987","timestamp":"1694849280.0","upvote_count":"22","content":"OMG !!! That is an ARP table ???? I think the guys who wrote this question didn't took CompTIA Network + . That is MAC ADDRESS TABLEEEEEE !!!!!!!!!!!!","poster":"freyprey","comments":[{"comment_id":"1095716","poster":"58ee59c","timestamp":"1702489680.0","content":"The test cost too much money for CompTIA to be making mistakes like this.","upvote_count":"9"}]},{"upvote_count":"8","poster":"[Removed]","timestamp":"1703518980.0","content":"They don't even bother to ask at this point","comment_id":"1105365"},{"poster":"AbdullahMohammad251","upvote_count":"1","timestamp":"1715956740.0","content":"Selected Answer: B\nRefer to my previous comment!","comment_id":"1212934"},{"content":"Having multiple MAC addresses pointing to the same port is a sign of MAC address flooding attack. In a MAC flooding attack, the attacker floods the switch's MAC address table with fake MAC addresses, essentially trying to overwhelm the table and force the switch to enter a fail-open mode. In a fail-open mode, every packet will be forwarded to all the ports in the switch, the attacker can sniff all the packets being forwarded, capturing any sensitive information.","upvote_count":"3","timestamp":"1715952480.0","comment_id":"1212908","poster":"AbdullahMohammad251"},{"comment_id":"1126954","poster":"MortG7","timestamp":"1705695960.0","upvote_count":"3","content":"B. MAC flooding on Fa0/2 port \nI bet if you were to read the fine print, they most likely reserve the right to screw you, and here is a perfect example why they do not want you to pass on the first try...bad for business."},{"poster":"ganymede","upvote_count":"2","content":"Selected Answer: B\nB. MAC flooding on Fa0/2 port\n\nThe key is that Fa0/2 port had multiple MAC addresses.","timestamp":"1702605780.0","comment_id":"1096977"},{"upvote_count":"1","poster":"cyberPunk28","content":"Selected Answer: B\nB. MAC flooding on Fa0/2 port","comment_id":"1096829","timestamp":"1702587360.0"},{"content":"Selected Answer: B\nB- MAC address is correct","comment_id":"1060606","upvote_count":"2","poster":"ComPCertOn","timestamp":"1698933600.0"},{"content":"Options A and D can not be since they don't work at the OSI Layer that the attack is happening (Layer 2). So we are left with B and C. Option B makes more sense since Mac Flooding is happening","comment_id":"1044869","upvote_count":"1","poster":"fercho2023","timestamp":"1697453100.0"},{"upvote_count":"3","poster":"ApplebeesWaiter1122","comment_id":"900520","timestamp":"1684360740.0","content":"Selected Answer: B\nThe port that has the highest number of MAC addresses associated with it is likely the target of the MAC flooding attack. This is because the attacker is flooding the switch with a large number of spoofed MAC addresses to overload the MAC address table and cause a DoS."},{"timestamp":"1683036360.0","content":"-B is correct\nBased on the ARP table output, it appears that there are multiple MAC addresses associated with port Fa0/2, which suggests that MAC flooding may be occurring on this port. Therefore, the correct answer is B. MAC flooding on Fa0/2 port.\n\nARP poisoning is a type of attack where the attacker sends fake ARP messages to associate their own MAC address with the IP address of another device on the network. However, there is no evidence of this type of attack in the ARP table output provided.\n\nDDoS and DNS poisoning attacks are not related to the information provided in the ARP table output, so options A and D are incorrect.","upvote_count":"4","comment_id":"887467","poster":"mouettespaghetti"}],"choices":{"B":"MAC flooding on Fa0/2 port","C":"ARP poisoning on Fa0/1 port","A":"DDoS on Fa0/2 port","D":"DNS poisoning on port Fa0/1"},"unix_timestamp":1683036360,"answer_description":"","question_text":"A security administrator examines the ARP table of an access switch and sees the following output:\n\n//IMG//","isMC":true,"answer_images":[],"exam_id":367}],"exam":{"isImplemented":true,"lastUpdated":"12 Apr 2025","name":"SY0-601","provider":"Comptia","id":367,"isBeta":false,"numberOfQuestions":860,"isMCOnly":false},"currentPage":81},"__N_SSP":true}