{"pageProps":{"questions":[{"id":"c4j1NhHuTGhRLJxhR6H2","question_text":"Which of the following is the MOST effective control against zero-day vulnerabilities?","exam_id":367,"answer_description":"","discussion":[{"comments":[{"comment_id":"826918","content":"But the question isn't about protecting other data, the question directly says how to \"control zero-day vulnerabilities\". If there is a zero-day vulnerability in a new piece of software on a device, the BEST control against this is patch management to ensure the vulnerability is patched out as soon as possible.","upvote_count":"3","comments":[{"timestamp":"1709248800.0","upvote_count":"5","content":"Since there are no patches for a zero-day exploit (it's called Zero day, for a reason), patch management is useless.","poster":"BD69","comment_id":"1163086"},{"content":"the mention of zero day implies they mean attacks for which there is no patch yet. Patch management wont protect against something that there isn't a patch for which is the definition of a zero day exploit.","poster":"DriftandLuna","upvote_count":"7","timestamp":"1685079720.0","comment_id":"907087"},{"comment_id":"1067650","poster":"Secplas","timestamp":"1699674060.0","comments":[{"upvote_count":"1","timestamp":"1702648260.0","comment_id":"1097364","comments":[{"poster":"dhaksbro","upvote_count":"4","content":"There is NO UPDATE for the vulnerability. That's why it is called a Zero Day","comments":[{"poster":"BD69","timestamp":"1709248980.0","upvote_count":"1","comment_id":"1163088","content":"Exactly! Patch management is ONLY good for vulnerabilities that have patches. Zero-Day vulnerabilities are patched after a patch is created, AFTER the zero-day exploit was executed. Why is this so difficult to understand? (25 years experience here and have had systems compromised with full patch management systems in place)"}],"timestamp":"1707614280.0","comment_id":"1146910"}],"content":"That is the MAIN REASON FOR PATHING THE SYSTEM! it means UPDATES!! Patching=update to prevent 0 days","poster":"233Matis"}],"content":"Zero-day means there's no patch. There is 0 to patch against.","upvote_count":"8"},{"comment_id":"860889","upvote_count":"7","content":"I believe it would still be network segmentation because when it mentions \"zero-day\" you have to automatically assume that there is no work around. But with network segmentation, you can contain the vulnerability and not allow it to affect the rest of the network. Essentially \"controlling\" it.","timestamp":"1680604200.0","poster":"SIFD32"}],"timestamp":"1677762240.0","poster":"CTE_Instructor"},{"poster":"AzureG0d","comment_id":"1026932","upvote_count":"2","content":"I don't know who yo are @ay_ma but this is a cold answer lol. I'm with yo in selecting A here, makes the most sense.","timestamp":"1696620960.0"}],"timestamp":"1663553880.0","content":"Selected Answer: A\nIPS can only protect against known host and application-based attacks and exploits. IPS inspects traffic against signatures and anomalies, it does cover a broad spectrum of attack types, most of them signature-based, and signatures alone cannot protect against zero-day attacks. (www.rawcode7.medium.com)\n\nHowever, with network segmentation, you're able to isolate critical assets into different segments. And when a zero-day attack occurs, you're not at risk of losing all and are able to isolate the attack's effect to one segment.","upvote_count":"38","comment_id":"672856","poster":"Ay_ma"},{"content":"Had to look this up myself as there is no real clear answer here. One of the Sec+ books I have suggested IPS and segmenting. Google search even says IPS in this regard as well. I would personally say Network Segmentation but otherwise not sure. My comment is not all that helpful I know but just wanted to throw my thoughts out there.","upvote_count":"24","timestamp":"1663801620.0","comment_id":"675571","poster":"beardsly","comments":[{"content":"I believe it's B, patch management. I don't really get how segmenting network can defend or prevent a zero day for being exploited on your network. I put this questions to chatGPT and it gave me B as the answer, so that's what I'm going with.","comment_id":"798473","timestamp":"1675552560.0","comments":[{"poster":"sarah2023","content":"Wrong, the essence of a zero day vulnerability is that you can't prevent or protect against something you have not encountered in the past.","upvote_count":"3","timestamp":"1692351960.0","comment_id":"984347"},{"poster":"rondo24","upvote_count":"3","timestamp":"1675633380.0","comment_id":"799198","content":"I did the same and then I pointed out to chat GPT that a Zero Day is by definition not known and it changed its answer and said \"However, even though the vendor may be unaware of the vulnerability, there are still ways to mitigate the risks posed by zero-day vulnerabilities. For example, network segmentation, intrusion prevention systems, and multiple vulnerability scanners can help to reduce the attack surface and limit the damage that can be done if a zero-day vulnerability is exploited.\"","comments":[{"upvote_count":"4","comment_id":"802631","timestamp":"1675896180.0","poster":"Sanj","content":"Regular software updates: Installing the latest software updates can help protect against known vulnerabilities and fix security holes that could be exploited by zero-day attacks.","comments":[{"upvote_count":"3","comment_id":"1040844","timestamp":"1697039880.0","poster":"daddylonglegs","content":"Do you understand what a zero-day is? It's a vulnerability that is unknown to security researchers or the vendor or the product. You can't fix a vulnerability that you don't know about, therefore there would not be a patch for a zero-day vulnerability until it is discovered, at which point it is no longer a zero-day vulnerability."}]}]}],"poster":"mascot45","upvote_count":"11"},{"content":"To be more clear, zero days is an unknown exploit. There are a few chances that the IPS will detect the attack payloads/signature. But segregating the network would eventually prevent lateral movement even if the attacker has Remote Code Execution privilege on the compromised server.","comment_id":"769995","comments":[{"content":"Agreed, i chose IPS but was thinking segmentation as well for the reasons you stated.","poster":"DriftandLuna","upvote_count":"1","comment_id":"907083","timestamp":"1685079300.0"},{"content":"I think its also in the official course a question like this somewhere. \n\nIPS is the only way to actually protect against zero days, since it uses baselines to detect any anomalies in the system. IPS is not only signature based, it's not an antivirus.\n\n Segmentation would just prevent the spread of the infection throughout the network.","timestamp":"1696577640.0","upvote_count":"2","poster":"thefoque","comment_id":"1026338"}],"poster":"hieptran","upvote_count":"13","timestamp":"1673232480.0"},{"content":"I agree, there is no clear answer here. And though I don't think it's what the test would want us to answer I will say in my 20 years of IT expereince that a good Patch management process is the most helpful when it comes to zero-day exploits. I say this because once a Zero Day becomes public knowledge then the vendor normally rushes to put out some kind of patch or workaround. Having a way to deploy that in a quick and reliable manner is key to getting things back to secure as soon as possible. \n\nBut I would say IPS would be most effective against zero day vulnerabilities because you might be able to detect the usual traffic or activity. Network segmentation will only help slow the intruder down. If you don't have anything to detect the oddity then the attacker could install a back door and then work their way across the segments. What's the old saying? An once on prevention is worth a pound of cure. But in a perfect world, both would be implemented. My vote is C.","timestamp":"1675301280.0","poster":"TinyTrexArmz","upvote_count":"11","comment_id":"795665"}]},{"poster":"e2ba0ff","content":"Selected Answer: C\nsecurity solutions like IPS(host-based IPS) can help detect and block suspicious activities.","upvote_count":"1","comment_id":"1320298","timestamp":"1732983960.0"},{"poster":"Eromons","upvote_count":"1","comment_id":"1220797","timestamp":"1716976620.0","content":"Selected Answer: A\nA network Segmentation in other to avoid the spread of any attack on other network"},{"upvote_count":"4","comment_id":"1181817","poster":"BD69","timestamp":"1711295820.0","content":"Selected Answer: C\nIPSes don't just use known malware definitions to prevent intrusions, they all use heuristics, behavior analysis, baselines, broad signatures (similar to already known ones), and are coupled with threat intelligence. \nPatch management is useless for zero-day exploits.\nVulnerability scanners do not prevent attacks.\nsegmentation may help, but it's not the most effective\nNetwork Segmentation is always a good idea, but only effective at preventing spread of malware"},{"timestamp":"1711169760.0","upvote_count":"2","content":"IPS can potentially detect a zero-day attack in real-time using anomaly or behavior analysis, or even by using euristic analysis which can and take automated action to block or prevent it","poster":"lekiam","comment_id":"1180572"},{"content":"Selected Answer: C\nGoing with C: here as most modern day IPS systems use heuristics and AI (anomaly detection) and is the only thing that might work\nB: Patch Management will have no effect on Zero-Day exploits as everyone knows\nC: Vulnerability scanners will also be useless of Zero-Day exploits\nA: Network segmentation may help a tad bit, but doesn't identify intrusions. so no go","poster":"BD69","comment_id":"1163083","timestamp":"1709248380.0","upvote_count":"3"},{"upvote_count":"2","timestamp":"1707369000.0","comment_id":"1144094","poster":"alicia2024","content":"Selected Answer: C\nAn intrusion prevention system is designed to monitor network traffic and detect and block malicious activities, including those associated with zero-day exploits, based on known attack patterns or abnormal behavior."},{"comment_id":"1141313","timestamp":"1707154560.0","upvote_count":"2","content":"Selected Answer: C\nIt's a tough one but I believe the answer is IPS. Specifically an IPS using heuristic or behavior-based detection. That's usually mentioned as one of the few ways to mitigate Zero-Day attacks. Network segmentation makes sense to an extent, but I think what Comptia is testing here is your understanding of detection methods are how they're leveraged.","poster":"Benrosan"},{"comment_id":"1131311","upvote_count":"1","timestamp":"1706157060.0","poster":"Yomzie","content":"While the precise methods of a zero-day exploit can’t be known in advance, a network intrusion protection system (IPS) will continuously monitor the network for unusual activity.\nThe advantage of IPS over a traditional antivirus-only system is that, it doesn't rely on checking suspicious software against known databases of threats. This means it does not make software vendors need updates or patches to learn about the latest attacks. IPS works by monitoring the day-to-day patterns of network activity across the network.\nWhen there is anomaly detection or events, the IPS/IDS alerts system administrators and lock down the network/firewall."},{"comment_id":"1130077","content":"I think it's IPS. Zero Day again is there is no patch. Network segmenting is an approach to slowing down a bad actor and mitigating damage. The only way to prevent or protect against an unknown vulnerability would be to use a good Next Gen firewall. A vulnerability is only exploitable if it is accessible. IPS, as part of a Next Gen firewall or edge protection, would have a chance at blocking the bad actor for even getting into the network. It's C, final answer.","poster":"hyabasa","timestamp":"1706049120.0","upvote_count":"1"},{"comment_id":"1128737","upvote_count":"1","poster":"johnabayot","content":"Selected Answer: B\nPatch management.","timestamp":"1705933380.0"},{"timestamp":"1704820560.0","content":"The correct answer is \"A.\" Network Segmentation. There are no known patches for a zero day attack which is a characteristic of a zero day attack, so that rules out the patches answer. Intrusion prevention systems will not prevent a zero day attack because the nature of a zero day attack is malware that has been present for a while and has not been detected, therefore that implies that the malware has already made it past your IPS. Vulnerability scanners would imply the same thing as the IPS that the zero day attack has already made it past your scanners and has been on your system for a while. The only logical/possible answer is \"A.\"","poster":"Modiggs2004","upvote_count":"2","comment_id":"1117708"},{"upvote_count":"2","poster":"12f1a9a","content":"I believe the answer is network segmentation. When we read the question carefully it says \"which would be the most effective CONTROL....\" The question is not asking for most effective way to prevent the zero day vulnerability. By segregation you can control the situation to prevent a big loss in my opinion.","timestamp":"1703904960.0","comment_id":"1109352"},{"poster":"ykt","comment_id":"1105724","upvote_count":"1","content":"Selected Answer: C\nIPS is not just about signatures. There are behavior-based IPS and AI-based IPS. So the answer is IPS.","timestamp":"1703568660.0"},{"content":"Selected Answer: B\nLook this site: https://www.imperva.com/learn/application-security/zero-day-exploit/#:~:text=One%20of%20the%\n\nPatch management:\nAnother strategy is to deploy software patches as soon as possible for newly discovered software vulnerabilities. While this cannot prevent zero-day attacks, quickly applying patches and software upgrades can significantly reduce the risk of an attack.","poster":"Enzoxx","upvote_count":"1","timestamp":"1703173740.0","comment_id":"1102692"},{"poster":"saucehozz","content":"Selected Answer: C\nIPS can be effective in detecting and blocking anomalous behavior","comment_id":"1085618","upvote_count":"1","timestamp":"1701481860.0"},{"timestamp":"1700166780.0","upvote_count":"2","content":"Selected Answer: C\nZero-day vulnerabilities refer to security vulnerabilities that are not known to the vendor or the public and, therefore, do not have a patch available. The most effective control against zero-day vulnerabilities is an intrusion prevention system (IPS).\n\nWHY?\nBehavioral Analysis: An IPS can detect and prevent attacks based on anomalous behavior rather than relying solely on known signatures. This is crucial for identifying and blocking attacks exploiting zero-day vulnerabilities.\nHeuristic Analysis: Intrusion prevention systems often employ heuristic analysis to identify patterns of behavior that may indicate an exploit. This helps in detecting previously unknown threats.\nReal-time Protection: IPS operates in real-time and can automatically respond to and block suspicious activities, reducing the window of exposure for zero-day vulnerabilities.\n\nNetwork Segmentation is assuming the vulnerability is already exploited","poster":"Teleco0997","comment_id":"1072783"},{"timestamp":"1699296540.0","poster":"IDTENT","upvote_count":"2","content":"Answer is IPS. As per CompTIA Sec+ textbook page 271: \"Behavioral-based detection means that the engine is trained to recognize baseline\n\"normal\" traffic or events. Anything that deviates from this baseline (outside a defined\nlevel of tolerance) generates an incident. The idea is that the software will be able to\nidentify zero day attacks, insider threats, and other malicious activity\"","comment_id":"1064166"},{"upvote_count":"1","poster":"kj0699","content":"Selected Answer: C\nIPS can sometimes prevent zero-day attacks by detecting and blocking suspicious activity or malware that exploits unknow vulnerabilities, based on heuristics or behavior rather than known signatures.","timestamp":"1698951000.0","comment_id":"1060803"},{"poster":"TheFivePips","content":"Selected Answer: A\nThis is a bad question. I'd personally go with network segmentation because both IPS and patch management can't really do anything against an exploit that is unknown to them. That being said, I feel like in the real world, those are exactly the tools you would use to address the exploit after you know about them (but then it's not a zero-day, so we're back at network segmentation)","comment_id":"1059912","upvote_count":"3","timestamp":"1698856560.0"},{"content":"My Answer is B\nI don't think you can defend against a zero day vulnerability other than patching your systems. Don't just think about it before it becomes public when only a few people know the vulnerability. After it becomes public then the hunt will begin to find the unpatched systems. Good luck with your segmented network and IPS while the vulnerability hasn't been fixed with the patches.","timestamp":"1698406800.0","poster":"Mahoni","comment_id":"1055534","upvote_count":"1"},{"upvote_count":"1","content":"I have a feeling that this was written as such by design. I think Comptia will give you credit for any choice you select because they all apply in some way.","timestamp":"1698348840.0","comment_id":"1054872","poster":"MortG7"},{"poster":"PropheticBettor","timestamp":"1698095100.0","upvote_count":"1","content":"Network segmentation doesn't actually stop the Zero Day, just minimizes it's impact. IPS will minimize impact through stopping the zero day which makes it more effective","comment_id":"1052256"},{"comment_id":"1048049","timestamp":"1697727660.0","upvote_count":"1","poster":"FRANCISCO2000","content":"We can find thise Answer in Cisco.com about Network Segmentation."},{"comment_id":"1044026","poster":"tonnage800","timestamp":"1697362860.0","content":"Selected Answer: C\nC. Intrusion prevention system: IPSs are designed to identify and prevent suspicious activities by analyzing behavior patterns and the traffic flow. They are effective against zero-day vulnerabilities because they don't rely solely on signatures of known vulnerabilities (like antivirus software), but also analyze behavior to block potential zero-day attacks.","upvote_count":"4"},{"content":"Selected Answer: B\nPatch management is the most effective control against zero-day vulnerabilities. Zero-day vulnerabilities are security flaws that are exploited by attackers before the vendor has released a patch or fix for them. Patch management involves regularly updating and applying patches to software, operating systems, and applications to address known vulnerabilities. While it may not address zero-day vulnerabilities as they are initially discovered, it helps protect against them once patches become available.\n\nThe other options, such as network segmentation, intrusion prevention systems, and multiple vulnerability scanners, are important security measures but may not be as directly effective in protecting against zero-day vulnerabilities as timely patch management.","poster":"Cyberjerry","upvote_count":"1","timestamp":"1696629660.0","comment_id":"1026976","comments":[{"upvote_count":"1","timestamp":"1697040000.0","comment_id":"1040848","content":"You understand that once a patch is released for a zero-day it is no longer a zero-day vulnerability right? When the question asks about the most effective control against zero-days it's asking about vulnerabilities you don't even know you have and that there are no patches for. How would patch management help against a vulnerability that no one even knows exists? Network segmentation is the best answer.","poster":"daddylonglegs"}]},{"upvote_count":"1","content":"Network Segmentation (A): By dividing a network into segments and controlling the flow of traffic between them, network segmentation can help contain the impact of a zero-day vulnerability. If an attacker exploits a vulnerability in one segment, they may be restricted from moving laterally to other segments.","comment_id":"1023998","poster":"mjr131","timestamp":"1696341480.0"},{"upvote_count":"4","timestamp":"1695575760.0","content":"A. Network segmentation\n\nNetwork segmentation is the most effective control against zero-day vulnerabilities among the options provided.\n\nZero-day vulnerabilities are security vulnerabilities that are not yet known to the vendor or the public, meaning there are no patches or fixes available. By implementing network segmentation, organizations can isolate critical systems or sensitive data from other parts of the network. This way, even if an attacker gains access to one part of the network, they won't necessarily have access to the entire system.\n\nWhile patch management (Option B) is crucial for addressing known vulnerabilities, it is not effective against zero-day vulnerabilities since no patches exist.\n\nIntrusion Prevention Systems (Option C) and multiple vulnerability scanners (Option D) are important security tools, but they primarily focus on detecting and preventing known threats. They may not be as effective against unknown vulnerabilities, like zero-days.","poster":"hipnos94","comment_id":"1016056"},{"comment_id":"1009250","content":"Network segmentation is my guess. The idea of a zero-day attack is a vulnerability that has no patch, so patch management would not be effective, and multiple vulnerability scans would not be able to identify this vulnerability since it is not known yet. Segmenting the network in the case that a vulnerability exists and data exploitation occurs would prevent it from reaching the entire network as a whole, successfully quarantining the attack and allowing for the company to handle it on a smaller scale.","timestamp":"1694889420.0","upvote_count":"2","poster":"Notgoodwithcomputers99"},{"comment_id":"1007101","timestamp":"1694658060.0","content":"IPS is not only signature based. It is also behavior based.","poster":"RogerW","upvote_count":"2"},{"timestamp":"1693507500.0","content":"In CompTIA's eyes, the wrong answers with all deal with Prevention and Detection. Leaving Network Segmentation as the only answer. answer.","upvote_count":"2","comment_id":"995416","poster":"Sublime_Cheese"},{"comment_id":"993147","timestamp":"1693316160.0","upvote_count":"1","comments":[{"content":"Correction: Patch Management, if done regularly, can increase the chances of NOT being exploited because even program developers can push patches for holes they have discovered themselves.","comments":[{"upvote_count":"1","poster":"daddylonglegs","comment_id":"1040854","content":"Okay but you're missing the point and seem to be confused at what mitigation means. \nA zero-day vulnerability is one that is not known to the security community and therefore won't be fixed until someone discovers and reports it and a patch is released, at which point it is no longer a zero-day vulnerability. There's nothing that can completely eliminate the risk of zero-days because they are unknown by definition. There could be a major vulnerability in Windows that everyone is susceptible to right now, but patch management won't do a lick of good because the vulnerability is by definition unknown and unpatched. Network segmentation is the correct answer.","timestamp":"1697040300.0"}],"timestamp":"1693316280.0","poster":"Sallyabat","upvote_count":"1","comment_id":"993149"}],"content":"Selected Answer: B\nI'd go for Patch Management. Network segmentation won't help mitigate zero-day attack but can only prevent lateral movement. Patch Management, if done regularly, can increase the chances of being exploited because even program developers can push patches for holes they have discovered themselves.","poster":"Sallyabat"},{"content":"Selected Answer: A\nA. Segmentation because there are no patches for zero day vulnerabilies, it's basically the description of a zero day vulnerabilty. For the same reason, no IPS or scanner will help you protect against a vulnerability that has never been seen before. Segmentation will isolate it and prevent against spreading to other segments in the network which is the best you can do with it.","timestamp":"1692351900.0","comment_id":"984344","upvote_count":"1","poster":"sarah2023"},{"content":"Selected Answer: A\nJust putting it out there that in Jason Dion's practice question, a similar question came up : \"Which of the following would NOT be useful in defending against a zero-day threat?\nAllow listing\nThreat intelligence\nPatching\nSegmentation\n\nExplanation\nOBJ-1.6: While patching is a great way to combat threats and protect your systems, it is not effective against zero-day threats. By definition, a zero-day threat is a flaw in the software, hardware, or firmware that is unknown to the party or parties responsible for patching or otherwise fixing the flaw. This attack has no time (or days) between the time the vulnerability is discovered and the first attack, and therefore no patch would be available to combat it. Using segmentation, allow listing, and threat intelligence, a cybersecurity analyst, can put additional mitigations in place to protect the network even if a zero-day attack was successful.\"\n\nSo im guessing Jason Dion will choose A.","comment_id":"983300","upvote_count":"3","poster":"je123","timestamp":"1692254520.0"},{"poster":"RevolutionaryAct","comment_id":"974046","timestamp":"1691341020.0","content":"Selected Answer: A\nMistake in the answer because if the answer is C here then the answer cannot be C in question #40, which is the best answer to describe zero day exploits:\n\nC. A zero-day exploit is initially undetectable, and no patch for it exists.\n\nTherefore we know patches can't be the answer, nor can it be detected so scanners won't help. If it said zero-day \"exploit\" then IPS would possibly make sense as it could detect an anomaly using heuristics, but the question says control in regards to \"vulnerability\" and therefore segmentation is best.\n\nhttps://cybriant.com/how-to-prevent-zero-day-attacks-in-5-steps","comments":[{"poster":"RevolutionaryAct","comment_id":"999555","timestamp":"1693920660.0","content":"Actually I am changing this to C - IPS as I review these questions again. A is good but an IPS *could* be anomaly or heuristic based and therefore detect, whereas segmentation might stop but wouldn't be ideal.","upvote_count":"1"}],"upvote_count":"1"},{"poster":"Nikamy","content":"Selected Answer: A\nA - There are no patches availabe to a Zero Day when it first appears and none knows about it. I'm going with A","comment_id":"964947","timestamp":"1690479000.0","upvote_count":"1"},{"poster":"faha83","upvote_count":"1","comment_id":"963114","timestamp":"1690318200.0","content":"network segmentation seem more visible considering no patch is available"},{"comments":[{"comment_id":"960910","poster":"Protract8593","timestamp":"1690153440.0","content":"While network segmentation is a valuable security measure and can help improve overall network security, it is not specifically designed to address zero-day vulnerabilities. Here are some key points to consider:\n\n1. Scope of Control: Network segmentation primarily deals with controlling network traffic and access between different segments. It does not directly address the existence or exploitation of zero-day vulnerabilities in specific systems or applications.\n\n2. Prevention vs. Mitigation: Zero-day vulnerabilities are newly discovered and exploited before vendors have had a chance to release patches or fixes. Network segmentation does not prevent zero-day vulnerabilities from being exploited. It can only limit the spread of the impact if a system is already compromised.","upvote_count":"1","comments":[{"comments":[],"upvote_count":"1","comment_id":"960911","poster":"Protract8593","timestamp":"1690153440.0","content":"3. Limitations of Network Segmentation: While network segmentation can be effective against known threats and attacks, it may not provide complete protection against sophisticated attackers who can bypass network boundaries using advanced techniques.\n\n4. Zero-Day Exploits Can Cross Segments: If a zero-day vulnerability is exploited on a system within a specific network segment, it is possible for the attacker to leverage other vulnerabilities or attack vectors to move to other segments, especially if there are misconfigurations or inadequate security controls in place.\n\nIn contrast, patch management (Option B) is a more effective control against zero-day vulnerabilities. By promptly applying patches and updates to systems and software, organizations can close known vulnerabilities, including zero-day vulnerabilities, reducing the attack surface and mitigating the risk of exploitation.\n\nIn summary, while network segmentation is an important security measure, it is not specifically tailored to address zero-day vulnerabilities. Patch management remains the most effective control against zero-day vulnerabilities as it directly addresses the timely application of patches to close known security holes."}]}],"timestamp":"1690153380.0","upvote_count":"1","content":"Selected Answer: B\nPatch management is the most effective control against zero-day vulnerabilities. Zero-day vulnerabilities are newly discovered and exploited vulnerabilities for which there are no official patches or fixes available from the software vendors. Attackers exploit these vulnerabilities before the vendor becomes aware of them and can release a patch.\n\nBy having a robust and proactive patch management process in place, organizations can regularly update and apply patches to their systems and software as soon as they become available. This reduces the window of opportunity for attackers to exploit zero-day vulnerabilities. Keeping systems up-to-date with the latest patches helps mitigate the risk posed by zero-day exploits.\n\nLet's provide a thorough explanation of why option A, \"Network segmentation,\" is not the most effective control against zero-day vulnerabilities.\n\nNetwork segmentation is a security practice that involves dividing a network into smaller subnetworks or segments. Each segment is isolated from others, creating barriers that restrict the lateral movement of threats within the network. The idea behind network segmentation is to contain the impact of a security breach by limiting an attacker's ability to move freely across the network.","poster":"Protract8593","comment_id":"960909"},{"content":"I will go with Network segmentation because most of the zero might not be picked up by the IPS.","timestamp":"1689932940.0","poster":"EEZ12","comment_id":"958299","upvote_count":"1"},{"content":"Selected Answer: B\nZero-day vulnerabilities refer to security vulnerabilities in software that are unknown to the software vendor and for which no patch or fix is currently available. These vulnerabilities pose a significant risk because they can be exploited by attackers before a patch is released.\n\nPatch management involves regularly applying updates, patches, and fixes to software and systems to address known vulnerabilities. While it does not specifically target zero-day vulnerabilities, it is a crucial control for overall security. By keeping software and systems up to date with the latest patches, organizations can mitigate the risk of both known vulnerabilities and, to some extent, zero-day vulnerabilities.","timestamp":"1689072840.0","upvote_count":"1","poster":"sursur","comment_id":"948903"},{"content":"Selected Answer: A\nA. Network segmentation: This can limit the impact of a zero-day attack by preventing it from spreading across the network. However, it does not prevent the initial exploitation of the zero-day vulnerability.","upvote_count":"2","timestamp":"1684653720.0","poster":"Essi","comment_id":"902992"},{"content":"Selected Answer: A\nC (IPS) and D (Vulnerability scanners) cannot detect zero-day.\nRemain options are A (Network segmentation) and B (Patch management).\nAs for “Control” which the question is asking, Network Segmentation is more effective, as at the beginning of Zero attack, it’s better you already segmented your network to reduce the spreading across your network, then a patch maybe released after sometime.\nSo answer is A. Network Segmentation","poster":"Abdul2107","comment_id":"871063","upvote_count":"4","timestamp":"1681574760.0"},{"poster":"TheWaraba","upvote_count":"4","comments":[{"poster":"daddylonglegs","content":"IPS is a better answer than patch management but network segmentation is still the better answer. An IPS could detect, but since we're talking about zero-days it more than likely won't. While network segmentation won't stop the initial exploitation it would contain the breach to that network segment, and the attacker wouldn't be able to move into different network zones without more work.","upvote_count":"1","timestamp":"1697040540.0","comment_id":"1040863"}],"timestamp":"1681388160.0","comment_id":"869385","content":"Patch management is wrong. By the definition of Zero-Day vulnerabilities there are no patches for it. \n\n\"A zero-day (or 0-day) vulnerability is a software vulnerability that is discovered by attackers before the vendor has become aware of it. By definition, no patch exists for zero day vulnerabilities and user systems have no defenses in place, making attacks highly likely to succeed.\"\n\nAn IPS is one of the best solutions here, IPS doesn't always need a signature as some people are saying here, they can detect anomalies and suspect traffic based on baseline traffic. They also comprise robust firewalls that can help detect and stop the attackers.\n\nGood article here:\nhttps://www.imperva.com/learn/application-security/zero-day-exploit/"},{"comment_id":"868576","upvote_count":"1","poster":"baker1109","content":"selected C.\nIPS can not detect zero-day exploiting code, but it can detect or prevent other parts of code of zero-day, such as payload, back door, etc. \nnot B, cuz zero-day means unknown, patch for known vulnerabilities.\nnot A. \nif the same application with zero-day vulnerability installed in all machines, segmentation doesn't makes sense.","timestamp":"1681317900.0"},{"upvote_count":"1","poster":"Confuzed","timestamp":"1681271940.0","content":"Selected Answer: B\nPatch management, as it relates to zero-day's is not about mitigating the threat before it's known (there is no effective way to do that). Its about addressing the zero day as quickly as possible once it's identified (the most dangerous period in the life of a zero-day).","comments":[{"timestamp":"1697040600.0","upvote_count":"1","poster":"daddylonglegs","comment_id":"1040865","content":"You can certainly mitigate the scope and the impact of a zero-day using network segmentation."}],"comment_id":"867881"},{"upvote_count":"2","content":"B) Professor Messer mentions Patch Management is best in his notes.","timestamp":"1681158660.0","poster":"TheGuitarMan_61","comment_id":"866609"},{"poster":"Kgun","upvote_count":"2","content":"IPS is not an answer since there is no way of knowing about the vulnerability. Patches are for know vulnerabilities. Network Segmentation isolates network traffic and lessens the attack surface. Answer: A","timestamp":"1681147500.0","comment_id":"866477"},{"timestamp":"1681094040.0","upvote_count":"1","poster":"Neither_you_nor_me","content":"Selected Answer: B\nEven though A is a good choice B sounds better\nReason is A will just limit the traffic to some network segments where as patching will update the necessary loopholes recently found thereby having lesser chances if all systems are needed to be in the same network","comments":[{"upvote_count":"1","content":"Patch management relies on there being a patch available. There's no guarantee that a vulnerability fix will come within a specific timeframe. Network segmentation would contain the scope of the initial breach and would be an effective mitigation. Whether or not it is better than an IPS is up for debate but certainly patch management would not do anything to mitigate a zero-day exploit.","comment_id":"1040870","timestamp":"1697040720.0","poster":"daddylonglegs"}],"comment_id":"865947"},{"comment_id":"864912","content":"Selected Answer: C\nAs zero-day vulnerabilities are unknown to the public and have no patches or fixes available, patch management may not be effective against such vulnerabilities. Instead, intrusion prevention systems (IPS) are the most effective control against zero-day vulnerabilities as they can detect and prevent attacks based on behavior, heuristics, and other indicators of compromise before patches or signatures are available. Therefore, option C is the correct answer.","upvote_count":"1","poster":"darklion","timestamp":"1680977280.0"},{"content":"Selected Answer: B\nAccording to ChatGPT is B.\n\nB. Patch management is the most effective control against zero-day vulnerabilities.\n\nA zero-day vulnerability is a security flaw that is unknown to the software vendor and has not been patched. Since it is unknown, traditional security controls such as intrusion prevention systems and vulnerability scanners are not effective against it.\n\nThe best way to mitigate the risk of zero-day vulnerabilities is to keep software and systems up-to-date with the latest patches and updates. Patch management is the process of identifying, acquiring, installing, and verifying patches for various software applications and operating systems. By keeping systems and software up-to-date, the organization can reduce the risk of zero-day vulnerabilities being exploited.","upvote_count":"1","timestamp":"1680828840.0","comment_id":"863396","poster":"ffsilveira10"},{"comment_id":"861280","timestamp":"1680624780.0","upvote_count":"1","poster":"ZAld12","content":"This has to be one of the more idiotic designed questions for the exam. This answer can easily be IPS OR Patch Mangement."},{"content":"Zero-day vulnerabilities refer to security flaws that have not yet been discovered by software developers, making them particularly difficult to defend against. Of the options provided, patch management is generally considered the most effective control against zero-day vulnerabilities.\n\nPatch management involves regularly updating software systems with the latest security patches, which can address known vulnerabilities and prevent attackers from exploiting them. While patch management may not protect against every possible zero-day vulnerability, it is an important component of any comprehensive security strategy.\n\nNetwork segmentation can also be an effective control, as it can limit the potential impact of a zero-day vulnerability by isolating affected systems from the rest of the network. Intrusion prevention systems and multiple vulnerability scanners can also help to detect and mitigate zero-day vulnerabilities, but they are not as effective as patch management in preventing them in the first place.\n\nTherefore, the most effective control against zero-day vulnerabilities is B. Patch management.","upvote_count":"1","comment_id":"861272","timestamp":"1680624420.0","poster":"Mkoenig69"},{"timestamp":"1680563340.0","content":"If there's a patch for it, it's no longer a zero-day...","comment_id":"860423","upvote_count":"1","poster":"ankiuser"},{"comment_id":"858794","timestamp":"1680435480.0","content":"Selected Answer: B\nChatGPT\nZero-day vulnerabilities are software vulnerabilities that are unknown to the vendor and have no available patch or solution. They are typically discovered by attackers and used to exploit systems before the vendor becomes aware of the vulnerability. Patch management is the process of maintaining and updating software applications to address known vulnerabilities, including those that are publicly disclosed. While patch management cannot address unknown vulnerabilities, it can significantly reduce the attack surface and limit the impact of known vulnerabilities.","poster":"SueySauce","upvote_count":"1"},{"poster":"examrobo","content":"i think its A","comment_id":"857185","upvote_count":"1","timestamp":"1680272760.0"},{"content":"The MOST effective control against zero-day vulnerabilities is intrusion prevention system (IPS).\n\nExplanation:\nA zero-day vulnerability is a software vulnerability that is unknown to the software vendor and therefore has no patch available. An IPS monitors network traffic for known attack patterns and behaviors, which can help identify and block zero-day attacks. An IPS can also use behavioral analysis to identify new and previously unknown attack patterns that might be associated with zero-day vulnerabilities. While patch management is important, it only addresses known vulnerabilities. Similarly, network segmentation and multiple vulnerability scanners are useful controls, but they do not provide protection against unknown threats like zero-day vulnerabilities.","poster":"arrowphoto7604493ahmed","timestamp":"1680061080.0","upvote_count":"1","comment_id":"853974"},{"timestamp":"1679649120.0","content":"Selected Answer: A\nwhoever says patch management is smoking poop shit - how do you have a patch for a vulnerability you didnt know about until now????","upvote_count":"4","comment_id":"849144","poster":"bitezadusto"},{"comment_id":"838470","content":"Selected Answer: B\nPatch management.","upvote_count":"1","poster":"Nick40","timestamp":"1678756740.0"},{"upvote_count":"1","comment_id":"833842","timestamp":"1678357560.0","content":"https://www.professormesser.com/security-plus/sy0-501/zero-day-attacks-4/","poster":"Omi0204"},{"content":"Zero-day attacks are attacks that are not previously known to the security community. Therefore, signature based controls, such as vulnerability scans, antivirus software, and intrusion prevention systems are not effective against these attacks. Application control software may use whitelisting to limit software running on a system to a list of known good applications. This technique may prevent zero-day malware from running on the protected system.\n\nSo most closely answer is Patch management.","timestamp":"1678357440.0","poster":"Omi0204","comment_id":"833840","upvote_count":"1"},{"poster":"attesco","comment_id":"833206","upvote_count":"2","timestamp":"1678296060.0","content":"According to Security+ textbook by James Michael Stewart on page 93. Says - The existence of zero day vulnerabilities makes it vital that you have a strong patch management program in your organization that ensure the prompt application of critical security updates"},{"comment_id":"833145","timestamp":"1678291500.0","poster":"princajen","content":"Selected Answer: B\nIt actually is a combination of everything. While patch management is important, there is a need to implement IPS and scan for vulnerabilities. These questions are getting so vague, that it is open for debate.","upvote_count":"2"},{"timestamp":"1678170360.0","upvote_count":"1","content":"There are two approaches Detective control and Preventive Controls. They have not mentioned in question which control to apply. Patch Management and IPS is preventive control . Network Segmentation is out of Scope. Vulnerability Scanner is Detective control . According to me patch management is most effective control against Zero Days .","poster":"viduNami","comment_id":"831606"},{"comment_id":"827905","timestamp":"1677842100.0","poster":"Nishkurup","upvote_count":"1","content":"ChatGpt\nCompTIA recommends several controls to protect against zero-day vulnerabilities, but the most effective control they suggest is to keep software and systems up to date with the latest security patches.\nCompTIA suggests that organizations should implement a patch management program that ensures all software and systems are patched in a timely manner, with critical patches prioritized. This includes regularly reviewing and applying security patches for operating systems, applications, and firmware.\nIn addition to patch management, CompTIA also recommends other measures to protect against zero-day vulnerabilities, such as:\nUsing advanced threat detection and response tools that can detect and respond to attacks in real-time. Implementing network segmentation to limit the impact of a zero-day vulnerability if it is exploited. Using application whitelisting to restrict the execution of unauthorized applications.\nImplementing strong access controls and using firewalls to restrict access to vulnerable systems and data."},{"upvote_count":"1","poster":"Ahmed_aldouky","content":"Selected Answer: C\nthe Correct answer is C . \" effective control \" and that will be IPS","comment_id":"816342","timestamp":"1676967000.0"},{"content":"Selected Answer: C\nA zero-day vulnerability is a security flaw in a software or system that is unknown to the vendor or developers and for which there is no patch or fixes available. Therefore, patch management would not be effective in mitigating zero-day vulnerabilities since there is no patch available yet. In this case, the most effective control against zero-day vulnerabilities would be intrusion prevention systems (IPS), which can detect and block zero-day exploits based on their behavior.","comment_id":"808636","poster":"geekneek","upvote_count":"1","timestamp":"1676395740.0"},{"comment_id":"802236","upvote_count":"1","poster":"haroun22","content":"B\nPatch Management is the correct answer.","timestamp":"1675873020.0"},{"upvote_count":"1","timestamp":"1674959580.0","content":"D. Employing multiple vulnerability scanners can detect some zero day exploits but not all. Patch management is another good answer, while it won't prevent the attack, quickly applying patches and software upgrades can significantly reduce the risk of an attack.\n\nThe question says control not prevention.\nD is the better answer because it can detect some zero-day exploits.\n\nA web application firewall is one of the most effective ways to prevent zero day attacks, but that is not one of the answers listed.","comment_id":"791329","comments":[{"content":"A. Network segmentation. I have changed my thoughts and agree Network segmentation, because it isolates it from all outside communications with an air gap.","poster":"DALLASCOWBOYS","upvote_count":"1","timestamp":"1674961080.0","comment_id":"791344"}],"poster":"DALLASCOWBOYS"},{"timestamp":"1673271060.0","content":"IPS. IPS can either be signature-based or heuristic/behavorial/anomaly-based. The answer doesn't specify what the IPS configuration is, so we can assume that it is a a heuristic/behviorial/anomaly-based IPS. Network Segmentation is a solution, but it is not the best solution. It is always better to prevent an attack from happening in the first place than it is to mitigate the impact of an attack after it has occurred.","poster":"Cber123","comment_id":"770425","upvote_count":"2"},{"content":"Selected Answer: B\nB - I need to have the newest patches","poster":"markus_was","comment_id":"766841","upvote_count":"3","timestamp":"1672937220.0","comments":[{"upvote_count":"9","timestamp":"1673383380.0","content":"you can have all the patches in the world..they won't help you. They are called zero day because there is no patch for it..at least not at time of exploitation","poster":"MortG7","comment_id":"771782"}]},{"comment_id":"749455","poster":"mike47","timestamp":"1671424500.0","content":"Selected Answer: A\nA. Network Segmentation is the only answer. There are plenty of website information on this if you type \"network segmentation zero day attack\" in the google search. Additionally, the A successful Zero Day attack is something that is hidden, it can only be mitigated to cause less damage. As there are no Vender patches out there for it. \nhttps://www.networkworld.com/article/2317169/segment-data-centers-to-prevent-zero-day-attacks.html","upvote_count":"2"},{"poster":"JustInTime23","timestamp":"1670354580.0","content":"My Sec+ instructor said that it was IPS, not because IPS can detect the actual zero day, but because the IPS will be able to identify that something is wrong and then both alert and try to take action.","upvote_count":"5","comment_id":"737159"},{"comment_id":"729502","upvote_count":"1","poster":"[Removed]","timestamp":"1669659120.0","content":"Selected Answer: A\nIt's unknown vulnerability so IPS ant other won't help. The only good answer is A."},{"comment_id":"717075","timestamp":"1668310980.0","poster":"EubertT","content":"Intrusion Protection\nWhile the precise methods of a zero-day exploit can’t be known in advance, a network intrusion protection system (NIPS) can monitor the firms’ network for unusual activity.\n\nThe advantage of NIPS over a traditional antivirus-only system is it does not rely on checking software against a known database of threats. This means it does not need updates or patches to learn about the latest attacks. NIPS works by monitoring the day-to-day patterns of network activity across the network.\nhttps://cybriant.com/how-to-prevent-zero-day-attacks-in-5-steps/","upvote_count":"3"},{"timestamp":"1668101580.0","upvote_count":"2","comment_id":"715432","poster":"rodwave","content":"Selected Answer: A\nAnswer: Network segmentation\n\nNetwork segmentation means you're isolating your network into smaller parts(segments). This can be helpful for providing unique control to each of those segments. Cyber attacks can spread quickly and a large network just means a large attack surface for an attack to spread through. Segmenting a network would isolate a zero-day attack to just that network instead losing an entire network you can isolate the attack to just that segment, hopefully.\n\nAn issue with zero-day vulnerabilities is that they are so new that they are likely not going to be detected initially, so the option for IPS (C) or using vulnerability scanner (D) would not be the most effective in preventing zero-day attacks. Option B would essentially mean having to wait for a patch to be discovered for the vulnerability, so this option would not work either."},{"poster":"Eric1212","timestamp":"1667859780.0","upvote_count":"2","comment_id":"713340","content":"Selected Answer: C\nFrom a Comptia instructor,\" the answer is C\""},{"upvote_count":"7","content":"Selected Answer: C\nC is the best choice here. The question asks what the most effective control against zero-day vulnerabilities is. Intrusion Prevention Systems (IPS) both monitor the behavior and protect against activity outside of a defined/expected behavior via system hardening techniques, limiting attack vectors. Obviously, a system would be safest from attack if it was turned off and inaccessible, but this isn't practical. The system must be booted to function. This principle carries over to the idea of network segmentation. Often connectivity to other networks to function is required. While network segmentation could help, it isn't a control that you can apply universally to all systems in all contexts in the way IPS is. IPS isn't always and only signature-based as some have suggested. Just my two cents.","comment_id":"683845","poster":"VendorPTS","timestamp":"1664571960.0"},{"content":"IPS may detect by: signatures, anomaly behaviors, heuristics, etc.\n\nI think this would be a potential correct answer.","comment_id":"677598","poster":"db97","timestamp":"1663992600.0","upvote_count":"3"},{"content":"Selected Answer: A\nMOST effective CONTROL","upvote_count":"5","timestamp":"1662597180.0","poster":"Halaa","comment_id":"662999"},{"content":"Selected Answer: B\nPatch Management.","upvote_count":"2","timestamp":"1662155640.0","comments":[{"poster":"[Removed]","comment_id":"657863","upvote_count":"1","timestamp":"1662155940.0","content":"Actually, nevermind. Intrusion prevention system seems to be the best answer here.","comments":[{"content":"This assumes the IPS is able to detect the Zero-Day, which most likely isn't possible since it is a brand new threat. I think its A","timestamp":"1662880380.0","comment_id":"665899","upvote_count":"1","poster":"svet123"}]},{"poster":"Jakalan7","timestamp":"1663832040.0","comment_id":"675846","content":"There's no way it's patch management, if it's a zero-day attack then it does not matter if your systems are patched or not. Zero-day attacks have no official patch to fix the issue.","upvote_count":"8"}],"comment_id":"657860","poster":"[Removed]"},{"comment_id":"657618","poster":"xOdinx","upvote_count":"5","content":"Selected Answer: A\nA - there are no signatures yet to observe in a zero-day","timestamp":"1662137220.0"},{"timestamp":"1661954880.0","poster":"Joe1984","upvote_count":"7","comments":[{"comments":[{"content":"No, if you use your baseline. Everything that is not your baseline of activity will raise a flag. But in this question they only say IPS, they do not specify (heuristic beaver). So i am going to A, segmenting the lan will incrise the security (don't let spreed the zero day by the network).","upvote_count":"1","poster":"Ribeiro19","comment_id":"658199","timestamp":"1662191220.0"},{"comment_id":"658200","poster":"Ribeiro19","upvote_count":"1","timestamp":"1662191280.0","content":"yes, if you use your baseline. Everything that is not your baseline of activity will raise a flag. But in this question they only say IPS, they do not specify (heuristic beaver). So i am going to A, segmenting the lan will incrise the security (don't let spreed the zero day by the network)."}],"timestamp":"1661988660.0","poster":"stoneface","upvote_count":"4","content":"IPSs can also use behavioral or heuristic based protection.","comment_id":"655593"}],"content":"Selected Answer: A\nDon't IPS use signatures as well? Therefore there would not be one cause its zero-day. If a zero day hits one network, segmentation could help contain it at least.","comment_id":"655166"}],"answer_images":[],"answer_ET":"A","question_id":411,"unix_timestamp":1661954880,"isMC":true,"topic":"1","answers_community":["A (61%)","C (25%)","14%"],"choices":{"C":"Intrusion prevention system","A":"Network segmentation","B":"Patch management","D":"Multiple vulnerability scanners"},"question_images":[],"url":"https://www.examtopics.com/discussions/comptia/view/78721-exam-sy0-601-topic-1-question-47-discussion/","timestamp":"2022-08-31 16:08:00","answer":"A"},{"id":"xpJieS83QP6gJtEYpNRE","topic":"1","isMC":true,"answer_ET":"B","answer_description":"","timestamp":"2023-05-02 16:18:00","exam_id":367,"answer":"B","question_text":"A company policy requires third-party suppliers to self-report data breaches within a specific time frame. Which of the following third-party risk management policies is the company complying with?","discussion":[{"upvote_count":"1","timestamp":"1721574540.0","content":"Every time I see “third party” involved it’s SLA","comment_id":"1252518","poster":"qacollin"},{"comment_id":"1192354","content":"Business to user = MOU. Business to business = SLA","poster":"Pesos","upvote_count":"2","timestamp":"1712674980.0"},{"poster":"Ghost6333525","comment_id":"1112782","timestamp":"1704288000.0","upvote_count":"4","content":"Selected Answer: B\nTIME= SLA"},{"timestamp":"1703963280.0","poster":"Malkhofash","upvote_count":"2","comment_id":"1109907","content":"Selected Answer: B\nSLA is the answer"},{"timestamp":"1689648240.0","content":"Selected Answer: B\nB. SLA","poster":"Gamsje","comment_id":"954843","upvote_count":"1"},{"poster":"ApplebeesWaiter1122","comment_id":"898648","upvote_count":"4","content":"Selected Answer: B\nThe company policy requiring third-party suppliers to self-report data breaches within a specific time frame is an example of compliance with an SLA (Service Level Agreement).","timestamp":"1684177740.0"},{"poster":"if10w","timestamp":"1683211740.0","comment_id":"889448","upvote_count":"1","content":">>>B<<<< >>\"SLA\" (Service Level Agreement) <<<\nThe company policy is complying with the \"SLA\" (Service Level Agreement) third-party risk management policy. An SLA is a contractual agreement between a company and a third-party supplier that outlines the level of service that the supplier is expected to provide. In this case, the SLA requires the third-party supplier to self-report data breaches within a specific time frame. This helps to ensure that the supplier is meeting the company's security requirements and that any breaches are identified and addressed in a timely manner. The other options (MOU, EOL, and NDA) are not directly related to third-party risk management policies."},{"timestamp":"1683037080.0","upvote_count":"1","content":"-B is correct\nThe company policy requiring third-party suppliers to self-report data breaches within a specific time frame is an example of a third-party risk management policy that complies with an SLA (Service Level Agreement), as shown in option B.\n\nAn SLA is an agreement between a service provider and a customer that outlines the level of service that will be provided, as well as any specific requirements or expectations. In the context of third-party risk management, an SLA may include specific requirements related to data security, such as the requirement for third-party suppliers to self-report data breaches within a certain time frame.","comment_id":"887485","poster":"mouettespaghetti"}],"choices":{"A":"MOU","B":"SLA","C":"EOL","D":"NDA"},"unix_timestamp":1683037080,"answer_images":[],"url":"https://www.examtopics.com/discussions/comptia/view/108265-exam-sy0-601-topic-1-question-470-discussion/","answers_community":["B (100%)"],"question_images":[],"question_id":412},{"id":"3vaBtO9pEIovYjyzEkeW","isMC":true,"answer_ET":"C","question_id":413,"timestamp":"2023-05-02 16:19:00","url":"https://www.examtopics.com/discussions/comptia/view/108266-exam-sy0-601-topic-1-question-471-discussion/","unix_timestamp":1683037140,"question_text":"While troubleshooting service disruption on a mission-critical server, a technician discovered the user account that was configured to run automated processes was disabled because the user s password failed to meet password complexity requirements. Which of the following would be the best solution to securely prevent future issues?","answers_community":["C (100%)"],"answer_description":"","question_images":[],"answer_images":[],"answer":"C","discussion":[{"upvote_count":"6","timestamp":"1684177500.0","content":"Selected Answer: C\nThe best solution to prevent future issues in this scenario would be to configure a service account to run the automated processes. Service accounts are designed specifically for running processes and can be configured with the necessary permissions and restrictions to ensure the security of the system. Using an administrator account or a shared account could lead to security risks, as these types of accounts have broader privileges than necessary for running automated processes. Removing password complexity requirements for the user account would also compromise the security of the system.","comment_id":"898646","poster":"ApplebeesWaiter1122"},{"content":"Selected Answer: C\nC. Configuring a service account to run the processes","poster":"cyberPunk28","comment_id":"1096850","timestamp":"1702590360.0","upvote_count":"2"},{"timestamp":"1698938280.0","comment_id":"1060642","upvote_count":"1","poster":"ComPCertOn","content":"Selected Answer: C\nI believe it is C"},{"content":"Selected Answer: C\nService accounts are accounts that are used to run processes that do not require human intervention to start, stop, or administer. From running batch jobs in the data center to executing simple tasks that an organization must complete for purposes of regulatory compliance, many reasons exist for running processes with service accounts that don’t require an account holder. From a security perspective, administrators can configure service accounts to minimize risks associate [sic] with them. For example, in Windows systems, administrators can prevent service accounts from logging in to the system. This limits some of the attack vectors that can be applied to these accounts. Another security provision that can be applied to service accounts that run batch jobs at night is to restrict when they can run. Any service account that has to run in an elevated privilege mode can also be designated to receive extra monitoring and scrutiny.\"\n\n-All-in-One Security+ SY0-601 Exam Guide by Conklin and White","timestamp":"1687739220.0","comment_id":"933934","upvote_count":"4","poster":"LeonardSnart"},{"content":"Selected Answer: C\nThe best solution to securely prevent future issues with the user account that was configured to run automated processes on a mission-critical server would be C. Configuring a service account to run the processes. A service account is a special type of user account that is used by an application or service to interact with the operating system. Service accounts typically have limited privileges and are not subject to password complexity requirements. By configuring a service account to run the automated processes, the technician can ensure that the processes continue to run even if the password complexity requirements change.","poster":"fouserd","upvote_count":"2","timestamp":"1683456960.0","comment_id":"891317"},{"content":">>>>>>>>>>>>C<<<<<<<<< >> Configuring a service account to run the processes <<\nThe best solution to securely prevent future issues would be to \"Configure a service account to run the processes\". A service account is a special type of account that is used to run services or automated processes on a server. By using a service account, the automated processes can run without requiring a user to be logged in, and the account can be configured with the appropriate permissions and security controls to ensure that it is secure. This approach is more secure than using an administrator account or a shared account, as it provides better separation of duties and reduces the risk of compromise. Additionally, removing password complexity requirements for the user account is not recommended, as it would weaken the security of the account and increase the risk of compromise.","timestamp":"1683211620.0","comment_id":"889446","poster":"if10w","upvote_count":"1"},{"poster":"mouettespaghetti","upvote_count":"3","comment_id":"887486","content":"-C is correct\nThe best solution to securely prevent future issues when a user account that was configured to run automated processes was disabled because the user's password failed to meet password complexity requirements is to configure a service account to run the processes, as shown in option C.\n\nService accounts are special-purpose accounts that are used to run services, applications, and automated processes. They are often used to provide a higher level of security for automated processes, as they can be configured with specific permissions and restrictions, and are not typically associated with a specific individual user.\n\nBy configuring a service account to run the automated processes, the organization can ensure that the account is created with appropriate password complexity requirements and other security controls, and that it is not subject to the same password policies as regular user accounts. This can help to prevent future issues related to password complexity requirements and ensure that the mission-critical server continues to operate without interruption.","timestamp":"1683037140.0"}],"topic":"1","choices":{"A":"Using an administrator account to run the processes and disabling the account when it is not in use","B":"Implementing a shared account the team can use to run automated processes","D":"Removing the password complexity requirements for the user account","C":"Configuring a service account to run the processes"},"exam_id":367},{"id":"otz2NdJefXTzzQA7hFZT","answer":"C","unix_timestamp":1683037200,"question_text":"A security analyst is assessing a new y developed web application by testing SQL injection, CSRF, and XML injection. Which of the follow ng frameworks should the analyst consider?","exam_id":367,"answer_description":"","url":"https://www.examtopics.com/discussions/comptia/view/108267-exam-sy0-601-topic-1-question-472-discussion/","choices":{"B":"MITRE ATT&CK","A":"ISO","D":"NIST","C":"OWASP"},"answers_community":["C (100%)"],"timestamp":"2023-05-02 16:20:00","answer_images":[],"discussion":[{"timestamp":"1684177320.0","upvote_count":"10","comment_id":"898645","content":"Selected Answer: C\nThe security analyst should consider OWASP (Open Web Application Security Project) framework. OWASP provides a comprehensive set of guidelines, tools, and techniques to help secure web applications. It also includes a top ten list of the most critical web application security risks, which includes SQL injection, CSRF, and XML injection.","poster":"ApplebeesWaiter1122"},{"comment_id":"1117815","timestamp":"1704830700.0","poster":"psowrong","upvote_count":"1","content":"Selected Answer: C\nOpen Web Application Security Project"},{"timestamp":"1702590420.0","content":"Selected Answer: C\nC. OWASP keyword \"Web\"","upvote_count":"4","comment_id":"1096851","poster":"cyberPunk28"},{"comments":[{"poster":"Xabovion","comment_id":"902434","timestamp":"1684570200.0","content":"Because the key is in \"web application\", that is owasp ground.","upvote_count":"13"}],"upvote_count":"3","comment_id":"899079","timestamp":"1684233780.0","content":"why not B\nMITRE ATT&CK® is a globally-accessible knowledge base of adversary tactics and techniques based on real-world observations.\nsomeone can explain that??","poster":"EvelynStandford"},{"upvote_count":"1","comment_id":"890008","timestamp":"1683287760.0","content":"Selected Answer: C\nC is correct","poster":"fouserd"},{"comment_id":"889443","upvote_count":"1","poster":"if10w","content":">>>>>>C<<<<< OWASP >>>>>>>>Open Worldwide Application Security Project\nThe security analyst should consider the \"OWASP\" framework when assessing a newly developed web application by testing SQL injection, CSRF, and XML injection. OWASP (Open Web Application Security Project) is a widely recognized framework for web application security. It provides a comprehensive list of the most critical web application security risks, including SQL injection, CSRF, and XML injection, and offers guidance on how to prevent and mitigate these risks. By following the OWASP framework, the security analyst can ensure that the web application is secure and protected against common web application security threats.","timestamp":"1683211560.0"},{"upvote_count":"3","timestamp":"1683037200.0","comment_id":"887487","poster":"mouettespaghetti","content":"-C is correct\nWhen assessing a new web application by testing SQL injection, CSRF, and XML injection, the security analyst should consider the OWASP (Open Web Application Security Project) framework, as shown in option C.\n\nThe OWASP framework is a widely used standard for web application security and provides a comprehensive list of the most common web application security risks, including SQL injection, CSRF, and XML injection. The framework also provides guidance and best practices for identifying, mitigating, and preventing these types of security risks."}],"answer_ET":"C","isMC":true,"question_id":414,"topic":"1","question_images":[]},{"id":"dfMAfwKP3l0Q2f1DkOhZ","question_images":[],"timestamp":"2023-05-02 16:21:00","exam_id":367,"answer_images":[],"question_id":415,"isMC":true,"unix_timestamp":1683037260,"answers_community":["D (100%)"],"question_text":"A user s laptop constantly disconnects from the Wi-Fi network. Once the laptop reconnects, the user can reach the internet but cannot access shared folders or other network resources. Which of the following types of attacks is the user most likely experiencing?","answer":"D","answer_ET":"D","discussion":[{"comment_id":"898643","content":"Selected Answer: D\nThe user is most likely experiencing an Evil Twin attack. In this type of attack, an attacker creates a fake access point with the same name as the legitimate access point to which the user is trying to connect. The attacker can then intercept and eavesdrop on the user's network traffic, potentially stealing sensitive information. The user's laptop may be disconnecting and reconnecting to the fake access point, causing the inability to access shared folders or other network resources.","timestamp":"1684177200.0","poster":"ApplebeesWaiter1122","upvote_count":"6"},{"comments":[{"comment_id":"1221294","poster":"AbdullahMohammad251","upvote_count":"3","timestamp":"1717022220.0","content":"SUMMARY: Every evil twin AP is a rouge AP, but not every rouge AP is an evil twin AP."}],"comment_id":"1221292","poster":"AbdullahMohammad251","upvote_count":"1","content":"Selected Answer: D\nGiven that the laptop reconnects without human intervention, the scenario assumes that the device has already saved the network profile of the legitimate network. The evil twin, by definition, has an SSID and credentials identical to a legitimate AP, which makes it possible for a device to automatically connect to a fake AP, if it is within the detection range. This won't happen with rogue APs that don't exactly mimic existing, legitimate networks.","timestamp":"1717022100.0"},{"upvote_count":"1","content":"Evil twin - \n\ndisconnects from the Wi-Fi network---->disassociation packets being sent","timestamp":"1704920580.0","comment_id":"1119028","poster":"MortG7"},{"poster":"cyberPunk28","content":"Selected Answer: D\nD. Evil twin","upvote_count":"1","comment_id":"1096852","timestamp":"1702590480.0"},{"upvote_count":"2","content":"Option D. Here is why \"A rogue access point is an illegitimate access point plugged into a network to create a bypass from outside into the legitimate network. By contrast, an evil twin is a copy of a legitimate access point.\"","timestamp":"1697454660.0","comment_id":"1044900","poster":"fercho2023"},{"comment_id":"1012148","timestamp":"1695201660.0","poster":"sujon_london","content":"Selected Answer: D\nIn this case, the user's laptop is able to connect to the internet but cannot access shared folders or other network resources because it is actually connected to the attacker's evil twin network. The attacker is likely intercepting the user's network traffic and preventing them from accessing certain resources.","upvote_count":"4"},{"comment_id":"1010009","poster":"LinkinPark4evr","timestamp":"1694977440.0","upvote_count":"1","content":"Selected Answer: D\nThere's a disassociation attack and a second AP. Evil Twin. That's what differentiates this from the rogue AP option."},{"content":"Selected Answer: D\nmouettespaghetti, kmummy & ITSheWolf are wrong for choosing C. Rogue Access Point.\n\nFor those who have confusion between C & D:\nRogue Access Point (RAP) is where an unauthorised access point is connected to the network, likely via the switch of the network. The main point of a RAP is for malicious actors to have access into the network, which is not the case as stated in the question.\n\nEvil twin: A AP that mimics the SSID and for more sophisticated attacker, spoofed mac address of a legitimate AP. this is not connected to the network and hence users who are lured into connecting to them will NOT have access to the network, but have access to the internet.","upvote_count":"1","poster":"je123","comment_id":"981520","timestamp":"1692094200.0"},{"poster":"Gaurabdon","content":"Selected Answer: D\nDon't know why the answer is shown C. The answer is clearly D because the user is connected to the internet again (meaning the user has connected to the same wifi). Evil twin is a specific type of rogue access point mimicking the exact wireless network. That is why the user cannot see the shared network resources because the mimicked Wireless Network is not a part of the corporate network.","comment_id":"922109","timestamp":"1686648660.0","upvote_count":"2"},{"comment_id":"916947","poster":"kmummy","content":"C\nThe most common Rogue AP is an ilegitimate AP that is plugged in a network to create a bypass from outside into the legitime network.\n\nAn Evil Twin is a copy of a legitimate AP. The target is different. It tries to hook clients to connect to the fake network to steal information, but is a kind of Rogue AP too. A lot of people is wrong about this. They think an Evil Twin is not a Rogue AP but it is too. Look at the definition on Wikipedia: Rogue AP. You can read there \"... it is tagged as rogue access point of the second kind, which is often called an Evil Twin\".\n\nThe Evil Twin has too \"good\" or \"positive\" usage. It can be used during a pentesting over a corporate network to measure the \"security education\" or better said, the user's security awareness. To see how many bite the lure.","upvote_count":"1","timestamp":"1686119520.0"},{"content":"An Evil Twin is a Wi-Fi access point set up to mimic a network A.P. It is connected to the internet but not to the company network. The intent of the evil twin is to intercept traffic from devices that are connected to it. The devices cannot access network files or folders because the evil twin is not connected to the organization's network.","comment_id":"900539","upvote_count":"1","poster":"Farticus","timestamp":"1684363380.0"},{"timestamp":"1684302840.0","comment_id":"899772","content":"i know evil twing is a type of rougue acces point so in this case what we should choose and why?","poster":"EvelynStandford","upvote_count":"1"},{"timestamp":"1684238760.0","content":"C) Rogue Access Point ...because (D) Evil twin is not part of the network","upvote_count":"1","comment_id":"899161","poster":"ITSheWolf"},{"upvote_count":"3","timestamp":"1683379080.0","content":"Selected Answer: D\nIMO, it's Evil Twin. \nBluejacking is a type of Bluetooth attack that involves sending unsolicited messages to nearby Bluetooth devices, but it is not related to Wi-Fi connectivity or network resource access.\nJamming is a type of attack in which an attacker floods the Wi-Fi frequency with noise or other signals to disrupt communications, but this would not result in the specific symptoms described in the scenario.\nA rogue access point is a malicious Wi-Fi access point set up by an attacker to mimic a legitimate one, but it is unlikely to cause the connectivity and access issues described in the scenario.\nAn evil twin attack is similar to a rogue access point attack, but the attacker creates an access point with the same name and security credentials as a legitimate one in order to trick users into connecting to it. Again, this is unlikely to cause the specific symptoms described in the scenario.","comment_id":"890757","poster":"indyrckstar"},{"poster":"Nickname19","upvote_count":"2","comment_id":"889788","content":"Selected Answer: D\nAccording to Messer it sound like an Evil Twin.","timestamp":"1683261780.0"},{"content":">>>>>>>>>D<<<<<<<<<>>>>> Evil Twin <<<<<<<<<<<<\nThe user is most likely experiencing an \"Evil twin\" attack. An evil twin attack is a type of Wi-Fi attack where an attacker sets up a fake wireless access point that looks like a legitimate one. When a user connects to the fake access point, the attacker can intercept and monitor their network traffic, steal sensitive information, or launch other attacks. In this scenario, the user's laptop is likely connecting to the fake access point, which is causing the disconnection from the legitimate network and preventing access to shared folders and other resources.","timestamp":"1683211440.0","poster":"if10w","comment_id":"889440","upvote_count":"4"},{"comments":[{"poster":"[Removed]","content":"The only reason explaining User to connect to a rogue AP is because it mimicks the original one => Evil Twin.","upvote_count":"1","comment_id":"976753","timestamp":"1691591880.0"}],"upvote_count":"2","comment_id":"887488","poster":"mouettespaghetti","content":"-C is correct\nBased on the information provided, the user is most likely experiencing a rogue access point attack, as shown in option C.\n\nA rogue access point is an unauthorized access point that is connected to a network without the network administrator's knowledge or consent. Rogue access points can be set up by attackers to intercept network traffic, steal sensitive information, or launch other types of attacks.\n\nIn this scenario, the user's laptop is constantly disconnecting from the Wi-Fi network, which could be an indication that there is a rogue access point interfering with the network. Once the laptop reconnects to the network, the user can reach the internet, but cannot access shared folders or other network resources. This is a common symptom of a rogue access point attack, as the rogue access point may not be configured to allow access to these resources.","timestamp":"1683037260.0"}],"url":"https://www.examtopics.com/discussions/comptia/view/108268-exam-sy0-601-topic-1-question-473-discussion/","answer_description":"","topic":"1","choices":{"A":"Bluejacking","D":"Evil twin","C":"Rogue access point","B":"Jamming"}}],"exam":{"isMCOnly":false,"lastUpdated":"12 Apr 2025","id":367,"provider":"Comptia","numberOfQuestions":860,"isBeta":false,"name":"SY0-601","isImplemented":true},"currentPage":83},"__N_SSP":true}