{"pageProps":{"questions":[{"id":"32nqb71ZJTnAlmP7Z9Ff","timestamp":"2020-01-23 11:03:00","question_text":"An organization hosts a public-facing website that contains a login page for users who are registered and authorized to access a secure, non-public section of the site. That non-public site hosts information that requires multifactor authentication for access. Which of the following access management approaches would be the BEST practice for the organization?","topic":"1","question_images":[],"discussion":[{"poster":"Faiz","comments":[{"timestamp":"1588658160.0","comment_id":"83969","poster":"[Removed]","content":"TOTP isn't something you have. Something you have is more like a fob or government cac card or PIV. Something physical.","upvote_count":"3","comments":[{"timestamp":"1590677640.0","comment_id":"97636","poster":"Meredith","upvote_count":"28","comments":[{"content":"TOTP is time-based one-time password, that is not related to this case\nCAPTCHA is used to identify whether the one logging in is a human or not. In a Captcha Verification, the user is presented with a picture (or “challenge”) of words or characters, and the user must correctly type out those characters in order to proceed. So the provided answer is correct. It's D.","comment_id":"114018","poster":"Lucky_Alex","timestamp":"1592575980.0","comments":[{"timestamp":"1593076020.0","poster":"MagicianRecon","upvote_count":"13","comment_id":"119270","content":"TOTP is not related ? Lol ... CAPTCHA does not seem to be related. How is that an authentication? It is used to differentiate b/w a human from a bot and protect agains spam bots"},{"comment_id":"345344","timestamp":"1619697480.0","content":"CAPTCHA isn't part of MFA","comments":[{"comment_id":"390695","content":"This is a copy/paste directly from Google Support site: CAPTCHA (Completely Automated Public Turing test to tell Computers and Humans Apart) is a type of security measure known as challenge-response AUTHENTICATION.","timestamp":"1624644720.0","poster":"haskins5763","upvote_count":"1"}],"poster":"Heymannicerouter","upvote_count":"2"}],"upvote_count":"9"}],"content":"TOTP is definitely something you have per Darrel Gibson's book."},{"comment_id":"119268","poster":"MagicianRecon","timestamp":"1593075900.0","upvote_count":"4","content":"TOTP can be disputed to be honest but literature says that is is indeed \"something you have\" and most orgs like google, fb, twitter when using multi factor auth do use a TOTP.\nSame thing that banking apps use"}]}],"timestamp":"1580780340.0","comment_id":"46365","upvote_count":"17","content":"TOTP - Something you have\nUser name and password - Something you know"},{"timestamp":"1579773780.0","content":"Its A.","poster":"success101","upvote_count":"14","comment_id":"41905"},{"content":"Discuss more, we need more comments about this simple question","comment_id":"486572","timestamp":"1637834520.0","upvote_count":"1","poster":"Eluis007"},{"timestamp":"1632595800.0","content":"CAPTCHA is something you do.","comment_id":"451534","upvote_count":"1","poster":"mxh778872"},{"poster":"fonka","comment_id":"393531","content":"Correction. Answer is A","timestamp":"1624944720.0","upvote_count":"1"},{"timestamp":"1624944660.0","upvote_count":"1","comment_id":"393528","poster":"fonka","content":"A and c"},{"poster":"hakanb","content":"`A Time-based One-Time Password (TOTP) is similar to HOTP, but it uses a timestamp instead of a counter. One-time passwords created with TOTP typically expire after 30 seconds.` so isnt it clear that the answer is A ? The best and practical way to authenticate so many people by eliminating most of the security issues","upvote_count":"1","comment_id":"374398","timestamp":"1622815980.0"},{"upvote_count":"1","content":"multifactor authentication for access, means have two authentication validations for accessing site. When you entering username/password that is one part of authentication. when you matching blocks of pictures or writing words that makes a seconds part of you being authenticated. CAPCHA does test you make sure you are not a Bot and NOT trying to brake in to a authenticated site. I hope it make sense folks. Still learning Security and trying to find best explanations.","timestamp":"1621544520.0","comment_id":"362499","poster":"StickyMac"},{"content":"Both HMAC-Based One-time Password Algorithms (HOTP) and Time-Based One-time Password Algorithms (TOTP) generate these tokens.","timestamp":"1618389900.0","comment_id":"335316","upvote_count":"1","poster":"KRone"},{"comment_id":"326685","content":"Keywords is \"Multifactor Authentication\" - TOTP is something you have.\n\nCAPTCHA is a verification method and not an authentication method.\n\nAnswer is A","upvote_count":"1","poster":"loophole","timestamp":"1617370320.0"},{"comment_id":"291162","upvote_count":"2","timestamp":"1613409720.0","poster":"Matrix141","content":"CompTIA Security+ Study Guide: Exam SY0-501:\nSomething you know, such as a password or PIN. This is often referred to\nas Type I.\nSomething you have, such as a smartcard, token, or identification device.\nThis is often referred to as Type II.\nSomething you are, such as your fingerprints or retinal pattern (often called\nbiometrics). This is often referred to as Type III.\nSomething you do, such as an action you must take to complete\nauthentication. This does not have a type (I, II, III).\nSomewhere you are (this is based on geolocation). This does not have a\ntype (I, II, III).\n\nhttps://en.wikipedia.org/wiki/Multi-factor_authentication\nA good example of two-factor authentication is the withdrawing of money from an ATM; only the correct combination of a bank card (something the user possesses) and a PIN (something the user knows) allows the transaction to be carried out. Two other examples are to supplement a user-controlled password with a one-time password (OTP) or code generated or received by an authenticator (e.g. a security token or smartphone) that only the user possesses\n\nIf it was the pattern of the iris or something like that, there is no doubt that B. But in this case, I would answer A."},{"comment_id":"285780","timestamp":"1612727940.0","upvote_count":"2","poster":"mdsabbir","content":"Its TOTP as TOTP is soft token. Its used for two factor authentication."},{"comment_id":"274391","comments":[{"timestamp":"1612163400.0","comment_id":"281097","upvote_count":"1","poster":"wraith13","content":"A.Y.E 🤘🏻","comments":[{"poster":"haskins5763","comment_id":"390686","upvote_count":"1","content":"In every CompTIA Security + study guide/exam prep I’ve read a OTP/TOTP is generated by a physical token, and is absolutely SOMETHING YOU HAVE 🤦‍♂️","timestamp":"1624643520.0"}]}],"content":"Answer is B. OTP is not something you have according to Comptia official study guide. They say it is something you know.","timestamp":"1611388080.0","upvote_count":"1","poster":"Orkhann"},{"comment_id":"270224","content":"Answer is A. Not sure why people are trying to convince themselves that it's D.","upvote_count":"1","timestamp":"1610971620.0","poster":"vi2"},{"timestamp":"1608473700.0","poster":"certpro","comment_id":"248713","upvote_count":"1","content":"keywords are \"hosts information\" and \"Best Practice for organization\" gives D"},{"comments":[{"content":"CAPTCHA isn't an authentication method.","comment_id":"345347","timestamp":"1619697780.0","upvote_count":"2","poster":"Heymannicerouter"}],"poster":"WFT_2020","content":"Registered users enter username/password + CAPTCHA just to gain access to the logon page for the non-public site. ThEN multifactored authentication is used. Right? So answer D may make sense in that context. Unless I'm dumb, high or both.","timestamp":"1605806760.0","comment_id":"222964","upvote_count":"2"},{"comment_id":"217087","upvote_count":"1","content":"Wouldn't CAPTCHA be something you DO because you have to do it correctly? like type the captcha or identify fire hydrants or spin the tiger statue till it's upright? I also agree that TOTP would be something you have that is valid for a moment but on the contrary, once you get the TOTP \"YOU KNOW THE 6 digit CODE or whatever\" right? My exams in 2 days I could go with either.","timestamp":"1605070860.0","comments":[{"upvote_count":"1","poster":"addyp1999","timestamp":"1605071160.0","comment_id":"217088","content":"I know CAPTCHA would only authenticate you as \"HUMAN\" it can't relate you with a user account owner's identity. IDK man good luck"}],"poster":"addyp1999"},{"content":"Gosh.. I really want to go with D but I read this:\nTOTP (Time-based, One-Time Password) is a form of MFA that uses a randomly generated code as an additional authentication token. TOTP MFA codes are generally created via a smartphone app (e.g. Google Authenticator), so it falls under the “something you have” classification.","upvote_count":"1","timestamp":"1603684620.0","comment_id":"206002","poster":"DaddyP"},{"comment_id":"196383","content":"Say it with me... \"CAPTCHA is not a form of authentication\". CAPTCHA does not prove your identity - only that you are not a bot. That's what it was designed for, and only that.\n\nPattern Matching is also based on \"something you know\". Yes, you are doing something on the screen, but not to the same level as analyzing a signature or gesture.\n\nThe only multi-factor authentication is 'A'. Username & Password = something you know. TOTP = something you have.","upvote_count":"2","timestamp":"1602205080.0","poster":"Not_My_Name"},{"poster":"paulyd","content":"The Answer is overwhelming \"A\". I am no longer surprised that the word \"Suggested\" appears in the button to show the \"Answer\". Don't memorize answers. Ask questions. Look into detail, decide for yourself. You will find out how smart you are when you pass or fail the exam.","upvote_count":"4","timestamp":"1602202020.0","comment_id":"196369"},{"comments":[{"upvote_count":"3","poster":"Duranio","comment_id":"173397","content":"So you think that, just because we are dealing with a \"public-facing website\", CAPTCHA somehow magically becomes a valid authentication factor? I still think username/password + CAPTHCA is a SINGLE factor authentication.","timestamp":"1599222480.0"}],"upvote_count":"1","poster":"Waffa","comment_id":"172958","content":"the key word is \"public-facing website\" so D is correct","timestamp":"1599172620.0"},{"content":"The question below is kind of a similar question, what will be your ans.\nA network administrator is implementing multifactor authentication for employees who travel and use company devices remotely by using the company VPN. Which of the following would provide the required level of authentication?\nA. 802.1X and OTP\nB. Fingerprint scanner and voice recognition C. RBAC and PIN\nD. Username/Password and TOTP","timestamp":"1598987160.0","upvote_count":"1","poster":"ewi","comment_id":"171518"},{"timestamp":"1598673060.0","poster":"jama","upvote_count":"1","comment_id":"168919","content":"it is A, something you and something you know -multifactor authentication"},{"content":"The correct answer is A : TOTP MFA codes are generally created via a smartphone app (e.g. Google Authenticator), so it falls under the “something you have”","upvote_count":"1","comment_id":"161974","poster":"Estiva","timestamp":"1597901040.0"},{"content":"A is the correct answer.","timestamp":"1597654140.0","poster":"coentror","comment_id":"159778","upvote_count":"1"},{"content":"A. Something you know with Something you have. (Likely the correct answer)\nB. Something you know with something you do. However, the pattern could also be seen as \"something you know (similar to a PIN). Which makes this option less likely. \nC. Something you know with Something you know. (Incorrect) \nD. CAPTCHA is not an authentication piece. (Incorrect)","timestamp":"1597241880.0","upvote_count":"2","poster":"CoRell","comment_id":"156497"},{"poster":"Duranio","upvote_count":"9","timestamp":"1596670200.0","content":"Authentication means \"proving an IDENTITY\"; using CAPTCHA I can just prove I am human (ok, I'm not a vegetable or a rock...); that's NOT \"proving an IDENTITY\". I couldn't find any book or course that describe CAPTCHA as a valid authentication factor. Even CompTIA Syllabus does not include CAPTCHA among the authentication methods.\nThat said, all is possible with CompTIA authors... This question wasn't on my exam; anyway if I had to choose I would have picked A, Username/password + TOTP.","comment_id":"151528"},{"timestamp":"1595883900.0","upvote_count":"2","poster":"SvendZ","comment_id":"145270","content":"It's A. The questions says multifactor. User/pass = something you know, TOTP = Something you have."},{"upvote_count":"1","content":"So what is the correct answer? I chose A but I am very conflicted. I wish there was a professor on here that can validate the answers or opinions.","comment_id":"144961","timestamp":"1595853480.0","poster":"TamiTams"},{"upvote_count":"7","poster":"Death2QuestionWriters","comment_id":"144205","timestamp":"1595776740.0","content":"My name says it all."},{"poster":"Heracles","upvote_count":"2","content":"TOTP (Time-based, One-Time Password) is a form of MFA that uses a randomly generated code as an additional authentication token. TOTP MFA codes are generally created via a smartphone app (e.g. Google Authenticator), so it falls under the “something you have” classification. \"A\" seems like the correct answer. \nhttps://jumpcloud.com/blog/totp-mfa\nhttps://docs.aws.amazon.com/cognito/latest/developerguide/user-pool-settings-mfa-totp.html","timestamp":"1595678040.0","comment_id":"143357"},{"content":"A. Time-based one-time password (TOTP) tokens, or synchronous dynamic\npassword tokens, are devices or applications that generate passwords at fixed\ntime intervals, such as every 60 seconds. Time-interval tokens must have their\nclocks synchronized to an authentication server. To authenticate, the user enters\nthe password shown along with a PIN or passphrase as a second factor of\nauthentication. The generated one-time password provides identification, and the\nPIN/passphrase provides authentication.","upvote_count":"2","timestamp":"1594596720.0","poster":"enzo2105","comment_id":"133324"},{"content":"According to what I have read, CAPTCHA can prove \"something you are\" human.","upvote_count":"2","poster":"[Removed]","timestamp":"1594502040.0","comments":[{"content":"That makes no sense. Looking at a CAPTCHA as a human hacker that has your username/password would still get in. Thus no authentication. Something you are factor is something that only the person (human) that is authorized to have access \"is.\" Every human has a one of a kind finger print, iris, and face, but you are still human. The hacker has a different finger print, iris, and face, but still human. Thus if a CAPTCHA is considered another factor, then he has gained access by simply being human, which is not one of a kind.","timestamp":"1594771320.0","comment_id":"135315","poster":"Autox","upvote_count":"1"}],"comment_id":"132351"},{"upvote_count":"4","content":"Answer is A\nusername/pass is something you know\nTOTP - Time-based One-Time Password - this is a password generated by a server (so you do not know what the server will generate) and sent to a software or hardware token. You need to HAVE that token to know the pass so this is something you HAVE used for 2FA\npattern matching can be something you DO, also used for 2FA, but more seen implemented on tablets or screens with touch capabilities. Because this is not so secure, is not likely to be implemented on a web server\nCAPTCHA ensures that you are a human not a bot, but does not provides authentication. Authentication means to validate you identity to a database with credentials, you need to provide credentials: user + unique password/code/PIN. CAPTCHA does not require a user name.","timestamp":"1594463700.0","comment_id":"132017","poster":"Kudojikuto"},{"comment_id":"130103","upvote_count":"3","content":"TOTP is the same as a password; something you know.\nThe provided answers are correct. Something you know and something you do.","comments":[{"timestamp":"1596721380.0","poster":"JacobCrane","upvote_count":"3","comment_id":"151984","content":"TOTP is NOT something you know. You get TOTP from applications like Google Authenticator, Auty, a FOB or the PIN code from text message. A is the only choice that is 2FA."},{"poster":"exiledwl","content":"No, TOTP is like getting a token code on a text on your phone or email...it falls under something you have so I believe A is the correct answer","comment_id":"250525","timestamp":"1608679200.0","upvote_count":"1"}],"timestamp":"1594239240.0","poster":"Aerials"},{"upvote_count":"1","content":"From the pattern matching option, that can be termed as multi factor as well since it could be a \"something you do\" category but i have only come across signatures, voice recognition to be in that category","poster":"MagicianRecon","timestamp":"1593076080.0","comments":[{"content":"I don´t think making a pattern can be defined as \"something you do\", as it can be easily imitated.\nBy the way, voice recognition falls under the category of \"Something you are\"\nAnswer should be A","poster":"Dante_Dan","timestamp":"1594214700.0","upvote_count":"1","comment_id":"129783"},{"timestamp":"1594239180.0","upvote_count":"1","comment_id":"130102","content":"Pattern matching falls under the something you know category, as you are memorizing a specific pattern.","poster":"Aerials"}],"comment_id":"119273"},{"upvote_count":"1","comment_id":"117023","poster":"Roy12343","content":"A Time-based One-Time Password (TOTP) application automatically generates an authentication code that changes after a certain period of time.\nhttps://help.github.jp/enterprise/2.11/user/articles/configuring-two-factor-authentication-via-a-totp-mobile-app/\nso it is A","timestamp":"1592887080.0"},{"timestamp":"1591933560.0","content":"D is not suitable because if the username and the password are been compromised then Captcha is not providing any authentication (as we enter the captcha value as they are provided)","poster":"clay09","comment_id":"108300","upvote_count":"2"},{"timestamp":"1591608180.0","poster":"SimonR2","content":"Don’t be thrown by the fact it says a public facing site, all that matters is that TOTP is the only one that provides multi factor authentication. Answer is A","upvote_count":"4","comment_id":"105132"},{"upvote_count":"1","timestamp":"1591416240.0","comment_id":"103552","poster":"cypher9","content":"CAPTCHA, or Completely Automated Public Turing test to tell Computers and Humans Apart, requires users to prove that they’re human, usually by entering a word or words in an image or by identifying objects in a series of images, which helps to reduce automated attacks by bots."},{"comment_id":"97145","content":"Ask google if totp is a MFA, you got” Time-based one-time passwords, or TOTPs, have become common as the second factor of two-factor authentication, which verifies users based on two conditions: something they know and something they have. ... Yet like any single security solution, TOTP as part of two- or even multi-factor authentication is not fool-proof.”\n\nAsk same question for captcha, it’s definitely not considered a MFA coz AI can beat it easily","upvote_count":"2","timestamp":"1590624540.0","poster":"komould"},{"comment_id":"92817","content":"Examples of Multi-Factor Authentication include using a combination of these elements to authenticate:\n\nCodes generated by smartphone apps\nBadges, USB devices, or other physical devices\nSoft tokens, certificates\nFingerprints\nCodes sent to an email address\nFacial recognition\nRetina or iris scanning\nBehavioral analysis\nRisk score\nAnswers to personal security questions\nTypes of authentication factors\nWhen it comes to MFA, we typically refer to three types of authentication factors:\n\nThings you know (knowledge), such as a password or PIN\nThings you have (possession), such as a badge or smartphone\nThings you are (inheritance), indicated through biometrics, like fingerprints or voice recognition\n\nInteresting question though","upvote_count":"2","poster":"komould","timestamp":"1589985300.0"},{"poster":"majid94","timestamp":"1589634180.0","content":"According to Daril's textbook, similar to a hardware token, the user enters a username and password as the something you know factor, and then enters the security code from the\napp as the something you have factor. This provides dual-factor authentication.","upvote_count":"1","comment_id":"89944"},{"poster":"majid94","comment_id":"89592","timestamp":"1589562240.0","upvote_count":"1","comments":[{"content":"CAPTCHA isn't an authentication method","upvote_count":"1","poster":"Heymannicerouter","comment_id":"345351","timestamp":"1619698020.0"}],"content":"CAPTCHA isn't something you do ?!"},{"comment_id":"83965","content":"TOTP is like Okta or RSA token. D is is the answer \"something you knoe and something you are\"","timestamp":"1588657800.0","upvote_count":"1","poster":"[Removed]"},{"upvote_count":"3","comment_id":"81487","poster":"Meredith","timestamp":"1588211160.0","content":"Per Darrel Gibson's book, HOTP and TOTP fall into the \"something you have\" category. I agree that the correct answer is A."},{"upvote_count":"1","comment_id":"81238","timestamp":"1588161780.0","poster":"ClintBeavers","content":"FYI, the Sec+ book only mentions \"something you are\" once, and its under Inherence which are based on personal physical characteristics. seems like a stretch to consider it the best choice. a TOTP authentication is much more secure and is still multifactor."},{"upvote_count":"2","comment_id":"81235","timestamp":"1588161600.0","poster":"ClintBeavers","content":"terrible question as A and B are correct and D makes the least sense."},{"poster":"000_000","comments":[{"timestamp":"1598733300.0","poster":"Teza","content":"Is CAPTCHA not open source","comment_id":"169567","upvote_count":"1"}],"content":"D is possibly correct. Even though TOTP was my choice. TOTP is an open source standard so not something you have like a token. CAPTCHA in this case appears to be \"something you are\"","comment_id":"73088","timestamp":"1586548560.0","upvote_count":"1"},{"comments":[{"timestamp":"1586548680.0","content":"D is possibly correct. Even though TOTP was my choice. TOTP is an open source standard so not something you have like a token. CAPTCHA in this case appears to be \"something you are\"","comment_id":"73089","upvote_count":"2","poster":"000_000"},{"upvote_count":"1","poster":"AllenFox","content":"CAPTCHA represents something you know!!","timestamp":"1593360240.0","comment_id":"122004"}],"upvote_count":"6","poster":"Tzu","comment_id":"71393","timestamp":"1586084400.0","content":"I think CAPTCHA confirms the “Something You Are” part of things. Maybe the site just wants to know that you are human, much like this site."},{"timestamp":"1581910080.0","comment_id":"51482","poster":"MelvinJohn","content":"B. A time-based one-time password (TOTP) is a temporary passcode generated by an algorithm that uses the current time of day as one of its authentication factors. Time-based one-time passwords are commonly used for two-factor authentication.","comments":[{"content":"A. (Correction) - something you have (TOTP) and something you know (password).","comments":[{"timestamp":"1591731420.0","poster":"Nicker92","content":"Bro why are you posting without thinking? You are the only one I see that post always 2 times a different solution. Just focus before give an answer!","comments":[{"upvote_count":"6","poster":"CoRell","content":"Can you please keep this to a respectful interaction? We're here to discuss the exam, not get at each other's throats. Thank you. Would also be nice if the moderator could do their freaking job and moderate.","comment_id":"156493","timestamp":"1597241580.0","comments":[{"upvote_count":"4","comment_id":"274354","comments":[{"poster":"kekmaster","upvote_count":"2","timestamp":"1615805040.0","content":"like many others have stated already, his contributions to the discussions are complete bogus. At this point i just ignore his comments in the comment section.","comment_id":"311326"},{"upvote_count":"1","comment_id":"317116","poster":"[Removed]","timestamp":"1616414040.0","content":"This time MJ is right. I think he is not malicious, just that he posts a lot and more you post, more mistakes you can make."}],"poster":"hpicpr","timestamp":"1611384240.0","content":"MJ is not helping with his input and thus confusing people. Nicker is right."}]},{"comment_id":"224417","upvote_count":"5","poster":"Kalich","timestamp":"1605974880.0","content":"MelvinJohn is a very helpful guy, is ok if he can change his mind, important is he correct himself. Don't give orders and let's be respectful to each others."}],"upvote_count":"31","comment_id":"106229"}],"upvote_count":"7","poster":"MelvinJohn","comment_id":"51486","timestamp":"1581910320.0"}],"upvote_count":"2"},{"content":"A & B are multi factors but do we make patterns on a web page? Though TOTP is based on 3rd party. So \"A\" i think","comment_id":"47152","upvote_count":"1","poster":"kedu","timestamp":"1580953080.0"},{"comment_id":"46758","poster":"success101","timestamp":"1580878740.0","content":"It is TOTP. This is a second authentication method for the user. After you enter your password you will be asked for a time based one time password which is the 2FA.","upvote_count":"9"},{"upvote_count":"5","content":"its D.","comment_id":"46491","comments":[{"upvote_count":"14","poster":"bob99kimmer","timestamp":"1581312960.0","content":"This can't be D. \nA CAPTCHA only confirms that you're human, not that you are you, so technically, it's not a form of authentication!","comment_id":"48596"}],"timestamp":"1580817540.0","poster":"bignori"},{"upvote_count":"1","comment_id":"45875","poster":"NeGaTiVeOnE","comments":[{"timestamp":"1608679140.0","comment_id":"250524","poster":"exiledwl","upvote_count":"1","content":"Technically you do a pattern, but pattern matching falls under something you know...'something you do' would be something like a signature"}],"content":"'B' makes more sense in context of the question because of multifactor authentication. It is the only answer that has something you know and something you do.","timestamp":"1580659380.0"},{"poster":"Ciaone","content":"Maybe A","timestamp":"1580340720.0","upvote_count":"3","comment_id":"44443"},{"timestamp":"1580219280.0","content":"B is the answer.","comment_id":"43775","upvote_count":"3","poster":"Disguy"}],"answer_images":[],"exam_id":366,"answer_ET":"D","unix_timestamp":1579773780,"isMC":true,"url":"https://www.examtopics.com/discussions/comptia/view/12561-exam-sy0-501-topic-1-question-624-discussion/","answer_description":"","answer":"D","choices":{"A":"Username/password with TOTP","C":"Username/password with a PIN","B":"Username/password with pattern matching","D":"Username/password with a CAPTCHA"},"answers_community":[],"question_id":631},{"id":"052iwBAmVBN77BnMz0Nh","answers_community":[],"answer":"C","isMC":true,"answer_images":[],"choices":{"D":"DAC","B":"MAC","C":"ABAC","A":"RBAC"},"question_id":632,"topic":"1","url":"https://www.examtopics.com/discussions/comptia/view/14295-exam-sy0-501-topic-1-question-625-discussion/","question_images":[],"unix_timestamp":1581910560,"answer_description":"","answer_ET":"C","exam_id":366,"timestamp":"2020-02-17 04:36:00","discussion":[{"upvote_count":"13","timestamp":"1584306540.0","comments":[{"timestamp":"1605777660.0","poster":"BillyKidd","content":"Based on what you said, business hours (time-of-day) would be the key to looking at this, and time hours were mentioned in the question.","comment_id":"222628","upvote_count":"3"}],"poster":"The_Temp","content":"The below explanation confirms why the answer is C.\n\n\"An example of ABAC would be allowing only users who are type=employees and have department=HR to access the HR/Payroll system and only during business hours within the same timezone as the company.\"\n\nhttps://blog.identityautomation.com/rbac-vs-abac-access-control-models-iam-explained","comment_id":"64476"},{"upvote_count":"8","comment_id":"51487","poster":"MelvinJohn","content":"C. Attribute-Based Access Control (ABAC) Role-based access control (RBAC) are two ways of controlling the authentication process and authorizing users. RBAC controls broad access across an organization, while ABAC takes a fine-grain approach.","timestamp":"1581910560.0"},{"content":"Attribute-based access control (ABAC) is the most fine-grained type of access control model. As the name suggests, an ABAC system is capable of making access decisions based on a combination of subject attributes (in this case, files in the share can only be accessed by MEMBERS OF THE SAME DEPARTMENT AS THE DATA OWNER) and object attributes (in this case, users should only be able to create FILES WITH APPROVED EXTENSIONS, which may differ by department) plus any context-sensitive or system-wide attributes (in this case, it can only be accessed between the hours of 9:00 a.m. and 5:00 p.m). \n\nAn attribute-based system could monitor the number of events or alerts associated with a user account or with a resource, or track access requests to ensure they are consistent in terms of timing of requests or geographic location\nC correct","comment_id":"486585","poster":"Eluis007","upvote_count":"1","timestamp":"1637835780.0"},{"upvote_count":"1","poster":"Tim13","comment_id":"402052","content":"So it's only role based access control if it's spelled out? How would you differentiate on a test","timestamp":"1625761920.0"},{"poster":"fonka","comment_id":"396688","content":"Sory i change my mind after reading this\nAttribute-based access control draws on a set of characteristics called “attributes.” This includes user attributes, environmental attributes, and resource attributes.\n\nUser attributes include things like the user’s name, role, organization, ID, and security clearance.\nEnvironmental attributes include the time of access, location of the data, and current organizational threat levels.\nResource attributes include things like creation date, resource owner, file name, and data sensitivity.\nso the answer is Attribute base (ATBAC)\nSoory","timestamp":"1625211960.0","upvote_count":"2"},{"content":"Rule-based access control\nThe last of the four main types of access control for businesses is rule-based access control. This system assigns or denies access to users based on a set of dynamic rules and limitations defined by the owner or system administrator. Such rules may limit access based on a number of unique situations, such as the individual's location, the time of day, or the device being used. The ability to customize rules and permissions makes RBAC an ideal form of access control for businesses that require a dynamic security solution.","timestamp":"1624945560.0","upvote_count":"1","comment_id":"393540","poster":"fonka"},{"comment_id":"393535","content":"It.is rule based access control in short management is saying is no acess is given after 5pm meaning that is a rule no one can complain about and if it is a library system same thing no access is given after working hours so the answer is A rbac","timestamp":"1624945020.0","poster":"fonka","upvote_count":"1"},{"upvote_count":"1","poster":"nakres64","timestamp":"1614239160.0","content":"Attribute-based access control (ABAC) is the most fine-grained type of access control\nmodel. As the name suggests, an ABAC system is capable of making access decisions\nbased on a combination of subject and object attributes plus any context-sensitive or\nsystem-wide attributes.","comment_id":"298847"},{"content":"ABAC because RULE BASED ACCESS CONTROL wasn’t spelled out.","timestamp":"1586084700.0","comments":[{"poster":"babati","upvote_count":"2","comment_id":"157856","content":"Rule-based access control is a term that can refer to any sort of access control\nmodel where access control policies are determined by system-enforced rules rather\nthan system users. As such, RBAC, ABAC, and MAC are all examples of rule-based\n(or non-discretionary) access control. As well as the formal models, rule-based access\ncontrol principles are increasingly being implemented to protect computer and\nnetwork systems founded on discretionary access from the sort of misconfiguration\nthat can occur through DAC.","timestamp":"1597386900.0"}],"poster":"Tzu","upvote_count":"6","comment_id":"71394"}],"question_text":"A security administrator needs to configure remote access to a file share so it can only be accessed between the hours of 9:00 a.m. and 5:00 p.m. Files in the share can only be accessed by members of the same department as the data owner. Users should only be able to create files with approved extensions, which may differ by department. Which of the following access controls would be the MOST appropriate for this situation?"},{"id":"KHCbGBDAVp8nFwekoWwe","choices":{"B":"Weak SSL cipher strength","D":"Race condition on packet inspection firewall","C":"Improper input handling on FTP site","A":"Resource exhaustion on VPN concentrators"},"discussion":[{"upvote_count":"27","poster":"Laposky","timestamp":"1608345060.0","comment_id":"247694","content":"CompTIA is a hoax with all these their confusing questions. I hope to pass in my first trial in CompTIA faraday cage I'm in."},{"timestamp":"1584306780.0","poster":"The_Temp","upvote_count":"19","comment_id":"64479","content":"I think the answer is actually B. A weak SSL cipher could have been cracked, allowing the attacker to decrypt the contents of the trafficked data.\n\nhttps://www.quora.com/What-are-weak-SSL-ciphers\n\nNot sure how this is C at all. The question doesn't refer to an FTP server at all."},{"upvote_count":"3","content":"FTP - transfer protection = username/password\nFTP - plain text, non encrypted, the username/password was sniffed off the wire","comments":[{"upvote_count":"2","content":"FTP has no data transport protections though","comment_id":"345371","poster":"Heymannicerouter","timestamp":"1619699580.0"}],"comment_id":"326646","timestamp":"1617368700.0","poster":"Funkydave"},{"timestamp":"1616523780.0","comment_id":"318363","poster":"L1singh","upvote_count":"2","content":"The answer has to be B the question clearly says exploited data transport protections FTP doesn't have any protection. a weak SSL encryption key may have been used which is then B"},{"timestamp":"1612384140.0","poster":"mcNik","upvote_count":"2","content":"After reading a bit of stuff across the net I believe given answer is correct, check this one http://projects.webappsec.org/w/page/13246933/Improper%20Input%20Handling","comment_id":"282960"},{"upvote_count":"1","comment_id":"277908","timestamp":"1611763260.0","content":"Ok, read this one, answer is B \nhttps://www.veracode.com/security/insufficient-transport-layer-protection","poster":"mcNik"},{"poster":"mcNik","timestamp":"1611763200.0","comment_id":"277906","content":"read many comment by can you tell me how the hell do you relate the question asked with anything FTP related? .. I believe it should be B","upvote_count":"2"},{"poster":"SQLinjector","comment_id":"246864","content":"I will choose B on the exam tomorrow. Here's a website that tells more about protecting against SSL suites weak ciphers: https://beyondsecurity.com/scan-pentest-network-vulnerabilities-ssl-suites-weak-ciphers.html?cn-reloaded=1","timestamp":"1608238080.0","upvote_count":"2"},{"timestamp":"1607737380.0","content":"These answers are getting ridiculously confusing. I hardly made until here. \nTopic 1 was so absurd. Topic 2 answers are worse ...","upvote_count":"6","poster":"integral","comment_id":"241310"},{"timestamp":"1607295900.0","content":"when I look at these questions ... how do ppl even pass this exam?? ill be lucky if it doesnt take me 3 tries..","upvote_count":"12","comment_id":"236867","poster":"MichaelLangdon"},{"content":"The question notes \"exploited data transport protections\".\n\nBoth 'A' and 'D' are obviously wrong.\n\n'C' mentions improper input handling on an FTP site. FTP isn't secure, so there would have been no data transport protection to exploit at all. (Improper input handling also sounds a lot like lack of input validation - which, again, has nothing to do with data transport protections.)\n\nSo, the answer must be 'B' - which also makes sense as the sole purpose of SSL is to act as a data transport protection (i.e., encryption). A weak cipher strength could easily be broken, exposing the decrypted data in transport.","comment_id":"196405","poster":"Not_My_Name","upvote_count":"7","timestamp":"1602208860.0"},{"poster":"Hanzero","timestamp":"1600722600.0","upvote_count":"1","comment_id":"184006","content":"SSL encrypts data in transit so SSL"},{"upvote_count":"1","timestamp":"1598549820.0","comment_id":"167733","content":"when talking about data transport protection, shouldn't it be SSL?","poster":"jama"},{"comments":[{"timestamp":"1624644180.0","comment_id":"390691","content":"FTP doesn't provide security for any data, it is transmitted in cleartext","upvote_count":"1","poster":"Figekioki"}],"upvote_count":"2","timestamp":"1598436240.0","content":"hint: data in-transit which the only option left is SSL which it secure the data in-transit unlike FTP it secure data at-reset (and don't forget FTP is not secure in the first place)","comment_id":"166613","poster":"Ibrahim_aj"},{"timestamp":"1596959160.0","content":"… Data-in-transit has high requirements for confidentiality. It’s relatively easy for bad guys to intercept transmitting data, so we need good encryption. … (Mike Meyers’ CompTIA Security+ p. 64)","comment_id":"153440","poster":"vaxakaw829","upvote_count":"3"},{"timestamp":"1593378600.0","comment_id":"122236","poster":"TeeTime87","upvote_count":"3","content":"This has to be B\n\nSSL is used to protect data"},{"comment_id":"119281","upvote_count":"4","poster":"MagicianRecon","content":"Data transport protection - SSL/TLS","timestamp":"1593076560.0"},{"upvote_count":"2","poster":"Wilfred","comment_id":"111537","content":"Could it be \"who exploited data TRANSPORT protections....\" so that the answer is C?","timestamp":"1592308620.0"},{"content":"C). Improper input handling on FTP site.\n\nIt is in this condition that incoming connections are trusted rather than checked first and approved later. All data connections must be identified.","timestamp":"1591928640.0","upvote_count":"8","comment_id":"108256","poster":"ramirocastillo1986"},{"upvote_count":"5","comment_id":"64966","timestamp":"1584410280.0","poster":"Elb","content":"B. \nInsufficient Transport Layer Protection\nDeals with information exchange between the user (client) and the server (application).\nBy using weak algorithms or using expired or invalid certificates or not using SSL can allow the communication to be exposed to untrusted users, which may compromise a web application and or steal sensitive information."}],"unix_timestamp":1584306780,"answer":"C","url":"https://www.examtopics.com/discussions/comptia/view/16699-exam-sy0-501-topic-1-question-626-discussion/","isMC":true,"timestamp":"2020-03-15 22:13:00","question_text":"Confidential corporate data was recently stolen by an attacker who exploited data transport protections.\nWhich of the following vulnerabilities is the MOST likely cause of this data breach?","question_id":633,"answer_images":[],"answers_community":[],"answer_ET":"C","exam_id":366,"question_images":[],"topic":"1","answer_description":""},{"id":"6J8kv2putKPPl2XSh4QM","answer_description":"","answer_images":[],"answer":"A","question_images":[],"answer_ET":"A","exam_id":366,"question_text":"A member of the human resources department received the following email message after sending an email containing benefit and tax information to a candidate:\n`Your message has been quarantined for the following policy violation: external potential_PII. Please contact the IT security administrator for further details`.\nWhich of the following BEST describes why this message was received?","answers_community":[],"timestamp":"2020-03-16 16:58:00","url":"https://www.examtopics.com/discussions/comptia/view/16749-exam-sy0-501-topic-1-question-627-discussion/","question_id":634,"discussion":[{"comment_id":"64760","content":"A. DLP can enforce a wide range of email security best practices. It can prevent workers from forwarding confidential business files outside the organization.","poster":"MelvinJohn","upvote_count":"7","timestamp":"1584374280.0"},{"upvote_count":"7","poster":"DrSledge","timestamp":"1593984240.0","comment_id":"127230","content":"I used to have to send these emails all the time.\nA -DLP for sure."},{"content":"\"external potential_PII\"\n\nFlagged for potential data loss","poster":"leesuh","comment_id":"316021","upvote_count":"1","timestamp":"1616294820.0"}],"topic":"1","unix_timestamp":1584374280,"isMC":true,"choices":{"A":"The DLP system flagged the message.","B":"The mail gateway prevented the message from being sent to personal email addresses.","D":"The file integrity check failed for the attached files.","C":"The company firewall blocked the recipient's IP address."}},{"id":"zEqiCNkifVAGjILAMGJQ","topic":"1","question_id":635,"answers_community":[],"unix_timestamp":1619950980,"exam_id":366,"timestamp":"2021-05-02 12:23:00","choices":{"A":"A hacker attempted to pivot using the web server interface.","B":"A potential hacker could be banner grabbing to determine what architecture is being used.","D":"A server is experiencing a DoS, and the request is timing out.","C":"The DNS is misconfigured for the server's IP address."},"url":"https://www.examtopics.com/discussions/comptia/view/51526-exam-sy0-501-topic-1-question-628-discussion/","question_text":"A security analyst is checking log files and finds the following entries:\n//IMG//\n\nWhich of the following is MOST likely happening?","question_images":["https://www.examtopics.com/assets/media/exam-media/03794/0034100001.png"],"isMC":true,"discussion":[{"upvote_count":"9","comments":[{"comment_id":"349021","comments":[{"content":"same here","poster":"Computerguy","comment_id":"355153","upvote_count":"2","timestamp":"1620784200.0"}],"poster":"madaraamaterasu","timestamp":"1620085560.0","upvote_count":"4","content":"I agree."}],"content":"It's Banner Grabbing","comment_id":"347628","timestamp":"1619950980.0","poster":"CobraBoy"},{"content":"Netcat is one of the oldest and most popular network utilities for Unix and Linux. For banner grabbing purposes, we’ll use the following command:\n\nnc -v IP PORT\n\nhttps://securitytrails.com/blog/banner-grabbing","poster":"Eluis007","comment_id":"486596","timestamp":"1637836440.0","upvote_count":"1"},{"content":"Key word host look up in the first sentence means someone is looking information ,but denied so it is banner grabbing answer is A","timestamp":"1624946700.0","poster":"fonka","comment_id":"393549","upvote_count":"3","comments":[{"poster":"fonka","timestamp":"1624946700.0","content":"I mean b","comment_id":"393550","upvote_count":"2"}]},{"content":"I just assuming anything that has Apache usually involves a webserver","timestamp":"1622351220.0","comment_id":"369873","poster":"doobiedubs","upvote_count":"1"},{"content":"Banner Grabbing We can also use netcat to “ grab ” the banner on web servers by connecting to port 80 and then sending a HEAD / HTTP/1.0 or HEAD / HTTP/1.1 request depending upon the protocol which they’re using.","upvote_count":"2","comment_id":"362505","poster":"StickyMac","timestamp":"1621545900.0"},{"upvote_count":"1","comment_id":"358124","content":"How is this A??","timestamp":"1621104300.0","poster":"MB87"}],"answer":"A","answer_images":[],"answer_description":"","answer_ET":"A"}],"exam":{"numberOfQuestions":1043,"lastUpdated":"12 Apr 2025","id":366,"provider":"Comptia","isImplemented":true,"isMCOnly":false,"name":"SY0-501","isBeta":false},"currentPage":127},"__N_SSP":true}