{"pageProps":{"questions":[{"id":"iPzhCI891Eg6W8X7VU0f","topic":"2","question_text":"HOTSPOT -\nYou have the Azure management groups shown in the following table:\n//IMG//\n\nYou add Azure subscriptions to the management groups as shown in the following table:\n//IMG//\n\nYou create the Azure policies shown in the following table:\n//IMG//\n\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answers_community":[],"timestamp":"2020-11-30 15:01:00","question_id":116,"answer_ET":"","isMC":false,"exam_id":44,"discussion":[{"poster":"fedztedz","comment_id":"237511","comments":[{"poster":"Kirintas","content":"At first I thought you are right, but isn't the second statement about creating a virtual machine?\nThere is no policy neither allowing nor preventing the creation of a virtual machine, only virtual networks.","timestamp":"1741437660.0","upvote_count":"1","comment_id":"1366555"},{"content":"From Udemy: NYN\nExplanation\n1. The azure policy (not allowed resource types – Virtual networks) is inherited to Subscription1. So, Virtual networks are not allowed to create in Subscription1.\n\n2. Policy assignments get evaluated top-to-bottom. The most restrictive policy assignment will always win, i.e. a DENY on any level will take precedence over an ALLOW on any other level. So the azure policy (not allowed resource types – Virtual networks) will be applied to Subscription2. The deny policy is only for virtual networks. This allows to create a virtual machine by leveraging existing VNet’s.\n\n3. Each management group and subscription can only support one parent. Subscription1 is already part of a management group. We can’t add this to another management group though we can move.\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview","upvote_count":"63","timestamp":"1678893720.0","comment_id":"840007","comments":[{"poster":"avidlearner","comment_id":"977277","comments":[{"poster":"Ruzhdi","content":"Answer 2: is Yes - ManagementGroup12 is allowed to create VNet as mentioned in the assignment.","upvote_count":"2","timestamp":"1711034100.0","comment_id":"1179356"}],"timestamp":"1691641320.0","upvote_count":"8","content":"No - Tenant Root not allowed\nNo - Azure policy is a Strict Deny system, Any deny policy on top level is not overridden by lower level allows. Since you are not allowed to create a VNet you can't create a VM without a VNet.\nNo- you don't add a subscription group which is already assigned to other ."},{"poster":"alexn76","comment_id":"846273","timestamp":"1679426400.0","content":"N Y N \nYou can create VM on existing network","upvote_count":"3","comments":[{"content":"Who told you there is an existing VNET?","comment_id":"884970","comments":[{"comment_id":"1065384","poster":"Batiste2023","timestamp":"1699429560.0","content":"Who told you there isn't? - Actually, who would make policies like this, if there weren't any VNets available already? (I know, it's a Microsoft scenario, but still...)","upvote_count":"1","comments":[{"poster":"ki01","timestamp":"1700072040.0","content":"no one in their right mind would make policies like these, but this is not a real world tenant in a company. this is an exam question to test if you know how allows and denies trickle down through management groups. No need to get philosophical on this","upvote_count":"4","comment_id":"1071766"}]},{"comment_id":"1065338","content":"Same question for you. Who told you there is NO existing VNet? We have no info about it (or any other resources) but we have a Q about VM's. VM's COULD be created because it's required an VNet and VNet could already exist, and there is no restriction about VM creation. So potentially you have a chance create VM (cuz it's not prohibited) by using existing VNet.","comments":[{"content":"ms exams usually tell what resources are already available, or what will be deployed. if it requires presuming that it just exists out of the nether, then it means it's not there. A VM in azure cannot be created without VNET, meaning that avidlearner is correct","comment_id":"1071761","upvote_count":"1","timestamp":"1700071860.0","poster":"ki01"}],"timestamp":"1699422120.0","poster":"neolisto","upvote_count":"2"}],"upvote_count":"9","poster":"KrisJin","timestamp":"1682840940.0"},{"comment_id":"1076231","upvote_count":"8","poster":"ggogel","timestamp":"1700566020.0","content":"\"Allowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.\"\n\nSee: https://learn.microsoft.com/en-us/azure/governance/policy/overview#policy-definition\n\nSo the answer to the second question is NO. Only vNets are in the list, so only vNets can be created. Anything else is denied."}]},{"timestamp":"1679823840.0","upvote_count":"21","content":"No - Sub1 > Group21 > Group11 > TenantRoot (Not allowed)\nNo - Sub2 > Group12 > TenantRoot (Not allowed)\nNo - Only one management group can be assigned to a subscription (Group21 is already assigned to sub1)","poster":"Zemar","comment_id":"850868"}],"poster":"Durden871"},{"upvote_count":"30","poster":"tita_tovenaar","comments":[{"poster":"tita_tovenaar","comment_id":"399718","timestamp":"1625553960.0","upvote_count":"15","content":"sorry, my bad. answer 2 is No.By allowing metworks, you deny all the rest."}],"comment_id":"398589","timestamp":"1625423700.0","content":"not agreed for answer 2. \nOnly virtual networks are mentioned in the policy. Nothing is said about virtual machines. \n\nResult: NO - YES - NO"},{"poster":"pieronegri","comment_id":"239473","content":"you are right, \"move\" is the right verb.","timestamp":"1607540880.0","upvote_count":"2"},{"timestamp":"1688594220.0","comment_id":"944141","content":"overrides property allows you to change the effect of a policy definition without modifying the underlying policy definition","upvote_count":"1","poster":"dp846"},{"content":"Valid! This question was on the exam 22/02/2023. Scored 920. Thanks guys!","comments":[{"timestamp":"1688572500.0","content":"you saying valid to the answer in examtopic or discussion thread?","comment_id":"943911","upvote_count":"1","poster":"franc_wins"},{"comment_id":"893469","upvote_count":"2","poster":"rapaz","content":"Which is the correct?","timestamp":"1683671640.0"}],"timestamp":"1677149820.0","comment_id":"819088","upvote_count":"20","poster":"Panapi"},{"content":"Agree.\n- NO: Subscription 1: is not allowed to create a VNET.\n- NO: Subscription 2: Allowed to create a VNET which restricts anything else.\n- NO: Subscription 1: already in one Management group called 21, so cannot add into another. A Subscription can be assigned to 1 Management Group.","comments":[{"comments":[{"comments":[{"comment_id":"427464","upvote_count":"8","poster":"imartinez","content":"I think this is wrong, it should be No YES NO.\nThe first policy only restrict to create VNets not VMs, So VMs are allowed to be created if you can attach a VNET and the 2nd policy allows you to create the VNET, So.. yes","timestamp":"1629377040.0","comments":[{"timestamp":"1629845760.0","upvote_count":"2","comment_id":"431034","content":"That's not correct...If you read this definition, then answer #2 is No. So It's still No, No, No\n\nAllowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.","poster":"Bon_"},{"upvote_count":"13","comment_id":"434545","timestamp":"1630237320.0","poster":"imartinez","content":"My bad, the whitelist will allow you to create the VNET but prevent's you to create the VM, that's the issue. second is NO, thx"},{"timestamp":"1630237020.0","upvote_count":"2","content":"@Bon_: #2 is still a YES.\nYou have 5 definition types, these two makes the magic about what can be deployed: Not allowed resource types (Deny): Prevents a list of resource types from being deployed. \nAllowed Resource Type (Deny): Defines the resource types that you CAN deploy, which means that all the resources in this list are allowed, and those which are not part, doesn't. Think on this a whitelist for resources","poster":"imartinez","comment_id":"434541"}]}],"upvote_count":"10","content":"because subscription 2 is under management group 12. The only allowed resource type is VirtualNetworks per the table in the question, therefore VM creation is not allowed","poster":"jimmyli","comment_id":"353174","timestamp":"1620577860.0"},{"poster":"kilowd","timestamp":"1654411800.0","upvote_count":"6","comment_id":"611707","content":"Allowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list."},{"poster":"Jayad","comment_id":"579727","content":"It's because of the \"Allowed Resources Policy\". You can only create resources of the allowed type and the ones which cannot be assigned tags.\nTR ->MG11 -> MG21 - Sub1\n ->MG12 - sub2","upvote_count":"7","timestamp":"1648877640.0"},{"comment_id":"556547","timestamp":"1645857900.0","upvote_count":"4","comments":[{"content":"But it should have a permission to create a VM","timestamp":"1645857960.0","poster":"zr79","upvote_count":"3","comment_id":"556548","comments":[{"comment_id":"614793","timestamp":"1654915800.0","upvote_count":"14","poster":"Scoobysnaks86","content":"you can't create a vm without a vnet"}]}],"poster":"zr79","content":"It should not have permission to create a VNet as this was denied in the root directory. rules are inherited downwards from parent to child"}],"content":"Im sorry but why is the 2nd false? All that was forbiden at the root level is lifted on Subscription 2","comment_id":"335738","poster":"azuremarco2021","timestamp":"1618424700.0","upvote_count":"4"},{"content":"Best explanation","comment_id":"617278","upvote_count":"3","poster":"RVE","timestamp":"1655386320.0"}],"timestamp":"1607658720.0","upvote_count":"141","comment_id":"240636","poster":"Ikrom"},{"comments":[{"comments":[{"content":"It is an implicit deny-explicit allow policy. Anything that does not fall into the list of allowed resources for example will be denied. So you explicitly state what you want to allow and Azure AD denies everything else not in included.","comment_id":"626128","upvote_count":"1","poster":"faz_r_a","timestamp":"1656763500.0"}],"content":"Azure Policy is an explicit deny.\nSo the root management group deny the virtual network resource type to the child management groups/subscriptions/resources groups and the policy in the question does not have any thing excluded so it will deny","poster":"vamshidhara","timestamp":"1621239420.0","upvote_count":"5","comment_id":"359374"}],"timestamp":"1621150440.0","upvote_count":"27","poster":"irosh412","comment_id":"358393","content":"https://docs.microsoft.com/en-us/azure/governance/policy/overview#policy-definition\n\nThis clearly states,\n\"Allowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.\"\nTherefore, only allowed resource type is virtual nerwork.\nSO the answer for the second question is NO.\nbut third is Yes, because adding subscrition and moving subscription is the same in MS docs. :)"}],"content":"Answer is Wrong : It should Be NO NO NO\n- subscription should be moved by can't be added to 2 groups.","timestamp":"1607360760.0","upvote_count":"255"},{"comment_id":"359557","content":"Allowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.\nNot allowed resource types (Deny): Prevents a list of resource types from being deployed.\n\nBased on the Policies, VNETs are not allowed in the Tenant Root Group scope, so you cannot deploy VNETs. Also, VNETs only allowed in ManagementGroup12 scope, but you cannot deploy any other resource.\n\nBox 1: No\nSubscription1 is a member of ManagementGroup21, ManagementGroup21 is a member of ManagementGroup11, ManagementGroup11 is a member of the Tenant Root Group, The Tenant Root group has ‘Not allowed resource types for virtual network’.\n\nBox 2: No:\nYou cannot create a VM, because based on the Policy you can only create VNETs in Sybscription2 (ManagementGroup12).\n\nBox 3: No\nYou cannot ADD Subscription1 to ManagementGroup11, but you can MOVE Subscription1 from ManagementGroup21 to ManagmentGroup11. Subscriptions can only be a member of ONE ManagementGroup at a time.","upvote_count":"251","poster":"mlantonis","timestamp":"1726810380.0","comments":[{"upvote_count":"2","timestamp":"1736932080.0","content":"Good Explanation dude :)","comment_id":"1340763","poster":"vrm1358"},{"poster":"ElDakhli","comment_id":"759593","timestamp":"1672217400.0","upvote_count":"5","content":"Perfect comment, thank you :)"},{"timestamp":"1638383160.0","content":"Box 1 and Box 2 are ok; however, I have a doubt that when all management groups here are under management group Tenant Root Group which has a policy barring Virtual Networks, so how come ManagementGroup12 can allow Virtual network creation in the first place? Do'nt member management groups inherit policies from host management group?","upvote_count":"1","comments":[{"comment_id":"491866","poster":"Harssh","timestamp":"1638383700.0","content":"My question is can a nested management group override policy defined at its parent management group level by creating its own contradictory policy?","upvote_count":"3","comments":[{"timestamp":"1670693220.0","poster":"SumanSaurabh","upvote_count":"1","comment_id":"741139","content":"Exactly, I do have same question. Can some help to understand"}]}],"poster":"Harssh","comment_id":"491862"},{"comment_id":"514572","comments":[{"upvote_count":"1","comment_id":"611708","content":"Allowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.","poster":"kilowd","timestamp":"1654411860.0"},{"timestamp":"1651483860.0","comment_id":"595975","poster":"xavigo","content":"If you can *only* create VNETS then it follows you cannot create other things like VMs. What's so hard to grasp?","upvote_count":"6"}],"poster":"joergsi","timestamp":"1641051960.0","content":"Your reply for box 2 makes no sense because the question is: You can create a VM in Sun 2?\nAnd you are saying: Box 2: No:\nYou cannot create a VM, because based on the Policy you can only create VNETs in Sybscription2 (ManagementGroup12).\nBut then the answer needs to be yes based on your argument, correct?","upvote_count":"4"},{"poster":"dp846","timestamp":"1688594340.0","upvote_count":"2","content":"Box 2 : No since overrides property allows you to change the effect of a policy definition without modifying the underlying policy definition","comment_id":"944142"},{"comment_id":"949713","upvote_count":"2","poster":"binhdortmund","timestamp":"1689161700.0","content":"best explanation! Thanks"},{"comment_id":"374644","poster":"RamanAgarwal","content":"Policy doesnt restrict you to create a VM anywhere. It restricts you to create VNet only which is overridden at Management12 and it will be inherited by Subscription 2. So you can create Vnet hence VM in subscription 2","timestamp":"1622856480.0","upvote_count":"10"}]},{"poster":"Ponpon3185","comment_id":"1362458","timestamp":"1740644760.0","content":"To my mind No/Yes/No, cause if Vnet exist you're able to create VM","upvote_count":"1"},{"comment_id":"1300219","content":"NYN - \n1 - can't create the network\n2 - you can create VMs all day long\n3 - can't add and have 2 parents; the answer says move but move != add","timestamp":"1729383720.0","upvote_count":"2","poster":"Dankho"},{"comments":[{"upvote_count":"11","content":"Second question is for vm, not for vnet.","comment_id":"259672","timestamp":"1609789260.0","poster":"Penagache"},{"comment_id":"256242","timestamp":"1609420800.0","upvote_count":"2","content":"Thank you for this detailed response!","poster":"oooMooo"},{"poster":"Bruce_dB","upvote_count":"4","content":"Yes, but,\nThe process of moving a subscription is by using the add functionality:\n\"To move a subscription in CLI, you use the add command\"\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage","comment_id":"268557","comments":[{"poster":"shnz03","comment_id":"376014","upvote_count":"1","timestamp":"1622983140.0","content":"Good one! the verb \"add\" in CLI is confirmed as move."}],"timestamp":"1610770800.0"}],"comment_id":"255703","timestamp":"1726810620.0","upvote_count":"9","poster":"NickyDee","content":"Nested groups galore!\n\nNO, you cannot create a Vnet in Subscription1: \nSubscription1 is a member of Group21, Group21 is a member of Group11, Group11 is a member of the Tenant Root Group, The Tenant Root group is Not allowed resource types for virtual network.\n\nNO, you cannot create a Vnet in Subscription2:\nSubscription2 is is a member of ManagementGroup12, ManagementGroup12 is a member of the Tenant Root Group, The Tenant Root group is Not allowed resource types for virtual network.\n\nNO, you cannot ADD Subscription1 to ManagementGroup11, but you can MOVE subscription1 from ManagementGroup21 to ManagmentGroup11. Subscriptions can only be a member of ONE managementGroup at a time."},{"content":"Creating a Virtual Machine alone still requires that you create a virtual network Essentially, a virtual machine is a virtual network with 1 PC. Meaning, you cannot create a VM if this action is denied. \n\nIf however, the VM existed before the policy was created, which is stated nowhere, by the way, that'd be something entirely different. The question doesn't state anything about there being an existing VNet. \n\nThis means the answer to question 2 should be NO.\n\nAs for question 3, Subscriptions can be moved, I am not sure what they mean by Add. So this one also isn't quite clear. \n\nIf by \"add\" they mean \"move\", then the answer is Yes.\n\nSo it should be: NO, NO, YES","comment_id":"424412","poster":"AubinBakana","timestamp":"1726810560.0","upvote_count":"4"},{"poster":"Chiboy","upvote_count":"2","content":"This is simple:\n1. Virtual Networks are not allowed at the Tenant Root Group for ALL Management Groups. So number 1 is a No. Though virtual network is allowed for one management group, that management group is still under a Tenant root group where vnet is not allowed.\n2. You cannot create a virtual Machine without a Virtual Network. Since virtual networks are not allowed, the answer is also No.\n3. This is a YES for me. The architecture of a subscription forces it to trust ONLY one Directory at a time. Hence, when the question asks if we can add the subscription to a different mgt group, it was asking if we can \"move\" it, since architecturally, you can not have a subscription in more than 1 directory at the same time. I admit the question should have been specific in using the word \"move\" instead of \"add\". But then, it may also have been part of the question to see if we understand that a subscription can only trust one directory at time.","comment_id":"613687","timestamp":"1726810440.0"},{"content":"Box 3: Yes.\n\nMove subscriptions\nAdd an existing Subscription to a management group in the portal\n\nLog into the Azure portal.\nSelect All services > Management groups.\nSelect the management group you're planning to be the parent.\nAt the top of the page, select Add subscription.\nSelect the subscription in the list with the correct ID.\nScreenshot of the 'Add subscription' options for selecting an existing subscription to add to a management group.\nSelect \"Save\".\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage","timestamp":"1726810440.0","poster":"Frost312321","upvote_count":"2","comment_id":"621793"},{"comment_id":"644568","upvote_count":"3","poster":"yana_b","timestamp":"1726810440.0","content":"Box1: No -> because VNets are only allowed for MG12. (here the question in principle whether the allowed VNet for MG12 overrides the previous rule that VNets are forbidden on Tenant root level, which will then mean that such a rule forbids totally the creation of new VNets).\nBox 2: Yes -> because forbidding VNets creation does not automatically forbit VMs creation, we can still create new VNs within the already existing Vnets.\nBox 3: Yes -> we can move subscriptions from one MG to another, and here we have MG21 under MG11\nhttps://docs.microsoft.com/en-us/learn/modules/create-windows-virtual-machine-in-azure/2-create-a-windows-virtual-machine\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage"},{"timestamp":"1726060980.0","content":"Wrong\n\nNO\nNO\nNO","upvote_count":"1","poster":"[Removed]","comment_id":"1282135"},{"poster":"lewisjcsc300","timestamp":"1725609060.0","content":"Adding sub1 isnt the same as moving Sub1","comment_id":"1279469","upvote_count":"1"},{"content":"NYN. In general, polices are inherited through a hierarchical structure consisting of Management Groups > Subscriptions > Resource Groups > and Resources. However policies, even more restrictive policies, can be over-ridden at those lower levels. \n\nThe first answer is No because it inherits the restrictive policy from the root group and there is nothing to over-ride that policy.\n\nThe second answer is Yes because even though it inherits a restrictive policy from the root group, it explicitly allows VNETs to be created at a lower, more granular, management level. I know the question is asking about VM creation, but you need VNETs to create VMs and there is no policy specifically about allowing or disallowing VM creation. \n\nThe third answer is No because, as other have said, you cannot have a subscription in 2 management groups. It cannot be added, but it can be moved.","timestamp":"1722431100.0","comment_id":"1258874","upvote_count":"1","comments":[{"content":"After reading more about this it seems that actually the more restrictive policy will apply. I must have read that from old information or something. You can however exclude resources from a policy in azure, although this is not mentioned in this particular question. So the Answer is actually NNN. The second answer is No because it inherits the more restrictive policy, and even though it is explicitly allowed, the more restrictive inherited policy will prevent VNETs and therefor VMs from being created. What a journey we've been on","upvote_count":"2","comment_id":"1258882","timestamp":"1722431760.0","poster":"TheFivePips"}],"poster":"TheFivePips"},{"timestamp":"1719427860.0","content":"NNN - disallowed by explicit deny; explicit allow is implicit deny on all else; cannot be a member of multiple management groups.","poster":"amurp35","upvote_count":"1","comment_id":"1237711"},{"poster":"23169fd","upvote_count":"1","comment_id":"1228437","timestamp":"1718108520.0","content":"Given answers are correct.\n1. No\nThe \"Not allowed resource types\" policy for virtualNetworks is scoped to the Tenant Root Group.\n2. Yes\nThere is no policy that restricts or disallows creating virtual machines in ManagementGroup12 or Tenant Root Group.\nThe allowed resource types for virtualNetworks doesn't impact the creation of virtual machines.\n3. Yes\nThere are no policies or constraints provided that explicitly prevent moving Subscription1 to ManagementGroup11."},{"poster":"Charumathi","upvote_count":"1","comment_id":"1227016","content":"Tenant Root Group (Not Allowed Resource - Virtual N/W)\n |\n |__Management Group 11\n | |\n | |__Management Group 21\n | (Sub 1)\n |\n |__Management Group 12 \n (Sub 2) \n (Allowed Resource - Virtual N/W)\n\nAnswers,\n\n1. You can create a virtual network in Sub1 - No\n Reason: Subscription 1 is under Tenant Root Group, hence we will not be able to create \n Virtual Network\n2. You can create a virtual machine in Sub2 - No \n Reason: Subscription 2 is also under Tenant Root Group with overrides the allow \n resource type in Management Group 12. You will not be able to create a Virtual network, \n without creation of virtual network, we will not be able to create a Virtual Machine.\n3. You can add Sub1 to Management Group11 - No\n Reason: We cannot add subscription from one group to the other.","timestamp":"1717900200.0"},{"poster":"varinder82","content":"Final Answer : NYN","timestamp":"1716276780.0","comment_id":"1214783","upvote_count":"2"},{"comment_id":"1209305","poster":"3c5adce","timestamp":"1715333940.0","content":"Going to go with NYN - will report back","upvote_count":"1"},{"upvote_count":"1","content":"Final Answer : No No No","comment_id":"1204390","poster":"varinder82","timestamp":"1714461900.0"},{"poster":"tashakori","content":"No\nNo\nYes","timestamp":"1710486840.0","comment_id":"1174089","upvote_count":"1"},{"upvote_count":"1","poster":"Wojer","comment_id":"1122705","timestamp":"1705252620.0","content":"Anything assigned on the root will apply to the entire hierarchy, which includes all management groups, subscriptions, resource groups, and resources within that Azure AD tenant"},{"poster":"Japeth","upvote_count":"1","content":"Answer is Wrong : It should Be NO YES NO\nVirtual networks are not allowed to create in Subscription1","timestamp":"1704732420.0","comment_id":"1116805"},{"upvote_count":"2","timestamp":"1703512500.0","content":"N - Subscription 1 not allowed to create VNET\n N - Subscription 2 allows only VNET, restricts everything else. Per policy definition of Allowed Resources Type, \"If NOT (listOfResourceTypesAllowed), then deny\". So, only specified resources will be allowed, nothing else\n N - Subscription can be associated with only one Management group","comment_id":"1105309","poster":"Gpsn"},{"upvote_count":"2","comment_id":"1075058","content":"2. Yes\nIf there is an existing virtual network in Subscription2, you could use that network to create a VM","poster":"jlee425","timestamp":"1700443800.0"},{"content":"During a VM creation, a VNet and NIC creation are mandatory. Because of the Policy, VM creation would be stopped if a new VNet needs to be created. But if there is any existing VNet available in the resource group already, that can be used to create the VM. In that way, the VM creation shouldn't fail. So, yes, you can create a VM.","poster":"psscloud","timestamp":"1700224260.0","upvote_count":"1","comment_id":"1073306"},{"poster":"DWILK","comment_id":"1042028","timestamp":"1697136780.0","content":"I wish MS would be more careful how they phrase things. There's a big difference between move and add","upvote_count":"2"},{"poster":"sedex","comment_id":"993379","content":"There seems to be a lot of confusion about the wording of the last part of this question. In my opinion yes, of course you can add Sub1 to MG11. Nothing is stopping you from adding it, it will just no longer be in MG21. Why is this it being argued that a subscription can't exist in 2 MGs when it will obviously only be in 1 after adding it to another?","upvote_count":"3","timestamp":"1693331880.0"},{"comment_id":"981643","content":"I would like to ask can I create virtual network in subscription 2?","timestamp":"1692102240.0","upvote_count":"1","poster":"FatFatSam"},{"content":"NNN\n\n2.- the order of the policy does not matter, the more restrictive policy wins","upvote_count":"3","timestamp":"1692029700.0","poster":"MGJG","comment_id":"980942"},{"poster":"RickySmith","content":"NNN\n1.N\nThe policy is inherited.\nhttps://learn.microsoft.com/en-us/azure/governance/policy/overview#assignments\n2.N\nAllowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.\nhttps://learn.microsoft.com/en-us/azure/governance/policy/overview#policy-definition\n3.N\nA subscription will be a direct member of only one management group.\nhttps://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/azure-best-practices/organize-subscriptions#azure-management-groups","comment_id":"980167","upvote_count":"3","timestamp":"1691947680.0"},{"poster":"kamalpur","comments":[{"poster":"avidlearner","comment_id":"977278","content":"that's a wrong explanation. he says you can create a VM , which you can't because you can't create the VNet on sub2. \nHe says answer is NYN, in my logical opinion it's just not what you can do it's whether it's allowed.\nAnswer should be NNN","timestamp":"1691641560.0","upvote_count":"1"}],"content":"This question is explained in the below video with the concept.\nhttps://youtu.be/ajrGaguGg90","upvote_count":"1","comment_id":"960105","timestamp":"1690090200.0"},{"content":"It's N N Y","comment_id":"958157","poster":"Josete1106","timestamp":"1689924000.0","upvote_count":"1"},{"timestamp":"1687982700.0","poster":"[Removed]","content":"If we assume permission inherit from root \nAdd virtual netwok -> No -> \\root\\ManagementGroup11\\ManagementGroup21\\Subscription1 -> Not allowed at root level -> Inherite all the following levels\n\nCreate virtual machine -> No -> \\root\\ManagementGroup12\\Subscription2 Not allowed at root level -> Inherite all the following levels\n\nAdd Subscription1 to ManagementGroup11 -> Yes -> \\root\\ManagementGroup11\\ManagementGroup21\\Subscription1, Not allowed \nfor only virtual networks, but we can add subscription1","upvote_count":"1","comment_id":"937101"},{"content":"Udemy is NO NO NO","comment_id":"911071","timestamp":"1685527680.0","upvote_count":"2","poster":"simer"},{"poster":"friendlyvlad","upvote_count":"1","content":"In Azure Policy, when you have multiple policies applied to the same resource with conflicting effects (e.g., deny and allow), the effect of the last evaluated policy takes precedence. \nN-Y-N","timestamp":"1685473740.0","comment_id":"910551","comments":[{"timestamp":"1691641620.0","comment_id":"977280","poster":"avidlearner","upvote_count":"1","content":"Nope, effect of last Deny policy takes precedence. \nCheck this out \nhttps://techcommunity.microsoft.com/t5/itops-talk-blog/the-impact-of-conflicting-azure-policies/ba-p/2227063"}]},{"comment_id":"902996","poster":"Zonci","timestamp":"1684654200.0","upvote_count":"2","content":"NNY is the correct ans"},{"comment_id":"899366","poster":"RandomNickname","comments":[{"poster":"RandomNickname","timestamp":"1686301740.0","comment_id":"919122","upvote_count":"1","content":"Changing my second Q from Y to N.\nDidn't read the Q properly and the URL below is a good expanation.\n\nDue to explicit policy restrictions on creating and deny specific resources."}],"timestamp":"1684255380.0","upvote_count":"1","content":"Based on the info here and questions\neither\nNYN\nor NYY\n1,2 are fairly straight forward.\n3rd depends if it's add or move since can move.\nSo careful on exam day."},{"poster":"Andreas_Czech","timestamp":"1684225740.0","content":"tested in Lab -> VM creation require a VNET\ntherefore -> NO NO NO","comment_id":"898993","comments":[{"upvote_count":"1","comment_id":"1125901","timestamp":"1705585260.0","content":"but what if you have a VM already existing in the environment?","poster":"waetawangu"}],"upvote_count":"3"},{"comment_id":"874842","poster":"worldkalabe","content":"The answer is: NO,NO,YES.\n1. POLICY SAYS NO\n2. PARENT POLICY IS SUPERIOR THAN THAT OF CHILDREN\n3. YOU CAN ADD EXISTING SUBSCRIPTION TO THE EXISTING MANAGEMENT GROUP\n\"Log into the Azure portal.\n\nSelect All services > Management groups.\n\nSelect the management group you're planning to be the parent.\n\nAt the top of the page, select Add subscription.\n\nSelect the subscription in the list with the correct ID.\"","timestamp":"1681917840.0","upvote_count":"4"},{"content":"#3 is should be \"move\" in the current version of the question (which is what I got on my exam), resulting in N/N/Y as the answer. It will be N/N/N otherwise.\n\nFor #2, it is \"No\" for two reasons. The first being the \"allowed\" policy inherited on subscription 2 does not allow anything except virtual networks to be created, denying virtual machines. The second reason is that the \"not allowed\" policy inherited from the root management group does not allow virtual networks to be created, and you cannot create a virtual machine without a virtual network. As a result of the two policies, you in fact should not be able to create any resource at all in subscription 2.\n\nhttps://learn.microsoft.com/en-us/azure/governance/policy/concepts/effects#layering-policy-definitions\n\nThe link above describes the net effect of layering multiple policies.","upvote_count":"5","poster":"Nitestorm","comment_id":"847051","timestamp":"1679488380.0"},{"content":"OLD Question :\n\n- NO: Subscription 1: is not allowed to create a VNET.\n- NO: Subscription 2: Allowed to create a VNET which restricts anything else.\n- NO: Subscription 1: already in one Management group called 21, so cannot add into another. A Subscription can be assigned to 1 Management Group.\n\nNEW Question :\n\n1. NO - I had subscription under MG with allowed virtualNetworks but got blocked by not allowed virtualNetworks policy from root MG https://imgur.com/a/vLnpRdX\n\n2. NO - Screenshot of policy that blocked my deployment of VM in my subscription https://imgur.com/a/BOUyWe4\n\n3. YES - I could MOVE it to higher tier MG which was called \"add\" in notification pane https://imgur.com/a/qX7WS6w","timestamp":"1679017140.0","poster":"rocky48","upvote_count":"12","comment_id":"841497"},{"timestamp":"1678270320.0","content":"Tested in Lab\n\n1. NO - I had subscription under MG with allowed virtualNetworks but got blocked by not allowed virtualNetworks policy from root MG https://imgur.com/a/vLnpRdX\n\n2. NO - Screenshot of policy that blocked my deployment of VM in my subscription https://imgur.com/a/BOUyWe4\n\n3. YES - I could MOVE it to higher tier MG which was called \"add\" in notification pane https://imgur.com/a/qX7WS6w","upvote_count":"4","poster":"Doman01","comment_id":"832803"},{"poster":"kklohit","comment_id":"823182","content":"A. No, you cannot create a virtual network in Subscription1 because the policy in the Tenant Root Group does not allow virtual networks.\nB. Yes, you can create a virtual machine in Subscription2 because the policies do not restrict creating virtual machines.\nC. Yes, you can add Subscription1 to ManagementGroup11 as it is a valid parent-child relationship between the two","upvote_count":"1","timestamp":"1677472140.0"},{"timestamp":"1676456760.0","upvote_count":"2","content":"Miselading question part 3.\n\"You can add subscription 1 to management group 11\"\nbetter to phrase this as \"You can move subscription 1 to management group 11\"\nThen the answer wouuld be 'yes'","poster":"allyQ","comment_id":"809364"},{"timestamp":"1674610440.0","upvote_count":"1","content":"Answer is Wrong : It should Be NO NO NO","poster":"orionduo","comment_id":"787157"},{"timestamp":"1673019660.0","poster":"silver1987","comment_id":"767852","content":"the second: You can create virtual machine in Subsription2 —> NO\nyou can not deploy any resources in Subscription2 because of Not allowed resource types policy and Allowed resource types policy\nyou can not deploy vent,vm,storage account etc.","upvote_count":"2"},{"timestamp":"1672954560.0","content":"Is it possible to have a VN without VMS?","poster":"Loose_Poet","upvote_count":"4","comment_id":"767064"},{"poster":"_fvt","upvote_count":"1","comment_id":"761821","content":"NO NO NO\n- First two are no because we have a Deny VNet at the root level and \"Policy is an explicit deny system\" (https://learn.microsoft.com/en-us/azure/governance/policy/overview) so Virtual Networks aren't allowed anywhere. And you need a VNet with subnet to create a VM.\n- The Third is NO because a Subscription can only be in one Management group, you can't add it to another Management group. You can only move it, but in this question it is written \"add\".","timestamp":"1672393620.0"},{"comment_id":"745525","timestamp":"1671060960.0","upvote_count":"1","poster":"JYKL88","content":"Answer should be No No No"},{"upvote_count":"3","poster":"KingChuang","content":"My Answer : N/N/Y\nQuestion 1:create Vnet in [ Not Allowed Pollicy ]\nQuestion 3:create VM not in [Allowed Pollicy]\nMove = Delete + Add\n\nhttps://learn.microsoft.com/zh-tw/azure/governance/management-groups/manage","comment_id":"712743","timestamp":"1667785140.0","comments":[{"comment_id":"712744","upvote_count":"1","content":"My Answer : N/N/Y\nQuestion 1:create Vnet in [ Not Allowed Pollicy ]\nQuestion 2:create VM not in [Allowed Pollicy]\nQustion 3: Move = Delete + Add","timestamp":"1667785140.0","poster":"KingChuang"}]},{"timestamp":"1666879500.0","upvote_count":"1","comment_id":"705631","content":"NO\nNO\nYES (An already existing subscription can be added to another Management Group. Go to the new Parent MG and ADD and then select the subscription from the drop down, it will automatically remove it from the previous MG and add it to the New MG).","poster":"dc2k79"},{"upvote_count":"1","content":"NO NO YES","comment_id":"688797","poster":"madrigal","timestamp":"1665158940.0"},{"content":"Correct answer is NO NO YES right?","upvote_count":"1","comment_id":"680704","timestamp":"1664278800.0","poster":"sardino_infecto"},{"content":"- NO: Subscription 1 under ManagementGroup21 is not allowed to create a VNET as it inherites the policy frmo the Tenant Root Group.\n- NO: Subscription 2 under ManagementGroup12 i allowed to create a VNET which restricts to create a VM.\n- YES: Go to Managegement Groups blade, righ click on the 3 dots next to ManageMentGRoup11, click +Add subscription here. Select Subscription 1 and it is moved to this MG.","poster":"gabyrever","comment_id":"671980","timestamp":"1663475280.0","upvote_count":"2"},{"comment_id":"671297","poster":"David1990","content":"– NO: Subscription 1: is not allowed to create a VNET. \n\n– NO: Subscription 2: Allowed to create a VNET which restricts anything else. \n\n– NO: Subscription 1: already in one Management group called 21, so cannot add into another. A Subscription can be assigned to 1 Management Group.","timestamp":"1663394940.0","upvote_count":"1"},{"upvote_count":"3","timestamp":"1662991320.0","poster":"NaoVaz","comment_id":"667064","content":"You can create a virtual network in subscription1: NO (Policy at Root Management Group does not allow)\nYou can create a virtual machines in subscription2: NO (Allow policy denies all other resources)\nYou can add Subscription1 to ManagementGroup11: No (1 Subscription can only exist inside a single Managmente Group)"},{"timestamp":"1661833020.0","upvote_count":"2","comment_id":"653803","poster":"EmnCours","content":"- NO: Subscription 1: is not allowed to create a VNET.\n- NO: Subscription 2: Allowed to create a VNET which restricts anything else.\n- NO: Subscription 1: already in one Management group called 21, so cannot add into another. A Subscription can be assigned to 1 Management Group."},{"content":"Question related to the nested policies stated here? someone also already asked but no answer yet...\n\nCan a nested management group override policy defined at its parent management group level by creating its own contradictory policy? like here parent tenant group says not allowed resource types as Vnets and other nested management group says allowed resource types of Vents. Please provide relevant documents as well if any. Thanks","upvote_count":"1","poster":"pari205","timestamp":"1657593000.0","comment_id":"630258"},{"content":"NO NO NO","timestamp":"1655795820.0","poster":"Aditv","upvote_count":"1","comment_id":"619653"},{"timestamp":"1655193120.0","upvote_count":"3","poster":"webs0219","content":"Question in exam with Move subscription and not add","comment_id":"616092"},{"comment_id":"613778","poster":"Sillyon","timestamp":"1654768740.0","upvote_count":"2","content":"Vote: No, Yes, No\n\nNot sure for 2nd is Yes."},{"timestamp":"1654767420.0","content":"No , Yes , Yes","poster":"manalshowaei","upvote_count":"2","comment_id":"613737"},{"timestamp":"1654688400.0","upvote_count":"4","content":"1) No - Policy at root level prevents the creation of vnets in any child management group (tested)\n2) No - Policy only allows vnets to be created, nothing else (tested)\n3) Yes - Click the elipsis in the selected management group and click \"Add subscriptio here\". This will move the subscription. In this case Add=Move.","comment_id":"613217","poster":"fonte"},{"comment_id":"613171","upvote_count":"1","content":"VM cannot be created without a VNet so #2 is No","poster":"Gbase","timestamp":"1654680060.0"},{"poster":"Vinni07","comment_id":"610363","timestamp":"1654124700.0","content":"NO - There is deny policy for virtual network resource on root level.\nNO - There is deny policy for virtual network resource on root level which means only virtual network resources are denied to be created and users are allowed to create rest all resources. But than there is another allowed policy applied on Sub2 to allow resource type is vnet which means rest of resources not allowed. So VM can't be created.\nRefer (Policy Definition) - https://docs.microsoft.com/en-us/azure/governance/policy/overview \nN - You can move subscription to another management group but can't add. Subscription can be part of single management group only.","upvote_count":"1"},{"content":"Answer should be NO, NO, NO\nBox 1: No\nSubscription1 is a member of ManagementGroup21, ManagementGroup21 is a member of ManagementGroup11, ManagementGroup11 is a member of the Tenant Root Group, The Tenant Root group has ‘Not allowed resource types for virtual network’.\n\nBox 2: No:\nYou cannot create a VM, because based on the Policy you can only create VNETs in Sybscription2 (ManagementGroup12).\n\nBox 3: No\nYou cannot ADD Subscription1 to ManagementGroup11, but you can MOVE Subscription1 from ManagementGroup21 to ManagmentGroup11. Subscriptions can only be a member of ONE ManagementGroup at a time","upvote_count":"3","comment_id":"607363","poster":"EleChie","timestamp":"1653505320.0"},{"upvote_count":"1","poster":"Marouane1","timestamp":"1653381900.0","comment_id":"606568","content":"Last one is also a NO. Each management group and subscription can only support one parent. Each management group can have many children. All subscriptions and management groups are within a single hierarchy in each directory."},{"comment_id":"568659","timestamp":"1647382200.0","upvote_count":"3","content":"The example explanation uses networking. Please read and you will have your answer. (From Microsoft Documentation): In another example, you might want to assign a resource type allowlist definition at the management group level. Then you assign a more permissive policy (allowing more resource types) on a child management group or even directly on subscriptions. However, this example wouldn't work because Azure Policy is an explicit deny system. Instead, you need to exclude the child management group or subscription from the management group-level assignment. Then, assign the more permissive definition on the child management group or subscription level. If any assignment results in a resource getting denied, then the only way to allow the resource is to modify the denying assignment. (End of document). And you cannot create a VM without being able to create a VNET, because it is a dependency, try and you will receive an error.","poster":"valkyrieShadow"},{"content":"NO Yes YES","poster":"Parkerkim","timestamp":"1646696760.0","upvote_count":"2","comment_id":"562934"},{"timestamp":"1645775460.0","poster":"nqthien041292","upvote_count":"1","comment_id":"555839","content":"Vote: N, Y, N"},{"upvote_count":"1","timestamp":"1645770720.0","content":"Vote: N, Y, N","poster":"nqthien041292","comment_id":"555814"},{"upvote_count":"1","timestamp":"1643822880.0","comment_id":"539006","content":"One reason to create a management group is to bundle subscriptions together. Only management groups and subscriptions can be made children of another management group. A subscription that moves to a management group inherits all user access and policies from the parent management group\n\nWhen moving a management group or subscription to be a child of another management group, three rules need to be evaluated as true.\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions","poster":"edengoforit"},{"comments":[{"poster":"reiny09","content":"Question 2 is asking if a VM can be created. Since the policy is already in place, the answer to the question is No. If the question were asking if a vNet could be created, the answer would be Yes, since vNets are the only resource type allowed in ManagementGroup12/Subscription2.","comment_id":"543249","timestamp":"1644344100.0","upvote_count":"3"}],"timestamp":"1641976860.0","poster":"fxliang","comment_id":"522002","content":"No, Yes, Yes\n1. NO, because policy states no vnet is allowed - so basically the new policy created states no *NEW * vNet can be created on ALL Management groups. including Management Group 12 because it is nested under Tenant Root Group.\n\n2. YES, you can create VM. because any vNET created before this no vNet policy is created are unaffected.\n\n3. YES, because that is how you would do it. to MOVE a subscription, you would use the *Add subscription\" option on the portal. this will in turn add the subscription to new management group and remove it from old management group.","upvote_count":"5"},{"timestamp":"1640842260.0","comment_id":"513005","content":"Option 2 is no (https://docs.microsoft.com/en-us/azure/governance/policy/overview#policy-definition):\n\nAllowed Resource Type (Deny): Defines the resource types that you can deploy. *Its effect is to deny all resources that aren't part of this defined list*.","upvote_count":"1","poster":"matt_dns"},{"poster":"hanyahmed","comment_id":"512408","content":"NO\nNO\nNO","timestamp":"1640795220.0","upvote_count":"1"},{"content":"Box 1: No\nSubscription1 is a member of ManagementGroup21, ManagementGroup21 is a member of ManagementGroup11, ManagementGroup11 is a member of the Tenant Root Group, The Tenant Root group has ‘Not allowed resource types for virtual network’.\n\nBox 2: No:\nYou cannot create a VM, because based on the Policy you can only create VNETs in Sybscription2 (ManagementGroup12).\n\nBox 3: No\nYou cannot ADD Subscription1 to ManagementGroup11, but you can MOVE Subscription1 from ManagementGroup21 to ManagmentGroup11. Subscriptions can only be a member of ONE ManagementGroup at a time.","upvote_count":"5","timestamp":"1640389680.0","poster":"Sara_Mo","comment_id":"508901"},{"poster":"arkadius","upvote_count":"2","comment_id":"500874","content":"Ans. 3 YES - as it was written - MS mixes Adding and moving in DOCS\n.\nMove subscriptions:\nAdd an existing Subscription to a management group in the portal\nLog into the Azure portal.\nSelect All services > Management groups.\nSelect the management group you're planning to be the parent.\nAt the top of the page, select Add subscription.\nSelect the subscription in the list with the correct ID.\nScreenshot of the 'Add subscription' options for selecting an existing subscription to add to a management group.\n Select \"Save\".\n.\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions","timestamp":"1639426380.0"},{"upvote_count":"1","content":"answer 2 is No.By allowing metworks, you deny all the rest. NO NO NO","poster":"Sara_Mo","timestamp":"1638734760.0","comment_id":"494623"},{"timestamp":"1638734580.0","poster":"Sara_Mo","upvote_count":"1","content":"NO yes NO","comment_id":"494619"},{"comment_id":"484878","content":"It is not possible to create an Azure VM without a vnet, \nAn Azure resource group cannot contain subscriptions. A subscription contains resource groups.\nNO, NO, NO","timestamp":"1637658300.0","upvote_count":"2","poster":"marco_aimi"},{"timestamp":"1637577240.0","upvote_count":"1","content":"Answers are correct as shown - see the 3x 'Box 1-2-3' explanations and comments.","poster":"J511","comment_id":"484084"},{"upvote_count":"3","content":"Tested. No, No, No.\n- deny policy overrides allow policy regardless of order in which policies are applied\n- trying to create vm ends with error creating a network interface\n- you can only MOVE, not ADD subscription","poster":"hitmk5","timestamp":"1636449720.0","comment_id":"474706"},{"poster":"Timock","upvote_count":"2","content":"Box 1: No -\nVirtual networks are not allowed at the Tenant Root Group. Management Group11 inherits the Deny Policy from the Tenant Root Group. ManagementGroup21 inherits the Deny Policy from ManagementGroup11. The question states Subscription1 which includes ManagementGroup21 and therefore ManagementGroup11.\n\nBox 2: No -\nManagementGroup12 is in Subscription2 and in the Scope of the 2nd policy. Allowed resource types are virtualNetworks. This means all other resources are denied by default.\n\nBox 3: No -\nSubscriptions can be moved between Management Groups provided the user has the required RBAC permissions, however, the question states ADD to Management Group11 and not move it. Thefore, the answer is no. A subscription can only exist in one Management Group at a time.\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions","comment_id":"474600","timestamp":"1636429320.0"},{"upvote_count":"1","poster":"a4andrew","timestamp":"1633713660.0","comment_id":"459357","comments":[{"upvote_count":"2","timestamp":"1634435460.0","comment_id":"463349","poster":"a4andrew","content":"Self correct.#2 is NO: Subscription 2: Allowed to create a VNET which restricts anything else."}],"content":"No\nYES(maybe), It will probably provision/create the vm but the policy will block the provisioning of the VNET. The creation process can allow other resources to be created, but can/will error others.\n YES..Adding sadly is the same as moving : https://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions"},{"timestamp":"1633209900.0","content":"These questions will be a lot easier if they are represented diagrammatically like you would do in real life but MS is too lazy to do something like that...","poster":"DevOpposite","comment_id":"456247","upvote_count":"6"},{"comments":[{"timestamp":"1633005840.0","upvote_count":"2","comment_id":"454917","poster":"sniper83","content":"The error message from the policy says that resource \"VM0123\" was disallowed by policy \"Allow resource type\", which means that this policy is disallowing any other resource beyond the Vnets."}],"upvote_count":"3","poster":"sniper83","comment_id":"454912","timestamp":"1633005180.0","content":"Right answer and tested in my lab:\n- No: because the policy on the Root Management level\n-No: same above reason, because the influence of the previous policy\n-Yes: Add subscription = move and yes you can move it from MG21 to MG11"},{"poster":"Michael_ATB","content":"the answer is :\nNo\nNo\nNo","timestamp":"1632507000.0","comment_id":"451038","upvote_count":"3"},{"comment_id":"450343","poster":"theOldOne","content":"Then question is in need of attention from a moderator. It seems there is no agreement on what is correct.","timestamp":"1632406680.0","upvote_count":"4"},{"upvote_count":"1","poster":"vekmbeplvgihxdnxab","comment_id":"449092","timestamp":"1632247920.0","content":"I'd to look this up since there's a massive different answers.\nApparently the few people saying B should be a \"NO\" is correct.\n\nSince its a explicite system it means allowing 1 resource denies everything else.\n\nExample a easy way to test it is by - creating a policy that allows creating resources XXXX regions will cause a deny on creating outside the selected regions."},{"content":"Answer is correct: NO, YES, YES\n1st Network resources are not allowed under the subject subscription. So NO\n2nd VM is not restricted and by default this is allowd. So YES\n3rd You can have subscription with the same name, it could be confusing, but the thing that is always different is the object ID. I have currently in the same group manager 3 subscription with the default pay-as-you-go name, if this is not allowed, then those should have a name with a number to be adding an identifier to each subscription, but is not, so the answer is YES. Also is important to highlight that question is saying \"ADD\" Which implies to create, and even if it says to move, this is also allowed, so in both cases, move or create a subscription with the same name, the answer must be YES.","comment_id":"446754","poster":"julioglez88","timestamp":"1631902380.0","upvote_count":"5"},{"upvote_count":"3","comment_id":"445025","content":"Correct Answer is No, Yes, No.","timestamp":"1631685300.0","poster":"Xzs29"},{"content":"1. No\n2. Yes (VM not Vnet)\n3. No (add -> No if move -> YES)","comment_id":"422170","upvote_count":"3","timestamp":"1628517300.0","poster":"thuylevn"},{"content":"The answer is NO, NO, YES\n\nTenant Root Group or Root Management Group is the highest level Management Group, if you have a policy denying access to resources at that level, all subscriptions, resource groups, management groups, and resources will be affected. \n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview\n\nYou guys are worrying me :(","timestamp":"1626888420.0","poster":"Acai","comment_id":"411060","comments":[{"timestamp":"1626889260.0","comment_id":"411068","poster":"Acai","upvote_count":"2","content":"Forgot to add Management Group 12 which is above Sub 2 allows only Vnets which are denied by the Root Group so no VM's"}],"upvote_count":"5"},{"timestamp":"1625903160.0","poster":"Teing","comment_id":"403197","upvote_count":"4","content":"Agree. \n1. Management Group is member of root tenant, so couldn't add VNET by policy \n2. By allowing VNET only in policy2, means you couldn't add any other type of resource\n3. You couldn't have 1 subscription under 2 management groups (you can move it, but in this case, the question ask about \"adding\")"},{"content":"From my understanding the first policy will overwrite the second policy. You would need to add an exclusion and not make a policy another policy to allow for subscription 2 to create vnets.","timestamp":"1625333880.0","upvote_count":"1","comments":[{"upvote_count":"1","content":"If you look back at Question 2 though, it doesn't say anything about creating a VNet, it specifies creating a Virtual Machine","comment_id":"429087","timestamp":"1629616560.0","poster":"GuyForget"}],"poster":"fazedenk","comment_id":"397771"},{"comment_id":"394265","upvote_count":"1","content":"The Tenant Root Group is a predefined management group; you can modify but not delete it. By default, any RBAC or Azure Policy you define at this level cascades by inheritance to administrator-defined management groups.\n\nAs you can do with, say, NTFS permissions, you can override inheritance by setting explicit Azure or RBAC policy at the child management group","poster":"Harryboy","timestamp":"1625010060.0"},{"comments":[{"poster":"tita_tovenaar","comment_id":"398592","timestamp":"1625424180.0","upvote_count":"2","content":"Not correct. \n'Adding' as being moving is only for subscriptions that don't have a management group yet. \nFor subscriptions that are already linked to a MG, you actually have to 'Remove' them. \nSee ref: https://docs.microsoft.com/en-us/azure/governance/management-groups/manage\n\nRemove a subscription from a management group in the portal\nLog into the Azure portal.\nSelect All services > Management groups.\nSelect the management group you're planning that is the current parent.\nSelect the ellipse at the end of the row for the subscription in the list you want to move.\nalternative menu for a subscription to select the 'Move' option.\n\nSelect Move.\n\nOn the menu that opens, select the Parent management group."}],"comment_id":"385379","poster":"Delanase","timestamp":"1624095120.0","upvote_count":"9","content":"The correct answer is NO NO YES\nYou can navigate to ManagementGroup11 and then select Add subscription. Subscription 1 is currently a child resource of ManagementGroup21, so by adding Subscription 1 to ManagementGroup11, you are actually moving Subscription 1 between the two management groups."},{"timestamp":"1623329160.0","comment_id":"379023","upvote_count":"4","content":"no no yes 100% sure","poster":"Gautam123"},{"upvote_count":"2","timestamp":"1623228960.0","poster":"Mich132","content":"Wouldn't the policy on the root tenant overrule the policy for management group 12? \"Any assignment of user access or policy assignment on the root management group applies to all resources within the directory.\" So no matter what you do, you cannot create a Vnet (and thus a VM) if you don't remove that rule at the root tenant level. So No, No, don't know for the last one... :-)","comments":[{"upvote_count":"3","timestamp":"1623896520.0","content":"same thinking, since Management 12 is under the tenant azure policy. The last one seems to have some typo error. If it's \"add\" then it's a NO if it's a \"move\" then it's a YES.","comments":[{"content":"or rather they should have used word \"attach\" instead of \"add\"","poster":"Harssh","comment_id":"493296","timestamp":"1638554820.0","upvote_count":"1"}],"comment_id":"383837","poster":"Ambivert"}],"comment_id":"378120"},{"poster":"CARIOCA","content":"This question is very divided in the feedback, after all what would be the answer and which justified it?\n\nAfter a debate of 62 comments, is the final answer to the question the same or not?\n\nMy humble suggestion for the Exam Topics would be to have an official moderator who, depending on the debate on the issues, should be responsible for changing the submitted template.\n\nI think the debate is healthy, but a better organization is needed following an established pattern because in some issues they get very confused and generate more doubts than clarifications.","timestamp":"1621788480.0","upvote_count":"13","comments":[{"timestamp":"1627538280.0","upvote_count":"2","comment_id":"416664","poster":"ShikshaGarg","content":"AGREED!! It gets so confusing. Everybody checks the discussion panel just for confirmation if the given answer is correct or not but we get more confused here. There's no definitive conclusion. I would also suggest the same to ExamTopics to have a moderator who can verify and change the answers in the template."}],"comment_id":"364775"},{"poster":"creator","upvote_count":"10","timestamp":"1618826940.0","comment_id":"338767","content":"I tested it on Portal. the answers are N,Y,Y."},{"content":"I agree that the first two are \"no\", third definitely 'yes', the terminology 'add subscription' is used everywhere in the portal instead of 'move'","poster":"Veronika1989","timestamp":"1618301760.0","upvote_count":"4","comment_id":"334494"},{"comment_id":"333927","content":"I stick onto No,Yes,No if the third sentence has \"add\"\nor else No,Yes,Yes if the third sentence has \"move\"","poster":"vikram12345","timestamp":"1618230180.0","upvote_count":"2"},{"comment_id":"331883","poster":"darko13","upvote_count":"2","comments":[{"timestamp":"1629616740.0","upvote_count":"1","poster":"GuyForget","content":"The ability to create a VNet isn't required to create a VM if an existing VNet is available","comment_id":"429088"}],"timestamp":"1617964620.0","content":"NNY\nDeny on root management trumps allow on child management group for vnet, which is required to create a vm in subscription2.\nAdd subscription to management group is effectively move subscription to management group, so yes."},{"comment_id":"310176","poster":"ms70743","content":"NO, NO, YES","upvote_count":"4","timestamp":"1615688460.0"},{"content":"Moderator please remove my previous answer. I go for\nN\n-N-\nN - can't add but can move","poster":"ZUMY","upvote_count":"3","timestamp":"1615087620.0","comments":[{"comment_id":"328077","upvote_count":"1","content":"We can add using Add subscription option from management group. However it finally moves the subscription and doesn't duplicates it in multiple management groups.","timestamp":"1617551580.0","poster":"J4U"}],"comment_id":"304920"},{"upvote_count":"1","comments":[{"poster":"mg","upvote_count":"3","timestamp":"1615150920.0","comment_id":"305343","comments":[{"upvote_count":"1","poster":"J4U","content":"Add vs Move does the same Move operation at the backend.","comment_id":"328079","timestamp":"1617551640.0"}],"content":"If its \"add\" subscription then answer is NO NO NO.\nif its \"Move\" subscription answer is NO NO YES"}],"poster":"mg","content":"No No Yes","timestamp":"1615052700.0","comment_id":"304766"},{"comment_id":"300084","poster":"ZUMY","content":"NO,NO,YES","upvote_count":"2","timestamp":"1614403740.0"},{"timestamp":"1614302160.0","comment_id":"299472","content":"Answer should be No, No and Yes.\nNot allowed resource types policy blocks deployment of virtual networks in Tenant Root Group\nOnly allowed resource type is virtual Network. Nothing else should work not even VMs. Recreated the scenario in a sub with the MG hierarchy and it did not deploy any other resources. Weird thing is that some validations passed but it still did not deploy the resources. The logic is the same as allowed locations/regions.\nSubscription 1 can be added to ManagementGroup11. Only issue here is syntax issue and it should have been changed to move. But this is a scenario based question, so we should stick to what Subscription1 is","poster":"olayin","upvote_count":"2"},{"comment_id":"298742","upvote_count":"9","poster":"immortalstrong","timestamp":"1614226440.0","content":"This is correct.\n1. This is obviously no.\n2. Yes, VM can be created as long as you have an existing VNET. It's reasonable to assume a VNET already exist. You'll only be prevented to create a VM is you try to create a new VNET while creating the VM. This is not specified so assume a VNET exists.\n3. Yes. I also tried this in lab. \"Add to subscription\" really means move, not add it again. The \"Add to subscription\" is misleading but this is how it is in the lab. It will move the subscription."},{"poster":"mealex","content":"2 - NO\n\n\"In another example, you might want to assign a resource type allow list definition at the management group level. Then you assign a more permissive policy (allowing more resource types) on a child management group or even directly on subscriptions. However, this example wouldn't work because Azure Policy is an explicit deny system. Instead, you need to exclude the child management group or subscription from the management group-level assignment. Then, assign the more permissive definition on the child management group or subscription level. If any assignment results in a resource getting denied, then the only way to allow the resource is to modify the denying assignment.\"","comment_id":"290658","timestamp":"1613359260.0","upvote_count":"2"},{"timestamp":"1613358180.0","content":"2 - Yes\n\n\"At the subscription scope, you can assign a definition that prevents the creation of networking resources. You could exclude a resource group in that subscription that is intended for networking infrastructure. You then grant access to this networking resource group to users that you trust with creating networking resources.\"\n\nhttps://docs.microsoft.com/en-us/azure/governance/policy/overview","poster":"mealex","comment_id":"290647","upvote_count":"1"},{"timestamp":"1613237100.0","upvote_count":"3","content":"Incorrect, it should be:\n- NO: Cannot create Vnet\n-YES: Can create VM (you dont need to create Vnet, just create VM)\n-NO: Cannot ADD, only move to another mgmt group","comment_id":"289668","poster":"toniiv"},{"poster":"oliv_","timestamp":"1612825020.0","comment_id":"286506","content":"no, no, yes.\ntested for the 2nd question, policy only allows virtual network. so you cannot create a VM, a public ip etc ...only VNET.","upvote_count":"2"},{"timestamp":"1612635240.0","content":"The scope of \"Not allowed\" policy on Tenant Root Group applies to both MG11 and MG12. If creating an another \"Allowed\" policy on MG12 to do the opposite of global policy and overrides global policy, then I think it would be a nightmare to manage access policies. So i think the answer to second question is NO. I tested third and it is Yes. So technically the answer should be NO NO Yes.","upvote_count":"1","comment_id":"285014","poster":"Azurite"},{"content":"hello guys I finally check own my own through performed lab\nanswer is \nNO NO YES\nI TESTED MY SELF","comment_id":"282452","upvote_count":"5","timestamp":"1612329900.0","poster":"Ahsankbcs2269"},{"timestamp":"1611045060.0","comments":[{"comment_id":"276059","poster":"QiangQiang","content":"Agreed:\nAllowed Resource Type (Deny): Defines the resource types that you can deploy. Its effect is to deny all resources that aren't part of this defined list.","upvote_count":"1","timestamp":"1611588480.0"}],"poster":"AxelB","upvote_count":"5","content":"- NO\n- NO : Indeed it concerns VM, however an \"allow\" policy prevent you from creating anything else. So you can only create VNET and not VM.\n- NO","comment_id":"271015"},{"upvote_count":"4","comment_id":"268040","poster":"xrpuser","timestamp":"1610726760.0","content":"The answer should be\nNo : Self Explainatory \nYes : VNet is restricted, not VM\nNo : Subscription can only belong to one Management Group at one time"},{"content":"i think this is correct","comment_id":"266315","timestamp":"1610543340.0","poster":"rusll","upvote_count":"1"},{"comment_id":"261310","timestamp":"1609969860.0","content":"Answer is \nNo - Subscription1 is associated with Tenant group policy which denies virtual network creation\nYes - Subscription2 is associated with ManagementGroup12 which has no policy denying VM creation\nNo - Subscription1 cannot be added to ManagementGroup11 since a Subscription can belong to only one Management Group at any time.","poster":"DodgyD","comments":[{"poster":"Bruce_dB","content":"The process of moving a subscription is by using the add functionality:\n\"To move a subscription in CLI, you use the add command\"\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage","timestamp":"1610770680.0","comment_id":"268555","upvote_count":"1"}],"upvote_count":"9"},{"comment_id":"251037","poster":"wooyourdaddy","upvote_count":"1","content":"Box 3: Should be no, based on the 2nd webite posted in the reference:\n\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions\n\nMoving management groups and subscriptions\nOne reason to create a management group is to bundle subscriptions together. Only management groups and subscriptions can be made children of another management group. A subscription that moves to a management group inherits all user access and policies from the parent management group\n\nWhen moving a management group or subscription to be a child of another management group, three rules need to be evaluated as true.\n\nIf you're doing the move action, you need:","timestamp":"1608736560.0"},{"upvote_count":"1","poster":"ms70743","timestamp":"1608535320.0","comment_id":"249125","content":"NO, NO, YES"},{"content":"My opinion:\n\n1. No, I think it's clear enough\n2. Yes, you already have Subscription1, i think you already have a VNET, so you can create a VM\n3. No, Subscription1 is already in MG21, parent group is MG12, you can't ADD to MG11 (you could MOVE to MG11)","upvote_count":"13","timestamp":"1607768160.0","poster":"lodo","comment_id":"241485"},{"comment_id":"239229","timestamp":"1607520540.0","content":"Last Statement is No.\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview\n\"Each management group and subscription can only support one parent.\"","upvote_count":"4","poster":"mhmyz"},{"content":"I go for No NO YES","comment_id":"238397","timestamp":"1607439660.0","comments":[{"timestamp":"1607537700.0","comment_id":"239442","poster":"Matkes","comments":[{"upvote_count":"5","timestamp":"1607859720.0","content":"Yes but maybe there is vnet available. It doesn't have to create.","comment_id":"242516","poster":"hbergun"}],"upvote_count":"1","content":"Agree with you, as we cannot create a VM without a vnet :)"}],"upvote_count":"2","poster":"ipindado2020"},{"upvote_count":"1","content":"If you create a VM you have to associate to VNET? this is my doubt here.","comment_id":"237922","timestamp":"1607406060.0","poster":"Rodro13"},{"upvote_count":"32","poster":"Andersonalm","comment_id":"237537","timestamp":"1607362920.0","content":"Answer is correct. The deny policy is only for virtual networks, not for virtual machines. NO, Yes, Yes","comments":[{"comment_id":"394744","upvote_count":"1","timestamp":"1625058540.0","content":"i agree. for the seconds question you can not create a virtual network but you can create a vm as long as a virtual network already exist .","poster":"raph90fr"},{"content":"Many people have missed this. Very good catch. Answer is correct it is NO, YES, YES.","comments":[{"comment_id":"328218","timestamp":"1617565620.0","content":"but that management group is under the same tenant which has a \"deny\"","upvote_count":"1","poster":"moni1"}],"timestamp":"1607543220.0","poster":"Hibs2016","upvote_count":"4","comment_id":"239490"},{"timestamp":"1607658840.0","upvote_count":"3","content":"You missed something:\n- One says Restricted\n- Another says Allowed\nSo, one restricts VNETs and the other allows VNETs.","comment_id":"240638","poster":"Ikrom"},{"poster":"ArgiDio","content":"The only objection that i have is that, you cannot create an Azure VM without a VNet, so second option is No too.\nFinal answer that i will give in case of exam, N,N,Y","comment_id":"249240","comments":[{"timestamp":"1609789080.0","poster":"Penagache","comment_id":"259668","comments":[{"content":"but this possibility is not informed, so you have to consider the standard creation of the VM with all the minimum resources.","upvote_count":"5","comments":[{"comment_id":"406755","timestamp":"1626322860.0","content":"It doesn't matter because with \"Allow resources\" policy, you actually deny all remaining resources.","upvote_count":"2","poster":"habit"}],"timestamp":"1619734380.0","comment_id":"345730","poster":"uellington"}],"upvote_count":"9","content":"You can. You can use a vnet created by other user."}],"timestamp":"1608548340.0","upvote_count":"11"}]},{"comment_id":"237133","content":"there is explicit deny on root. So answer should be NO, NO, YES","upvote_count":"3","poster":"4thehell","timestamp":"1607331180.0"},{"poster":"pikusy","comment_id":"236564","upvote_count":"4","timestamp":"1607266320.0","content":"NO NO YES"},{"comment_id":"236223","content":"NO NO YES","timestamp":"1607236920.0","poster":"boink","upvote_count":"8"},{"timestamp":"1606744860.0","poster":"asdf12345a","content":"Answer is correct -\nThe scope is set to GUEST users only. So User3 cannot perform an access review of User1 and UserA as they are Members.\nGroup2 is a member of Group1 so the access review is inherited.","comments":[{"upvote_count":"23","poster":"asdf12345a","timestamp":"1606745100.0","comment_id":"231127","content":"Clicked on the wrong discussion box - Moderator please delete this as it was meant to reply to another question, thanks."}],"upvote_count":"1","comment_id":"231123"}],"answer_description":"Box 1: No -\nVirtual networks are not allowed at the root and is inherited. Deny overrides allowed.\n\nBox 2: Yes -\nVirtual Machines can be created on a Management Group provided the user has the required RBAC permissions.\n\nBox 3: Yes -\nSubscriptions can be moved between Management Groups provided the user has the required RBAC permissions.\nReference:\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview https://docs.microsoft.com/en-us/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions","question_images":["https://www.examtopics.com/assets/media/exam-media/04223/0004200001.png","https://www.examtopics.com/assets/media/exam-media/04223/0004200002.png","https://www.examtopics.com/assets/media/exam-media/04223/0004200003.png","https://www.examtopics.com/assets/media/exam-media/04223/0004300001.jpg"],"answer_images":["https://www.examtopics.com/assets/media/exam-media/04223/0004300002.jpg"],"url":"https://www.examtopics.com/discussions/microsoft/view/38107-exam-az-104-topic-2-question-5-discussion/","unix_timestamp":1606744860,"answer":""},{"id":"cYpB24BFxzDZq150VqS2","topic":"2","answer_images":[],"exam_id":44,"url":"https://www.examtopics.com/discussions/microsoft/view/67428-exam-az-104-topic-2-question-50-discussion/","answers_community":["B (91%)","9%"],"question_text":"You have three offices and an Azure subscription that contains an Azure Active Directory (Azure AD) tenant.\nYou need to grant user management permissions to a local administrator in each office.\nWhat should you use?","answer_description":"","choices":{"C":"access packages in Azure AD entitlement management","D":"Azure roles","A":"Azure AD roles","B":"administrative units"},"discussion":[{"timestamp":"1639123320.0","comment_id":"498398","content":"The answer is correct \nAdministrative units restrict permissions in a role to any portion of your organization that you define. You could, for example, use administrative units to delegate the Helpdesk Administrator role to regional support specialists, so they can manage users only in the region that they support.","upvote_count":"53","comments":[{"comment_id":"578357","timestamp":"1648650060.0","content":"Although I agree with your explanation the question is not really stating that administrative units are required as there is no statement about the local office administrators and weather they need to administer all users or should only administer the users of their respective office.","upvote_count":"18","poster":"magichappens"}],"poster":"HananS"},{"upvote_count":"17","poster":"NaoVaz","content":"Selected Answer: B\nB) \"administrative units\"\n\n\"It can be useful to restrict administrative scope by using administrative units in organizations that are made up of independent divisions of any kind.\"- https://docs.microsoft.com/en-us/azure/active-directory/roles/administrative-units#deployment-scenario","comment_id":"668728","timestamp":"1663141260.0"},{"content":"Selected Answer: A\n\"You need to grant user management permissions to a local administrator in each office\"\nWhy are administrative units needed here? Why not simply assign an Entra role to one guy from each office?","timestamp":"1741808640.0","comment_id":"1388054","upvote_count":"1","poster":"Ivanvazovv"},{"poster":"[Removed]","content":"Selected Answer: B\nB is corerct","upvote_count":"1","timestamp":"1725284880.0","comment_id":"1276765"},{"content":"Why some YouTube videos say azure AD roles?","comment_id":"1153326","comments":[{"upvote_count":"3","comment_id":"1182852","timestamp":"1711411560.0","content":"The wording of the question, \"what should you choose,\" is equivalent to \"what is the best answer?\" AD roles would work, but they wouldn't be the best answer, given that the question mentions having local administrators, which could be grouped together for practicality. The youtube video, like me, probably missed that.","poster":"af68218"}],"timestamp":"1708266480.0","upvote_count":"2","poster":"JananiToo"},{"upvote_count":"1","timestamp":"1707990300.0","poster":"Amir1909","comment_id":"1150854","content":"B is correct"},{"content":"Selected Answer: B\nB. Administrative units\n\nAdministrative units in Azure AD allow you to organize and delegate administrative tasks to specific administrative units. You can assign specific permissions and roles to administrators based on these units. This approach allows local administrators to have control over users and resources within their respective offices without having full global permissions. It's a more granular and decentralized approach to user management.\n\nAzure AD roles (Option A) typically deal with assigning permissions at a broader level, and they might not provide the necessary granularity for managing users within specific offices.\n\nAccess packages in Azure AD entitlement management (Option C) are used for granting access to resources and applications rather than delegating user management tasks.\n\nAzure roles (Option D) are primarily focused on managing permissions for Azure resources and services, not user management within Azure AD.\n\nSo, the most suitable choice for delegating user management permissions to local administrators in different offices is \"B. Administrative units.\"","upvote_count":"9","poster":"Rednevi","timestamp":"1695380700.0","comment_id":"1014015"},{"content":"Selected Answer: A\nI think A because, the question does not state that each local administrator should be restricted to only administer the users in their office, so assigning the role 'User Administrator' would be the solution to this question would it not?","comments":[{"upvote_count":"3","timestamp":"1695002640.0","content":"Do not overthink these questions. The phrase \"... Local administrator in each office\" gave the answer away for Administrative Unit.","poster":"urbanmonk","comment_id":"1010178"}],"timestamp":"1693459320.0","comment_id":"994779","upvote_count":"3","poster":"grimrodd"},{"timestamp":"1691391720.0","upvote_count":"1","comment_id":"974461","content":"answer is correct\nhttps://youtu.be/XNqSQOYtcPQ","poster":"kamalpur"},{"upvote_count":"4","timestamp":"1682245500.0","poster":"Chris76","comment_id":"878198","content":"Selected Answer: B\n\"You need to grant user management permissions to a local administrator in each office\"\nvs\n\"You need to grant *LOCAL* user management permissions to a local administrator in each office\"\n\nIMHO the latter is a stronger case for Administrative Units. But the mere fact of mentioning \"Local administrator in each office\", implies an already in place setup of Administrative Units. Location/Division - based admin is use case for Administrative Units."},{"comment_id":"859229","content":"B. Administrative units would be the best option to grant user management permissions to a local administrator in each office.\n\nAdministrative units are a feature in Azure AD that allow you to delegate administrative privileges to specific groups of users or administrators. By creating an administrative unit for each office, you can grant the local administrator in each office the necessary permissions to manage users and groups within their own office, without giving them access to the entire Azure AD tenant.\n\nAzure AD roles and Azure roles are used to grant permissions to perform specific tasks within Azure services, but they are not specifically designed for user management within Azure AD.\n\nAccess packages in Azure AD entitlement management are used to manage access to specific resources and applications within an organization, but they are not specifically designed for delegating administrative privileges.","poster":"lokii9980","timestamp":"1680459120.0","upvote_count":"3"},{"poster":"Mazinger","content":"Selected Answer: B\nTo grant user management permissions to a local administrator in each office, you should use Azure AD administrative units.\nAdministrative units are a feature in Azure AD that allow you to delegate administrative permissions to specific groups of users or administrators. You can create an administrative unit for each office and then assign a local administrator to manage the users and groups within that unit.\nAzure AD roles, Azure roles, and access packages in Azure AD entitlement management are also used to grant permissions to users and groups, but they are not designed specifically for delegating administrative permissions to specific groups of users or administrators based on their location or organizational structure. Therefore, they are not the best option for granting user management permissions to local administrators in each office.\nSo, the correct answer is B. administrative units.","timestamp":"1676573400.0","comments":[{"timestamp":"1676633880.0","upvote_count":"5","comment_id":"811806","content":"True, But the scenario says:\nYou need to grant user management permissions to a local administrator in each office.\nNot....\nYou need to grant 'local'user management permissions to a local administrator in each office.\nThe answer assumes a scope that the question does nt actually specify.","poster":"allyQ","comments":[{"timestamp":"1682244960.0","upvote_count":"2","poster":"Chris76","content":"Finally somebody sane with attention to details","comment_id":"878186"}]}],"comment_id":"811015","upvote_count":"5"},{"comment_id":"790364","poster":"zellck","content":"Selected Answer: B\nB is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/roles/administrative-units\nAn administrative unit is an Azure AD resource that can be a container for other Azure AD resources. An administrative unit can contain only users, groups, or devices.\n\nAdministrative units restrict permissions in a role to any portion of your organization that you define. You could, for example, use administrative units to delegate the Helpdesk Administrator role to regional support specialists, so they can manage users only in the region that they support.","timestamp":"1674888960.0","upvote_count":"3"},{"upvote_count":"1","timestamp":"1674743760.0","comment_id":"788810","poster":"brein33","content":"Administrative units is correct"},{"comment_id":"654373","poster":"EmnCours","upvote_count":"3","timestamp":"1661887920.0","content":"Selected Answer: B\nCorrect Answer: B 🗳️\nReference:\nhttps://docs.microsoft.com/en-us/azure/active-directory/roles/administrative-units"},{"comment_id":"557770","content":"It's very obvious, Administrative Unit is the answer","upvote_count":"2","poster":"Azure_daemon","timestamp":"1646014740.0"},{"poster":"edengoforit","content":"Answer is Administrative unit \n\nIf you go to porta.azure.com -> Azure Active Directory -> Roles and Administrators from the left pane, you will be able to see multiple built in role called 'User Administrator'. If you click that role, you are able to assign, update or delete the user to the role","timestamp":"1645340100.0","comment_id":"551606","upvote_count":"3"},{"comments":[{"upvote_count":"3","poster":"Mozbius_","content":"I think that B is the answer because it is what the question is implying a scenario for which \"Administrative Units\" are specifically tailored for...\n\n\"Deployment scenario\nIt can be useful to restrict administrative scope by using administrative units in organizations that are made up of independent divisions of any kind.\"\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/roles/administrative-units#:~:text=An%20administrative%20unit%20is%20an%20Azure%20AD%20resource,any%20portion%20of%20your%20organization%20that%20you%20define.","timestamp":"1643260140.0","comment_id":"533525"}],"upvote_count":"5","content":"Why is A not correct?\nEven with B(admin unit), you have to assign AAD role to administrators for an admin unit.","comment_id":"509317","poster":"Snownoodles","timestamp":"1640472240.0"},{"upvote_count":"2","timestamp":"1640149620.0","poster":"jaydee7","comment_id":"506714","content":"Earlier OU (Organizational Unit) is not AU (Administrative Unit) :)"},{"content":"I believe Administrative Units in Azure AD, are similar to Organizational Units in Windows AD.\n\nhttps://4sysops.com/archives/an-introduction-to-azure-ad-administrative-units/#:~:text=A%20user%20or%20group%20is,flat%20directory%20and%20lacks%20OUs.&text=Administrative%20units%20are%20containers%20for%20users%20and%20groups%20that,administrative%20rights%20to%20specific%20users.","upvote_count":"2","poster":"maatksle","timestamp":"1639737480.0","comment_id":"503578"},{"poster":"testmobile18","content":"Administrative units restrict permissions in a role to any portion of your organization that you define. You could, for example, use administrative units to delegate the Helpdesk Administrator role to regional support specialists, so they can manage users only in the region that they support.","comment_id":"498358","timestamp":"1639119060.0","upvote_count":"4"},{"upvote_count":"2","comment_id":"498255","timestamp":"1639106220.0","poster":"V4","content":"Correct answer B"},{"content":"I agree with B.\n\nRegarding the link provided, the example fits with the use case : \n\"You could, for example, use administrative units to delegate the Helpdesk Administrator role to regional support specialists, so they can manage users only in the region that they support.\"","poster":"shako","comment_id":"497850","timestamp":"1639064580.0","upvote_count":"1"}],"question_id":117,"timestamp":"2021-12-09 16:43:00","unix_timestamp":1639064580,"answer_ET":"B","answer":"B","question_images":[],"isMC":true},{"id":"GA4eWfdDjdwNsAm7qcEY","answer_images":[],"answer":"A","timestamp":"2021-12-09 16:44:00","isMC":true,"url":"https://www.examtopics.com/discussions/microsoft/view/67429-exam-az-104-topic-2-question-51-discussion/","choices":{"B":"No","A":"Yes"},"discussion":[{"timestamp":"1639129320.0","comment_id":"498493","content":"Answer \"Yes\" is correct. Logic App Contributor role will allow you to create Logic Apps.\n\nSee here: https://docs.microsoft.com/en-us/azure/logic-apps/logic-apps-securing-a-logic-app?tabs=azure-portal\n\n\"Your Azure subscription requires Contributor permissions for the resource group that contains that logic app resource. If you create a logic app resource, you automatically have Contributor access.\"","comments":[{"poster":"youngjanpawel","content":"Logic App Contributor - Lets you manage logic app, but not access to them\nLogic App Operator - Lets you read, enable and disable logic app\nDescription from access control (IAM)","upvote_count":"3","comment_id":"1337529","timestamp":"1736248620.0"},{"comment_id":"1312076","poster":"2d153f5","upvote_count":"2","content":"Contributor is needed.","timestamp":"1731596160.0"},{"upvote_count":"21","content":"ANSWER: B\nContributor and Logic App Contributor are different...from your link\nLogic App Contributor: Lets you manage logic apps, but you can't change access to them.\nLogic App Operator: Lets you read, enable, and disable logic apps, but you can't edit or update them.\nContributor: Grants full access to manage all resources, but does not allow you to assign roles in Azure RBAC, manage assignments in Azure Blueprints, or share image galleries.","comment_id":"566976","poster":"itguy2","timestamp":"1647186540.0","comments":[{"comment_id":"1309118","poster":"sca88","timestamp":"1731165960.0","content":"The question talk about create Logic App. So Logic App Contributor Role it's enought","upvote_count":"4"},{"comment_id":"677337","timestamp":"1663954020.0","poster":"klasbeatz","content":"Microsoft doesn't say it directly on site so I thought the same they almost present as of Contributor and Logic app contributor are different","upvote_count":"1"},{"upvote_count":"2","comment_id":"785575","poster":"MeysamBayani","timestamp":"1674489060.0","content":"in dev resource group you can create a logic app. when you try create logic app in this RG change plane type to consumption ...."}]}],"upvote_count":"67","poster":"MrMacro"},{"content":"Tested today, gave \"Logic App Contributor\" role to a user account. During Logic App creation phase got error under RG selection: \"You cannot perform this action without all the following permissions (Microsoft.Storage/storageAccounts/write, Microsoft.Web/ServerFarms/write, Microsoft.Web/Sites/write\"","comments":[{"upvote_count":"3","comment_id":"1301970","content":"Tested as well, got the same error.","poster":"LuLaCeK","timestamp":"1729674480.0"}],"comment_id":"695259","poster":"Emre_jm","timestamp":"1665819720.0","upvote_count":"18"},{"timestamp":"1741809180.0","upvote_count":"1","poster":"Ivanvazovv","comment_id":"1388061","content":"Selected Answer: A\nLogic App Contributor gives action \"Microsoft.Logic/*\" so creating should be possible."},{"timestamp":"1741440540.0","upvote_count":"1","comment_id":"1366575","content":"Selected Answer: B\nYou need contributor","poster":"BUDSENA"},{"timestamp":"1740092940.0","poster":"digitalcoder","upvote_count":"3","content":"Selected Answer: B\nNo, assigning the Logic App Contributor role to the Developers group does not meet the goal.\n\nThe Logic App Contributor role allows users to manage existing logic app workflows, but it does not provide permissions to create new logic apps. To enable the Developers group to create Azure logic apps in the Dev resource group, you would need to assign a role with broader permissions, such as the Contributor role, which grants full access to manage all resources within the resource group, including creating and managing logic apps","comment_id":"1359510"},{"timestamp":"1738440840.0","upvote_count":"1","content":"Selected Answer: A\nThe Logic App Contributor role allows users to:\n✔ Create, edit, and delete logic apps.\n✔ Manage triggers, workflows, and actions.\n❌ Cannot assign roles or manage security settings (needs Owner or User Access Administrator role for that).","poster":"Jay_D_Lincoln","comment_id":"1350061"},{"timestamp":"1737388860.0","upvote_count":"1","content":"Selected Answer: A\nDepends on the hosting option. Tested in Environment. \nConsumption: YES\nStandard: NO","poster":"Bambi0074","comment_id":"1343725"},{"comment_id":"1332670","content":"Selected Answer: B\nyou need to have contributor role to be able to create a new logic app. with logic app contributor, you can only manage the existing ones","upvote_count":"3","timestamp":"1735340520.0","poster":"dazzle2013"},{"content":"Selected Answer: A\nLogic App Contributor role allow to create Logic App, but not to use it. If you want to allow to use Logic App, you need to assign Logic App Operator role. The question talk about create Logic App, so A should be correct","upvote_count":"1","poster":"sca88","comment_id":"1309117","timestamp":"1731165900.0"},{"upvote_count":"1","timestamp":"1728902580.0","comment_id":"1297468","content":"Selected Answer: A\nLogic App Contributor role: This role grants the necessary permissions to create, manage, and deploy logic apps within a resource group.","poster":"Xpinguser"},{"comment_id":"1297293","timestamp":"1728891060.0","poster":"jamesf","content":"Selected Answer: A\nA correct\nLogic App Contributor & Contributor can create logical apps","upvote_count":"1"},{"content":"Selected Answer: A\nA is correct\n\nLogic App Contributor & Contributor can create logical apps","timestamp":"1725886980.0","poster":"[Removed]","comment_id":"1280890","upvote_count":"1"},{"comment_id":"1264234","content":"Microsoft.Resources/deployments/* Create and manage a deployment ... Means Logic App Contributor can create a logic app","upvote_count":"1","timestamp":"1723394820.0","poster":"asaulu"},{"comments":[{"timestamp":"1722926040.0","comment_id":"1261501","content":"Yeah I applied the Logic App Contributor role at the resource group level for a test user, then attempted to create a logic app. As long as the resource provider Microsoft.Web is registered already (For this question we can assume it is) then you can create logic apps of consumption type. If you want to create other types you need a few other perms (Microsoft.Storage/storageAccounts/write, Microsoft.Web/ServerFarms/write, Microsoft.Web/Sites/write)","upvote_count":"1","poster":"etrop"}],"comment_id":"1260449","poster":"Carmen_Ms","timestamp":"1722721740.0","upvote_count":"4","content":"Tested! The answer is A, you can create logic apps but only of the comsumption type. So the objective is fulfilled. All those who say the B, you have not tested it correctly."},{"poster":"DevopsRock","timestamp":"1722528480.0","upvote_count":"3","comment_id":"1259473","content":"Selected Answer: A\nAnswer is A"},{"upvote_count":"2","comment_id":"1250285","content":"Selected Answer: B\nIn Azure, the Logic App Contributor role does not inherently have the permissions to create new logic apps. The Logic App Contributor role allows users to manage logic apps but not create them. Specifically, this role includes permissions to read, write, and delete logic apps, but it lacks the permission required to create new ones, which is part of the broader Logic App Operator role or higher.\n\nTo create new logic apps, users generally need either the Logic App Operator role or a custom role with the following specific permission: Microsoft.Logic/workflows/write. This permission is necessary to create logic apps and is included in the Logic App Operator role or higher-level roles like Contributor or Owner.","timestamp":"1721296140.0","poster":"a6bd45e"}],"exam_id":44,"topic":"2","answers_community":["A (58%)","B (42%)"],"answer_description":"","answer_ET":"A","question_images":[],"question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou have an Azure Directory (Azure AD) tenant named Adatum and an Azure Subscription named Subscription1. Adatum contains a group named Developers.\nSubscription1 contains a resource group named Dev.\nYou need to provide the Developers group with the ability to create Azure logic apps in the Dev resource group.\nSolution: On Dev, you assign the Logic App Contributor role to the Developers group.\nDoes this meet the goal?","question_id":118,"unix_timestamp":1639064640},{"id":"8ir6oEs3C96oi8i9wzs5","url":"https://www.examtopics.com/discussions/microsoft/view/73882-exam-az-104-topic-2-question-52-discussion/","discussion":[{"upvote_count":"102","poster":"NaoVaz","comment_id":"668732","timestamp":"1663141620.0","content":"1) User1 can \"assign access to other users for\" LB1.\n2) User1 can \"delete a virtual machine from\" the resource group.\n\nThe Role assignments say it all."},{"comments":[{"content":"A lot of questions came out of here? Would they arrive to approve?","upvote_count":"1","comment_id":"963645","timestamp":"1690370340.0","poster":"rteinformatica"}],"comment_id":"959504","poster":"Rogit","content":"Was in test yesterday","timestamp":"1690029960.0","upvote_count":"12"},{"content":"answer is absolutely correct","comment_id":"1276943","upvote_count":"1","poster":"behradcld","timestamp":"1725298620.0"},{"content":"correct","upvote_count":"3","poster":"[Removed]","comment_id":"1276787","timestamp":"1725286140.0"},{"timestamp":"1710972660.0","poster":"tashakori","upvote_count":"1","content":"Given answer is right","comment_id":"1178781"},{"content":"Correct","upvote_count":"1","timestamp":"1707990660.0","comment_id":"1150860","poster":"Amir1909"},{"content":"1) User1 can \"assign access to other users for\" LB1.\n2) User1 can \"delete a virtual machine from\" the resource group.\n\nThe Role assignments say it all.","upvote_count":"1","comment_id":"1114249","timestamp":"1704427860.0","poster":"SkyZeroZx"},{"content":"i wish all questions were as simple as this","comment_id":"1014765","timestamp":"1695458700.0","upvote_count":"5","poster":"nmnm22"},{"upvote_count":"8","comment_id":"790242","poster":"zellck","content":"1. assign access to other users\n2. delete a VM\n\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#user-access-administrator\nLets you manage user access to Azure resources.\n\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#virtual-machine-contributor\nCreate and manage virtual machines, manage disks, install and run software, reset password of the root user of the virtual machine using VM extensions, and manage local user accounts using VM extensions. This role does not grant you management access to the virtual network or storage account the virtual machines are connected to. This role does not allow you to assign roles in Azure RBAC.","timestamp":"1674877560.0"},{"comment_id":"700668","timestamp":"1666341360.0","content":"Its Correct","poster":"LiamAzure","upvote_count":"5"},{"poster":"ECNS","comment_id":"682957","content":"Answer is CORRECT","upvote_count":"5","timestamp":"1664475480.0"},{"poster":"EmnCours","timestamp":"1661910900.0","comment_id":"654606","content":"Answer is CORRECT","upvote_count":"4"},{"poster":"vetrivelm","upvote_count":"1","comment_id":"590869","timestamp":"1650773400.0","content":"Both Answer is correct.\nContributer-Grants full access to manage all resources, but does not allow you to assign roles in Azure RBAC, manage assignments in Azure Blueprints, or share image galleries."},{"upvote_count":"2","poster":"arodman","timestamp":"1650726600.0","comment_id":"590690","content":"Correct"},{"timestamp":"1650645660.0","upvote_count":"1","comment_id":"590123","content":"Correct Answer","poster":"Pasmo"},{"content":"Answer is correct","poster":"AzureDev777","upvote_count":"1","comment_id":"590068","timestamp":"1650639540.0"},{"upvote_count":"1","timestamp":"1650545700.0","content":"Answer provided is correct.","poster":"epomatti","comment_id":"589391"},{"timestamp":"1650451920.0","content":"Answer is CORRECT\n\nUser Access Administrator can only assign access to other users\nhttps://docs.microsoft.com/en-us/azure/role-based-access-control/rbac-and-directory-admin-roles\n\nVirtual Machine Contributor can Manage VMs, which includes deleting VMs too. \nhttps://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#virtual-machine-contributor\nhttps://docs.microsoft.com/en-us/answers/questions/350635/can-virtual-machine-contributor-create-vm.html","poster":"kennynelcon","upvote_count":"4","comment_id":"588569"}],"answer":"","answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#virtual-machine-contributor https://docs.microsoft.com/en-us/azure/role-based-access-control/rbac-and-directory-admin-roles","answer_ET":"","timestamp":"2022-04-20 12:52:00","unix_timestamp":1650451920,"answers_community":[],"isMC":false,"topic":"2","question_text":"HOTSPOT -\nYou have an Azure Load Balancer named LB1.\nYou assign a user named User1 the roles shown in the following exhibit.\n//IMG//\n\nUse the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","question_images":["https://www.examtopics.com/assets/media/exam-media/04223/0010800001.jpg","https://www.examtopics.com/assets/media/exam-media/04223/0010900001.jpg"],"question_id":119,"exam_id":44,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04223/0010900002.jpg"]},{"id":"cmr77MV41Kbxk0tiNThu","answers_community":["B (97%)","3%"],"choices":{"B":"Assign User1 the Owner role for VNet1.","D":"Assign User1 the Network Contributor role for VNet1.","C":"Assign User1 the Contributor role for VNet1.","A":"Remove User1 from the Security Reader role for Subscription1. Assign User1 the Contributor role for RG1."},"answer_ET":"B","unix_timestamp":1650546060,"exam_id":44,"question_images":[],"topic":"2","discussion":[{"poster":"MentalG","upvote_count":"59","content":"B. Owner correct\n\nOwner = Grants full access to manage all resources, including the ability to assign roles in Azure RBAC.\nContributor = Grants full access to manage all resources, but does NOT allow you to assign roles in Azure RBAC. (you cannot add users or changes their rights)\nUser Access Administrator = Lets you manage user access to Azure resources.\nReader = View all resources, but does not allow you to make any changes.\nSecurity Admin = View and update permissions for Security Center. Same permissions as the Security Reader role and can also update the security policy and dismiss alerts and recommendations.\nNetwork Contributor = Lets you manage networks, but not access to them. (so you can add VNET, subnet, etc)","timestamp":"1650714360.0","comment_id":"590589"},{"content":"Selected Answer: B\nB) \"Assign User1 the Owner role for VNet1.\"\n\nFrom the provided options, only the Owner role scoped at the resource level gives the ability to assign other roles to other users.","timestamp":"1663141740.0","poster":"NaoVaz","upvote_count":"6","comment_id":"668734"},{"comment_id":"1317830","content":"Selected Answer: B\nAnything with 'Contributor' in the role cannot do anything with users.","poster":"b411470","timestamp":"1732579200.0","upvote_count":"2"},{"content":"Selected Answer: B\nB is corerct","poster":"[Removed]","upvote_count":"1","comment_id":"1276793","timestamp":"1725286380.0"},{"content":"https://learn.microsoft.com/en-us/entra/identity/users/licensing-group-advanced#limitations-and-known-issues \nThe feature can only be used with security groups, and Microsoft 365 groups that have securityEnabled=TRUE.","comment_id":"1211348","timestamp":"1715685600.0","upvote_count":"1","poster":"Jedi_sg2000"},{"poster":"3c5adce","timestamp":"1715170980.0","upvote_count":"1","comment_id":"1208370","content":"D. Assign User1 the Network Contributor role for VNet1.\n\nExplanation:\n\nAssigning User1 the Network Contributor role for VNet1 would enable them to assign the Reader role for VNet1 to other users. The Network Contributor role grants permissions to manage network resources, including the ability to assign roles within the scope of the virtual network (VNet1). This role aligns with the requirement to allow User1 to assign the Reader role for VNet1 to other users."},{"content":"This is what ChatGPT says:\n\nTo ensure that User1 can assign the Reader role for VNet1 to other users, you should assign User1 the \"Network Contributor\" role for VNet1. This role grants the necessary permissions to manage all aspects of virtual networks, including assigning roles to other users.\n\nSo, the correct action is:\n\nD. Assign User1 the Network Contributor role for VNet1.","upvote_count":"2","timestamp":"1710429060.0","comment_id":"1173508","comments":[{"content":"This is why we should not blindly trust AI as reference.\n--- Only owners or User Access Administrators can assign roles to other users. ---","upvote_count":"1","comment_id":"1350064","poster":"Jay_D_Lincoln","timestamp":"1738441440.0"}],"poster":"kijoksip"},{"timestamp":"1695554760.0","poster":"Rednevi","comment_id":"1015708","upvote_count":"4","content":"Selected Answer: B\nthe Contributor role in Azure does not have the permission to assign roles to other users or manage access control for other users. The Contributor role can perform actions such as creating, modifying, and deleting resources within the scope of a resource group or subscription, but it cannot manage access control.\n\nTo grant the ability to assign roles and manage access control for Azure resources, you would typically need to assign the User Access Administrator or Owner roles to a user or group. These roles have the necessary permissions to manage access control, including the assignment of roles to other users."},{"poster":"Codelawdepp","content":"Selected Answer: B\nThis question comes up so often and is easy to answer: Only owners or User Access Administrators can assign roles to other users","comment_id":"982261","upvote_count":"5","timestamp":"1692168000.0"},{"upvote_count":"1","comment_id":"966014","content":"Selected Answer: B\n\"Grants full access to manage all resources, including the ability to assign roles in Azure RBAC.\"\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#owner","poster":"Mehedi007","timestamp":"1690599660.0"},{"poster":"[Removed]","content":"within provided solution , the Owner role can assign role for other users\nB. Owner is answer","comment_id":"938412","timestamp":"1688060460.0","upvote_count":"1"},{"content":"C. Assign User1 the Contributor role for VNet1.\n\nTo ensure that User1 can assign the Reader role for VNet1 to other users, you should assign User1 the Contributor role for VNet1.\n\nThe Contributor role grants permissions to manage all resources within a specific scope, including the ability to assign roles to other users. By assigning User1 the Contributor role for VNet1, User1 will have the necessary permissions to assign the Reader role for VNet1 to other users.\n\nAssigning User1 the Owner role for VNet1 (option B) would grant excessive permissions, allowing User1 to make any changes to VNet1 and its resources, which may not be desired.","upvote_count":"1","timestamp":"1685777520.0","comment_id":"913380","poster":"Athul07"},{"poster":"myarali","comment_id":"803996","timestamp":"1676007000.0","content":"Selected Answer: B\nB. Owner correct\n\nOwner: Grants full access to manage all resources, including the ability to assign roles in Azure RBAC.\nUser Access Administrator: Lets you manage user access to Azure resources.\n\nConributor: Grants full access to manage all resources, but does not allow you to assign roles in Azure RBAC, manage assignments in Azure Blueprints, or share image galleries.\nReader: View all resources, but does not allow you to make any changes.\nNetwork Contributor: Lets you manage networks, but not access to them.","upvote_count":"2"},{"upvote_count":"3","content":"Selected Answer: B\nB is the answer.","poster":"zellck","timestamp":"1674526380.0","comment_id":"786067"},{"timestamp":"1661910960.0","poster":"EmnCours","comment_id":"654609","content":"Selected Answer: B\nCorrect Answer: B","upvote_count":"2"},{"comment_id":"590870","content":"Answer B is correct. Owner Has full access to all resources including the right to delegate access to others.","poster":"vetrivelm","timestamp":"1650773940.0","upvote_count":"2"},{"poster":"sjb666","upvote_count":"1","timestamp":"1650715920.0","comment_id":"590598","content":"Selected Answer: B\nAnswer is B. Contributor can't grant access to others"},{"content":"Selected Answer: B\nAnswer is correct","poster":"Pasmo","timestamp":"1650685860.0","upvote_count":"1","comment_id":"590384"},{"comment_id":"590070","upvote_count":"3","timestamp":"1650639600.0","poster":"AzureDev777","content":"Selected Answer: B\nAnswer is correct"},{"comment_id":"589805","comments":[{"timestamp":"1650735600.0","upvote_count":"7","content":"You are Wrong;\n\nContributor: \nCreate and manage all of types of Azure resources\nCreate a new tenant in Azure Active Directory\nCannot grant access to others","comment_id":"590733","poster":"Mtijnz0r"}],"timestamp":"1650613080.0","upvote_count":"1","poster":"JayR12345424","content":"Selected Answer: C\nWrong C is right"},{"comment_id":"589398","poster":"epomatti","timestamp":"1650546060.0","upvote_count":"2","content":"Selected Answer: B\nAnswer provided \"B\" is correct.\n\nRoles from A, C, D cannot give others users permissions to resources.\n\nA better option instead of \"Owner\" would be \"User Access Administrator\", but in the case of this question \"Owner\" is the only correct possible answer."}],"question_text":"You have an Azure subscription named Subscription1 that contains a virtual network named VNet1. VNet1 is in a resource group named RG1.\nSubscription1 has a user named User1. User1 has the following roles:\n✑ Reader\n✑ Security Admin\n✑ Security Reader\nYou need to ensure that User1 can assign the Reader role for VNet1 to other users.\nWhat should you do?","timestamp":"2022-04-21 15:01:00","isMC":true,"url":"https://www.examtopics.com/discussions/microsoft/view/74021-exam-az-104-topic-2-question-53-discussion/","question_id":120,"answer":"B","answer_description":"","answer_images":[]}],"exam":{"numberOfQuestions":606,"lastUpdated":"12 Apr 2025","name":"AZ-104","isImplemented":true,"id":44,"isMCOnly":false,"isBeta":false,"provider":"Microsoft"},"currentPage":24},"__N_SSP":true}