{"pageProps":{"questions":[{"id":"wOjJAFNL6fXYgrH8ogvq","question_id":81,"question_text":"You have an Azure Active Directory Domain Services (Azure AD DS) managed domain named contoso.com.\nYou create an Azure Virtual Desktop host pool named Pool1. You assign the Virtual Machine Contributor role for the Azure subscription to a user named Admin1.\nYou need to ensure that Admin1 can add session hosts to Pool1. The solution must use the principle of least privilege.\nWhich two actions should you perform? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point.","discussion":[{"comment_id":"639702","upvote_count":"17","poster":"Krazzy46","comments":[{"timestamp":"1659279300.0","poster":"KaiUno","upvote_count":"5","comments":[{"content":"bro it literally says the user has that role in the 3rd sentence of the question: \"You assign the Virtual Machine Contributor role for the Azure subscription to a user named Admin1.\"","comment_id":"657192","timestamp":"1662107640.0","upvote_count":"21","poster":"afbnfz"}],"content":"\"users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role\"\n\nNowhere does it say the user also has that role...","comment_id":"640149"},{"content":"If the registration token is valid (generated and not expired). A and E is correct.","upvote_count":"1","comment_id":"1074906","timestamp":"1700424420.0","poster":"Jordan_exams"}],"content":"Selected Answer: BE\nAnswer is correct it's B and E if you read the microsoft document properly you will get to know.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/rbac","timestamp":"1659187920.0"},{"content":"Selected Answer: AE\nCorrect A and E since - Desktop Virtualization Session Host Operator: This role lets you view and remove session hosts, and change drain mode. You CAN'T ADD session hosts using the Azure portal because you don't have write permission for host pool objects.","upvote_count":"15","poster":"rfelipe","timestamp":"1654692900.0","comment_id":"613266","comments":[{"poster":"OllyThompson","content":"You can if you have the Virtual Machine Contributor role, which this question states they do, so i'd go with B and E","timestamp":"1700239080.0","upvote_count":"2","comment_id":"1073479"}]},{"poster":"belyo","content":"Selected Answer: AE\nmust have the following RBAC:\nDesktop Virtualization Host Pool Contributor -> to generate reg key\nVirtual Machine Contributor -> to add session hosts [already had]\ndefinitely A & E\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/add-session-hosts-host-pool?tabs=portal%2Cgui&pivots=host-pool-standard#prerequisites:~:text=The%20Azure%20account,Expand%20table","timestamp":"1737453240.0","comment_id":"1344089","upvote_count":"2"},{"content":"Selected Answer: AE\nAnswer is A & E.","poster":"sbwdek88","comment_id":"1311182","timestamp":"1731488640.0","upvote_count":"1"},{"comment_id":"1310813","timestamp":"1731435780.0","upvote_count":"1","content":"Selected Answer: BE\nThe Desktop Virtualization Session Host Operator role allows viewing and removing session hosts, and changing drain mode. This role can't add session hosts using the Azure portal because it doesn't have write permission for host pool objects. For adding session hosts outside of the Azure portal, if the registration token is valid (generated and not expired), this role can add session hosts to the host pool \"if the Virtual Machine Contributor role is also assigned.\" (which it states in the question)","poster":"e0a5fc3"},{"poster":"jeff1988","comment_id":"1307801","content":"Selected Answer: AE\nOption B, Assign Admin1 the Desktop Virtualization Session Host Operator role for Pool1, is not necessary in this case because this role primarily allows a user to manage session hosts, including starting, stopping, and restarting them. However, it does not grant the permissions needed to add new session hosts to the pool.\n\nThe Desktop Virtualization Host Pool Contributor role (Option A) specifically includes the ability to manage the host pool, which encompasses adding session hosts. Therefore, combining this role with the registration token (Option E) ensures Admin1 has the precise permissions required to add session hosts without granting additional, unnecessary privileges.","timestamp":"1730893380.0","upvote_count":"1"},{"content":"Selected Answer: AE\nDesktop Virtualization Session Host Operator role:\n\nThis role can't add session hosts using the Azure portal because it doesn't have write permission for host pool objects. For adding session hosts outside of the Azure portal, if the registration token is valid (generated and not expired), this role can add session hosts to the host pool if the Virtual Machine Contributor role is also assigned.\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator\n\nThe answer must be A & E","upvote_count":"1","poster":"RabbitB","timestamp":"1728321960.0","comment_id":"1294411"},{"upvote_count":"2","content":"A & E\nNot B because, The Desktop Virtualization User Session Operator role allows sending messages, disconnecting sessions, and using the logoff function to sign users out of a session host. However, this role doesn't allow host pool or session host management like removing a session host, changing drain mode, and so on.","comment_id":"1228907","timestamp":"1718182020.0","poster":"pissbang"},{"poster":"[Removed]","timestamp":"1714578300.0","content":"Selected Answer: AE\nI'll go for A&E because the user has already the \"Virtual Machine Contributor\" role and as the MS doc clearly states that:\n\n\"The Desktop Virtualization Session Host Operator role allows viewing and removing session hosts, and changing drain mode. This role can't add session hosts using the Azure portal because it doesn't have write permission for host pool objects. \n\nFor adding session hosts outside of the Azure portal, if the registration token is valid (generated and not expired), this role can add session hosts to the host pool if the Virtual Machine Contributor role is also assigned\"\n\nAlso the question demands that the solution must use the principle of least privilege.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator","upvote_count":"1","comment_id":"1205156"},{"poster":"kapankaj","comment_id":"1194565","content":"Selected Answer: BE\nAnswer BE is correct. Microsoft article clearly states that:\nThe Desktop Virtualization Session Host Operator role allows viewing and removing session hosts, and changing drain mode\nSo it mandatory to have operator role assigned.","upvote_count":"1","timestamp":"1712960220.0"},{"comment_id":"1119612","timestamp":"1704969480.0","poster":"ESAJRR","content":"Selected Answer: BE\nB. Assign Admin1 the Desktop Virtualization Session Host Operator role for Pool1\nE. Generate a registration token","upvote_count":"1"},{"timestamp":"1696606140.0","upvote_count":"2","content":"Selected Answer: BE\n\"You assign the Virtual Machine Contributor role for the Azure subscription to a user named Admin1.\nYou need to ensure that Admin1 can add session hosts to Pool1. The solution must use the principle of least privilege.\" - To follow this principle B+E are the correct ones. Check the link I've put below and you will come to the same conclusion.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator:~:text=If%20the%20registration%20token%20is%20valid%20(generated%20and%20not%20expired)%2C%20users%20assigned%20this%20role%20can%20add%20session%20hosts%20to%20the%20host%20pool%20outside%20of%20the%20Azure%20portal%20if%20they%20also%20have%20the%20Virtual%20Machine%20Contributor%20role.","poster":"RDIO","comment_id":"1026766"},{"content":"Selected Answer: AE\nE. Generate a registration token. is required.\nand to generate a registration token, A. Desktop Virtualization Session Host Operator is required role.\n(Microsoft.DesktopVirtualization/hostpools/retrieveRegistrationToken/action is the required action and B. Desktop Virtualization Session Host Operator dont have this action)\n\nhttps://learn.microsoft.com/azure/virtual-desktop/rbac#desktop-virtualization-host-pool-contributor\nhttps://learn.microsoft.com/azure/role-based-access-control/resource-provider-operations#microsoftdesktopvirtualization\n\nhttps://learn.microsoft.com/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator","upvote_count":"2","poster":"katayama","comment_id":"1009982","timestamp":"1694971860.0"},{"poster":"[Removed]","comment_id":"986797","timestamp":"1692639600.0","content":"Selected Answer: BE\nAnswer B and E meets the requirement of Least Privilege. Very tricky question!\n\nQuestion states that you have assigned the \"Virtual Machine Contributor\" role for the subscription to Admin1. So with a valid token and \"Desktop Virtualization Session Host operator\" role Admin1 can add session hosts outside of the Azure Portal. (PowerShell or CLI)\n\n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/rbac\n\nDesktop Virtualization Session Host Operator\nThe Desktop Virtualization Session Host Operator role allows users to view and remove session hosts, as well as change drain mode. Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects. ****If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal**** if they also have the ****Virtual Machine Contributor role****.","upvote_count":"6"},{"poster":"Toschu","comment_id":"950139","timestamp":"1689190260.0","upvote_count":"2","content":"Selected Answer: BE\nA. Assign Admin1 the \"Desktop Virtualization Host Pool Contributor\" role for Pool1.\nThis role provides permissions to create and manage host pools and session hosts in Azure Virtual Desktop.\n\nE. Generate a registration token.\nThe registration token is required for adding session hosts to a host pool in Azure Virtual Desktop. The Admin1 can use this token to register new session hosts to Pool1.\n\nOption B would allow for management of individual session hosts, but not for adding new hosts to the pool. Option C is not required for managing Azure Virtual Desktop, as it pertains to Azure AD DS administration. Option D involves assigning a license which is not directly related to the task of adding session hosts to an Azure Virtual Desktop host pool."},{"timestamp":"1687452660.0","comment_id":"930802","poster":"poullb","content":"Selected Answer: BE\nBE - Resposta Correta.\n\nDesktop Virtualization Session Host Operator → \"If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role\"\n\nhttps://learn.microsoft.com/pt-br/azure/virtual-desktop/rbac","upvote_count":"2"},{"content":"Selected Answer: BE\nVirtual Machine Contributor role + Desktop Virtualization Session Host Operator will do.","upvote_count":"2","comment_id":"912097","timestamp":"1685622840.0","poster":"Leocan"},{"comment_id":"909768","poster":"jr_luciano","upvote_count":"3","content":"Selected Answer: BE\nSince the user already has the Virtual Machine Contributor role, the correct answers are B and E.","timestamp":"1685400840.0"},{"comment_id":"888186","timestamp":"1683092340.0","content":"Selected Answer: AE\nThe correct actions to perform to ensure that Admin1 can add session hosts to Pool1 using the principle of least privilege are A and E.\n\nA. Assign Admin1 the Desktop Virtualization Host Pool Contributor role for Pool1: This role allows Admin1 to manage the entire lifecycle of host pools, including creating, updating, and deleting host pools. It also enables the user to add, update, and remove session hosts from the pool.\n\nE. Generate a registration token: A registration token is required to register a new session host with a host pool. By generating the token, Admin1 can provide it to the new session host, which will enable it to register with the host pool.\n\nChatGPT","upvote_count":"1","poster":"Nvoisn","comments":[{"timestamp":"1683092340.0","comment_id":"888187","comments":[{"upvote_count":"1","poster":"CloudDummyDude","content":"Like Nvoism has descriptied Session Host Operator cannot add new session host to host pool. But That is requirement so A is right one\nvalid registration token is needed but also joining to Entra Id domain services. So by the roles perspective A and C are valid options. Note that solution must use the principle of least privilege so I would select only roles","timestamp":"1709997180.0","comment_id":"1169586"}],"poster":"Nvoisn","upvote_count":"1","content":"B. Assign Admin1 the Desktop Virtualization Session Host Operator role for Pool1: This role allows the user to manage the session hosts in the host pool, including starting and stopping the hosts and accessing the remote desktop session of a host. However, it does not allow the user to add new session hosts to the host pool.\n\nC. Add Admin1 to the AAD DC Administrators group: This group has full administrative access to the Azure AD DS managed domain, including the ability to manage users, groups, and domain controllers. This level of access is not necessary for the specific task of adding session hosts to a host pool.\n\nD. Assign a Microsoft 365 Enterprise E3 license to Admin1: A Microsoft 365 license is not required for the specific task of adding session hosts to a host pool."}]},{"poster":"kshum","upvote_count":"2","comment_id":"854601","content":"Selected Answer: BE\ncorrect answer is BE","timestamp":"1680104580.0"},{"poster":"jcxxxxx2020","content":"Passed the exam last Jan 28 2023 and this question is included.\nProvided answer is correct.","timestamp":"1675085340.0","comment_id":"792852","upvote_count":"3"},{"timestamp":"1674770460.0","comment_id":"789134","upvote_count":"2","poster":"ZokiZokic2023","content":"Selected Answer: BE\nOnly correct answer is: B and E. https://learn.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator . Read this part: Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects. If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.\nSo, adding session hosts is possible."},{"timestamp":"1674469080.0","poster":"Mahaendhiran","content":"Answer A & C\n\n 1. A - Admin1 can generate registration token himself and add session hosts directy using the portal if he is 'Desktop Virtualization Host Pool Contributor' no dependency on others.\n 2. C - Session hosts should be domain joined to Azure ADDS so Admin1 need to be member of 'AAD DC Administrators' group.","comment_id":"785211","upvote_count":"4"},{"content":"Selected Answer: BE\nBE, https://docs.microsoft.com/en-us/azure/virtual-desktop/rbac \n\"If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.\"","poster":"HereToLearnNinjitsu","timestamp":"1673160600.0","comment_id":"769131","upvote_count":"2"},{"content":"Correct answer is \"B. Desktop Virtualization Session Host Operator\"\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator","poster":"AGMAN","timestamp":"1671135000.0","comment_id":"746476","upvote_count":"1"},{"content":"Selected Answer: BE\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rbac","upvote_count":"2","timestamp":"1670580360.0","comment_id":"739978","poster":"MJFT"},{"timestamp":"1667118060.0","comment_id":"707699","upvote_count":"2","poster":"Magis","content":"Selected Answer: BE\nI agree with BE. All comments below are valid and this method using a principle of Least priviledges"},{"content":"b e is correct","timestamp":"1662827700.0","upvote_count":"2","poster":"max_n","comment_id":"665532"},{"timestamp":"1662107520.0","upvote_count":"5","comment_id":"657184","poster":"afbnfz","content":"Selected Answer: BE\nGiven answer is correct. Session Host Operator (B) doesn't seem correct at first glance, but you're generating a registration token too (E).\n\nPer the link: \"If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.\" \n\nWhich they do."},{"upvote_count":"4","content":"It could be B & E bwcause...\n\nRead below...\nThe Desktop Virtualization Session Host Operator role allows users to view and remove session hosts, as well as change drain mode. Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects. If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.","poster":"kamranahmedar","timestamp":"1655632080.0","comment_id":"618616"},{"timestamp":"1653218940.0","comment_id":"605401","upvote_count":"3","content":"Selected Answer: AE\nCorrect: A,E","poster":"lfbustamante"},{"comments":[{"upvote_count":"1","poster":"constructedrobot","timestamp":"1652784900.0","comments":[{"comment_id":"624562","upvote_count":"2","poster":"KFM2020","timestamp":"1656499260.0","comments":[{"upvote_count":"1","comment_id":"707695","timestamp":"1667117940.0","content":"And this is why BE correct :)\n\nWhen we are talking about permissions it doesn't matter which method allows you to do this. If you have ability to do this in any way it means you have permissions :)","poster":"Magis"}],"content":"Yea, that's fair, I see your point. I guess the question doesn't really say _how_ the user will add a session host into the pool as there are two(?) methods.\n\nOne is \"add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.\" The user has this role assigned and also has the less-privileged Session Host operator role, so are we to infer that this is the method they'll use to add a session host?\n\nAnd the other is simply adding a session host through the host pool UI which they cannot do if they're given just Session Host Operator role."}],"content":"If the registration token is valid (generated and not expired), users assigned this role \"Session Host Operator\" can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.","comment_id":"602887"}],"content":"Selected Answer: AE\nI think it's AE.\n\nIn addition to assigning this role \"you'll also need the Virtual Machine Contributor role to create virtual machines\" (From https://docs.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-host-pool-contributor)\n\nYou will also need to generate a registration token to add additional session hosts into the host pool.\n\nI don't think it's B because according to https://docs.microsoft.com/en-us/azure/virtual-desktop/rbac#desktop-virtualization-session-host-operator it says \"Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects.\"","timestamp":"1651802640.0","comment_id":"597509","poster":"KFM2020","upvote_count":"4"},{"comment_id":"594756","upvote_count":"4","comments":[{"upvote_count":"2","comment_id":"608820","timestamp":"1653838800.0","comments":[{"upvote_count":"2","timestamp":"1657047120.0","comment_id":"627574","poster":"LeGluten","content":"It is B-E, The Desktop Virtualization Session Host Operator can add Host to a pool if it has a valid registration token.\nFrom : https://docs.microsoft.com/en-us/azure/virtual-desktop/rbac\n\"Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects. If the registration token is valid (generated and not expired), users assigned this role can add session hosts to the host pool outside of the Azure portal if they also have the Virtual Machine Contributor role.\""}],"poster":"AnonymousJhb","content":"it's not B.\nThe Desktop Virtualization Session Host Operator role allows users to view and remove session hosts, as well as change drain mode. Users can't add session hosts using the Azure portal because they don't have write permission for host pool objects."}],"timestamp":"1651279800.0","poster":"datts","content":"Given answer looks correct: BE"}],"answer_images":[],"unix_timestamp":1651279800,"exam_id":46,"topic":"3","answers_community":["BE (63%)","AE (37%)"],"answer":"BE","url":"https://www.examtopics.com/discussions/microsoft/view/74938-exam-az-140-topic-3-question-11-discussion/","answer_description":"","isMC":true,"choices":{"C":"Add Admin1 to the AAD DC Administrators group","A":"Assign Admin1 the Desktop Virtualization Host Pool Contributor role for Pool1","D":"Assign a Microsoft 365 Enterprise E3 license to Admin1","E":"Generate a registration token","B":"Assign Admin1 the Desktop Virtualization Session Host Operator role for Pool1"},"timestamp":"2022-04-30 02:50:00","answer_ET":"BE","question_images":[]},{"id":"PRrYvlK8ANcfIjBdeMiM","url":"https://www.examtopics.com/discussions/microsoft/view/74404-exam-az-140-topic-3-question-12-discussion/","unix_timestamp":1650849780,"answer_images":[],"answer_description":"","topic":"3","discussion":[{"timestamp":"1722338940.0","upvote_count":"3","poster":"jcxxxxx2020","content":"Passed the exam last Jan 28 2023 and this question is included.\nProvided answer is correct.","comment_id":"792853"},{"content":"Selected Answer: B\nCorrect. You need to use GPO for it.","comment_id":"707700","poster":"Magis","upvote_count":"1","timestamp":"1714458180.0"},{"poster":"[Removed]","content":"The settings of RDP session timeouts are located in the following GPO section Computer Configuration -> Policies -> Administrative Templates -> Windows Components -> Remote Desktop Services -> Remote Desktop Session Host -> Session Time Limits. \nalthough you could do it in the past from the RDS collection settings","comment_id":"612110","timestamp":"1701834540.0","upvote_count":"1"},{"content":"Provided answer is correct. \nB","timestamp":"1698196980.0","upvote_count":"1","poster":"datts","comment_id":"591329"}],"question_images":[],"answer_ET":"B","answers_community":["B (100%)"],"isMC":true,"question_id":82,"exam_id":46,"answer":"B","question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou have an Azure Virtual Desktop host pool named Pool1 that is integrated with an Azure Active Directory Domain Services (Azure AD DS) managed domain.\nYou need to configure idle session timeout settings for users that connect to the session hosts in Pool1.\nSolution: From the Azure portal, you modify the Advanced settings in the RDP Properties of Pool1.\nDoes this meet the goal?","choices":{"B":"No","A":"Yes"},"timestamp":"2022-04-25 03:23:00"},{"id":"HYRm8VOItMCIWeNSnpQU","url":"https://www.examtopics.com/discussions/microsoft/view/78723-exam-az-140-topic-3-question-13-discussion/","unix_timestamp":1661955540,"answer_images":[],"answer_description":"","topic":"3","discussion":[{"upvote_count":"1","content":"Selected Answer: A\nA. a role assignment for the host pool","timestamp":"1720658160.0","poster":"ESAJRR","comment_id":"1119276"},{"comment_id":"986827","poster":"[Removed]","timestamp":"1708546740.0","content":"Selected Answer: C\nBest Answer is C\n\nNOT A - The Required Role \"Virtual Machine Administrator Login\" is not available for assignment to Host Pools - It would need to be applied to the Resource Group or Individual VMs\n\nNot B - \"Virtual Machine Administrator Login\" Role Assignment for the individual VMs would accomplish the desired outcome, but would require undue administrative effort\n\nC - Correct answer, Accomplishes the goal with least administrative effort\n\nNot D - No device setting in Azure AD exists for this configuration","upvote_count":"4"},{"content":"Selected Answer: C\nThe virtual machines will be joined to the on-premises Active Directory domain;\neach user is added automatically to the local Administrators group on the virtual machine.\nI can be done by GPO.","comment_id":"912103","timestamp":"1701441420.0","poster":"Leocan","upvote_count":"1"},{"content":"Selected Answer: A\nIt is A due to \"Azure Virtual Desktop personal host pool\" each user need access as a local admin on the computer they will be assigned.","upvote_count":"1","timestamp":"1696003200.0","poster":"kshum","comment_id":"854620"},{"timestamp":"1694942160.0","comment_id":"841920","upvote_count":"2","content":"Virtual Machine Administrator Login Role\nView Virtual Machines in the portal and login as administrator\n\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles","poster":"Mickbuz"},{"upvote_count":"1","poster":"ryouga1313","timestamp":"1693960140.0","content":"Selected Answer: C\nGiven answer (A) seems to be describing how to give access to the host pool/personal desktop, rather than Local Admin access (which is done via GPO)","comment_id":"830509"},{"upvote_count":"1","timestamp":"1687118940.0","comment_id":"749230","poster":"spool","content":"Selected Answer: C\nCan only be done via GPO, C is correct"},{"content":"Selected Answer: C\nCorrect answer is C. Requested action is not related with AVD roles in any way. So it is standard procedure how you can do it in any Windows domain and it is GPO.","timestamp":"1682836080.0","poster":"Magis","upvote_count":"2","comment_id":"707704"},{"content":"Selected Answer: C\nits a GPO setting","poster":"tiger_03","comment_id":"694874","timestamp":"1681485420.0","upvote_count":"1"},{"poster":"Sorataj","upvote_count":"2","timestamp":"1677694980.0","comment_id":"656439","content":"Selected Answer: C\nCorrect answer is C, to automatically add a user to the local administrator a GPO is needed"},{"comment_id":"655172","content":"Selected Answer: C\nA is not correct. it is asking you to add the user to the Local Administrators group in the session host. That should be done via GPO.","poster":"antuanfff","timestamp":"1677601140.0","upvote_count":"4","comments":[{"poster":"max_n","content":"https://microsoftlearning.github.io/AZ-140-Configuring-and-Operating-Microsoft-Azure-Virtual-Desktop/Instructions/Labs/LAB_04L01_Implement_and_manage_AVD_profiles_AADDS.html","timestamp":"1678473840.0","upvote_count":"2","comment_id":"665541"}]}],"question_images":[],"answer_ET":"C","answers_community":["C (89%)","11%"],"isMC":true,"question_id":83,"exam_id":46,"answer":"C","question_text":"You have a hybrid Azure Active Directory (Azure AD) tenant.\nYou plan to deploy an Azure Virtual Desktop personal host pool. The host pool will contain 15 virtual machines that run Windows 10 Enterprise. The virtual machines will be joined to the on-premises Active Directory domain and used by the members of a domain group named Department1.\nYou need to ensure that each user is added automatically to the local Administrators group on the virtual machine to which the user signs in.\nWhat should you configure?","timestamp":"2022-08-31 16:19:00","choices":{"A":"a role assignment for the host pool","C":"a policy preference in a Group Policy Object (GPO)","D":"a device setting in Azure AD","B":"a role assignment for each virtual machine"}},{"id":"oPftagrrwnEeQd46fzWC","discussion":[{"comments":[{"poster":"[Removed]","timestamp":"1692645600.0","upvote_count":"1","comments":[{"timestamp":"1692645660.0","comment_id":"986882","comments":[{"timestamp":"1692645660.0","poster":"[Removed]","comment_id":"986885","upvote_count":"2","content":"Part 2 of the question is tricky as well. \n\nIt states: “Role Required to” assign the role to User1. It is not asking which role to assign to User1 which would be the Security Admin role. It is instead asking which role “you” need to have in order to assign the appropriate role to User1.\n\nBeing that the Tenant Root Group does not allow anyone to modify its role assignments by default and only a Global Administrator can self-elevate to the “User Access Administrator role” of the Tenant Root Group, you will require Global Admin rights to achieve the goal. \nhttps://learn.microsoft.com/en-us/azure/governance/management-groups/overview"}],"content":"Instead, Azure Subscription rights are managed by Management Groups. The Tenant level management group is named by default “Tenant Root Group”. While technically this is the “Root Management Group Level” using this language in the exam question is solely intended to throw the reader off as it would typically be referred to as the “Tennant Root Group”. \n\nTo provide User1 access to manage the security information for all the subscriptions in the tenant the user would need to be assigned the “Security Admin Role” on the Tenant Root Group\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/tenant-wide-permissions-management","poster":"[Removed]","upvote_count":"2"}],"comment_id":"986881","content":"Part 1 asks what role User1 needs to be able to “manage” (read that as Modify/Contribute not just read) security information for the tenant. Tenant here also means the multiple azure subscriptions. \n\nAzure Subscription rights are not handled by default Azure AD role assignments. You can be a Global Admin of the Azure AD tenant and not have visibility to the Azure Subscriptions unless it is grated by another admin, or you self-elevate."}],"upvote_count":"7","content":"Correct Answer: \nSecurity Admin at the Root Management Group Level (Tenant Root Group)\nAnd\nGlobal Administrator\n\nThis is a poorly written question. The author intentionally misleads the reader using incorrect naming, and poorly phrased objectives. Most of these get thrown out, my condolences to anyone who sees this on an exam.","comment_id":"986880","timestamp":"1692645480.0","poster":"[Removed]"},{"comment_id":"912118","poster":"Leocan","content":"Tested in the lab: Security Admin at the root management group level.","timestamp":"1685624040.0","upvote_count":"5"},{"content":"Role to assign to User1: Security Admin at the root (tenant) management group level.\nTenant‐wide visibility in Microsoft Defender for Cloud (Security Center) requires a role assignment at the root management group (also called the “tenant root group”). Assigning “Security Admin” at the root level lets User1 manage security settings across all subscriptions under that tenant, meeting the “tenant‐wide” requirement.\n\nRole required to assign the role to User1: Privileged role administrator.\nThe Privileged Role Administrator role can manage role assignments in Azure AD, including high‐privilege directory roles such as Security Admin.","poster":"hwoccurrence","comment_id":"1341642","upvote_count":"1","timestamp":"1737023580.0"},{"comment_id":"1303985","poster":"impie007","upvote_count":"2","content":"Role to assign to User1:\n\nSecurity administrator for contoso.com\nReason: The \"Security administrator\" role will allow User1 to manage security information for the entire Azure AD tenant , which provides tenant-wide visibility in Azure Security Center. This role grants the necessary permissions to view and manage security policies and configurations across the tenant.\nRole required to assign the role to User1:\n\nPrivileged role administrator\nReason: The \"Privileged role administrator\" role is needed to assign roles such as \"Security administrator\" to users. This role has the authority to manage role assignments within Azure AD and can delegate the necessary security permissions to User1.","timestamp":"1730122860.0"},{"poster":"JohnBarneveld","timestamp":"1686129120.0","comment_id":"917033","content":"https://learn.microsoft.com/en-us/azure/defender-for-cloud/tenant-wide-permissions-management\nIn this document somewhre under point 3 it says \"The organizational-wide view is achieved by granting roles on the root management group level of the tenant.\"","upvote_count":"2"},{"timestamp":"1683572760.0","upvote_count":"4","comment_id":"892451","content":"Security Administrator at the tenant level doesn't gives you any rights in Azure. Since there are 2 subscriptions you need the Security Admin at the root management group level.","poster":"hydrillo"},{"upvote_count":"1","timestamp":"1667119740.0","content":"Sounds correct to me.","comment_id":"707712","poster":"Magis"}],"answer":"","timestamp":"2022-10-30 09:49:00","answer_ET":"","question_text":"HOTSPOT -\nYou have two Azure subscriptions that are linked to an Azure Active Directory (Azure AD) tenant named contoso.com and contain an Azure Virtual Desktop deployment. The tenant contains a user named User1.\nWhen User1 signs in to Azure Security Center, the user receives the message shown in the following exhibit.\n//IMG//\n\nYou need to ensure that User1 can manage security information for the tenant. The solution must use the principle of least privilege.\nWhat should you do? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","exam_id":46,"isMC":false,"topic":"3","answers_community":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04272/0010600001.jpg","https://www.examtopics.com/assets/media/exam-media/04272/0010600002.png"],"unix_timestamp":1667119740,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04272/0010700001.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/86672-exam-az-140-topic-3-question-14-discussion/","question_id":84,"answer_description":"Box 1: Security administrator for contoso.com\nIncorrect:\n* Not at the subscription level, as there are two subscriptions.\n* Not Root management group level\nEach directory is given a single top-level management group called the root management group. The root management group is built into the hierarchy to have all management groups and subscriptions fold up to it. This root management group allows for global policies and Azure role assignments to be applied at the directory level.\nBox 2: Privileged Role Administrator\nYou need to ensure that User1 can manage security information for the tenant.\nPrivileged Role Administrator - Can manage role assignments in Azure AD, and all aspects of Privileged Identity Management.\nIncorrect:\n* External Identity Provider Administrator\nThis administrator manages federation between Azure AD organizations and external identity providers. With this role, users can add new identity providers and configure all available settings (e.g. authentication path, service ID, assigned key containers). This user can enable the Azure AD organization to trust authentications from external identity providers.\nReference:\nhttps://docs.microsoft.com/en-us/azure/governance/management-groups/overview https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference"},{"id":"62s9vXw4lN986ZELcr1A","answer_ET":"","answers_community":[],"answer_description":"","question_text":"DRAG DROP\n-\n\nYour on-premises network contains an Active Directory domain named fabrikam.com that syncs with Azure Active Directory (Azure AD). The domain contains a global group named AVDusers.\n\nYou have an Azure subscription that contains the resources shown in the following table.\n\n//IMG//\n\n\nAll Azure Virtual Desktop users are members of the AVDusers group.\n\nYou plan to create FSLogix profile containers in Profiles1.\n\nYou need to configure Profiles1 and fabrikam.com to ensure that the HostPool1 sessions hosts can access the FSLogix profile containers.\n\nWhat should you do? To answer, drag the appropriate configurations to the correct targets. Each configuration may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\n\n//IMG//","url":"https://www.examtopics.com/discussions/microsoft/view/96570-exam-az-140-topic-3-question-15-discussion/","answer":"","exam_id":46,"question_images":["https://img.examtopics.com/az-140/image179.png","https://img.examtopics.com/az-140/image180.png"],"answer_images":["https://img.examtopics.com/az-140/image181.png"],"discussion":[{"content":"https://www.youtube.com/watch?v=rEjddntRnZk&t=2408s\nthe answers should be:\nProfile1: Assign Azure role-based access control roles to AVDusers group: Storage File Data SMB Share Contributor\nfabirkam.com: Create a computer account for storage 1.","upvote_count":"8","poster":"Leocan","timestamp":"1685635320.0","comments":[{"timestamp":"1728152160.0","poster":"javdatto","comment_id":"1293562","upvote_count":"1","content":"In this scenario, you don't use Azure RBAC roles because the authentication for FSLogix profiles is based on Active Directory (AD), and session hosts are joined to the AD domain. Azure RBAC controls access to Azure resources but doesn't apply to NTFS file system permissions required by FSLogix."},{"comment_id":"912713","timestamp":"1685701080.0","poster":"Leocan","comments":[{"timestamp":"1685882280.0","comment_id":"914590","upvote_count":"4","comments":[{"comment_id":"1118584","content":"It's not mentioned that you have to do it from the Azure Portal. https://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds#set-ntfs-permissions","upvote_count":"1","timestamp":"1704893340.0","poster":"Schra"}],"poster":"Leocan","content":"\"Set NTFS permissions\" is done on a session host. Not to share on the Azure portal."}],"content":"https://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds\n\"Set NTFS permissions\" is done after assigning the role.","upvote_count":"4"}],"comment_id":"912246"},{"comment_id":"993093","timestamp":"1693313580.0","content":"I think that the provided answer is correct : \nin this scenario we have on prem adds , so as explained here : \n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds\n\n1 Assign RBAC role to users\n2 Set NTFS permissions\n\n(we assume that the storage account exists and it is joined to the ADDS)","upvote_count":"6","poster":"Shertster"},{"poster":"DC095","comment_id":"1363157","upvote_count":"1","timestamp":"1740759300.0","content":"The answers are correct but in reverse. The users will need Storage File Data SMB Share Contributor role assignment for the Azure file share, and NTFS permissions will need to be set in the ADDS environment."},{"poster":"HartMS","upvote_count":"1","content":"Passed the Exam with below Answers:\nNTFS\nCreate Computer Account","comment_id":"1275317","timestamp":"1725063480.0"},{"timestamp":"1704893160.0","upvote_count":"2","poster":"Schra","comment_id":"1118581","content":"Provided answer is correct\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds#assign-rbac-role-to-users\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds#assign-rbac-role-to-users"},{"content":"The provided link states in step 8 Select + File Share\nJust below that it states to Join storage account to Azure AD with a computer account. Based on that and the provide answers it should be\nCreate Shared Folder\nCreate a computer account\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds","timestamp":"1681237560.0","poster":"scottims","comment_id":"867585","upvote_count":"2"},{"timestamp":"1675556520.0","content":"Respuesta correcta.","comment_id":"798503","upvote_count":"1","poster":"17Master"},{"content":"Answer seems good\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/fslogix-profile-container-configure-azure-files-active-directory?tabs=adds","comment_id":"786369","timestamp":"1674553320.0","upvote_count":"2","poster":"CARO54"},{"content":"I think the Answers are wrong and should be the Following:\nProfiles: assign NTFS Permissions to AVD users\nFrabrikam.com: Create a computer Objekt for Storage 1","poster":"panterpansn","timestamp":"1674463380.0","upvote_count":"5","comments":[{"timestamp":"1678002960.0","content":"Computer account will already be created as the storage account is joined to the domain","comments":[{"content":"With ADDS it is a manual process unlike with AADDS. Therefore the suggested answers of panterpansn are correct.","timestamp":"1683573300.0","upvote_count":"1","poster":"hydrillo","comment_id":"892459","comments":[{"content":"No, you are not understanding. Storage account is already authenticating with frabrikam domain according to the question, so that step is already complete.","timestamp":"1684173960.0","upvote_count":"2","poster":"tristamm16","comment_id":"898596"}]}],"upvote_count":"1","poster":"Dan_Turnbull","comment_id":"829722"}],"comment_id":"785140"}],"unix_timestamp":1674463380,"isMC":false,"question_id":85,"topic":"3","timestamp":"2023-01-23 09:43:00"}],"exam":{"lastUpdated":"12 Apr 2025","id":46,"isImplemented":true,"isBeta":false,"isMCOnly":false,"numberOfQuestions":289,"name":"AZ-140","provider":"Microsoft"},"currentPage":17},"__N_SSP":true}