{"pageProps":{"questions":[{"id":"Yh7IWviBuVEVOdXIjYy7","question_images":[],"isMC":true,"answer_ET":"AB","answer":"AB","answers_community":["AB (77%)","BD (21%)","2%"],"topic":"1","unix_timestamp":1695396360,"answer_images":[],"discussion":[{"poster":"m1dp","comment_id":"1017526","timestamp":"1695714000.0","content":"Selected Answer: AB\nWe first create tags on the resources per project, afterwards we create a budget for monitoring the costs.","upvote_count":"14"},{"comment_id":"1016465","upvote_count":"13","content":"I had question at 24th Sep 2023","timestamp":"1695619260.0","poster":"Forex19"},{"upvote_count":"2","timestamp":"1742509620.0","content":"Selected Answer: BD\nWell, it is confusing because budgets are not wrong.. But budgets are for alerting not monitoring... Management groups would simplify applying the policies and reporting which resonates with lowering admin efforts... Monitoring the costs mean gaining insight on where the money goes not necessarily getting alerts..","poster":"ahhatem","comment_id":"1401364"},{"content":"Selected Answer: UB\nResposta dada pelo copilot (IA generativa da microsoft)","timestamp":"1741349400.0","upvote_count":"1","comment_id":"1366244","poster":"rgomes"},{"upvote_count":"1","comment_id":"1366100","poster":"Nhadipour","timestamp":"1741310640.0","content":"Selected Answer: BD\nMicrosoft says management group and resource tags!\n\nhttps://learn.microsoft.com/en-us/azure/cost-management-billing/cost-management-billing-overview#organize-and-allocate-costs"},{"upvote_count":"1","content":"Selected Answer: BD\nBudget doesn't make sense here.","timestamp":"1734376380.0","comment_id":"1327591","poster":"lav16"},{"content":"Selected Answer: AB\nA & B are correct","upvote_count":"2","poster":"[Removed]","comment_id":"1310128","timestamp":"1731333780.0"},{"comment_id":"1307449","content":"A. budgets and B. resource tags\nExplanation:\nBudgets: Allow you to set spending limits for specific resources or subscriptions.\nCan be defined at a per-project level, making it easy to monitor costs for each project.\nTrigger alerts when budget thresholds are reached, helping to proactively manage costs.\nResource tags:Provide a flexible way to categorize and label resources.\nCan be used to tag resources based on the project they belong to.\nMicrosoft Cost Management allows you to filter and group costs by tags, making it easy to analyze costs on a per-project basis.\nAdditional Considerations: While management groups could be used to organize subscriptions, they might not be the most efficient solution in this case. They are primarily used for policy and access control management.\nCustom RBAC roles and Azure Boards are not directly related to cost management and monitoring.\nBy combining budgets and resource tags, you can effectively monitor and manage costs for each project with minimal administrative effort.","upvote_count":"2","poster":"Thanveer","timestamp":"1730823600.0"},{"upvote_count":"5","poster":"23169fd","comment_id":"1234578","content":"Selected Answer: AB\nB. Resource tags\n\nWhy: Tags allow categorizing and tracking costs for resources by project across multiple subscriptions. This enables detailed cost analysis and reporting for each project.Use tags to assign metadata to resources (e.g., project name), making it easier to filter and analyze costs per project.\nA. Budgets\n\nWhy: Budgets enable setting cost limits and alerts for each project. When combined with tags, budgets can help track and control costs effectively, ensuring each project stays within its allocated budget.Set up budgets for each project to monitor spending, receive alerts, and enforce cost controls based on tagged resources.","timestamp":"1718986320.0"},{"comment_id":"1206336","content":"Select Answer: AB\nTo monitor costs on a per project basis using Microsoft Cost Management, you should include the following two components in the solution: Resource Tags (Option B): Resource tags allow you to categorize resources by project. This makes it easier to track costs associated with a particular project across multiple subscriptions. \nBudgets (Option A): Budgets in Azure Cost Management help you plan for and drive organizational accountability. With budgets, you can account for the resources used by your projects and monitor how spending progresses over time. Budgets will also alert you as you reach predefined budget thresholds. \nSo, the correct answers are Resource Tags (Option B) and Budgets (Option A).","timestamp":"1714795440.0","poster":"Chenn","upvote_count":"1"},{"upvote_count":"2","comment_id":"1203776","content":"Selected Answer: AB\nI would agree with AB\nMGMT groups dont allow for the requirements","poster":"Lazylinux","timestamp":"1714359900.0"},{"upvote_count":"4","comment_id":"1202054","poster":"manny72","timestamp":"1714054680.0","comments":[{"content":"But project uses resources across multiple subscriptions. If one subscription has resources that used by multiple subscription, then you can't use management groups in this occasion.","upvote_count":"1","poster":"AsankaI","timestamp":"1730705400.0","comment_id":"1306816"},{"comment_id":"1274008","content":"I agree","timestamp":"1724843220.0","upvote_count":"1","poster":"salned"}],"content":"Selected Answer: BD\nThe question is tricky. A,B and D would all be part of the solution.\nIt's important to understand the purpose of the question and I've to say that Microsoft exam questions are often confusing. \n\nIn this case the question already mentions Azure Cost Management, so Budgets are part of it. \nI would say that if you want to minimise administrative effort when applying tags, you have to group subscriptions based on projects, then you can use Azure Cost Management which doesn't have just Budgets but also other tools. \n\nInterstingly, ChatGpt and Gemini gave different answers, one AB, the other BD. But when I added to the question what the other AI gave as an answer, they both changed answers and they kept the last one even after removing it :)"},{"upvote_count":"2","comment_id":"1201675","poster":"arnitjoe","content":"How would you deploy the tags without a management group? You would have to create a policy for every sub. Minimize Effort. Management Groups are definitely correct.","timestamp":"1714007160.0"},{"comment_id":"1198266","content":"To monitor costs on a per-project basis using Microsoft Cost Management while minimizing administrative effort, you should include the following two components:\n\nAzure Tags:\nUse Azure tags to label resources across subscriptions with project-specific tags.\nAssign tags to resources based on the project they belong to.\nCost Management can then aggregate costs based on these tags, allowing you to monitor costs per project.\nTags are easy to manage and do not require additional administrative overhead.\nAzure Management Groups:\nCreate Azure management groups to organize your subscriptions hierarchically.\nAssociate each project’s subscriptions under a specific management group.\nSet up cost tracking and reporting at the management group level.\nThis approach minimizes administrative effort because you can manage policies, budgets, and cost views at the management group level rather than individually for each subscription.","timestamp":"1713491580.0","upvote_count":"4","poster":"vmvm44"},{"timestamp":"1710655860.0","comment_id":"1175610","content":"Selected Answer: AB\nbudgets, resource tags","poster":"prshntdxt7","upvote_count":"2"},{"timestamp":"1709285340.0","content":"B and D are the correct answers. Refer to the below:\n\nhttps://learn.microsoft.com/en-us/azure/cost-management-billing/costs/understand-work-scopes\nhttps://learn.microsoft.com/en-us/azure/cost-management-billing/costs/quick-acm-cost-analysis","poster":"RockyChak","comment_id":"1163358","upvote_count":"5"},{"upvote_count":"2","poster":"SDiwan","content":"Selected Answer: AB\nBudget and resource tags. Management group is wrong.","timestamp":"1708456800.0","comment_id":"1154949"},{"upvote_count":"1","content":"Selected Answer: BD\nMinimizar el esfuerzo administrativo. los grupos de administracion cumplen con esto.","comment_id":"1154824","poster":"f2c587e","timestamp":"1708443660.0"},{"upvote_count":"2","timestamp":"1704786240.0","content":"Selected Answer: AB\nAB - :)","poster":"TonySuccess","comment_id":"1117270"},{"upvote_count":"1","poster":"vrp007","timestamp":"1703090820.0","content":"The Question states \"Which 'TWO' components...?\"\nIs budget a component..?\n\nmy view on this is, budget would be covered under 'Management Group' as part of cost management policies...\nAlso, I get that while budgets can be useful for setting spending limits and monitoring costs against those limits, they don't directly facilitate per-project cost monitoring.","comment_id":"1101753"},{"comment_id":"1092311","timestamp":"1702192140.0","content":"Selected Answer: BD\nSince \"You have 12 Azure subscriptions and three projects.\" Use management groups helps you managing subscriptions across different projects, and \"Each project uses resources across multiple subscriptions.\" which resource tags help you managing resources within different subs","upvote_count":"4","poster":"youngzyl"},{"upvote_count":"3","poster":"BShelat","timestamp":"1701990540.0","content":"\"Budgets\" is NOT a component but it is a method to keep an eye on the usage of the resources and get alerted when usage exceeding beyond whatever $ we want to spend and perform some action to stop that exceeding usage. We can \"Monitor\" cost analysis blade without configuring budgets. So answers B & D are correct answers.","comment_id":"1090652"},{"poster":"GODUSGREAT","comment_id":"1064910","upvote_count":"3","content":"Selected Answer: AB\ncorrect answer","timestamp":"1699369140.0"},{"timestamp":"1696395960.0","upvote_count":"2","poster":"ArunS005","comment_id":"1024460","content":"Selected Answer: AB\n\"Budget & Resource Tags\" are the correct options."},{"content":"Selected Answer: AB\nResource Tags (B): Tagging is an easy way to classify assets. That metadata can be used to classify the asset based on various data points. When tags are used to classify assets as part of a cost management effort, companies often need tags such as project. Azure Cost Management + Billing can use these tags to create different views of cost data.\n\nBudgets (A): Budgets in Azure Cost Management + Billing help you plan for and drive organizational accountability. With budgets, you can account for the Azure services you consume or subscribe to during a specific period, and proactively notify teams about how they’re tracking against their spending targets.","poster":"yuu_oppai","comment_id":"1015781","upvote_count":"4","timestamp":"1695559680.0"},{"content":"Selected Answer: AB\nTo monitor costs on a per project basis using Microsoft Cost Management, you should include the following components in your solution:\n\nA. Budgets: Azure Cost Management + Billing allows you to create and manage budgets, which can help you monitor costs proactively1.\n\nB. Resource Tags: Tagging is an easy way to classify assets. Tagging associates metadata to an asset, which can be used to classify the asset based on various data points. When tags are used to classify assets as part of a cost management effort, companies often need tags such as project, business unit, department, billing code, geography, environment, and workload or application categorization2. Azure Cost Management + Billing can use these tags to create different views of cost data2.\n\nSo the correct answers are A. budgets and B. resource tags.","timestamp":"1695425580.0","comment_id":"1014560","upvote_count":"5","poster":"JeyD"},{"timestamp":"1695396360.0","comment_id":"1014273","poster":"marcellov","upvote_count":"5","content":"Selected Answer: AB\nA few examples of what you can do in Cost Management include:\n- Report on and analyze costs in the Azure portal, Microsoft 365 admin center, or Power BI.\n- Monitor costs proactively with budget, anomaly, reservation utilization, and scheduled alerts.\n- Enable tag inheritance and split shared costs with cost allocation rules.\n- Automate business processes or integrate cost into external tools by exporting data.\nBudgets in Cost Management help you plan for and drive organizational accountability. They help you proactively inform others about their spending to manage costs and monitor how spending progresses over time."}],"choices":{"C":"custom role-based access control (RBAC) roles","A":"budgets","E":"Azure boards","B":"resource tags","D":"management groups"},"answer_description":"","exam_id":54,"timestamp":"2023-09-22 17:26:00","url":"https://www.examtopics.com/discussions/microsoft/view/121192-exam-az-305-topic-1-question-64-discussion/","question_text":"You have 12 Azure subscriptions and three projects. Each project uses resources across multiple subscriptions.\n\nYou need to use Microsoft Cost Management to monitor costs on a per project basis. The solution must minimize administrative effort.\n\nWhich two components should you include in the solution? Each correct answer presents part of the solution.\n\nNOTE: Each correct selection is worth one point.","question_id":61},{"id":"HEKP8e9SvmbcCqu3kAbk","question_images":["https://img.examtopics.com/az-305/image214.png"],"question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that contains multiple storage accounts.\n\nYou assign Azure Policy definitions to the storage accounts.\n\nYou need to recommend a solution to meet the following requirements:\n\n• Trigger on-demand Azure Policy compliance scans.\n• Raise Azure Monitor non-compliance alerts by querying logs collected by Log Analytics.\n\nWhat should you recommend for each requirement? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","unix_timestamp":1696498620,"answer_images":["https://img.examtopics.com/az-305/image215.png"],"answer_ET":"","exam_id":54,"answer_description":"","answers_community":[],"isMC":false,"topic":"1","url":"https://www.examtopics.com/discussions/microsoft/view/122495-exam-az-305-topic-1-question-65-discussion/","timestamp":"2023-10-05 11:37:00","question_id":62,"answer":"","discussion":[{"content":"my experience on Azure Policy alert:\n\nbox1: CLI is correct. I use powershell command to do this \nbox2: I first set the diagnostic setting on activity log so that all policy related messages are sent to log analytic workspace. And then on log analytic workspace setup alert rules that send alert whenever non-informative messages are found. Simply speaking, diagnostic setting is on activity log, alert rule setup is on log analytic workspace.","comment_id":"1045591","timestamp":"1697522760.0","poster":"godchild","upvote_count":"21","comments":[{"timestamp":"1700321220.0","poster":"mmarkiew","upvote_count":"7","content":"Adding a reference supporting Azure CLI for box 1:\nhttps://learn.microsoft.com/en-us/azure/governance/policy/how-to/get-compliance-data#on-demand-evaluation-scan\n\nIt doesn't appear that on-demand scans can be initiated from Azure Portal.","comment_id":"1074112"}]},{"comment_id":"1025680","upvote_count":"12","timestamp":"1696511400.0","comments":[{"timestamp":"1696511520.0","content":"Also, note that on-demand evaluation scan can be triggered not only by Azure CLI, but also using Azure PowerShell, REST API call and Azure Policy Compliance Scan GitHub action.","comment_id":"1025689","poster":"mykola_yakovliev","upvote_count":"3","comments":[{"poster":"cosmicT73","timestamp":"1725353580.0","comment_id":"1277375","upvote_count":"2","content":"but this only shows how to create alerts but not how to configure diagnostic settings for activity log"}]}],"content":"Provided answers look correct:\n\nTo trigger the compliance scans, use Azure CLI\n> https://learn.microsoft.com/en-us/azure/governance/policy/how-to/get-compliance-data#on-demand-evaluation-scan\nAn evaluation scan for a subscription or a resource group can be started with Azure CLI, Azure PowerShell, a call to the REST API, or by using the Azure Policy Compliance Scan GitHub Action. This scan is an asynchronous process. An evaluation scan for a subscription or a resource group can be started with Azure CLI, Azure PowerShell, a call to the REST API, or by using the Azure Policy Compliance Scan GitHub Action. This scan is an asynchronous process.\n\nTo generate alerts, configure diagnostic settings for the Azure activity logs\n> https://learn.microsoft.com/en-us/azure/azure-monitor/alerts/alerts-create-new-alert-rule","poster":"mykola_yakovliev"},{"content":"Box 1: CLI \nhttps://learn.microsoft.com/en-us/azure/governance/policy/how-to/get-compliance-data#azure-cli\n\nBox 2: Log Analytics Workspace\n\nIf you have a Log Analytics workspace with AzureActivity from the Activity Log Analytics solution tied to your subscription, you can also view non-compliance results from the evaluation of new and updated resources using Kusto queries and the AzureActivity table. With details in Azure Monitor logs, alerts can be configured to watch for non-compliance.\n\nhttps://learn.microsoft.com/en-us/azure/governance/policy/how-to/get-compliance-data#azure-monitor-logs","comment_id":"1412517","upvote_count":"1","timestamp":"1743339660.0","poster":"serbanvadi"},{"comments":[{"poster":"Nhadipour","timestamp":"1741831380.0","upvote_count":"1","content":"box2: log analytic workspace \nanswer is in the video from microsoft docs:\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/diagnostic-settings\n\nTo create alerts, we set the log analytic workspace as destination in diagnostics settings.","comment_id":"1388145"}],"timestamp":"1741823700.0","comment_id":"1388117","upvote_count":"1","poster":"Nhadipour","content":"box1: CLI \nbox2: log analytic workspace\n\nI guess it's like configuring diagnostics IN the activity log FOR the log analytic workspace, in which we can query logs to find non-compliance and generate alerts."},{"upvote_count":"2","timestamp":"1731334500.0","poster":"[Removed]","comment_id":"1310130","content":"CORRECT"},{"comments":[{"timestamp":"1718986800.0","comments":[{"timestamp":"1720120500.0","comment_id":"1242256","upvote_count":"1","content":"Plus we already know what we what to store and query them:\n- Raise Azure Monitor non-compliance alerts by querying logs collected by Log Analytics.","poster":"OlehT"},{"upvote_count":"4","timestamp":"1720120200.0","content":"Question is not about where to send logs, but about where you should configure diagnosing settings.\n\n1.) You have an Azure subscription that contains multiple storage accounts.\n2.) You assign Azure Policy definitions to the storage accounts.\n3.) You trigger on-demand Azure Policy compliance scans.\n\nWhere do you configure diagnostic settings?\nAnswer: Storage Account","comment_id":"1242253","poster":"OlehT"}],"poster":"23169fd","comment_id":"1234599","content":"To Generate the Non-Compliance Alerts:\n\nLog Analytics workspace:\n\nWhy: By configuring diagnostic settings to send logs to a Log Analytics workspace, you can leverage Azure Monitor to query these logs and set up alerts for non-compliance. This integrates well with your existing monitoring solutions and ensures comprehensive log management and alerting.\nWhy Not Other Options:\nAzure activity logs: While useful for auditing, they do not provide the detailed compliance information needed for triggering specific alerts.\nStorage accounts: Used for storing raw data and logs but not for querying and setting up detailed alerts without additional processing.","upvote_count":"3"}],"comment_id":"1234597","poster":"23169fd","timestamp":"1718986800.0","upvote_count":"2","content":"To Trigger the Compliance Scans:\n\nThe Azure Command-Line Interface (CLI):\n\nWhy: The Azure CLI provides a straightforward way to manually trigger on-demand compliance scans. It allows for automation and scripting, which can be incorporated into your existing workflows with minimal administrative effort.\nWhy Not Other Options:\nAn Azure template: Primarily used for deploying resources, not ideal for triggering compliance scans.\nThe Azure portal: While you can manually trigger scans, it does not support automation and scripting as effectively as the CLI."},{"poster":"cosmicT73","timestamp":"1718467080.0","content":"CHTAGPT response:Triggering Compliance Scans:\n\nThe Azure Command-Line Interface (CLI): Use the Azure CLI to trigger on-demand compliance scans. The command az policy state trigger-scan initiates a compliance evaluation for your policies.\nGenerating Non-Compliance Alerts:\n\nAzure Activity Logs: Configure diagnostic settings for the Azure activity logs. Activity logs provide information about operations on resources in your subscription. By sending these logs to a Log Analytics workspace, you can query and create alerts based on policy non-compliance events.\nCorrect Selections:\nTo trigger the compliance scans, use: The Azure Command-Line Interface (CLI)\nTo generate the non-compliance alerts, configure diagnostic settings for the: Azure activity logs\nThis configuration ensures that you can manually trigger policy compliance scans and monitor policy compliance through the activity logs, which can then be queried in Log Analytics for alerting purposes.","upvote_count":"3","comment_id":"1231041"},{"timestamp":"1716196140.0","poster":"rtsh06","upvote_count":"5","comment_id":"1214247","content":"This question appeared in my exam on 13th May 2024. The given answer is correct."},{"content":"I would say\n1- Powershell CLI\n2- Storage account for diagnostic setting","poster":"Lazylinux","timestamp":"1714360080.0","comment_id":"1203777","upvote_count":"2"},{"timestamp":"1710963660.0","content":"Final Answer:\n1- CLI\n2- Storage account","comment_id":"1178646","poster":"varinder82","upvote_count":"2"},{"poster":"Fidel_104","content":"1- CLI\n2- Storage account\n\n-1-\nFor the 1st question as others pointed out, you have to use CLI - you cannot trigger them from the Portal, and the 3rd option (Templates) doesn't make any sense.\n\nSource: https://learn.microsoft.com/en-us/azure/governance/policy/how-to/get-compliance-data#on-demand-evaluation-scan\n\n-2-\nThis is tricky, I actually changed my mind after going through the docs. If you read the article 'Create diagnostic settings in Azure Monitor' (link below), you will see that the guide explicitly states (with screenshots) that within Azure Monitor, you have to select a resource (that is the Storage account in our case), select the Diagnostic settings, and then you can add a new or edit the existing diagnostic settings.\n\nSource: https://learn.microsoft.com/en-us/azure/azure-monitor/essentials/create-diagnostic-settings?tabs=portal","upvote_count":"3","timestamp":"1709731500.0","comment_id":"1167173"},{"comment_id":"1164099","poster":"profesorklaus","upvote_count":"2","comments":[{"upvote_count":"2","poster":"profesorklaus","comment_id":"1164100","content":"5. Run policy scan by az policy state trigger-scan. This is manual run and should show a policy compliance violation \n6. Go to Monitor => Alerts => Create alert rule. You need to choose Custom Log search with a query which triggers alert i.e. AzureActivity \n| where CategoryValue == \"Policy\" and Level == \"Warning\"\n| count and triggers when count > 0","timestamp":"1709381520.0"}],"content":"Here how you can do it:\n1. Create a log workspace \n2. Create a policy reffereing to Storage Account which will be violated .i.e Storage accounts should restrict network access or Storage accounts should disable public network access\n3. Go to Monitor => Activity Log and see an option Export Activity Logs and click it\n4. Add diagnostic setting for Policy and send it to newly created workspace. Now all policy alerts should go to log worspace.","timestamp":"1709381520.0"},{"poster":"Risto83","content":"1- CLI\n2- Log analytics\n\nhttps://medium.com/azure-architects/using-log-analytics-alerts-for-non-compliant-azure-policies-8d99f74089d9","timestamp":"1708488540.0","upvote_count":"1","comment_id":"1155224"},{"timestamp":"1705362720.0","content":"First option is correct, for second, the diagnostic log blade for azure monitor shows all the storage accounts with their diagnostic settings on or off, is second answer still correct ?","poster":"GSChoff","comment_id":"1123775","upvote_count":"1"},{"content":"It does indeed look like Activity Logs don't have the necessary information to create the required alerts. See https://techcommunity.microsoft.com/t5/fasttrack-for-azure/generate-azure-policy-compliance-alerts-by-sending-custom-data/ba-p/3671119","comments":[{"poster":"TonySuccess","upvote_count":"1","content":"Replaced by the Diagnostic Setting:\n\nhttps://azure.microsoft.com/en-us/updates/azure-activity-logs-legacy-solution-is-replaced-by-diagnostic-settings/#:~:text=Azure%20Activity%20Logs%20Legacy%20solution,settings%20%7C%20Azure%20updates%20%7C%20Microsoft%20Azure","comment_id":"1117272","timestamp":"1704786420.0"}],"upvote_count":"3","comment_id":"1067157","timestamp":"1699611660.0","poster":"kodathedog"},{"comments":[{"content":"I'd say look into the MS Learn resource as it has the most updated information:\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/activity-log?tabs=powershell","comment_id":"1063022","comments":[{"timestamp":"1699672140.0","content":"The Azure Monitor activity log is a platform log in Azure that provides insight into subscription-level events. The activity log includes information like when a resource is modified or a virtual machine is started. You can view the activity log in the Azure portal or retrieve entries with PowerShell and the Azure CLI. This article provides information on how to view the activity log and send it to different destinations.\n\nFor more functionality, create a diagnostic setting to send the activity log to one or more of these locations for the following reasons:\n\nSend to Azure Monitor Logs for more complex querying and alerting and for longer retention, up to two years.\nSend to Azure Event Hubs to forward outside of Azure.\nSend to Azure Storage for cheaper, long-term archiving.","poster":"StixxNSnares","comment_id":"1067640","upvote_count":"2"}],"poster":"StixxNSnares","upvote_count":"2","timestamp":"1699196400.0"}],"upvote_count":"4","timestamp":"1697015760.0","comment_id":"1040424","content":"box 2 - Azure Activity logs are no longer supported:\nhttps://techcommunity.microsoft.com/t5/itops-talk-blog/how-to-create-azure-monitor-alerts-for-non-compliant-azure/ba-p/713466","poster":"matanzpl"},{"comment_id":"1028257","upvote_count":"1","timestamp":"1696796520.0","poster":"serget12","content":"You should setup using workflow automation in the portal. With continuous export set to the correct workspace."},{"poster":"kecskesajt","content":"Is it correct?","upvote_count":"1","comment_id":"1025506","timestamp":"1696498620.0"}]},{"id":"tlX6MKRBlfYugEqSYIJ0","answer_images":["https://img.examtopics.com/az-305/image217.png"],"unix_timestamp":1696513080,"question_images":["https://img.examtopics.com/az-305/image216.png"],"answer_description":"","isMC":false,"answer_ET":"","discussion":[{"comments":[{"timestamp":"1734608160.0","poster":"tommylux","comment_id":"1328955","content":"I can't create a new comment, but to add, the question states \"Prevent the use of shared keys\"\nCorrect answer is \"A user delegation shared access signature (SAS)\", given that a SAS is a secured against the private key and we want to avoid shared keys.","upvote_count":"1"}],"upvote_count":"52","poster":"mykola_yakovliev","comment_id":"1025712","timestamp":"1696513080.0","content":"1. For the blobs - a user delegation SAS only\n\nTo maximize security it's better to use a user delegation SAS:\nFrom docs: As a security best practice, we recommend that you use Azure AD credentials when possible, rather than the account key, which can be more easily compromised. When your application design requires shared access signatures, use Azure AD credentials to create a user delegation SAS to help ensure better security.\n\nThis also prevents using shared keys & supports time-limited access. Note: user delegation SAS do not support stored access policies.\n\n2. For the file shares - Azure AD credentials\n\nIt fulfills the requirement to maximize security (the most secure way recommended by Microsoft), but doesn't support time-limited access, which is optional and has lower priority than security.\n\nSource: https://learn.microsoft.com/en-us/rest/api/storageservices/create-user-delegation-sas."},{"upvote_count":"5","comment_id":"1234617","content":"User Delegation SAS (for blobs):\n\nSecurity: User delegation SAS uses Azure AD credentials to generate the SAS token, providing a higher level of security.\nTime-limited access: SAS tokens can be configured with specific start and expiry times, supporting time-limited access.\nAzure AD Credentials (for file shares):\n\nSecurity: Azure AD provides secure authentication and authorization, eliminating the need for shared keys.\nAccess Management: Azure AD allows fine-grained access control and integration with SMB protocol for file shares.","timestamp":"1718987340.0","poster":"23169fd"},{"comment_id":"1310829","poster":"[Removed]","content":"WRONG\n\nFor the blobs: A user delegation shared access signature (SAS) only\n\nFor the file shares: Azure AD credentials\n\n(Keyword: maximize security)","timestamp":"1731436800.0","upvote_count":"3"},{"poster":"Thanveer","comment_id":"1307328","upvote_count":"2","timestamp":"1730805120.0","content":"For the Blobs:\nc)A user delegation shared access signature (SAS)\n\nFor the File Shares:\na) Azure AD credentials","comments":[{"comment_id":"1307330","content":"Correction: -\n\nFor the Blobs:\na)A user delegation shared access signature (SAS)\n\nFor the File Shares:\na) Azure AD credentials","poster":"Thanveer","upvote_count":"1","timestamp":"1730805420.0"}]},{"upvote_count":"1","timestamp":"1729169220.0","content":"a user delegation SAS only\nAzure AD credentials\nhttps://learn.microsoft.com/en-us/rest/api/storageservices/create-user-delegation-sas","poster":"cosmicT73","comment_id":"1299218"},{"comment_id":"1288423","timestamp":"1727158380.0","upvote_count":"2","content":"Stored access policies allow you to define a set of permissions on a container or blob that you can associate with a service-level SAS (signed with the storage account key), whereas a user delegation SAS is signed with EntraID credentials. So it should be SAS only for the 1st option","poster":"Arthur_zw"},{"comment_id":"1274478","upvote_count":"2","content":"I think the correct answer should be: \n - For the blobs: 'a user delegation SAS only' (more secure and granular access control)\n - For the file shares: 'Azure AD credentials'\n \nBut who knows..","poster":"salned","timestamp":"1724933280.0"},{"upvote_count":"2","timestamp":"1716196140.0","comment_id":"1214248","content":"This question appeared in my exam on 13th May 2024. The given answer is correct.","poster":"rtsh06"},{"content":"i agree with \n1. A user delegation SAS only\n2. Azure AD credentials","poster":"Lazylinux","timestamp":"1714360380.0","comment_id":"1203780","upvote_count":"2"},{"poster":"varinder82","comment_id":"1177890","upvote_count":"3","content":"Final Answer :\n1. A user delegation SAS only\n2. Azure AD credentials","timestamp":"1710904620.0"},{"poster":"randy0077","timestamp":"1697688720.0","upvote_count":"4","comment_id":"1047506","content":"Answer:\n\n- user delegation SAS only \n- AzureAD authentication"},{"poster":"U4ea","comment_id":"1043445","comments":[{"poster":"ec2user","timestamp":"1697547720.0","upvote_count":"8","comment_id":"1046021","content":"A user delegation SAS is supported for Azure Blob Storage and Azure Data Lake Storage Gen2. Stored access policies are not supported for a user delegation SAS.\nhttps://learn.microsoft.com/en-us/rest/api/storageservices/create-user-delegation-sas\n\nso since user delegated SAS isn't supported for file share, the only answer left is Azure AD credentials for question 2 and has to be the answer(though incomplete) for this specific question."}],"timestamp":"1697288220.0","upvote_count":"2","content":"I'm not 100% sure on the correct answers but found the following info:\n\n\"Stored access policies are not supported for the user delegation SAS or the account SAS.\"\nhttps://learn.microsoft.com/en-us/rest/api/storageservices/define-stored-access-policy\nSo \"user SAS + stored access policies\" are wrong at least for both questions.\n\nFile Share doesn't allow Azure AD (only AD DS like btboudreaux said) login so I guess it is regular user SAS for question2?\nIt feels wrong though."},{"comment_id":"1039115","timestamp":"1696905240.0","content":"I'm confused about the File Shares part of the question. \nThe question states that the File Shares will be accessed over SMB. According to this documentation, and testing, you cannot access File Shares via SMB by Azure AD alone. You need On Prem Synced accounts or Azure ADDS. \nhttps://learn.microsoft.com/en-us/azure/storage/files/storage-files-active-directory-overview","poster":"btboudreaux","comments":[{"upvote_count":"2","comment_id":"1167018","timestamp":"1709715000.0","poster":"chair123","content":"That's interestingly true"}],"upvote_count":"3"}],"question_id":63,"answer":"","timestamp":"2023-10-05 15:38:00","url":"https://www.examtopics.com/discussions/microsoft/view/122528-exam-az-305-topic-1-question-66-discussion/","exam_id":54,"answers_community":[],"question_text":"HOTSPOT\n-\n\nYou have an Azure subscription.\n\nYou plan to deploy five storage accounts that will store block blobs and five storage accounts that will host file shares. The file shares will be accessed by using the SMB protocol.\n\nYou need to recommend an access authorization solution for the storage accounts. The solution must meet the following requirements:\n\n• Maximize security.\n• Prevent the use of shared keys.\n• Whenever possible, support time-limited access.\n\nWhat should you include in the solution? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","topic":"1"},{"id":"D9G3tmXkJ8sP8u1gkNfY","topic":"1","question_id":64,"question_text":"HOTSPOT\n-\n\nYou have an Azure subscription. The subscription contains 100 virtual machines that run Windows Server 2022 and have the Azure Monitor Agent installed.\n\nYou need to recommend a solution that meets the following requirements:\n\n• Forwards JSON-formatted logs from the virtual machines to a Log Analytics workspace\n• Transforms the logs and stores the data in a table in the Log Analytics workspace\n\nWhat should you include in the recommendation? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer":"","answer_images":["https://img.examtopics.com/az-305/image219.png"],"answers_community":[],"answer_ET":"","discussion":[{"comments":[{"timestamp":"1698067860.0","upvote_count":"4","comment_id":"1051899","content":"and what was your score?","poster":"GeorgiAngelov"},{"poster":"TaoLu","content":"Box2 should be XPATH","upvote_count":"1","comment_id":"1068165","comments":[{"upvote_count":"6","comment_id":"1074133","timestamp":"1700323020.0","content":"For those arguing XPATH over KQL, as far as I can tell, XPATH can only filter (not transform) event log data that is sent to a Log Analytics workspace. KQL, on the other hand, can be used for ingestion-time transformations that allow for filtering or modification of incoming data before it's stored in a Log Analytics workspace. So Box 2 should indeed be KQL.\n\nReferences:\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/agents/data-collection-rule-azure-monitor-agent?tabs=portal#filter-events-using-xpath-queries\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/agents/azure-monitor-agent-transformation","comments":[{"content":"Microsoft recommends in their official documentation to use KQL to transform data at ingestion, but it seems that some people here are smarter than the creators of these tools :))","comment_id":"1150173","upvote_count":"8","comments":[{"content":"KQL is correct. Here is the link as reference for ingested-transformation:\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/data-collection-transformations#how-transformations-work:~:text=Transformations%20are%20defined%20in%20a%20data%20collection%20rule%20(DCR)%20and%20use%20a%20Kusto%20Query%20Language%20(KQL)%20statement","comment_id":"1167023","comments":[{"content":"** Ingestion-Time Transformation","poster":"chair123","timestamp":"1709715720.0","upvote_count":"1","comment_id":"1167025"}],"poster":"chair123","timestamp":"1709715660.0","upvote_count":"1"}],"poster":"xRiot007","timestamp":"1707911880.0"}],"poster":"mmarkiew"}],"timestamp":"1699741080.0"}],"poster":"Elecktrus","timestamp":"1697033160.0","comment_id":"1040726","content":"in the exam today 11-Oct. Answered:\nBox1 - Azure Monitor Data collection\nBox2 - KQL","upvote_count":"20"},{"poster":"vensub","timestamp":"1697989140.0","comment_id":"1050813","content":"For Box 2 - It should be KQL \nhttps://learn.microsoft.com/en-us/azure/azure-monitor/agents/azure-monitor-agent-transformation","upvote_count":"8"},{"comment_id":"1310137","poster":"[Removed]","upvote_count":"1","content":"CORRECT","timestamp":"1731334920.0"},{"poster":"Thanveer","timestamp":"1730824260.0","comment_id":"1307453","content":"Box1 - Azure Monitor Data collection\nBox2 - KQL","upvote_count":"1"},{"comments":[{"comment_id":"1234637","upvote_count":"4","poster":"23169fd","timestamp":"1718987760.0","content":"Why Not Other Options:\nForwarding the logs:\n\nLinked storage account: Primarily used for storing raw data, not directly for forwarding logs.\nService endpoint: Not typically used for log forwarding in this context.\nTransforming the logs:\n\nWQL query: Used for querying WMI data, not suitable for transforming JSON-formatted logs.\nXPath query: Used for querying XML data, not suitable for JSON-formatted logs."}],"poster":"23169fd","timestamp":"1718987700.0","upvote_count":"4","content":"Azure Monitor Data Collection Endpoint:\n\nWhy: This endpoint allows you to ingest data directly into a Log Analytics workspace from various sources, including virtual machines with the Azure Monitor Agent installed.\nKQL Query:\n\nWhy: Kusto Query Language (KQL) is used within Azure Monitor to transform and query log data, making it suitable for storing and analyzing the logs in a Log Analytics workspace.","comment_id":"1234636"},{"upvote_count":"2","poster":"Lazylinux","comment_id":"1203781","timestamp":"1714361040.0","content":"Given answer is correct\nBox1 - Azure Monitor Data collection\nBox2 - KQL"},{"timestamp":"1704279120.0","poster":"peterp007","upvote_count":"4","comment_id":"1112683","content":"DCE \nKQL\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/data-collection-transformations#how-transformations-work\n\"Transformations are defined in a data collection rule (DCR) and use a Kusto Query Language (KQL) statement that's applied individually to each entry in the incoming data. It must understand the format of the incoming data and create output in the structure expected by the destination.\""},{"timestamp":"1704278340.0","upvote_count":"1","poster":"kishoredeena","comment_id":"1112670","content":"Box2 - KQL feels appropriate\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/data-collection-transformations"},{"comment_id":"1107048","content":"For (2) you must consider \"Forwards JSON-formatted logs \". XPath can extract information from XML documents. For non-XML documents as in this case, KQL is the suggested approach.","timestamp":"1703699460.0","upvote_count":"1","poster":"Aryan171"},{"comment_id":"1076123","content":"Appeared on 11/21/2023","upvote_count":"4","poster":"ManosCaptain","timestamp":"1700555580.0"},{"upvote_count":"2","poster":"Tay2234","timestamp":"1700230260.0","content":"For Box 2 - It should be KQL\n https://learn.microsoft.com/en-us/azure/azure-monitor/essentials/data-collection-transformations-structure","comment_id":"1073376"},{"poster":"malcubierre","content":"Should be XPath: https://learn.microsoft.com/en-us/azure/azure-monitor/agents/data-collection-rule-azure-monitor-agent?tabs=portal","upvote_count":"1","timestamp":"1699794420.0","comment_id":"1068532","comments":[{"content":"XPath just collects the data. it does NOT transform the data KQL Query Language is used to transform the collected data.\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/data-collection-transformations-structure","upvote_count":"1","poster":"BShelat","timestamp":"1702437660.0","comment_id":"1095108"}]},{"poster":"mykola_yakovliev","comment_id":"1025731","comments":[{"upvote_count":"11","comments":[{"timestamp":"1699741200.0","upvote_count":"1","comment_id":"1068166","content":"Who told you XPath can only used for XML?","poster":"TaoLu"}],"comment_id":"1027792","poster":"TheOlli","content":"XPath is for XML only. KQL can query JSON. AFAIK.","timestamp":"1696749840.0"},{"upvote_count":"6","content":"To forward the logs: Use the Azure Monitor Agent. The Azure Monitor Agent can collect different types of data into a Log Analytics workspace, including JSON-formatted logs from your virtual machines.\n\nTo transform the logs and store the data: Use Kusto Query Language (KQL). Once the data is in the Log Analytics workspace, you can write KQL queries to transform the logs and store the data in a table in the workspace. KQL is a read-only request to process data and return results.","poster":"kayceeec","comment_id":"1039989","timestamp":"1696982220.0"}],"upvote_count":"8","timestamp":"1696513800.0","content":"The first answer is correct (https://learn.microsoft.com/en-us/azure/azure-monitor/agents/data-collection-rule-azure-monitor-agent)\n\nTo transform the logs and store the data use an XPath query (https://learn.microsoft.com/en-us/azure/azure-monitor/agents/data-collection-rule-azure-monitor-agent#filter-events-using-xpath-queries)."}],"timestamp":"2023-10-05 15:50:00","exam_id":54,"url":"https://www.examtopics.com/discussions/microsoft/view/122532-exam-az-305-topic-1-question-67-discussion/","question_images":["https://img.examtopics.com/az-305/image218.png"],"unix_timestamp":1696513800,"answer_description":"","isMC":false},{"id":"gBIVG2rSSQWqCUD5w5ay","answers_community":[],"answer_images":["https://img.examtopics.com/az-305/image242.png"],"unix_timestamp":1704655080,"question_text":"HOTSPOT\n-\n\nYou have five Azure subscriptions. Each subscription is linked to a separate Azure AD tenant and contains virtual machines that run Windows Server 2022.\n\nYou plan to collect Windows security events from the virtual machines and send them to a single Log Analytics workspace.\n\nYou need to recommend a solution that meets the following requirements:\n\n• Collects event logs from multiple subscriptions\n• Supports the use of data collection rules (DCRs) to define which events to collect\n\nWhat should you recommend for each requirement? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer":"","timestamp":"2024-01-07 20:18:00","url":"https://www.examtopics.com/discussions/microsoft/view/130525-exam-az-305-topic-1-question-68-discussion/","isMC":false,"question_images":["https://img.examtopics.com/az-305/image241.png"],"exam_id":54,"answer_description":"","answer_ET":"","topic":"1","discussion":[{"comment_id":"1177892","content":"Final Answer:\n1: Azure Lighthouse\n2.Azure Monitor Agent","upvote_count":"25","timestamp":"1710904860.0","poster":"varinder82"},{"poster":"AmineD","comment_id":"1116901","comments":[{"comment_id":"1126830","poster":"JimmyYop","upvote_count":"14","timestamp":"1705683720.0","content":"answer to box 2 should be the 'Azure Monitor Agent' as Log Analytics Agent is on the path to be deprecated.\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/agents/log-analytics-agent"},{"upvote_count":"8","poster":"MiniLa92","content":"As per the link you provided, the second ans should be Azure Monitor agent. In doc it says \"Azure Monitor Agent uses data collection rules, where you define which data you want each agent to collect. Data collection rules let you manage data collection settings at scale and define unique, scoped configurations for subsets of machines. You can define a rule to send data from multiple machines to multiple destinations across regions and tenants.\"","comment_id":"1118733","timestamp":"1704899220.0","comments":[{"content":"It also mentions that \"If you have machines already deployed with legacy Log Analytics agents, we recommend you migrate to Azure Monitor Agent as soon as possible. The legacy Log Analytics agent will not be supported after August 2024.\"","poster":"MiniLa92","timestamp":"1704899340.0","comment_id":"1118735","upvote_count":"4"}]}],"content":"Box 1: Azure Lighthouse\n\nTo send data across tenants, you must first enable Azure Lighthouse.\n\nBox 2: Azure Log Analytics agent\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/agents/agents-overview#install-the-agent-and-configure-data-collection","timestamp":"1704740160.0","upvote_count":"11"},{"timestamp":"1731335100.0","poster":"[Removed]","upvote_count":"2","content":"WRONG\n\n1. Azure Lighthouse\n2. Azure Monitor Agent","comment_id":"1310141"},{"upvote_count":"2","timestamp":"1730806560.0","poster":"Thanveer","content":"Final Answer:\n1: Azure Lighthouse\n2.Azure Monitor Agent","comment_id":"1307346"},{"poster":"Teerawee","timestamp":"1725884880.0","content":"• To collect the event logs: Azure Lighthouse\n• To support the DCRs: The Azure Monitor agent","comment_id":"1280868","upvote_count":"1"},{"comment_id":"1203785","upvote_count":"6","content":"I would go for\nBox 1: Azure Lighthouse => multi-tenant so needs be created first\n\nBox 2: Azure Monitor Agent and works with DCR as Azure Log Analytics agent is depreciated","poster":"Lazylinux","timestamp":"1714361520.0"},{"poster":"SDiwan","timestamp":"1708459560.0","content":"This seems a bit confusing question. Azure light house is needed for multitenant management. As per documentation, it says log analytics workspace should be created at each tenant, and then \"You can run log queries to retrieve data across Log Analytics workspaces in different customer tenants by creating a union that includes multiple workspaces. \" . But in the question it says all logs need to be ingested to a single workspace. \nI would go for \"Azure lighthouse\" for the first one since eventgrid and purview are not related to the topic. Azure monitoring agent cannot natively send logs to event grid. 2nd answer is Azure monitoring agent.","upvote_count":"2","comment_id":"1154979"},{"upvote_count":"1","poster":"TonySuccess","comments":[{"upvote_count":"4","comment_id":"1132191","timestamp":"1706231040.0","content":"I will vote for Light house. Event logs need to be sourced to a Log Analytics workspace of MSP subscription set up by Lighthouse","poster":"TJ001"}],"comment_id":"1117285","content":"Yes this is a funny one because Lighthouse is needed to connect to multiple tenants, but Event Grid is needed to collect the logs. Since they are asking for a solution it's hard to assume lighthouse is already in place and select Event Grid...\n\nAnybody able to add to this?","timestamp":"1704787560.0"},{"content":"Shouldn't box1 be Azure Lighthouse?","timestamp":"1704655080.0","poster":"[Removed]","upvote_count":"4","comments":[{"upvote_count":"2","timestamp":"1704913080.0","poster":"[Removed]","content":"Had a second look at this and I think it should be Azure Lighthouse.\n\nhttps://learn.microsoft.com/en-us/azure/lighthouse/how-to/monitor-at-scale\n\n\nBut I think the second box is correct - AMA agent. The LA agent is gonna be deprecated in August 2024 and customers are already migrating away from it.","comment_id":"1118951"}],"comment_id":"1116119"}],"question_id":65}],"exam":{"numberOfQuestions":286,"isBeta":false,"lastUpdated":"12 Apr 2025","name":"AZ-305","isMCOnly":false,"id":54,"provider":"Microsoft","isImplemented":true},"currentPage":13},"__N_SSP":true}