{"pageProps":{"questions":[{"id":"whZNrv8wdwaWFEOi94QF","timestamp":"2021-12-15 08:36:00","answer_images":[],"discussion":[{"poster":"Greysi","upvote_count":"59","content":"Selected Answer: D\nParent policy must be in the same region as child policy!\nYou get this information when creating a Firewall Policy. Parent Policy drop down list only shows policies in the same region.\nExisting Firewall Policies are located in different regions. To link them to a new parent policy, each region must have a new parent policy => 3 new policies.","timestamp":"1641029760.0","comments":[{"comments":[{"comment_id":"576583","comments":[{"content":"Confirmed. Parent policy must be in the same region according to my work tenant.","comment_id":"629315","upvote_count":"1","poster":"LillyLiver","timestamp":"1657394100.0"},{"timestamp":"1655305620.0","comment_id":"616808","content":"You are the GOAT","poster":"sapien45","upvote_count":"1"}],"upvote_count":"9","timestamp":"1648437180.0","content":"\"Parent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.\"\n\nThat's from Azure Portal, showed for the field \"Parent Policy\" when creating a new policy or editing an existing one. We can't associate existing child policies to the new parent policy if their are not in the same region.\n\nSince our existing child policies are in 3 different regions, we would need 3 different parent policies.","poster":"FrancisFerreira"},{"upvote_count":"3","comment_id":"657603","content":"You will get 3 objects which you will need to maintain separately.","poster":"One111","timestamp":"1662136260.0"}],"poster":"SilverFox22","timestamp":"1641572520.0","comment_id":"519078","content":"It states in the question \"The new policy will be configured as a parent policy for the existing policies.\" So then just 1 policy, that will be inherited by the existing child policies.","upvote_count":"3"},{"upvote_count":"3","poster":"blacknurse","content":"I am in agreement with your answer. If you look at https://blog.cloud63.fr/azure-firewall/ then your premise is correct.","timestamp":"1641393120.0","comment_id":"517528"},{"upvote_count":"1","timestamp":"1695517320.0","comment_id":"1015409","content":"Answer seems to be D, bcoz of a known issue.\nAzure Firewall Policies can be used across regions. For example, you can create a policy in West US, and use it in East US.\nBut below is listed as known issue : Base policies must be in same region as local policy. https://learn.microsoft.com/en-us/azure/firewall-manager/overview#region-availability","poster":"Som_triv"}],"comment_id":"514450"},{"comments":[{"comment_id":"634018","timestamp":"1658317860.0","poster":"codingdown","upvote_count":"4","content":"Parent policy must be in the same region as child policy but firewall policy can be associated with firewalls across regions."}],"upvote_count":"32","poster":"Redimido","timestamp":"1644910140.0","comment_id":"547580","content":"Selected Answer: D\nTested in Portal. \n1. Created 1 named \"Parent\" policy in West Europe\n Created 1 named \"Child\" policy - in West US - unable to set \"Parent\" as parent policy. \n Changed region to West Europe, could directly chose \"Parent\" as parent.\n2. Created second policy named \"Parent2\" in West US.\n Went to the \"Child\" policy, still located in West Europe.\n Tried to choose Parent policy from the menu. The only parent that showed up was \"Parent\" also located in West Europe. \n\nConclusion: You can't set a Parent Policy from different region to a child in a given region.\nTherefore we need 3 different region policies to be set as parents if we do not change the child's regions."},{"content":"Selected Answer: B\nou can create one global parent Azure Firewall policy that applies mandatory rules across all existing Azure Firewall policies (child policies","poster":"robinhoHH","timestamp":"1732823460.0","upvote_count":"1","comment_id":"1319430"},{"comment_id":"1319018","content":"Selected Answer: D\nThe parent policy and the child policy must be in the same region.","timestamp":"1732769820.0","poster":"Thanveer","upvote_count":"1"},{"comment_id":"1311638","upvote_count":"1","content":"Selected Answer: C\nAm I the only one that wants to go for C. 2?\n\nYou create one policy as stated in the text. What is the minimum number of ADDITIONAL (adding onto the one that you already created) policies you need to create?","poster":"quincy273","timestamp":"1731533460.0"},{"poster":"[Removed]","upvote_count":"1","content":"Selected Answer: D\nD is correct","timestamp":"1731505920.0","comment_id":"1311301"},{"content":"Crappy wording. Create is not deploy.\n1 parent policy needs to be created.\n1 parent policy needs to be deployed 3 times.\nBut I'll go with D since I have learned to not read into the question what does not already exist. No assumptions can be made that someone is using automation to deploy a single policy 3 times..","upvote_count":"1","timestamp":"1730680920.0","poster":"Paputzback","comment_id":"1306725"},{"comment_id":"1302372","upvote_count":"1","timestamp":"1729759500.0","poster":"3c5adce","content":"B. 1 - You don't need to create three new policies. The existing policies are already in place for each region. The question only asks for a parent policy that manages rules across all regions, so you need to create just one parent policy"},{"upvote_count":"1","poster":"e1aa8c5","comment_id":"1262664","timestamp":"1723150200.0","content":"I'm so glad this wasn't a question that required mapping actually policy and firewalls and regions - considering the regions are all named differently to the regions they are in"},{"comment_id":"1216618","upvote_count":"1","timestamp":"1716472020.0","content":"Tested in a LAB. Answer is correct. Root policy must be in the same region as a child policy.","poster":"profesorklaus"},{"content":"Should not the answer be \"0\" ? If we update existing firewall policies with global configurations in all three regions then there may not be any need to have parent policy in any region.","timestamp":"1702259700.0","comment_id":"1092994","poster":"BShelat","upvote_count":"1"},{"comments":[{"poster":"rishisoft1","comment_id":"1183321","upvote_count":"1","content":"Hierarchical policies\nNew policies can be created from scratch or inherited from existing policies. Inheritance allows DevOps to create local firewall policies on top of organization mandated base policy.\nPolicies created with non-empty parent policies inherit all rule collections from the parent policy. The parent policy and the child policy must be in the same region. A firewall policy can be associated with firewalls across regions regardless where they're stored.\n\nhttps://learn.microsoft.com/en-us/azure/firewall-manager/policy-overview","timestamp":"1711458360.0"}],"content":"Selected Answer: B\nSorry but there isn't a strict requirement for the parent policy to be in the same region as the child policies. The parent policy and child policies can be associated with Azure Firewall instances in different regions. This is one of the benefits of Azure Firewall Manager—it allows you to manage firewall policies across regions from a centralized location.","poster":"Ale1973","upvote_count":"1","comment_id":"991597","timestamp":"1693156740.0"},{"comments":[{"upvote_count":"2","content":"Answer is : B","comment_id":"933963","timestamp":"1687744920.0","poster":"Trillionairejeffe"}],"poster":"Trillionairejeffe","timestamp":"1687744860.0","comment_id":"933962","content":"Hierarchical policies\nNew policies can be created from scratch or inherited from existing policies. Inheritance allows DevOps to create local firewall policies on top of organization mandated base policy.\n\nPolicies created with non-empty parent policies inherit all rule collections from the parent policy. The parent policy and the child policy must be in the same region. A firewall policy can be associated with firewalls across regions regardless where they are stored: \n\nhttps://learn.microsoft.com/en-us/azure/firewall-manager/policy-overview#hierarchical-policies","upvote_count":"2"},{"poster":"bd1234","comment_id":"837941","content":"B:\nFirewall Policy is the recommended method to configure your Azure Firewall. It's a global resource that can be used across multiple Azure Firewall instances in Secured Virtual Hubs and Hub Virtual Networks. Policies work across regions and subscriptions.","timestamp":"1678713540.0","upvote_count":"1"},{"timestamp":"1678197480.0","content":"Should be B.\nAs the global parent policy, all else Hierarchical policies should call local policies, different than we call child of global.","comment_id":"831965","poster":"bd1234","upvote_count":"1"},{"timestamp":"1675884420.0","comment_id":"802453","comments":[{"upvote_count":"1","content":"It seems you are right! https://learn.microsoft.com/en-us/azure/firewall-manager/rule-hierarchy","timestamp":"1679745540.0","comment_id":"850095","poster":"AzureMasterChamp"}],"poster":"Anzus","upvote_count":"4","content":"Selected Answer: B\nThe question states:\n\nYou need to deploy a new Azure Firewall policy that will contain mandatory rules for all Azure Firewall deployments. The new policy will be configured as a parent policy for the existing policies.\n\nIt also states that the policies are already created. If you need one for all of them, you only need to create 1, the \"Firewall Policy\" that is a global resource. Since this works as hub and spoke, you only need one to centrally manage the 3 policies that exist already."},{"comments":[{"upvote_count":"1","timestamp":"1675382580.0","content":"To have the existing policies linked to a new parent policy, each region must have a separate parent policy. Therefore, a minimum of 3 additional Azure Firewall policies would need to be created. The answer is D.","comment_id":"796548","poster":"VBK8579"}],"timestamp":"1675382520.0","comment_id":"796546","content":"Selected Answer: D\no have the existing policies linked to a new parent policy, each region must have a separate parent policy. Therefore, a minimum of 3 additional Azure Firewall policies would need to be created. The answer is D.","poster":"VBK8579","upvote_count":"2"},{"comment_id":"765432","content":"Selected Answer: D\nThe question says:\n\"The new policy will be configured as a parent policy for the existing policies.\"\nSo for you to have parent policy, have to deploy 3 policies for the child policies that are in the three regions..","upvote_count":"2","poster":"ServerBrain","timestamp":"1672824120.0"},{"timestamp":"1667469900.0","upvote_count":"1","poster":"pabloartgal","comment_id":"710406","content":"By searching for a little bit more information I think the correct answer is B.1 \nYou have two kind of hierarchical policies on Azure Firewall Manager; local policies and global policies. \nThe key is you can use Azure Firewall Manager to centrally manage Azure Firewall policies across multiple secured virtual hubs. For example, your global admin can author global firewall policies to enforce organization wide firewall policy across teams. Locally authored firewall policies allow a DevOps self-service model for better agility.\nAt the end of the document, you will be able to find some of the actual limitations with this kind of policy hierarchy:\nBase policies must be in same region as local policy. Create all your local policies in the same region as the base policy. You can still apply a policy that was created in one region on a secured hub from another region."},{"content":"There was a lot of debate in the comments so thought i'd test this out. \nI created a Firewall Policy within West Europe. \n\nWhen i created a secondary policy as a child it would ONLY allow me to select first policy if the region was the same. I tested with both Standard and Premium Policies.","timestamp":"1660570860.0","comment_id":"647219","upvote_count":"5","poster":"8eebs"},{"comment_id":"638292","upvote_count":"1","timestamp":"1658948580.0","poster":"shaojunni","content":"Answer is B, 1 parent policy. The new policy can contain one of existing policy as child policy, then include all the firewall rules from other 2 policies. What is the point to create 3 parent polices which only contains corresponding child policy?"},{"timestamp":"1658863200.0","comment_id":"637598","content":"Selected Answer: B\nIt is clear here that people are not familiar with Firewall Manager. Th answer is correct","poster":"AubinBakana","upvote_count":"2"},{"timestamp":"1658317980.0","poster":"codingdown","content":"Selected Answer: B\nParent policy must be in the same region as child policy but firewall policy can be associated with firewalls across regions.","upvote_count":"3","comment_id":"634021","comments":[{"poster":"JayBee65","content":"So you must have 3 policies, because currently there are 3 policies, each in different regions, so you need to create 3 parent policies, so D not B","timestamp":"1658908080.0","comment_id":"637904","upvote_count":"1"}]},{"upvote_count":"4","timestamp":"1657573800.0","comment_id":"630209","content":"Selected Answer: D\nA Parent policy must be in the same region as child policy.","comments":[],"poster":"SilverFox22"},{"comment_id":"627564","timestamp":"1657043040.0","poster":"bellorg","upvote_count":"1","content":"Correct naswer is 3, azure policy need to be Premium and in the same region"},{"poster":"Tsunami28","comments":[{"comment_id":"637907","upvote_count":"1","timestamp":"1658908260.0","poster":"JayBee65","content":"I don't understand what you are saying. Currently there are 3 policies. You need to create a parent policy for these policies, and as these policies are in different regions, and parent and child policy must be in the same region, you need to create 3 new policies, one in each region. This will give you 3 parent policies + 3 child policies = 6 policies."}],"upvote_count":"2","content":"I would like to chalenge you all, by saying that the correct answer is C(2).\nWhy? I agree that we need to have parent/child in the same region.\nSemantics of the question - they are saying that we need to deploy 1, and asking how much more additional ones? -> 1+2=3","timestamp":"1656530220.0","comment_id":"624864"},{"timestamp":"1653414540.0","upvote_count":"4","comment_id":"606849","content":"Selected Answer: D\nParent policy must be in the same region as child policy!","poster":"Gor"},{"upvote_count":"4","poster":"Teringzooi","content":"Selected Answer: D\nCorrect answer: D\nParent policy must be in the same region as child policy!","timestamp":"1651034940.0","comment_id":"592843"},{"content":"Selected Answer: B\nPolicies work across regions and subscriptions.\nhttps://docs.microsoft.com/en-us/azure/firewall-manager/policy-overview","comments":[{"comments":[{"poster":"codingdown","comment_id":"634020","content":"Parent policy must be in the same region as child policy but firewall policy can be associated with firewalls across regions.","upvote_count":"1","timestamp":"1658317920.0"}],"upvote_count":"3","content":"D - Changing my answer to D. Based on Known issues with Azure Firewall Manger which states that base policies must be in same region as local policy.\n\nhttps://docs.microsoft.com/en-us/azure/firewall-manager/overview","poster":"BrownHornet","comment_id":"581798","timestamp":"1649247360.0"}],"timestamp":"1648811100.0","upvote_count":"3","comment_id":"579442","poster":"BrownHornet"},{"timestamp":"1648529760.0","upvote_count":"5","comment_id":"577253","poster":"cloudera","content":"Selected Answer: B\nhttps://docs.microsoft.com/en-us/azure/firewall-manager/policy-overview"},{"poster":"FrancisFerreira","content":"Selected Answer: D\nWhereas we can push Firewall Policies to Firewalls in whatever regions and subscriptions, we can only have Parent Policies in the same region as their Child Policies.\n\nMind the premise: \"The new policy will be configured as a parent policy for the existing policies.\"\n\nYes, we could have only ONE policy created, and they assign it to all our firewalls. Thats NOT whats being asked though. They actually want a parent policies for the existing policies, and for that we need 3 new Firewall Policies (since our existing policies spam 3 different regions).\n\nCorrect Answer: D","comments":[{"poster":"FrancisFerreira","timestamp":"1648438020.0","upvote_count":"1","content":"It's pretty easy and fast to test this in the Azure Portal, btw.\nI (and others in this thread) have verified it.","comment_id":"576589"}],"upvote_count":"6","comment_id":"576587","timestamp":"1648437900.0"},{"poster":"Jhill777","comment_id":"574417","timestamp":"1648130940.0","upvote_count":"4","content":"Selected Answer: D\nQuestion states: \"The new policy will be configured as a parent policy for the existing policies\", not for firewall instances. The parent policy of child policies must be in the same region. Those policies can then be used on firewall instances in different regions."},{"upvote_count":"1","comment_id":"574369","poster":"pallmall","timestamp":"1648127700.0","content":"Selected Answer: B\nAnswer is B - Firewall policies work across regions and subscriptions. It clearly asks for creation, not assigning/pushing to the firewalls. So it's one policy to create.","comments":[{"timestamp":"1648437420.0","comment_id":"576584","upvote_count":"2","content":"You can assign a policy to firewall in whatever region or subscriptions, yeah. HOWEVER...\n\n\"Parent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.\"\n\nAnd it is clearly stated that the new policy will be created as a parent policy to the existing ones. The existing ones are spread across 3 regions. So we require 3 parents.\n\nCorrect Answer is D","poster":"FrancisFerreira"}]},{"comments":[{"poster":"Jhill777","content":"\"The new policy will be configured as a parent policy for the existing policies\"...not firewall instances. Parent policies need to be in the same region of child policies.","timestamp":"1648131000.0","comment_id":"574418","upvote_count":"1","comments":[{"upvote_count":"1","content":"This ^^\n\nWhereas we can push policies to firewalls in whatever regions and subscriptions, we can only have parent policies in the same region as their child policies. And that is the requirement, so...\n\nCorrect Answer is D","comment_id":"576585","timestamp":"1648437540.0","poster":"FrancisFerreira"}]}],"upvote_count":"1","poster":"Grafting","timestamp":"1648029180.0","comment_id":"573522","content":"Selected Answer: B\nAnswer is B. The question states how many additional firewall policies to create so you are creating 1 policy but pushing this out to 3 firewalls due to 3 different regions. The question does not ask how many firewall policies need to be assigned as then the answer will be D. So, in this case the answer is B"},{"timestamp":"1647351060.0","content":"Answer is D:\nParent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.","comment_id":"568417","upvote_count":"3","poster":"Pak149"},{"content":"https://docs.microsoft.com/en-us/azure/firewall-manager/overview says: \nCentral Azure Firewall deployment and configuration\nYou can centrally deploy and configure multiple Azure Firewall instances that span different Azure regions and subscriptions.\n\nBut known issues says:\nBase policies must be in same region as local policy \n\n\nCreate all your local policies in the same region as the base policy. You can still apply a policy that was created in one region on a secured hub from another region. \n\nInvestigating\n\nI think the answer should be B, but since there is a known issue, people think it's D.","upvote_count":"3","timestamp":"1647261660.0","poster":"p3nz0r","comment_id":"567635"},{"upvote_count":"5","poster":"ashxos","timestamp":"1646916420.0","comment_id":"564796","content":"Selected Answer: D\nD : Correct\n\nTo link child policy to Parent Policy, it should be in same region, otherwise the Parent policy will not be available for selection. So for 3 regions, 3 Parent policies will be required.\nYou can test the same by creating Firewall policies using azure portal."},{"upvote_count":"3","content":"Selected Answer: D\nEach region will require its own Parent Policy as below text from Firewall Policy creation windows does not allow to use Parent Policy for multiple region.\n\nhttps://portal.azure.com/#create/Microsoft.FirewallPolicy\n\nParent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.","poster":"ashxos","comment_id":"564794","timestamp":"1646916180.0"},{"poster":"examlearner","comment_id":"548464","timestamp":"1645004940.0","content":"Guys you need 3 Policies one for each Region. The following text is from the Portal when creating Azure firewall policy-\"Parent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.\"","upvote_count":"1"},{"content":"Answer is correct just tested it. Created one azure firewall policy in one region and was able to use it in other firewalls in other regions.","poster":"Bluediamond","timestamp":"1644778380.0","comment_id":"546652","upvote_count":"4","comments":[{"timestamp":"1648131120.0","comment_id":"574419","content":"That's not what the question asks. \"The new policy will be configured as a parent policy for the existing policies.\" Nobody is debating whether you can deploy the policies to firewalls in different regions.","upvote_count":"1","poster":"Jhill777"}]},{"comment_id":"544831","content":"Selected Answer: D\nI've not tested this (not willing to pay), but all the evidence here that specifically references parent policies indicate (with screenshots), that parent/child policies must be in the same region - however policies do not need to be in the same region as their firewalls. So the correct way would be to have all policies in a single region, with one parent.\n\nHowever the scenario shows policies in separate regions, so I'm going with D","poster":"DoolyMilly","timestamp":"1644523260.0","upvote_count":"5"},{"comment_id":"544003","upvote_count":"3","timestamp":"1644430980.0","content":"Selected Answer: D\nBecause of 3 regions.","poster":"Gall"},{"timestamp":"1644417240.0","comment_id":"543832","poster":"ohjee","content":"Struggeling whether 1 or 3 might be correct. The Azure portal says \"Parent policy must be in the same region as child policy. Firewall policy can be associated with Firewalls across regions regardless of where they are stored.\"\nI would assume that 1 is correct since that new policy should be \"mandatory for all Firewall deployments\". And NOT \"should be parent for all existing child policies\". So we create 1 parent policy and have to redeploy the child policies to the same region as the parent policy. Then the regionally deistributed firewall deployments (sic! not \"Firewall policy deployments\") use this policy set as mandatory policy set.","upvote_count":"1"},{"comment_id":"539122","upvote_count":"4","content":"Selected Answer: B\nhttps://docs.microsoft.com/en-us/azure/firewall-manager/policy-overview#:~:text=Policies%20work%20across%20regions%20and%20subscriptions","timestamp":"1643829720.0","poster":"itmaster"},{"comment_id":"520657","content":"Selected Answer: B\n\"Create a global Azure Firewall policy to govern the security posture across the global network environment, and then assign it to all Azure Firewall instances. This allows for granular policies to meet the requirements of specific regions, by delegating incremental Azure Firewall policies to local security teams, via RBAC.\"\n\nhttps://docs.microsoft.com/en-us/azure/architecture/networking/guide/well-architected-framework-azure-firewall#general-administration-and-governance","timestamp":"1641791580.0","upvote_count":"6","poster":"kevino81"},{"poster":"Eltooth","upvote_count":"5","timestamp":"1639553760.0","comment_id":"501954","content":"Correct answer - B\nOnly one policy is needed to rule them all and can span multi region firewall/policies."}],"answer_ET":"D","answers_community":["D (81%)","Other"],"topic":"4","isMC":true,"choices":{"D":"3","A":"0","B":"1","C":"2"},"answer_description":"","unix_timestamp":1639553760,"url":"https://www.examtopics.com/discussions/microsoft/view/68003-exam-az-305-topic-4-question-11-discussion/","question_images":["https://www.examtopics.com/assets/media/exam-media/04224/0019100001.png"],"question_text":"You have the Azure resources shown in the following table.\n//IMG//\n\nYou need to deploy a new Azure Firewall policy that will contain mandatory rules for all Azure Firewall deployments. The new policy will be configured as a parent policy for the existing policies.\nWhat is the minimum number of additional Azure Firewall policies you should create?","exam_id":54,"answer":"D","question_id":156},{"id":"C12LoO5F0yHBGpWkRyUj","question_images":[],"answers_community":["B (81%)","Other"],"url":"https://www.examtopics.com/discussions/microsoft/view/122756-exam-az-305-topic-4-question-110-discussion/","answer_description":"","answer_ET":"B","unix_timestamp":1696671600,"answer":"B","exam_id":54,"discussion":[{"comment_id":"1027226","poster":"Geekyhunchback","content":"Selected Answer: B\nIn order to minimize administrative effort, I believe Azure App Service is the right answer","upvote_count":"20","timestamp":"1696671600.0"},{"content":"Selected Answer: B\nThe competition between App service and VMSS as AKS is out due to major change to do so\nApp service is PaaS and VMSS is IaaS but administrative effort to be minimized, also you can run Multiple apps per instance by using App Service plan, also Web hosting is builtin, application composition is predominantly Apps and Containers \n\nVMSS => Azure VMs can automatically scale by using virtual machine scale sets. This capability isn't strictly a PaaS, but it's the type of management feature found in PaaS.There's a tradeoff between control and ease of management. IaaS gives the most control, flexibility, and portability, but you have to provision, configure, and manage the VMs and network components you create hence is very administrative intense. Also application composition is AGNOSTIC hence more complex for this scenario\n\nSo based on the above App services is winner (B)","timestamp":"1713919740.0","upvote_count":"5","poster":"Lazylinux","comment_id":"1201070"},{"comment_id":"1411296","content":"Selected Answer: D\nFrankly, a confusing question... While B seems like the logical answer, programmatically speaking, if the app needs significant work to containerize, it means they are doing something unusual and it probably won't run without rework on App Service as well...","poster":"ahhatem","upvote_count":"1","timestamp":"1743166140.0"},{"comment_id":"1351056","upvote_count":"2","poster":"7f3f6bd","timestamp":"1738601820.0","content":"Selected Answer: B\n\"App1 is an interactive app that users access by using HTTPS connections.\"\n\nAzure App Service is designed for web applications (HTTPS-based, interactive apps).\nAzure Batch and Virtual Machine Scale Sets (VMSS) are not optimized for direct HTTPS access.\n\"The number of connections to App1 changes significantly throughout the day.\"\n\nAuto-scaling is required to handle varying loads.\nApp Service has built-in auto-scaling without extra admin effort.\n\"Administrative effort must be minimized.\"\n\nApp Service is fully managed, meaning no need to manage VMs, clusters, or networking manually.\nAKS (Kubernetes) and VMSS require more admin effort (not the best choice for a simple web app)."},{"timestamp":"1731597360.0","content":"Selected Answer: B\nB is correct","upvote_count":"2","comment_id":"1312094","poster":"[Removed]"},{"comment_id":"1240584","upvote_count":"2","content":"What is the correct answer please? Azure App service looks possible but answer is marked as Azure VM scale set. Anyone confirm?","poster":"Tharassiyil","timestamp":"1719900060.0"},{"poster":"23169fd","timestamp":"1719405780.0","content":"Selected Answer: B\nAzure App Service can run multiple instances of an app, and it can automatically scale the number of instances based on load, minimizing administrative effort.\nIt supports Java applications and can handle HTTPS connections natively.\nApp Service provides built-in load balancing and traffic management, which helps in managing the fluctuating number of connections.","upvote_count":"2","comment_id":"1237452"},{"upvote_count":"1","poster":"arnitjoe","content":"This is a tricky one because minimize admin effort is stated but not clearly defined. Is it minimize admin effort to migrate or maintain or both? If migrate or both I would lean towards VMSS. If maintain, then Azure App Service.","comment_id":"1204711","timestamp":"1714505280.0","comments":[{"upvote_count":"1","timestamp":"1736923260.0","comment_id":"1340699","content":"Since migrate is a one time thing and maintaining is like as long as your app is up and running, what would be your wildest guess?","poster":"chrillelundmark"}]},{"content":"Selected Answer: B\nApp Service app does not need to be containerized","upvote_count":"2","timestamp":"1709893440.0","poster":"rumino","comment_id":"1168733"},{"comment_id":"1118827","content":"Selected Answer: B\nIf your application requires major changes to run in a container, and you want to minimize administrative effort, Azure App Service is likely the better choice. It abstracts away many infrastructure management tasks and provides a simpler deployment model for applications.\n\nAzure Virtual Machine Scale Sets might be more suitable when you need more control over the virtual machines, have specific configuration requirements, or if you need to run the application on a specific operating system.","poster":"[Removed]","upvote_count":"4","timestamp":"1704904200.0"},{"comment_id":"1093574","comments":[{"timestamp":"1715190240.0","poster":"NguyenDo","content":"However, while VM Scale Sets do provide the ability to scale and run multiple instances, they typically require more administrative effort compared to Azure App Service. You would need to manage the VMs, including tasks like OS updates, security, and scaling configurations.\n\nAs for Azure App Service, it's a fully managed platform, meaning it handles most of the infrastructure management tasks. While it's true that some code modifications might be needed when migrating an application to Azure App Service, the question states that App1 requires major changes to run in a container, not specifically for Azure App Service.\n\nIn general, Azure App Service is designed to support a broad range of languages and frameworks, including Java, and it's often possible to migrate applications with minimal changes. The exact amount of modification required would depend on the specifics of the application.","comment_id":"1208491","upvote_count":"2"}],"upvote_count":"3","content":"Selected Answer: D\nD. Azure Virtual Machine Scale Sets\n\nAdministration effort must be minimized. Switching to Azure App service would require code modifications","timestamp":"1702305180.0","poster":"ziggy1117"},{"content":"Selected Answer: D\nIt is not a containerized application. So AKS is out of question. VMSS is the only solution considering the scaling requirements.","timestamp":"1698404760.0","poster":"sumaju","comments":[{"poster":"cesco1286","timestamp":"1702225740.0","comment_id":"1092656","upvote_count":"3","content":"have you ever ever deployed an app service? Do you know that you can have auto-scaling based on many metrics?"}],"comment_id":"1055498","upvote_count":"5"},{"timestamp":"1698284340.0","comments":[{"upvote_count":"3","poster":"sumaju","comment_id":"1055494","content":"\"App1 requires major changes to run in a container\". AKS can run only containerized applications. So VMSS is the only option.","timestamp":"1698404640.0"}],"poster":"Hammer84","upvote_count":"1","content":"Selected Answer: C\nAzure Batch (Option A) is more suitable for high-performance computing workloads and batch processing rather than running interactive, stateful applications like App1. Azure App Service (Option B) is designed for hosting web applications, but it may not provide the same level of control and flexibility as AKS, especially for complex applications like App1. Azure Virtual Machine Scale Sets (Option D) can be used for scalable VM deployments, but it doesn't provide the same level of container orchestration and automatic scaling that AKS offers for containerized applications.\n\nSo, for the given scenario and requirements, Azure Kubernetes Service (AKS) is the recommended solution.","comment_id":"1054225"},{"content":"Selected Answer: B\nAbsolutely Azure App Service.\n\"requires major changes to run in a container\" so Azure Kubernetes Service discarded. No need for Azure Batch. Azure Virtual Machine Scale Sets is bigger a burden and setup.","poster":"pabsinaz","timestamp":"1697533260.0","comment_id":"1045736","comments":[{"timestamp":"1697534280.0","comment_id":"1045759","content":"Also, Azure App Service has horizontal autoscaling to adjust the number of instances automatically based on thresholds.","upvote_count":"2","poster":"pabsinaz"}],"upvote_count":"4"},{"upvote_count":"2","content":"Selected Answer: B\nB.\n\nEcho what Geekyhunchback said.","timestamp":"1696924020.0","poster":"alfaAzure","comment_id":"1039272"}],"timestamp":"2023-10-07 11:40:00","question_id":157,"answer_images":[],"choices":{"B":"Azure App Service","C":"Azure Kubernetes Service (AKS)","D":"Azure Virtual Machine Scale Sets","A":"Azure Batch"},"isMC":true,"topic":"4","question_text":"Your on-premises datacenter contains a server that runs Linux and hosts a Java app named App1. App1 has the following characteristics:\n\n• App1 is an interactive app that users access by using HTTPS connections.\n• The number of connections to App1 changes significantly throughout the day.\n• App1 runs multiple concurrent instances.\n• App1 requires major changes to run in a container.\n\nYou plan to migrate App1 to Azure.\n\nYou need to recommend a compute solution for App1. The solution must meet the following requirements:\n\n• The solution must run multiple instances of App1.\n• The number of instances must be managed automatically depending on the load.\n• Administrative effort must be minimized.\n\nWhat should you include in the recommendation?"},{"id":"MsY2QJG2sgoZmWKGRKLP","url":"https://www.examtopics.com/discussions/microsoft/view/123825-exam-az-305-topic-4-question-111-discussion/","exam_id":54,"answer_description":"","unix_timestamp":1697533680,"timestamp":"2023-10-17 11:08:00","answer_images":["https://img.examtopics.com/az-305/image236.png"],"question_text":"HOTSPOT\n-\n\nYou have an Azure App Service web app named Webapp1 that connects to an Azure SQL database named DB1. Webapp1 and DB1 are deployed to the East US Azure region.\n\nYou need to ensure that all the traffic between Webapp1 and DB1 is sent via a private connection.\n\nWhat should you do? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","topic":"4","answers_community":[],"isMC":false,"answer":"","discussion":[{"comment_id":"1056820","poster":"OrangeSG","content":"Box 1: 2 subnets\nCreate a virtual network that contains at least 2 subnets. One for the Azure App Service VNet Integration and another for the Azure Private Link.\n\nBox 2: a private DNS zone\nConfigure name resolution to use a private DNS zone. This is necessary for the web app to work with Azure DNS private zones.","upvote_count":"28","comments":[{"upvote_count":"7","comment_id":"1060633","timestamp":"1698936900.0","poster":"kodathedog","content":"Private Endpoints do not require their own subnet - see https://learn.microsoft.com/en-us/azure/private-link/private-link-faq :\n\"Do I require a dedicated subnet for Private Endpoints?\nNo. You don't require a dedicated subnet for Private Endpoints. You can choose a Private Endpoint IP from any subnet from the VNet where your service is deployed.\"","comments":[{"comment_id":"1082791","upvote_count":"28","content":"You are correct that Private Endpoint does NOT require a dedicated subnet, but when you use Web Apps inside a VNet, then delegation (integration) comes into place. If the subnet of the Web App has a delegation (Microsoft.Web/serverFarms) nothing can be created in that subnet besides the \"Microsoft.Web/serverFarms\". So it is NOT possible to create Private Endpoint in a delegated subnet.\n\nSo in this case you need a VNet. In that VNet you create a subnet for Web Apps with delegation. You need another subnet for the Private Endpoint to connect to the SQL database. \n\nAnswer:\n2 subnets (1x Private Endpoint; 1x Web Apps)\nA private DNS zone","poster":"fodocel235","timestamp":"1701193500.0"}]}],"timestamp":"1698583980.0"},{"upvote_count":"6","poster":"cesco1286","content":"People that respond in here never used Azure. You need Virtual network integration for a Web App to talk with a service inside a Vnet. And you need a different subnet for the SQL Private endpoint. So you need at the very least 2 subnets to have this working","comment_id":"1092661","timestamp":"1702226100.0"},{"timestamp":"1738734300.0","comment_id":"1351724","upvote_count":"1","poster":"junkz","content":"i would argue that second box is azure private dns resolver. yes, you do need a private dns zone to integrate the SQL PE, however thw question is what do you need to configure on VNET level. so on vnet, the dns servers has two options: azure-provided and custom. on custom, you can only add IPs. private DNS zones are FQDN based. so, my take is that NOTHING should be changed at VNET level (and leave the default zure private dns resolver. in place), as long as the private DNS zone is linked to the VNET already"},{"content":"WRONG\n\n2 Subnets\n\nA private DNS zone","timestamp":"1731597780.0","comment_id":"1312101","upvote_count":"2","poster":"[Removed]"},{"timestamp":"1713921600.0","comment_id":"1201075","upvote_count":"3","poster":"Lazylinux","content":"2 Subnets - vNET integration + Private EP (Note subnet is not dedicated to EP and can be other subnet but not Integration subnet hence another subnet must be provisioned), \nPrivate EP require private DNS in this scenario"},{"comment_id":"1187977","content":"Box1: 2 VNETs\nBox2: Private DNS zone\n\nI have been working with PE/PLs for the past 3 years, so MS tells us that PEs don't go along with delegated subnets as in this case with the webapp and the SQL PE.\n\nAny Subnet that has been delegated (as in webapp VNET integration), doesn't support to have a PE inside it.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-network/subnet-delegation-overview#effect-of-subnet-delegation-on-your-subnet\n\n\"Each Azure service defines their own deployment model, where they can define what properties they do or don't support in a delegated subnet for injection purposes as follows:\n\nCan't be used with a private endpoint if the subnet is delegated.\"","poster":"cris_exam","timestamp":"1712055120.0","comments":[{"poster":"cris_exam","comments":[{"poster":"go4adil","timestamp":"1713524640.0","comment_id":"1198550","content":"Correct. Box1: 2 Subnets\n\n\"Virtual network integration depends on a dedicated subnet.\"\nhttps://learn.microsoft.com/en-us/azure/app-service/overview-vnet-integration","upvote_count":"1"}],"comment_id":"1187978","content":"sorry = correction\nBox1: 2 Subnets","upvote_count":"2","timestamp":"1712055180.0"}],"upvote_count":"2"},{"upvote_count":"1","timestamp":"1711040220.0","poster":"kodjoa2024","content":"Azure App Service VNet Integration required dedicated subnet and we need second subnet for IP address of Private Link.","comment_id":"1179440"},{"timestamp":"1699867260.0","comment_id":"1069176","comments":[{"timestamp":"1700061660.0","poster":"a03","comment_id":"1071572","content":"in this example are 2 subnets\nwebappsSubnet: 10.1.2.0.24\nsqlSubnet: 10.1.1.0/24","upvote_count":"4"}],"poster":"kodathedog","upvote_count":"3","content":"This is a nasty question.\n\n1 subnet would be sufficient if the App only needs inbound traffic, because Private Endpoints only support Inbound traffic - \"Private endpoint is only used for incoming traffic to your app. Outgoing traffic won't use this private endpoint. You can inject outgoing traffic to your network in a different subnet through the virtual network integration feature.\" - https://learn.microsoft.com/en-us/azure/app-service/overview-private-endpoint\n\nSo you need Virtual Network Integration as well as a private endpoint for the app, to enable the app to talk to the database.\n\nFor example, see https://gregorsuttie.com/2023/01/16/azure-web-app-using-azure-sql-using-private-endpoints/"},{"comment_id":"1061669","content":"2 subnets. one for the DB and one for the app service. https://learn.microsoft.com/en-us/azure/app-service/overview-vnet-integration#subnet-requirements","upvote_count":"2","timestamp":"1699036920.0","poster":"JazzyStahh"},{"comment_id":"1061071","timestamp":"1698985320.0","upvote_count":"1","content":"given answer is correct.","poster":"randy0077"},{"poster":"pabsinaz","comment_id":"1045741","upvote_count":"3","timestamp":"1697533680.0","content":"Correct answer.\n1 subnet and Private DNS zone."}],"question_images":["https://img.examtopics.com/az-305/image235.png"],"question_id":158,"answer_ET":""},{"id":"ORGWSdJJm3J0nv55X73y","discussion":[{"upvote_count":"16","poster":"matanzpl","timestamp":"1697193000.0","content":"Correct answers\n\nbox1: ent app (required for MFA in conditional access)\nbox2: azure ad app proxy","comment_id":"1042567"},{"comment_id":"1056835","poster":"OrangeSG","timestamp":"1698585540.0","content":"Box 1: An app registration\nThis allows App1 to use Azure AD for authentication.\nhttps://learn.microsoft.com/en-us/answers/questions/270680/app-registration-vs-enterprise-applications\n\nBox 2: a server that runs windows server and has the Azure AD Application Proxy connector installed\nOn-premises: A server that runs Windows Server and has the Azure AD Application Proxy connector installed. This allows App1 to be accessed from outside the on-premises network without a VPN.","upvote_count":"8","comments":[{"content":"The application doesn't do the authentication, this is handled by the App Proxy service, see https://learn.microsoft.com/en-us/entra/identity/app-proxy/application-proxy-security\n\nThe service requires an Enterprise Application to be created, see https://learn.microsoft.com/en-us/entra/identity/app-proxy/application-proxy-add-on-premises-application - see section \"Add an on-premises app to Microsoft Entra ID\", \"2. Browse to Identity > Applications > Enterprise applications\".","upvote_count":"6","timestamp":"1699003920.0","comment_id":"1061227","poster":"kodathedog"}]},{"upvote_count":"2","comment_id":"1312103","content":"CORRECT","poster":"[Removed]","timestamp":"1731598020.0"},{"upvote_count":"1","timestamp":"1711366980.0","poster":"prshntdxt7","content":"answers are correct, there's another similar mcq in earlier topics with same answer.","comment_id":"1182432"},{"timestamp":"1708332900.0","upvote_count":"3","content":"Provided answers are correct - https://learn.microsoft.com/en-us/entra/identity/app-proxy/application-proxy-add-on-premises-application#add-an-on-premises-app-to-microsoft-entra-id","comment_id":"1153793","poster":"techtest848"}],"question_text":"HOTSPOT\n-\n\nYour on-premises network contains an Active Directory Domain Services (AD DS) domain. The domain contains a server named Server1. Server1 contains an app named App1 that uses AD DS authentication. Remote users access App1 by using a VPN connection to the on-premises network.\n\nYou have an Azure AD tenant that syncs with the AD DS domain by using Azure AD Connect.\n\nYou need to ensure that the remote users can access App1 without using a VPN. The solution must meet the following requirements:\n\n• Ensure that the users authenticate by using Azure Multi-Factor Authentication (MFA).\n• Minimize administrative effort.\n\nWhat should you include in the solution? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_id":159,"answers_community":[],"timestamp":"2023-10-13 12:30:00","question_images":["https://img.examtopics.com/az-305/image237.png"],"answer":"","answer_description":"","unix_timestamp":1697193000,"url":"https://www.examtopics.com/discussions/microsoft/view/123521-exam-az-305-topic-4-question-112-discussion/","answer_ET":"","exam_id":54,"answer_images":["https://img.examtopics.com/az-305/image238.png"],"topic":"4","isMC":false},{"id":"8evxnebLin0UQVI8mXmH","answer":"D","unix_timestamp":1696843560,"question_images":[],"discussion":[{"upvote_count":"7","timestamp":"1698586680.0","comment_id":"1056848","poster":"OrangeSG","content":"Selected Answer: D\nMutual TLS (mTLS) authentication is natively supported by Azure API Management and can be enabled in Kubernetes by installing an Ingress Controller. This approach simplifies the microservices as the authentication will be performed in the Ingress Controller. This solution also meets the requirements of implementing mTLS authentication between APIM1 and AKS1, minimizing development effort, and minimizing costs.\n\nPlease note that while deploying an ingress controller to AKS1, you should ensure that it supports mTLS. Examples of enterprise-level ingress controllers that support mTLS include NGINX and AGIC1.\n\nhttps://learn.microsoft.com/en-us/azure/api-management/api-management-kubernetes"},{"timestamp":"1731598140.0","content":"Selected Answer: D\nD is correct","comment_id":"1312104","poster":"[Removed]","upvote_count":"2"},{"content":"mTLS between APIM1 and AKS1 while minimizing development effort and costs-->Deploy an ingress controller to AKS1. This approach ensures secure communication between APIM1 and AKS1 while meeting the specified requirements","comment_id":"1231059","upvote_count":"1","timestamp":"1718468820.0","poster":"Angurajesh"},{"comment_id":"1201684","content":"Selected Answer: D\nGiven answer D is correct , as note is that Ingress Controller is part of App GWY L7 Load Balancer \nThe Application Gateway Ingress Controller (AGIC) is a Kubernetes application, which makes it possible for Azure Kubernetes Service (AKS) customers to leverage Azure's native Application Gateway L7 load-balancer to expose cloud software to the Internet. AGIC monitors the Kubernetes cluster it's hosted on and continuously updates an Application Gateway, so that selected services are exposed to the Internet.\nhttps://learn.microsoft.com/en-us/azure/application-gateway/ingress-controller-overview","upvote_count":"1","poster":"Lazylinux","timestamp":"1714009920.0"},{"timestamp":"1701351540.0","content":"Ingress controller is correct answer.\nThere is picture describing the architecture (API Management > Ingress Controller > AKS cluster):\nhttps://learn.microsoft.com/en-us/azure/architecture/solution-ideas/articles/mutual-tls-deploy-aks-api-management","comment_id":"1084404","upvote_count":"4","poster":"a03"},{"upvote_count":"3","comment_id":"1077288","timestamp":"1700651460.0","poster":"babakeyfgir","content":"it was a exam Question"},{"comment_id":"1028694","upvote_count":"4","content":"Selected Answer: D\nD\nhttps://learn.microsoft.com/en-us/azure/api-management/api-management-kubernetes","poster":"KakashiCopyNinja","timestamp":"1696844040.0"},{"comment_id":"1028686","content":"D is correct.\n\nhttps://learn.microsoft.com/en-us/azure/api-management/api-management-kubernetes#option-2-install-an-ingress-controller","poster":"KakashiCopyNinja","timestamp":"1696843560.0","upvote_count":"4"}],"exam_id":54,"choices":{"A":"Implement an external load balancer on AKS1.","D":"Deploy an ingress controller to AKS1.","C":"Implement an ExternalName service on AKS1.","B":"Redeploy APIM1 to the virtual network that contains AKS1."},"answer_description":"","timestamp":"2023-10-09 11:26:00","answer_ET":"D","answers_community":["D (100%)"],"question_id":160,"answer_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/122959-exam-az-305-topic-4-question-113-discussion/","isMC":true,"question_text":"You have an Azure subscription that contains an Azure Kubernetes Service (AKS) instance named AKS1. AKS1 hosts microservice-based APIs that are configured to listen on non-default HTTP ports.\n\nYou plan to deploy a Standard tier Azure API Management instance named APIM1 that will make the APIs available to external users.\n\nYou need to ensure that the AKS1 APIs are accessible to APIM1. The solution must meet the following requirements:\n\n• Implement MTLS authentication between APIM1 and AKS1.\n• Minimize development effort.\n• Minimize costs.\n\nWhat should you do?","topic":"4"}],"exam":{"provider":"Microsoft","isImplemented":true,"isBeta":false,"isMCOnly":false,"numberOfQuestions":286,"lastUpdated":"12 Apr 2025","name":"AZ-305","id":54},"currentPage":32},"__N_SSP":true}