{"pageProps":{"questions":[{"id":"Y5OA3v01ivvcu1xGtK00","topic":"3","isMC":false,"question_text":"HOTSPOT -\nYou need to recommend an Azure Storage account configuration for two applications named Application1 and Application2. The configuration must meet the following requirements:\n✑ Storage for Application1 must provide the highest possible transaction rates and the lowest possible latency.\n✑ Storage for Application2 must provide the lowest possible storage costs per GB.\n✑ Storage for both applications must be available in an event of datacenter failure.\n✑ Storage for both applications must be optimized for uploads and downloads.\nWhat should you recommend? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer_ET":"","question_images":["https://www.examtopics.com/assets/media/exam-media/04224/0014100001.png"],"question_id":141,"timestamp":"2022-09-05 09:11:00","discussion":[{"comments":[{"upvote_count":"1","comment_id":"1559729","poster":"vrm1358","content":"When comparing BlobStorage with standard performance and BlockBlobStorage with premium performance, the latter typically offers faster data access and lower latency. This is because premium performance storage accounts utilize solid-state drives (SSDs), providing low latency and high throughput. \nhttps://learn.microsoft.com/en-us/answers/questions/864000/difference-between-premium-vs-standard-general-pur?utm_source=chatgpt.com\nSo between blob with standard and blockblobstorage with premium the latter is faster and meed datacenter failure. \n\nGeneral Purpose v2 (GPv2) with standard performance, Cool access tier, and RA-GRS is generally the more cost-effective and flexible option. It provides enhanced features like blob-level tiering, comprehensive lifecycle management, and continuous read access to the secondary region, making it suitable for a wide range of applications and workloads.","timestamp":"1744323840.0"},{"timestamp":"1666946340.0","comment_id":"706282","content":"RA-GRS is more expensive than GRS.","poster":"Galron","comments":[{"comment_id":"799139","timestamp":"1675628220.0","comments":[{"upvote_count":"2","content":"Blob Storage is still available and supported and less expensive per GB than GPv2 (according to the pricing calculator).\n\"Legacy storage accounts are also supported. For more information, see Legacy storage account types.\"\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy#supported-storage-account-types\n\"The following table describes the legacy storage account types. These account types aren’t recommended by Microsoft, but may be used in certain scenarios:\" (like because it's cheaper & offers GRS)\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types","timestamp":"1683043800.0","comment_id":"887659","poster":"betterthanlife"}],"content":"Yes, but legacy storage account are no longer recommended, so you cant recommend these solutions even if it may cost less.\nhttps://docs.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types","poster":"GarryK","upvote_count":"4"},{"comment_id":"706283","poster":"Galron","timestamp":"1666946460.0","upvote_count":"1","comments":[],"content":"But App2 must be accessible, so unless regional failover occurs, you'll need RA access?"}],"upvote_count":"12"}],"comment_id":"660295","timestamp":"1662390300.0","poster":"Snownoodles","upvote_count":"34","content":"Application 2: Blobstorage with standard performance VS General purpose V2 with standard performance - General purpose V2 is always recommended since Blobstorage with a legacy\nso the given answer is correct"},{"content":"Pretty sure it's app 1 block blob (answer as listed) but for App 2 I think it's A : because #1 there is no hot and cool blobs in V1. and there's not option to pick GRS/RA-GRS etc. (go look at azure pricing calculator.) ... so by having cool and GRS it IS v2 storage. and therefore GRS is cheaper than RA-GRS.. so it's A ... Blob with GRS.","timestamp":"1662729720.0","poster":"jrv116psu","comments":[{"timestamp":"1725055800.0","content":"I think the key is ReadOnly GRS for V2","poster":"Adx_YT","comment_id":"1275294","upvote_count":"1"}],"upvote_count":"23","comment_id":"664605"},{"content":"WRONG\n\nApp1: BlockBlobStorage with Premium performance and zone redundant storage (ZRS) replicaton\n\nApp2: BlobStorage with Standard Performance, cool access tier and GRS replication\n\n\nKEYWORD: <provide the lowest possible storage costs>","comments":[{"content":"there is no BlobStorage with \"Standard Performance\"","comment_id":"1315219","upvote_count":"1","timestamp":"1732103580.0","poster":"davidpetersiani","comments":[{"upvote_count":"2","comment_id":"1326323","timestamp":"1734143400.0","content":"When I try to create a storage account, the options I have for \"Primary service\" are:\n- Azure Blob Storage or Azure Data Lake Storage Gen 2\n- Azure Files\n- Other (tables and queues)\n\nIf I pick \"Azure Blob Storage or Azure Data Lake Storage Gen 2\", the \"Performance\" options are:\n- Standard: Recommended for most scenarios (general-purpose v2 account)\n- Premium: Recommended for scenarios that require low latency.\n\nSo it is confusing because there is an Azure Blob Storage Standard option but it can also be called general-purpose v2","poster":"d7b83e2"}]}],"upvote_count":"3","comment_id":"1310742","poster":"[Removed]","timestamp":"1731430080.0"},{"poster":"Teerawee","timestamp":"1726321140.0","upvote_count":"1","comment_id":"1283646","content":"Premium block blob\nZone-redundant storage (ZRS)"},{"upvote_count":"2","content":"1)BlockBlobStorage with Premium performance and Zone-redundant storage (ZRS) replication\n2)BlobStorage with Standard performance, Cool access tier, and Geo-redundant storage (GRS) replication","comment_id":"1282007","poster":"Teerawee","timestamp":"1726038900.0"},{"content":"there is no storage account type called blobStorage (depricated), and Gpv1 also depricated.\nthe given answer are correct depends on what left \napp1 blockblobstoarge=better performance+low latency+zrs(datacenter failure =we gonna have copy in each zone)\napp2 gpv2 less cost with cool tier (less cost)+ra-grs copy in another region \nthe option for blockblob is expensive","comments":[{"upvote_count":"1","content":"Yeah, you are correct. The question is asking for storage account types. Only two of the given options are even options, Premium block blob and Standard general-purpose v2.","poster":"c_h_r_i_s_","comment_id":"1298081","timestamp":"1728978660.0"}],"poster":"KarimaMaf","comment_id":"1271449","timestamp":"1724446920.0","upvote_count":"2"},{"timestamp":"1719232740.0","comment_id":"1236332","poster":"23169fd","upvote_count":"1","content":"Application 1:\nBlockBlobStorage with Premium performance and Zone-redundant storage (ZRS) replication\nApplication 2:\nBlobStorage with Standard performance, Cool access tier, and Geo-redundant storage (GRS) replication"},{"comment_id":"1178202","upvote_count":"4","poster":"varinder82","content":"Final Answer:\n1. BlockBlobStorage with Premium performance and ZRS replica\n2. BlobStorage with Standard Performance, Cool access tier and GRS","timestamp":"1710934500.0"},{"poster":"[Removed]","comment_id":"1116944","timestamp":"1704742380.0","upvote_count":"6","content":"I used Azure Pricing calculator to have a look for box2.\n\nBlock Blob Storage, Blob Storage, Flat Namespace, GRS Redundancy, Cool Access Tier, 1,000 GB Capacity - Pay as you go\n\nMonthly: $66.50\n\nBlock Blob Storage, General Purpose V2, Flat Namespace, RA-GRS Redundancy, Cool Access Tier, 1,000 GB Capacity - Pay as you go\n\nMonthly: $75.60\n\nThere is not a huge difference but definitely BlobStorage is cheaper for Application2. Not sure what to make of it, but since it is still supported I would go with this option to save a few bucks."},{"upvote_count":"4","poster":"ziggy1117","timestamp":"1702388400.0","comment_id":"1094577","content":"App1: BlockBlobStorage with Premium performance and ZRS replica\n\nApp2: BlobStorage with Standard Performance, Cool access tier and GRS - is the correct answer, GRS is cheaper then RA-GRS. I also checked the Azure Pricing Calculator and RA-GRS for GPurposeV2 is indeed more expensive"},{"content":"App1:\nBlockBlobStorage with Premium performance and ZRS replica\n\nApp2:\nBlobStorage with Standard Performance, Cool access tier and GRS - is the correct answer,\nGRS is cheaper then RA-GRS","comment_id":"1018302","poster":"MichaelMelb","upvote_count":"6","timestamp":"1695775080.0"},{"timestamp":"1694272860.0","upvote_count":"1","content":"The given answers are correct.\n- Storage for both applications must be available in an event of datacenter failure.","poster":"Leocan","comment_id":"1003336"},{"upvote_count":"1","comment_id":"996045","content":"Storage for Application2 must provide the lowest possible storage costs per GB - how we accomplish this with cool access tier?","poster":"Vladobate","timestamp":"1693571280.0"},{"poster":"firedog2023","comment_id":"927214","upvote_count":"3","comments":[{"timestamp":"1692210420.0","poster":"sawanti","comment_id":"982870","content":"RA-GRS is much more expensive than GRS as you also want to read that data. Storage should be as cheap as possible. BlobStorage is a legacy type, but Microsoft allows legacy datatypes for a scenarios where it can be more beneficial, hence A is correct.","upvote_count":"2"}],"content":"I think D is correct for App2. 'BlobStorage' doesnt exist as an option, its general purpose v2 as a BLOB. Also, RA-GRS does allow Write but only on failover. The purpose of RA is that you can also READ the secondary while the primary is still active. If there is a failover, it just becomes the writeable storage account as per normal GRS functionality. The READ is helpful if you are testing an app and you want to check it will connect to the secondary even though its in READ only mode. So think of its as everything GRS does but with a READ also for that specific scenario.","timestamp":"1687155420.0"},{"content":"App 1: \nBlockBlobStorage with Premium performance and zone redundant storage (ZRS) replicaton\n\nStorage for Application1 must provide the highest possible transaction rates and the lowest possible latency. - Yes\nStorage for both applications must be available in an event of datacenter failure. - Yes\nStorage for both applications must be optimized for uploads and downloads. - Yes\n\nApp2: \nBlobStorage with Standard Performance, cool access tier and GRS replication\nFullfills the requirements?\nStorage for Application2 must provide the lowest possible storage costs per GB. - Yes\nStorage for both applications must be available in an event of datacenter failure. - Yes\nStorage for both applications must be optimized for uploads and downloads. - Yes","timestamp":"1685353500.0","comment_id":"909251","poster":"sw1000","upvote_count":"13","comments":[{"content":"Cool storage is less expansive that premium. \nWe are talking about storage cost, not access cost","timestamp":"1695049200.0","comment_id":"1010685","upvote_count":"2","poster":"Elecktrus"},{"comment_id":"983853","timestamp":"1692292620.0","poster":"Darkeh","upvote_count":"1","content":"AGREED!"}]},{"timestamp":"1678864260.0","comments":[{"comment_id":"839611","upvote_count":"2","poster":"SD_Coordinator","timestamp":"1678864320.0","content":"I meant cool access tier. *"},{"poster":"betterthanlife","content":"Not at all optimized for uploads if the target is read-only.","upvote_count":"1","timestamp":"1683656820.0","comment_id":"893346"}],"comment_id":"839606","poster":"SD_Coordinator","content":"I recommend the following Azure Storage account configurations for Application1 and Application2:\n\nApplication1: \"BlockBlobStorage with Premium performance and Zone-redundant storage (ZRS) replication.\" This configuration offers the highest possible transaction rates and the lowest possible latency due to its Premium performance tier. ZRS replication ensures availability in the event of a datacenter failure.\n\nApplication2: \"General purpose v2 with Standard performance, Hot access tier, and Read-access geo-redundant storage replication.\" This configuration provides lower storage costs per GB due to its Standard performance tier and Hot access tier. Read-access geo-redundant storage replication ensures data availability in the event of a datacenter failure and allows for optimized uploads and downloads.","upvote_count":"2"},{"content":"1. BlockBlobStorage with Premium performance and ZRS replication\n2. GPv2 with Standard performance, Cool access tier, and RA-GRS replication\n\nhttps://learn.microsoft.com/en-us/azure/storage/blobs/storage-blob-block-blob-premium\nPremium block blob storage accounts make data available via high-performance hardware. Data is stored on solid-state drives (SSDs) which are optimized for low latency. SSDs provide higher throughput compared to traditional hard drives. File transfer is much faster because data is stored on instantly accessible memory chips. All parts of a drive accessible at once. By contrast, the performance of a hard disk drive (HDD) depends on the proximity of data to the read/write heads.","upvote_count":"7","poster":"zellck","comment_id":"822379","comments":[{"timestamp":"1677416640.0","poster":"zellck","upvote_count":"3","comment_id":"822385","comments":[{"upvote_count":"1","content":"The question asks nothing about what MS recommends to make you do what they want you to do so they can consolidate control... Blob storage is still a service offering & is still supported. \n\"The following table describes the legacy storage account types. These account types aren’t recommended by Microsoft, but may be used in certain scenarios:\" (like because it's cheaper & offers GRS)\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types","comment_id":"893350","timestamp":"1683656940.0","poster":"betterthanlife"}],"content":"https://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy#supported-storage-account-types\nBlobStorage is legacy and not recommended."}],"timestamp":"1677416160.0"},{"upvote_count":"4","poster":"sG9","comment_id":"819288","content":"gents, for app2 it requires capabilities for UPLOAD and DOWNLOAD. RA-GRS will not suffice here as it is READ ONLY (cannot UPLOAD). answer is A in my opinion.","timestamp":"1677162480.0","comments":[{"poster":"zellck","upvote_count":"1","timestamp":"1677416340.0","comment_id":"822381","comments":[{"content":"Yes, & if there is a fail-over you do not meet the requirement \"Storage for both applications must be optimized for uploads and downloads\".","timestamp":"1683657060.0","upvote_count":"3","poster":"betterthanlife","comment_id":"893353"}],"content":"For RA-GRS, you can of course still read and write to primary region. Read-only applies only to secondary region."}]},{"content":"answer is correct. General Purpose v2 storage is designed to be a more cost-effective alternative to Blob storage for use cases that do not require the high-performance, low-latency access of Blob storage.","poster":"Putra19","comment_id":"806081","timestamp":"1676188440.0","upvote_count":"1"},{"timestamp":"1675317480.0","poster":"VBK8579","content":"Application1:\nBlockBlobStorage with Premium performance and Zone-redundant storage (ZRS) replication\n\nApplication2: \nGeneral purpose v2 with Standard performance, Cool access tier, and Read-access geo-redundant storage (RA-GRS) replication","comment_id":"795788","upvote_count":"8"},{"content":"I would say the answer is correct. First one is obvious and explained by others. As for Application2 it is specifically said that cost has to be lowest \"per GB\", not lowest in general. So even tho RA-GRS is more expensive than GRS, general purpose V2 still provides better price per gigabyte as said in documentation.\n\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-upgrade?tabs=azure-portal","timestamp":"1673708580.0","comments":[{"timestamp":"1673823840.0","comment_id":"777155","poster":"[Removed]","upvote_count":"2","comments":[{"timestamp":"1677416700.0","content":"https://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy#supported-storage-account-types\nBlobStorage is legacy and not recommended.","comments":[{"comment_id":"893355","poster":"betterthanlife","upvote_count":"2","content":"Thumbs down... still an Azure offering, supported, & let's not drink the coolaid.","timestamp":"1683657120.0"}],"upvote_count":"1","comment_id":"822387","poster":"zellck"}],"content":"The Azure storage type that provides the lowest cost per GB is Azure Blob Storage"}],"upvote_count":"3","comment_id":"775554","poster":"FabrityDev"},{"comment_id":"772774","content":"This is very strange because BOTH uploads and downloads will be only possible with ZRS. if it would be downloads only we could use RA-GRS, GZRS would work but it's not present as an option. maybe typo in question. I would go with Premium ZRS because with one option it 's cheapest","poster":"gramotei","timestamp":"1673459340.0","upvote_count":"1","comments":[{"timestamp":"1711720140.0","upvote_count":"1","comment_id":"1185454","poster":"UWSFish","content":"Bingo, must support uploads and downloads AND be available during a datacenter failure which RA can not do."}]},{"timestamp":"1672366440.0","upvote_count":"5","comment_id":"761611","poster":"wwwmmm","content":"My answer is \nApp1: option 2 Blockblob premium with ZRS\nApp2: option 1 standard genV2 with GRS\nHave tried this in my portal as well,\nFor app1, it focuses on performance, so it needs to be use premium, premium storage account supports LRS and ZRS, since it mentioned datacenter fail, meaning zone redundant, so I would go for 2, block blob premium with ZRS.\nFor App2, note all the options fulfill the redundancy requirement, and App2 focuses on cost, so we should go for Standard plan, and option 1 GRS is cheaper than RA-GRS, so option 1."},{"timestamp":"1671995160.0","content":"First 1 is pretty clear option 3, second would be the last option as zone redundant storage and Geo zone redundant storage are only available for standard general-purpose V2 accounts","comment_id":"755936","poster":"PankajKataria","upvote_count":"1"},{"timestamp":"1669089240.0","upvote_count":"2","comment_id":"724083","content":"\"Storage for both applications must be available in an event of datacenter failure.\"\nApp1: ZRS not support that.\nAns: App1: D App2: A\nCorrect me if I am wrong","poster":"CloudNov","comments":[{"comment_id":"724086","upvote_count":"4","timestamp":"1669089420.0","poster":"CloudNov","content":"Sorry I placed ZRS in place of LRS\nANS: APP1: B, APP2: A"}]},{"comment_id":"673683","upvote_count":"2","content":"There's no way a cool tier is the answer for Application 2. \n\nIt has to be General v1. That answer makes sense if you assume this is now an outdated question. Rule out the cool tiers, rule out the premium account and it's the only one left.","comments":[{"content":"v1 is no longer recommended and may not give you a minimal cost per GB. that's why v2 with cool tier is the answer.","timestamp":"1664192820.0","comment_id":"679688","upvote_count":"4","poster":"Rohan21"}],"timestamp":"1663627740.0","poster":"jellybiscuit"},{"timestamp":"1662526380.0","comments":[{"upvote_count":"1","timestamp":"1683657360.0","content":"Blob storage is still an Azure offering & still supported & ... \"may be used in certain scenarios:\" (like because it's cheaper & offers GRS)\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types","comment_id":"893359","poster":"betterthanlife"}],"upvote_count":"5","comment_id":"662007","poster":"Gowind2","content":"BlobStorage and Generalv1 are no longer recommended \nhttps://docs.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types"},{"poster":"most_lenyora","timestamp":"1662361860.0","content":"App 1: BlockBlobStorage\nApp 2: BlobStorage","comments":[{"upvote_count":"2","timestamp":"1683657420.0","poster":"betterthanlife","comment_id":"893360","content":"Blob storage is still an Azure offering & still supported & ... \"may be used in certain scenarios:\" (like because it's cheaper & offers GRS)\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview#legacy-storage-account-types\nIf you answer Blob for App2 & it dings you for a wrong response then what are you going to do, continue to believe the lie?"}],"comment_id":"659838","upvote_count":"8"}],"answer_description":"Box 1: BlobStorage with Premium Performance,ג€¦\nApplication1 requires high transaction rates and the lowest possible latency. We need to use Premium, not Standard.\nBox 2: General purpose v2 with Standard Performance,..\nGeneral Purpose v2 provides access to the latest Azure storage features, including Cool and Archive storage, with pricing optimized for the lowest GB storage prices. These accounts provide access to Block Blobs, Page Blobs, Files, and Queues. Recommended for most scenarios using Azure Storage.\nReference:\nhttps://docs.microsoft.com/en-us/azure/storage/common/storage-account-upgrade","unix_timestamp":1662361860,"answers_community":[],"url":"https://www.examtopics.com/discussions/microsoft/view/80236-exam-az-305-topic-3-question-7-discussion/","answer":"","exam_id":54,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04224/0014200001.png"]},{"id":"zwJUmH2O6xSW3W1q7jR5","timestamp":"2022-09-01 08:22:00","question_text":"HOTSPOT -\nYou plan to develop a new app that will store business critical data. The app must meet the following requirements:\n✑ Prevent new data from being modified for one year.\n✑ Maximize data resiliency.\n✑ Minimize read latency.\nWhat storage solution should you recommend for the app? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer":"","topic":"3","url":"https://www.examtopics.com/discussions/microsoft/view/78938-exam-az-305-topic-3-question-8-discussion/","answers_community":[],"answer_description":"Box 1: Standard general-purpose v2\nStandard general-purpose v2 supports immutable storage.\nIn general Standard general-purpose v2 is the preferred Microsoft recommendation.\nBox 2: Zone-redundant storage (ZRS)\nZRS is more resilient compared to LRS.\nNote: RA-GRS is even more resilient, but it is not an option here.\nReference:\nhttps://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-immutable-storage","question_images":["https://www.examtopics.com/assets/media/exam-media/04224/0014300004.jpg"],"exam_id":54,"unix_timestamp":1662013320,"isMC":false,"discussion":[{"upvote_count":"124","poster":"mse89","comment_id":"655865","comments":[{"comments":[{"upvote_count":"11","content":"True, there are maximum and minimum requirements, but neither mention cost?","poster":"morito","timestamp":"1686044640.0","comment_id":"916101"},{"upvote_count":"25","content":"Bro, can you read?\n\n✑ Prevent new data from being modified for one year. (Both Standard + Premium)\n✑ Maximize data resiliency. (ZRS)\n✑ Minimize read latency. (Premium)\n\nHence - Premium. There isn't ANYTHING related with keyword \"cost\". Why do you make it up?","poster":"sawanti","comment_id":"982872","timestamp":"1692210540.0"}],"comment_id":"764569","timestamp":"1672746180.0","poster":"ServerBrain","upvote_count":"1","content":"The buzz words in this scenario are maximum and minimum, so I'm thinking minimum cost, ----->>> Standard v2.."},{"timestamp":"1690886460.0","upvote_count":"2","content":"Premium Block is not good for \"data\", is more suitable for media (image, video)","poster":"idoraemon999","comment_id":"968953"}],"timestamp":"1662013320.0","content":"To minimize read latency premium block blobs is the right answer, the immutable storage is also supported on premium tier.\nhttps://docs.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview#supported-account-configurations"},{"upvote_count":"61","comment_id":"658264","comments":[{"upvote_count":"2","content":"Even if there are no cost limits mentioned, why recommend an higher cost option when you can do it for less??? Given answers are correct..","comment_id":"764544","timestamp":"1672745700.0","poster":"ServerBrain","comments":[{"upvote_count":"9","content":"Because we have to minimize latency and Premium is better in that regard.","timestamp":"1673708820.0","comment_id":"775563","poster":"FabrityDev"},{"upvote_count":"2","timestamp":"1710243360.0","comment_id":"1171639","content":"\"Even if there are no cost limits mentioned, why recommend an higher cost option when you can do it for less???\" - Premium has lower latency.","poster":"xRiot007"},{"poster":"Ivanvazovv","timestamp":"1675697880.0","content":"Because one of the requirements is to minimize read latency which requires premium tier.","upvote_count":"13","comment_id":"799908"}]}],"content":"Agreed, no cost limits are mentioned. Correct Answer: Premium + ZRS","poster":"santi1975","timestamp":"1662196020.0"},{"comment_id":"1316732","timestamp":"1732380600.0","poster":"Pringlesucka","upvote_count":"1","content":"Wong.. Premium Block Blobs, and ZRS."},{"content":"WRONG\n\n1. Premium block blobs (to minimize read latency)\n\n2. Zone-redundant storage (ZRS) (to maximize data resiliency)","poster":"[Removed]","upvote_count":"2","comment_id":"1310747","timestamp":"1731430560.0"},{"comment_id":"1283647","timestamp":"1726321200.0","content":"Premium block blobs\nZone-redundant storage (ZRS)","poster":"Teerawee","upvote_count":"2"},{"comment_id":"1282146","poster":"cosmicT73","timestamp":"1726061460.0","content":"Business critical data + low latency should be Premium given it supports preventing data overwrite","upvote_count":"1"},{"poster":"profesorklaus","content":"Prevent new data from being modified for one year. - Premium \n✑ Maximize data resiliency. - Standard and Premium\n✑ Minimize read latency. - Premium\n\nSo the choice is premium ZRS as GRS is not available","timestamp":"1717772400.0","upvote_count":"1","comment_id":"1226210"},{"poster":"Lazylinux","timestamp":"1714958820.0","comment_id":"1207117","content":"Since NO cost limits are discussed => i would go for premium and ZRS (this is highest redundancy Premium provides i.e. LRS and ZRS - Block, Share but page ONLY LRS)","upvote_count":"2"},{"content":"As some others indicated \npremium block blobs - High performance (Low latency) and WORM policy applies to it\nZRS offers data resiliency \nfurther info found here\nhttps://learn.microsoft.com/en-us/azure/virtual-machines/premium-storage-performance \n\nhttps://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview","timestamp":"1712736900.0","comment_id":"1192820","poster":"Lazylinux","upvote_count":"1"},{"timestamp":"1711825800.0","comment_id":"1186321","upvote_count":"4","content":"premium block blobs + ZRS seems to be the correct answer\n\"premium block blobs\" meets \"minimize latency\" better than General V2","poster":"MichaelMelb"},{"timestamp":"1710934740.0","content":"Final Answer:\n1.Premium\n 2. ZRS","comment_id":"1178204","poster":"varinder82","upvote_count":"4"},{"poster":"TJ001","content":"Premium blockblobs ,,timebased retention policies are supportedhttps://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview#supported-account-configurations\nlatency is less for premium \ncost is not a factor considered in the question","timestamp":"1706926980.0","upvote_count":"1","comment_id":"1138961"},{"poster":"basak","upvote_count":"5","timestamp":"1695879240.0","comment_id":"1019453","content":"Premium + ZRS"},{"comment_id":"993142","timestamp":"1693316040.0","comments":[{"comment_id":"1009264","poster":"AdventureChick","timestamp":"1694891400.0","upvote_count":"1","content":"This is true for the three -900 level exams, as well. A LOT of wrong answers. At least the -900 level ExamTopics don't have as many duplicate questions."}],"upvote_count":"5","poster":"AntonR","content":"off topic: but why is it, that almost all answers on this page are wrong? Why do I always have to check comments first"},{"content":"Premium Block Blob and ZRS. Use this link https://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview#supported-account-configurations as a reference.","timestamp":"1685953200.0","poster":"morito","upvote_count":"1","comment_id":"915212"},{"comments":[{"poster":"C_M_M","content":"Blob storage offers data lock irrespective of which account- premium or V2. So I don't see how this V2 immutability means much here. You can apply readONLY lock on the containers for both account types. \nBesides immutability (time-based retention and legal hold) are supported in V2 & premium blob - https://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview\n\nSo latency should be the main deciding factor here.","upvote_count":"3","timestamp":"1682341200.0","comment_id":"879353"}],"poster":"NotMeAnyWay","timestamp":"1679588400.0","upvote_count":"6","content":"Storage Account Type: Premium Block Blobs provide high-performance, low-latency storage for unstructured data such as images, videos, and documents. However, it does not provide a built-in feature to prevent data modification. Standard General Purpose v1 or v2 can be used with the help of additional features such as Azure Blob Versioning to meet the requirement of preventing new data from being modified for one year. Since the requirement is to minimize read latency, I would recommend using the Standard General Purpose v2 storage account type which offers a higher level of performance and scalability.\n\nRedundancy: To maximize data resiliency, I would recommend using Zone-Redundant Storage (ZRS) replication. This replicates data across multiple zones within a single region, providing high availability and resiliency in case of a zone failure.\n\nTherefore, the recommended storage solution for the given scenario would be to use Standard General Purpose v2 storage account type with ZRS redundancy and additional features such as Azure Blob Versioning to prevent new data from being modified for one year while minimizing read latency.","comment_id":"848431"},{"poster":"jj22222","content":"Box 1: Premium Block blobs\nBox 2: ZRS","comment_id":"828043","upvote_count":"2","timestamp":"1677853440.0"},{"comment_id":"823218","timestamp":"1677474540.0","content":"Correct Answer is Premium + ZRS. Premium supports immutable policy","poster":"RamChagol","upvote_count":"4"},{"content":"Topic 2 Q21 - The answer should be premium block blobs, container access policy. (data access charges - not storage cost- must be minimized) - agree?","poster":"Rams_84zO6n","timestamp":"1677079140.0","comment_id":"817972","upvote_count":"2"},{"timestamp":"1676779200.0","poster":"zellck","content":"1. Premium block blobs\n2. ZRS\n\nhttps://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview#supported-account-configurations\n\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy#supported-storage-account-types\nZRS\n- Premium block blobs\n\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy#zone-redundant-storage\nZone-redundant storage (ZRS) replicates your storage account synchronously across three Azure availability zones in the primary region. Each availability zone is a separate physical location with independent power, cooling, and networking. ZRS offers durability for storage resources of at least 99.9999999999% (12 9's) over a given year.","comment_id":"813726","upvote_count":"1"},{"poster":"VBK8579","timestamp":"1675318080.0","content":"Storage Account type: Premium block blobs\nRedundancy: Zone-redundant storage (ZRS)","upvote_count":"5","comment_id":"795797"},{"poster":"OPT_001122","content":"1. premium block blobs \n2. ZRS","comment_id":"790591","upvote_count":"4","timestamp":"1674909360.0"},{"timestamp":"1673468460.0","comment_id":"772861","upvote_count":"1","content":"First is Premium Block blobs, it is not write to minimize costs like in question 10","poster":"mercuryit"},{"comment_id":"771289","content":"Premium + ZRS","timestamp":"1673346120.0","upvote_count":"2","poster":"francescoc"},{"poster":"CineZorro824","content":"First answer should be Premium Block Blobs instead of General Purpose v2. Immutable data policy is also possible for Premium Block Blobs, see: https://learn.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview","upvote_count":"3","comment_id":"737956","timestamp":"1670423280.0"},{"upvote_count":"6","content":"Agree with everyone here:\nPremium\nZRS","poster":"rjcverar","timestamp":"1670333760.0","comment_id":"736853"},{"poster":"A_GEE","timestamp":"1669953360.0","content":"There is cost and requirements include minimize read latency. So \nThe answer should be : Premium BlockBlobs + ZRS","comment_id":"733427","upvote_count":"6"},{"timestamp":"1669338720.0","comment_id":"726309","content":"Premium + ZRS","upvote_count":"3","poster":"ryanzou"},{"poster":"hmz","content":"Premium + ZRS","upvote_count":"3","comment_id":"722908","timestamp":"1668970980.0"},{"comment_id":"703837","timestamp":"1666700040.0","poster":"MartyMart","upvote_count":"2","content":"The ans: Premium + ZRS"},{"upvote_count":"1","content":"Premium+ZRS","timestamp":"1666534200.0","comment_id":"702237","poster":"Snownoodles"},{"comment_id":"673691","poster":"jellybiscuit","upvote_count":"3","timestamp":"1663628760.0","content":"I agree with others:\nPremium/ZRS"},{"upvote_count":"3","timestamp":"1662799140.0","content":"Yes it should be Premium + ZRS","comment_id":"665248","poster":"Balaji_c_s"},{"comment_id":"662012","upvote_count":"10","timestamp":"1662526680.0","poster":"Gowind2","content":"Correct answer Premium + ZRS\nMinimize read latency -> Premium > Generalv2\nMaximize resiliency -> ZRS > LRS.\n\nhttps://docs.microsoft.com/en-us/azure/storage/blobs/immutable-storage-overview\nhttps://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-block-blob-premium#check-for-blob-storage-feature-compatibility\n\"Premium: Recommended for scenarios that requires low latency\""}],"answer_ET":"","question_id":142,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04224/0014300005.jpg"]},{"id":"E2r4GpqgfgJr7V41hmWB","answer":"A","exam_id":54,"answers_community":["A (93%)","5%"],"unix_timestamp":1662363300,"answer_ET":"A","discussion":[{"timestamp":"1662526800.0","comments":[{"timestamp":"1683052560.0","content":"Agreed, & in fact when you look at AKS baseline for multiregion clusters you'll see Azure Front Door is the, well, um, front door. \nhttps://learn.microsoft.com/en-us/azure/architecture/reference-architectures/containers/aks-multi-region/aks-multi-cluster","comment_id":"887797","upvote_count":"4","poster":"betterthanlife"}],"comment_id":"662017","upvote_count":"32","content":"Selected Answer: A\nCorrect answer A\nhttps://docs.microsoft.com/en-us/azure/architecture/guide/technology-choices/load-balancing-overview\n\nFront Door is an application delivery network that provides global load balancing and site acceleration service for web applications. It offers Layer 7 capabilities for your application like SSL offload, path-based routing, fast failover, caching, etc. to improve performance and high-availability of your applications.\n\nTraffic Manager does not provide SSL Offloading.\nAnd the other options are not global options (multi-region)","poster":"Gowind2"},{"upvote_count":"5","comment_id":"663357","content":"Selected Answer: A\nCorrect answer A","poster":"taer","timestamp":"1662624960.0"},{"timestamp":"1731430620.0","comment_id":"1310748","content":"Selected Answer: A\nA is correct","poster":"[Removed]","upvote_count":"1"},{"timestamp":"1719234540.0","poster":"23169fd","content":"Selected Answer: A\nHigh Availability: Azure Front Door provides global load balancing and failover capabilities. It can route traffic to the closest healthy AKS cluster based on latency or priority, ensuring applications remain available even if one AKS cluster fails.\n\nSSL Offloading: Azure Front Door can terminate SSL connections at the edge, meaning it handles SSL/TLS encryption and decryption. This relieves the AKS clusters and their containers from having to manage SSL certificates directly, simplifying deployment and management.\n\nGlobal Scalability: Front Door is designed to handle global-scale traffic and can optimize the delivery of web applications by caching content closer to the users, thereby improving performance and reducing latency.","upvote_count":"1","comment_id":"1236357"},{"poster":"Lazylinux","comment_id":"1192823","timestamp":"1712737260.0","content":"Selected Answer: A\nAZ FD supports both HTTP and HTTPS and global \nTraffic Manager is Global but it is DNS based and doesn't encrypt traffic\nother two are NOT regional more like local i.e. per regions (can be xcross region but you need multiple)","upvote_count":"3"},{"upvote_count":"1","timestamp":"1695497880.0","poster":"Som_triv","comment_id":"1015286","content":"Correct answer A\nhttps://learn.microsoft.com/en-us/azure/architecture/reference-architectures/containers/aks-multi-region/aks-multi-cluster\nAKS Ingress controller - It is a component of the AKS cluster and not a service to handle traffic between 2 or more AKS clusters. An Ingress controller abstracts away the complexity of Kubernetes application traffic routing and provides a bridge between Kubernetes services and external ones."},{"content":"A is correct, see blueprint:\nhttps://learn.microsoft.com/en-us/azure/architecture/reference-architectures/containers/aks-multi-region/aks-multi-cluster","poster":"GS300","timestamp":"1682404980.0","upvote_count":"1","comment_id":"880047"},{"poster":"sherwindaniel","content":"An AKS Ingress controller is a Kubernetes resource that allows the management of external access to the services in an AKS cluster. It provides traffic routing and load balancing for inbound traffic to the applications running in the cluster.\n\nBy using an AKS Ingress controller, you can ensure that the applications remain available if a single AKS cluster fails. The controller can route traffic to the remaining available AKS cluster(s), ensuring that the application remains available to users.\n\nAdditionally, an AKS Ingress controller supports SSL/TLS encryption of internet traffic, which ensures that the connection traffic over the internet is encrypted by using SSL without having to configure SSL on each container.","comments":[{"comment_id":"1192824","timestamp":"1712737380.0","upvote_count":"2","poster":"Lazylinux","content":"Yes correct the above but you missing one thing and that is it is NOT global i.e. different regions, it refers to Single AKS cluster failure failover within the same region"},{"content":"Therefore, an AKS Ingress controller would be a suitable service to include in the recommendation to meet the requirements of ensuring high availability of the applications and encrypted internet traffic. Azure Front Door and Azure Traffic Manager are also services that can be used for traffic routing, but they do not provide SSL encryption natively. Azure Load Balancer can provide traffic routing and load balancing for inbound traffic, but it does not support SSL encryption natively.","timestamp":"1682012880.0","upvote_count":"1","comment_id":"875835","poster":"sherwindaniel"}],"comment_id":"875834","upvote_count":"2","timestamp":"1682012880.0"},{"content":"Selected Answer: C\nAzure Front Door is also a viable option for providing traffic routing, load balancing, and failover across multiple regions. It can provide SSL termination and caching for faster performance.\n\nHowever, compared to the AKS ingress controller, Azure Front Door is a higher-level service that operates at the HTTP/HTTPS layer and is optimized for HTTP traffic. It is typically used for web applications that require advanced routing, traffic management, and SSL offloading.\n\nOn the other hand, the AKS ingress controller is a Kubernetes-native solution that operates at the layer 7 (HTTP) and layer 4 (TCP) level, and can provide more granular control over traffic routing and application-level routing rules.\n\nTherefore, the choice between Azure Front Door and AKS ingress controller ultimately depends on the specific requirements and characteristics of the applications being deployed. For applications running on Kubernetes, using the AKS ingress controller is often the most straightforward and cost-effective option.","comment_id":"848439","poster":"NotMeAnyWay","comments":[{"comment_id":"950827","content":"Further Supporting information: A. Azure Front Door.\n\nAzure Front Door provides both global load balancing and site acceleration, which would help keep the applications available if a single AKS cluster fails by routing traffic to the other region. \n\nIn addition, Azure Front Door provides SSL termination at the edge node, closest to the user, This ensures that the connection traffic over the internet is encrypted using SSL, without having to configure SSL on each container.\n\nThe other options do not meet all the requirements:\nB. Azure Traffic Manager operates at the DNS level and wouldn't directly handle SSL termination.\nC. An AKS ingress controller could manage internal Kubernetes networking, but it doesn't handle global load balancing across different Azure regions.\nD. Azure Load Balancer operates at the transport layer (Layer 4) and would require manual SSL configuration on each container for encryption.","timestamp":"1689264420.0","poster":"NotMeAnyWay","upvote_count":"1"}],"upvote_count":"3","timestamp":"1679588880.0"},{"content":"Selected Answer: A\nAzure Traffic Manager is at DNS level so you have to configure SSL on every container.... -> Azure Front Door is the choice","upvote_count":"2","poster":"malcubierre","timestamp":"1679164860.0","comment_id":"843062"},{"upvote_count":"1","timestamp":"1677853620.0","poster":"jj22222","content":"Selected Answer: A\nazure front door","comment_id":"828045"},{"content":"Selected Answer: A\nA is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/architecture/guide/technology-choices/load-balancing-overview#azure-load-balancing-services\nFront Door is an application delivery network that provides global load balancing and site acceleration service for web applications. It offers Layer 7 capabilities for your application like SSL offload, path-based routing, fast failover, caching, etc. to improve performance and high-availability of your applications.","upvote_count":"2","comment_id":"820732","poster":"zellck","timestamp":"1677257280.0"},{"comments":[{"upvote_count":"2","poster":"totalz","comment_id":"810216","timestamp":"1676517000.0","content":"Please delete the this one and above, that statement is incorrect."}],"timestamp":"1676516280.0","upvote_count":"1","poster":"totalz","content":"I was surprised to find out that Traffic Manager doesn't support https. Can someone provide some good example of its usage?","comment_id":"810207"},{"upvote_count":"2","timestamp":"1675356240.0","comment_id":"796243","poster":"dagomo","content":"Selected Answer: A\nhttps://github.com/phillipgibson/Cloud-Azure-AKS-Using-AFD-with-AKS#using-azure-front-door-service-afd-with-azure-kubernetes-service-aks-walkthrough"},{"timestamp":"1675318200.0","comment_id":"795800","content":"Selected Answer: A\nA. Azure Front Door","poster":"VBK8579","upvote_count":"1"},{"comment_id":"790593","timestamp":"1674909540.0","content":"Selected Answer: A\nA. Azure Front Door","poster":"OPT_001122","upvote_count":"1"},{"comment_id":"701409","upvote_count":"1","timestamp":"1666426500.0","poster":"Galron","content":"AKS Ingress Controller is part of App GW which is not Global."},{"timestamp":"1666136280.0","comment_id":"698557","content":"Selected Answer: A\nFront Door support SSL offloading.","upvote_count":"1","poster":"simonseztech"},{"poster":"Xinx","timestamp":"1663555920.0","comments":[{"comment_id":"933381","poster":"theboywonder","content":"ingress controller is for each cluster only, if you have 2 clusters in different region, then you support different regions, however the answer here seems to be front door, because we don't want to set this for each container","timestamp":"1687681860.0","upvote_count":"1"}],"upvote_count":"2","comment_id":"672868","content":"AKS ingress controller seems like not support multi region"},{"content":"Selected Answer: D\nD. Azure Front Door","comment_id":"659861","comments":[{"content":"My bad, meant A guys! A. Azure Front Door","timestamp":"1662363360.0","poster":"most_lenyora","upvote_count":"5","comment_id":"659865"}],"upvote_count":"1","poster":"most_lenyora","timestamp":"1662363300.0"}],"question_text":"You plan to deploy 10 applications to Azure. The applications will be deployed to two Azure Kubernetes Service (AKS) clusters. Each cluster will be deployed to a separate Azure region.\nThe application deployment must meet the following requirements:\n✑ Ensure that the applications remain available if a single AKS cluster fails.\n✑ Ensure that the connection traffic over the internet is encrypted by using SSL without having to configure SSL on each container.\nWhich service should you include in the recommendation?","answer_description":"","question_id":143,"isMC":true,"question_images":[],"choices":{"A":"Azure Front Door","C":"AKS ingress controller","D":"Azure Load Balancer","B":"Azure Traffic Manager"},"topic":"3","url":"https://www.examtopics.com/discussions/microsoft/view/80249-exam-az-305-topic-3-question-9-discussion/","answer_images":[],"timestamp":"2022-09-05 09:35:00"},{"id":"eCXOcA9Uzqg9GwJPs1l0","discussion":[{"upvote_count":"85","comment_id":"540947","timestamp":"1644063600.0","poster":"mmar123","content":"There are two types of Virtual WANs. one is the BASIC and the second one is STANDARD. BASIC supports only SITE to SITE VPN. \nSTANDARD supports below configs, \nExpressRoute\nUser VPN (P2S)\nVPN (site-to-site)\nInter-hub and VNet-to-VNet transiting through the virtual hub\nAzure Firewall\nNVA in a virtual WAN\n\nNOTE: You can upgrade from Basic to Standard, but you cannot revert from Standard back to Basic."},{"content":"Selected Answer: A\nCorrect answer - A. \nhttps://docs.microsoft.com/en-us/azure/virtual-wan/virtual-wan-about#basicstandard","comment_id":"500364","upvote_count":"18","timestamp":"1639367280.0","poster":"Eltooth"},{"timestamp":"1731435300.0","comment_id":"1310805","content":"Selected Answer: A\nA is correct","upvote_count":"1","poster":"[Removed]"},{"content":"This question appeared in the exam, August 2024. I gave this same answer listed here. I scored 870","upvote_count":"1","poster":"Len83","timestamp":"1723199880.0","comment_id":"1262872"},{"timestamp":"1680452700.0","upvote_count":"3","poster":"NotMeAnyWay","content":"Selected Answer: A\nA. Upgrade VirtualWAN1 to Standard.\n\nTo create an ExpressRoute association with VirtualWAN1, you need to upgrade VirtualWAN1 from the Basic tier to the Standard tier. ExpressRoute connectivity to a virtual WAN is only supported in the Standard tier of Azure Virtual WAN. Once you have upgraded VirtualWAN1 to the Standard tier, you can proceed with setting up the ExpressRoute association.","comment_id":"859051"},{"timestamp":"1676254200.0","comment_id":"806996","content":"Selected Answer: A\nSteps to perform in sequence\n\n1. Upgrade VirtualWAN1 to Standard.\n2. Create a virtual hub in the US East region and associate it with the ExpressRoute circuit.\n3.Associate the virtual hub with VirtualWAN1.","upvote_count":"5","poster":"VBK8579"},{"upvote_count":"1","comment_id":"791003","poster":"OPT_001122","timestamp":"1674934140.0","content":"Selected Answer: A\nA. Upgrade VirtualWAN1 to Standard"},{"comment_id":"720781","content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/azure/virtual-wan/virtual-wan-expressroute-portal\n\nType: Basic or Standard. Select Standard. If you select Basic, understand that Basic virtual WANs can only contain Basic hubs. Basic hubs can only be used for site-to-site connections.","poster":"egdeeptha","upvote_count":"2","timestamp":"1668712620.0"},{"timestamp":"1655888700.0","content":"did my Exam today. This was on there.","upvote_count":"3","comment_id":"620258","poster":"al608"},{"poster":"mitsuichiu","content":"Correct answer - A.","comment_id":"612118","timestamp":"1654481220.0","upvote_count":"1"},{"upvote_count":"1","content":"Selected Answer: A\nCorrect Answer - A\nhttps://docs.microsoft.com/en-us/azure/virtual-wan/virtual-wan-about#basicstandard","comment_id":"606627","timestamp":"1653388140.0","poster":"Gor"},{"poster":"Teringzooi","upvote_count":"1","timestamp":"1651033320.0","comment_id":"592823","content":"Selected Answer: A\nAnswer is A\nhttps://docs.microsoft.com/en-us/azure/virtual-wan/virtual-wan-about#basicstandard"},{"comment_id":"580786","upvote_count":"3","content":"Came in exam today 04/04/2022","timestamp":"1649081340.0","poster":"Contactfornitish"},{"comment_id":"565079","upvote_count":"4","poster":"Insanewhip","timestamp":"1646952840.0","content":"Appeared on my exam today, March 10th, 2022. I selected A."},{"content":"Answer A is correct","timestamp":"1646476140.0","poster":"jinger","comment_id":"561365","upvote_count":"1"},{"upvote_count":"2","comment_id":"547576","content":"Answer A is correct.","poster":"Nansman","timestamp":"1644909240.0"},{"upvote_count":"4","content":"Selected Answer: A\nA is correct","comment_id":"512418","poster":"[Removed]","timestamp":"1640795580.0"}],"question_text":"You have an Azure subscription that contains a Basic Azure virtual WAN named VirtualWAN1 and the virtual hubs shown in the following table.\n//IMG//\n\nYou have an ExpressRoute circuit in the US East Azure region.\nYou need to create an ExpressRoute association to VirtualWAN1.\nWhat should you do first?","topic":"4","unix_timestamp":1639367280,"url":"https://www.examtopics.com/discussions/microsoft/view/67782-exam-az-305-topic-4-question-1-discussion/","answer_images":[],"choices":{"A":"Upgrade VirtualWAN1 to Standard.","B":"Create a gateway on Hub1.","C":"Enable the ExpressRoute premium add-on.","D":"Create a hub virtual network in US East."},"isMC":true,"question_images":["https://www.examtopics.com/assets/media/exam-media/04224/0017800001.png"],"answer_ET":"A","answer":"A","timestamp":"2021-12-13 04:48:00","answers_community":["A (100%)"],"answer_description":"","exam_id":54,"question_id":144},{"id":"zM4hzXlVqO9gYlqjuHyF","answer_images":[],"timestamp":"2022-09-01 19:04:00","question_text":"You have a .NET web service named Service1 that performs the following tasks:\n✑ Reads and writes temporary files to the local file system.\n✑ Writes to the Application event log.\nYou need to recommend a solution to host Service1 in Azure. The solution must meet the following requirements:\n✑ Minimize maintenance overhead.\n✑ Minimize costs.\nWhat should you include in the recommendation?","choices":{"C":"an App Service Environment (ASE)","A":"an Azure App Service web app","D":"an Azure Functions app","B":"an Azure virtual machine scale set"},"answers_community":["A (90%)","10%"],"isMC":true,"url":"https://www.examtopics.com/discussions/microsoft/view/79105-exam-az-305-topic-4-question-10-discussion/","answer_description":"","answer_ET":"A","exam_id":54,"answer":"A","question_images":[],"question_id":145,"unix_timestamp":1662051840,"topic":"4","discussion":[{"poster":"techrat","comment_id":"884602","upvote_count":"22","timestamp":"1682792820.0","content":"Passed exam with 979 today, this question was on the exam. I am 1000% confident A is correct."},{"comment_id":"664933","poster":"Balaji_c_s","timestamp":"1662756480.0","content":"Selected Answer: A\nA is correct","upvote_count":"16"},{"poster":"[Removed]","content":"Selected Answer: A\nA is correct","timestamp":"1731436500.0","upvote_count":"1","comment_id":"1310824"},{"timestamp":"1718112840.0","content":"Came in June 2024","upvote_count":"4","comment_id":"1228476","poster":"binodwa"},{"comment_id":"859095","upvote_count":"12","timestamp":"1680453960.0","poster":"NotMeAnyWay","content":"Selected Answer: A\nA. an Azure App Service web app\n\nAzure App Service is a fully managed platform for building, deploying, and scaling web apps. By hosting Service1 as an Azure App Service web app, you can minimize maintenance overhead, as the platform takes care of the underlying infrastructure, patching, and scaling. Azure App Service also offers a cost-effective solution that can be scaled up or out as needed to meet the demands of your application.\n\nWhile Azure Functions, virtual machine scale sets, and App Service Environments can also host web services, they may not provide the same balance of minimal maintenance overhead and cost-effectiveness as Azure App Service web apps do in this scenario."},{"content":"Azure Functions seem to acces to local temporary files and can write to event log... why is not the correct option?","comments":[{"comment_id":"983806","upvote_count":"1","poster":"sawanti","timestamp":"1692288900.0","content":"How Azure Function is a web service? Azure Function is a serverless FaaS, not Web Service as Azure Web Apps"}],"timestamp":"1679248080.0","poster":"malcubierre","upvote_count":"5","comment_id":"844065"},{"poster":"orionduo","timestamp":"1675906080.0","comment_id":"802717","content":"Selected Answer: A\nAzure provides built-in diagnostics to assist with debugging an App Service app.\nThere are three main types of files that an Azure Web App can deal with\n➊ Persisted files\n➋ Temporary files\n➌ Machine level read-only files\nLogs messages generated by your application code. The messages can be generated by the web framework you choose, or from your application code directly using the standard logging pattern of your language. Each message is assigned one of the following categories: Critical, Error, Warning, Info, Debug, and Trace. You can select how verbose you want the logging to be by setting the severity level when you enable application logging.","upvote_count":"4"},{"upvote_count":"1","poster":"moshos","content":"Selected Answer: A\nCorrect answer: A","timestamp":"1675726200.0","comment_id":"800365"},{"upvote_count":"3","timestamp":"1675381800.0","content":"Selected Answer: A\nA. an Azure App Service web app would be the best solution as it provides low maintenance overhead and cost-effectiveness while being able to host .NET web services. Additionally, Azure App Service provides easy integration with other Azure services, and it supports the reading and writing of files to the local file system. The Application event log can also be written to using Azure Diagnostic Logs, which can be configured within the Azure App Service.","comment_id":"796538","poster":"VBK8579"},{"content":"A. an Azure App Service web app","upvote_count":"1","comment_id":"787047","timestamp":"1674600300.0","poster":"VBK8579"},{"content":"How come a function app isn't a good answer here?","upvote_count":"2","poster":"509325_5153","timestamp":"1669693260.0","comments":[{"timestamp":"1670140740.0","content":"a .NET web service ?","upvote_count":"4","comment_id":"734928","poster":"Ivanwu"}],"comment_id":"729884"},{"content":"Selected Answer: A\nWeb App can write Application Event logs, you enable this in the Monitoring section of the Web App.","upvote_count":"4","comment_id":"704065","timestamp":"1666719060.0","poster":"Galron"},{"poster":"sKaiNL","comment_id":"673941","upvote_count":"3","timestamp":"1663662840.0","content":"Selected Answer: A\nA should be ok"},{"comment_id":"663998","upvote_count":"2","comments":[{"poster":"GarryK","content":"Sorry A","upvote_count":"4","timestamp":"1662669540.0","comment_id":"663999"}],"poster":"GarryK","content":"Selected Answer: B\nAnswer is B. \nApp service has local disk to write temp files. For more persistent files, mount shares:\nhttps://docs.microsoft.com/en-us/azure/app-service/operating-system-functionality\nhttps://docs.microsoft.com/en-us/azure/app-service/configure-connect-to-azure-storage?tabs=portal&pivots=container-linux\nApp Service can write to application logging windows: \nhttps://docs.microsoft.com/en-us/azure/app-service/troubleshoot-diagnostic-logs\n\nit was never said that the app wanted to write logs into a filesystem.","timestamp":"1662669480.0"},{"timestamp":"1662136080.0","content":"@Mderators, please fit answer for this one. Web App can't write to Windows OS Application event log. In addition if question is not about Application event log, but about Application log it is still invalid, because of limited up to 12 hours enabled time.","upvote_count":"1","comment_id":"657598","poster":"One111"},{"comments":[{"poster":"bootless","comments":[{"content":"hello, i think answer is A because is asking for Application event log and not for filesystem log. Also app service minimize the costs.","timestamp":"1662117660.0","comments":[{"timestamp":"1662118080.0","content":"You're Right, to analyze the application log we have to choose Application Logging (Filesystem) or Application Logging (Blob).\nBut to minimize the maintenance and the costs i think A is still the correct answer.","upvote_count":"3","poster":"mse89","comment_id":"657348"}],"poster":"mse89","comment_id":"657344","upvote_count":"3"}],"comment_id":"656476","upvote_count":"1","content":"Source: https://docs.microsoft.com/en-us/azure/app-service/troubleshoot-diagnostic-logs#enable-application-logging-windows\nQuote: \"The Filesystem option is for temporary debugging purposes, and turns itself off in 12 hours. The Blob option is for long-term logging, and needs a blob storage container to write logs to. \"","timestamp":"1662051900.0"}],"content":"Selected Answer: B\nAnswer cannot be correct because with a web app this feature will only be on for 12 hours. After this time it will be disabled and has to be enabled again. So you have to use VMs","poster":"bootless","upvote_count":"3","comment_id":"656475","timestamp":"1662051840.0"}]}],"exam":{"lastUpdated":"12 Apr 2025","provider":"Microsoft","isImplemented":true,"numberOfQuestions":286,"name":"AZ-305","isBeta":false,"id":54,"isMCOnly":false},"currentPage":29},"__N_SSP":true}