{"pageProps":{"questions":[{"id":"5ID3pJIOQZ8I4S6EdmVi","unix_timestamp":1629297480,"question_id":21,"answer":"B","answer_ET":"B","answers_community":["B (100%)"],"question_text":"Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements.\nYour company has Azure subscription linked to their Azure Active Directory (Azure AD) tenant.\nAs a Global administrator for the tenant, part of your responsibilities involves managing Azure Security Center settings.\nYou are currently preparing to create a custom sensitivity label.\nSolution: You start by altering the pricing tier of the Security Center.\nDoes the solution meet the goal?","isMC":true,"choices":{"B":"No","A":"Yes"},"question_images":[],"exam_id":56,"answer_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/59894-exam-az-500-topic-1-question-28-discussion/","answer_description":"","timestamp":"2021-08-18 16:38:00","discussion":[{"comment_id":"463834","upvote_count":"39","content":"Here is the documentation for this question.\n1- Create Sensitive Info type\n2- Create Pattern\n3- Choose Confidence level\n4- Choose and define primary elements\n5- Value for char prox\n6- Choose recommend confidence level\n7 - Submit","timestamp":"1634526300.0","poster":"salmantarik"},{"poster":"Irishtk","timestamp":"1651195860.0","comments":[{"comment_id":"699364","poster":"koreshio","upvote_count":"3","content":"also this does not seem included in the exam topics anymore\nref: https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE3VC70\nhttps://learn.microsoft.com/en-us/certifications/exams/az-500","timestamp":"1666214940.0"}],"comment_id":"594165","upvote_count":"16","content":"Technology in this question has been obsolete by newer products.\nSome pricing changes to Microsoft Defender for Cloud(formerly Azure Security Center). \"Purchase of a Microsoft Purview account is required to apply data sensitivity classifications and run the scans.\"\nhttps://docs.microsoft.com/en-us/azure/defender-for-cloud/information-protection"},{"poster":"stonwall12","comment_id":"1355868","content":"Selected Answer: B\nAnswer: B, No\n\nReason: Altering the pricing tier of Security Center is not related to creating custom sensitivity labels. Sensitivity labels are part of Microsoft Information Protection, not Azure Security Center.\n\nReference: https://learn.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels?view=o365-worldwide","timestamp":"1739402700.0","upvote_count":"1"},{"content":"This is what you should do before creating a sensitivity label:\n\"To make sure you have permissions to create and manage sensitivity labels, see Permissions required to create and manage sensitivity labels\"\n\n\nDepending on the portal you're using, navigate to one of the following locations:\n\n +Sign in to the Microsoft Purview portal > Information Protection card > Sensitivity labels.\n\n If the Information Protection solution card isn't displayed, select View all solutions and then select Information Protection from the Data Security section.\n\n +Sign in to the Microsoft Purview compliance portal > Solutions > Information protection > Labels\n\nOn the Labels page, select + Create a label to start the new sensitivity label configuration.","poster":"schpeter_091","comment_id":"1309046","upvote_count":"1","timestamp":"1731144360.0"},{"timestamp":"1729167960.0","content":"Here is the documentation for this question.\n1- Create Sensitive Info type\n2- Create Pattern\n3- Choose Confidence level\n4- Choose and define primary elements\n5- Value for char prox\n6- Choose recommend confidence level\n7 - Submit","poster":"Ruffyit","upvote_count":"1","comment_id":"1299210"},{"content":"Selected Answer: B\n\"Security Center\" is not a product anymore (it would be Defender for Cloud or Purview). But it does not seem that custom labels would require a special tier.","comment_id":"1257431","timestamp":"1722253320.0","poster":"pentium75","upvote_count":"1"},{"content":"Selected Answer: B\nB is the answer.\n\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/create-sensitivity-labels\nFirst, create and configure the sensitivity labels that you want to make available for apps and other services. For example, the labels you want users to see and apply from Office apps.","comment_id":"891164","timestamp":"1683435840.0","poster":"zellck","upvote_count":"2"},{"poster":"majstor86","timestamp":"1677780900.0","upvote_count":"3","content":"Selected Answer: B\nB. No is correct answer","comment_id":"827204"},{"content":"Selected Answer: B\nNo is correct answer","poster":"Eltooth","comment_id":"569272","upvote_count":"2","timestamp":"1647457080.0"},{"comment_id":"488728","poster":"rohitmedi","content":"correct answer","upvote_count":"4","timestamp":"1638065280.0"},{"poster":"PBA1211","comment_id":"474161","content":"https://docs.microsoft.com/en-us/microsoft-365/compliance/create-sensitivity-labels?view=o365-worldwide","upvote_count":"3","timestamp":"1636357560.0"},{"content":"No - First you have to create a custom sensitive information type.","poster":"trevax","upvote_count":"14","timestamp":"1629297480.0","comment_id":"426919","comments":[{"poster":"AmitDeorukhkar","timestamp":"1634417580.0","content":"Hello Trevax, Do you mind sharing documentation please.","upvote_count":"2","comment_id":"463286"}]}],"topic":"1"},{"id":"Yv6iDYgIGpbl7NoIvFvb","url":"https://www.examtopics.com/discussions/microsoft/view/63567-exam-az-500-topic-1-question-29-discussion/","question_id":22,"question_images":[],"topic":"1","choices":{"A":"Yes","B":"No"},"answer_images":[],"answers_community":["B (100%)"],"exam_id":56,"answer_ET":"B","answer_description":"","question_text":"Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements.\nYour company has Azure subscription linked to their Azure Active Directory (Azure AD) tenant.\nAs a Global administrator for the tenant, part of your responsibilities involves managing Azure Security Center settings.\nYou are currently preparing to create a custom sensitivity label.\nSolution: You start by integrating Security Center and Microsoft Cloud App Security.\nDoes the solution meet the goal?","answer":"B","timestamp":"2021-10-04 14:09:00","isMC":true,"unix_timestamp":1633349340,"discussion":[{"poster":"Shahrezza","comment_id":"457104","timestamp":"1633349340.0","upvote_count":"7","content":"Given answer is correct. Must create Custom Information type first for description of the sensitive Label"},{"comment_id":"1355869","timestamp":"1739402700.0","content":"Selected Answer: B\nAnswer: B, No\n\nReason: Integrating Security Center and Microsoft Cloud App Security is not directly related to creating custom sensitivity labels.\n\nReference: https://learn.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels?view=o365-worldwide","poster":"stonwall12","upvote_count":"1"},{"comment_id":"1299211","timestamp":"1729168020.0","upvote_count":"1","poster":"Ruffyit","content":"Microsoft Cloud App Security is now called Microsoft Defender for Cloud Apps\nAnswer B - First step is to connect Defender for Cloud Apps to Azure via the Connected Apps page.\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/connect-azure"},{"upvote_count":"2","content":"Selected Answer: B\nB is the answer.\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/azip-integration#how-it-works","poster":"zellck","comment_id":"891136","timestamp":"1683430680.0"},{"content":"Microsoft Cloud App Security is now called Microsoft Defender for Cloud Apps\nAnswer B - First step is to connect Defender for Cloud Apps to Azure via the Connected Apps page.\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/connect-azure","poster":"Irishtk","upvote_count":"1","timestamp":"1651199280.0","comment_id":"594178"},{"content":"Selected Answer: B\nB is correct answer.","upvote_count":"2","poster":"Eltooth","comment_id":"569273","timestamp":"1647457380.0"},{"comments":[{"timestamp":"1684525440.0","poster":"Holii","comments":[{"comment_id":"902210","poster":"Holii","content":"To follow this, you do not need to connect Security Center or enable MDCA prior to creating a custom Sensitive Information Type. This can be done by the Microsoft Purview portal today, and could have before been done via the AIP portal (legacy).\n\nTherefore, it's still B...because this technology is redundant in the process of creating a SIT.","timestamp":"1684525680.0","upvote_count":"3"}],"upvote_count":"1","content":"? What you said is basically \"Answer B is correct, but here's the reason as to why A is correct\"","comment_id":"902209"}],"comment_id":"566184","upvote_count":"1","poster":"rc05","timestamp":"1647093120.0","content":"Answer Is Correct\nMicrosoft Cloud App Security is now called Microsoft Defender for Cloud Apps\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/connect-azure\nBefore you create the Sensitive Info Type, you need to connect Security Center to MS Defender for Cloud Apps. \n\nProcess that Salmantarik has on Q28 is correct."},{"comment_id":"488729","content":"correct answer","upvote_count":"2","timestamp":"1638065280.0","poster":"rohitmedi"},{"timestamp":"1634526420.0","poster":"salmantarik","comment_id":"463835","upvote_count":"2","content":"https://docs.microsoft.com/en-us/microsoft-365/compliance/create-a-custom-sensitive-information-type?view=o365-worldwide"}]},{"id":"3Ks6CZsUftiXfI9FCGpU","answer_ET":"B","answers_community":["B (100%)"],"unix_timestamp":1625142120,"isMC":true,"url":"https://www.examtopics.com/discussions/microsoft/view/56773-exam-az-500-topic-1-question-3-discussion/","answer_description":"","question_id":23,"answer":"B","timestamp":"2021-07-01 14:22:00","answer_images":[],"exam_id":56,"discussion":[{"timestamp":"1629291780.0","comments":[{"comment_id":"456039","timestamp":"1633173480.0","upvote_count":"1","comments":[{"timestamp":"1635093840.0","content":"Agreed, while federation would force user logon limitations it would require minimum 4 servers (2 ADFS/2 WAP).","poster":"cometoit","comment_id":"467052","upvote_count":"1"}],"content":"Agreed answer is : PTA","poster":"Shahrezza"}],"content":"- \"password policies and user logon limitations affect user accounts that are synced to the Azure AD tenant\" → Federation or PTA \n- \"the amount of necessary servers are reduced\" → Federation > PTA > PHS (number of server)\n\nSo the answer is PTA.","upvote_count":"18","poster":"trevax","comment_id":"426861"},{"content":"the phrase ...amount of necessary servers is reduced eliminate Federation as an answer choice.","timestamp":"1633063440.0","poster":"LeDefatman","upvote_count":"7","comment_id":"455284"},{"content":"Selected Answer: B\nAnswer: B, No\n\nReason: Federation with AD FS doesn't meet the requirement to reduce server count as it requires additional infrastructure including multiple AD FS servers and web application proxies for high availability.\n\nReference: https://learn.microsoft.com/en-us/azure/active-directory/hybrid/connect/choose-ad-authn#federation-authentication-with-ad-fs","poster":"stonwall12","comment_id":"1355830","upvote_count":"1","timestamp":"1739397360.0"},{"content":"Selected Answer: B\nNo password write back is needed","upvote_count":"1","poster":"Vaibhav39","comment_id":"1337092","timestamp":"1736163000.0"},{"upvote_count":"2","comment_id":"1264202","content":"the phrase ...amount of necessary servers is reduced eliminate Federation as an answer choice. Guide: https://sites.google.com/view/learnmicrosoftcomenustrainingm/home","poster":"rysano","timestamp":"1723389300.0"},{"timestamp":"1722245580.0","poster":"pentium75","upvote_count":"1","comment_id":"1257378","content":"Selected Answer: B\nNo because ADFS does anything but 'reduce the amount of necessary servers'."},{"comment_id":"1189193","content":"A federated authentication system relies on an external trusted system to authenticate users. Some companies want to reuse their existing federated system investment with their Azure AD hybrid identity solution. The maintenance and management of the federated system falls outside the control of Azure AD. It's up to the organization by using the federated system to make sure it's deployed securely and can handle the authentication load.","timestamp":"1712220780.0","upvote_count":"2","poster":"Ruffyit"},{"upvote_count":"1","comment_id":"942846","timestamp":"1688480040.0","poster":"ESAJRR","content":"Selected Answer: B\nB. Answer is No"},{"timestamp":"1683419040.0","content":"Selected Answer: B\nB is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/hybrid/connect/choose-ad-authn#cloud-authentication\nWhat are the on-premises server requirements beyond the provisioning system: Azure AD Connect?\nFederation with AD FS\n- Two or more AD FS servers\n- Two or more WAP servers in the perimeter/DMZ network","poster":"zellck","comment_id":"891079","upvote_count":"1"},{"upvote_count":"1","content":"Selected Answer: B\nB. Answer is No","poster":"majstor86","comment_id":"827157","timestamp":"1677778740.0"},{"comment_id":"809997","timestamp":"1676496420.0","upvote_count":"1","poster":"Fal991l","content":"the solution of using federation with Active Directory Federation Services (AD FS) meets the goal of integrating Active Directory and the Azure AD tenant while making sure that password policies and user logon limitations affect user accounts that are synced to the Azure AD tenant, and reducing the number of necessary servers.\n\nFederation with AD FS allows for a single sign-on (SSO) experience for users, where they can authenticate with their on-premises Active Directory credentials and gain access to resources in both the on-premises environment and in the cloud. This ensures that password policies and user logon limitations applied to on-premises Active Directory also apply to Azure AD.(ChatGPT)"},{"timestamp":"1670689020.0","comment_id":"741092","poster":"AZ5cert","content":"B. No\nAD FS will trust third party trusted domains across the enterprise for seamless authentication","upvote_count":"1"},{"upvote_count":"1","comment_id":"735760","poster":"salmantarik","timestamp":"1670228580.0","content":"The correct answer is B\nHowever, correct answer is SSO + PHS as it enforces two password policies (Password complexity policy and Password expiration policy also User Logon Restrictions) and it doesnt require any agents."},{"content":"Can go with PTA and Standby PHS. Need to think of ADFS only when third party application authentication is required. Question doesn't speak about third-party apps. So you don't need ADFS.","timestamp":"1669943580.0","upvote_count":"1","poster":"God2029","comment_id":"733292"},{"timestamp":"1664411520.0","content":"The 'correct answer' misses the point. You have recommended (in a badly stated fashion) 2 options: (1) PTA and (2) PHS with SSO. Option 2 does not care about your on prem settings, but option 1 does. Since you recommend both options and only one does the job, mission failed. This answer is incorrect (but not for the reason mentioned in 'correct answer').","upvote_count":"1","poster":"MarcusPlexus","comment_id":"682234"},{"poster":"TheLegendPasha","comment_id":"582343","upvote_count":"3","timestamp":"1649325120.0","content":"Selected Answer: B\nLess server means instantly not federation."},{"poster":"Arpilinde92","content":"Selected Answer: B\nNo is correct answer","upvote_count":"1","timestamp":"1647861300.0","comment_id":"572130"},{"upvote_count":"1","comment_id":"567877","timestamp":"1647285780.0","poster":"Eltooth","content":"Selected Answer: B\nB is correct"},{"comment_id":"500223","timestamp":"1639343340.0","upvote_count":"1","poster":"AS179","content":"correct answer is NO"},{"timestamp":"1638064500.0","comment_id":"488698","poster":"rohitmedi","content":"correct answer","upvote_count":"1"},{"comment_id":"484095","poster":"mjsm","timestamp":"1637578380.0","content":"Selected Answer: B\nno additional server","upvote_count":"1"},{"poster":"Rume","content":"must make sure that password policies and user logon limitations affect user accounts that are synced to the Azure AD tenant ....\nThis point to PTA \n\namount of necessary servers are reduced...Suggest to use PHS.\n\nMy vote would be B: NO.\n\nRef:https://docs.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-pta\n\nHowever, certain organizations wanting to enforce their on-premises Active Directory security and password policies, can choose to use Pass-through Authentication instead","timestamp":"1625142120.0","comment_id":"395929","upvote_count":"3"}],"question_text":"Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements.\nYour company has an Active Directory forest with a single domain, named weylandindustries.com. They also have an Azure Active Directory (Azure AD) tenant with the same name.\nYou have been tasked with integrating Active Directory and the Azure AD tenant. You intend to deploy Azure AD Connect.\nYour strategy for the integration must make sure that password policies and user logon limitations affect user accounts that are synced to the Azure AD tenant, and that the amount of necessary servers are reduced.\nSolution: You recommend the use of federation with Active Directory Federation Services (AD FS).\nDoes the solution meet the goal?","question_images":[],"topic":"1","choices":{"B":"No","A":"Yes"}},{"id":"HHidFpmVIH1pposKoZjI","topic":"1","isMC":true,"unix_timestamp":1626984780,"url":"https://www.examtopics.com/discussions/microsoft/view/58357-exam-az-500-topic-1-question-30-discussion/","answer_ET":"A","question_text":"Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements.\nYour company has Azure subscription linked to their Azure Active Directory (Azure AD) tenant.\nAs a Global administrator for the tenant, part of your responsibilities involves managing Azure Security Center settings.\nYou are currently preparing to create a custom sensitivity label.\nSolution: You start by creating a custom sensitive information type.\nDoes the solution meet the goal?","answer_description":"","exam_id":56,"discussion":[{"comments":[{"content":"this link is insteresting to read too: https://learn.microsoft.com/en-us/purview/get-started-with-sensitivity-labels","poster":"STC007","comment_id":"999271","upvote_count":"1","timestamp":"1693904220.0"},{"content":"I get the answer is correct but I am confused as to what MS AIP has to do with managing Azure Security Center settings. I find this question misleading, unless I am missing the connection.","upvote_count":"5","comment_id":"475782","comments":[{"timestamp":"1638821820.0","upvote_count":"2","poster":"InnaB","content":"Not even sure why sensitive info type is the correct answer, given that the question is only asking about a label. Custom labels can be created without being associated to a sensitive info type...","comment_id":"495402","comments":[{"timestamp":"1638909780.0","content":"create Custom Information type first for description of the sensitive Label.","poster":"wooyourdaddy","upvote_count":"2","comment_id":"496320"}]},{"content":"exact ...","poster":"AZ5002023","upvote_count":"1","comment_id":"1082629","timestamp":"1701180360.0"}],"timestamp":"1636576140.0","poster":"adamsca"}],"comment_id":"447332","poster":"cosine","upvote_count":"8","content":"Correct. This can be achieved by using MS AIP.\nhttps://docs.microsoft.com/en-us/azure/information-protection/what-is-information-protection","timestamp":"1632014820.0"},{"poster":"stonwall12","comment_id":"1355870","timestamp":"1739402760.0","upvote_count":"1","content":"Selected Answer: A\nAnswer: A, Yes\n\nReason: Creating a custom sensitive information type is a step in the right direction for creating a custom sensitivity label. Custom sensitive information types can be used as conditions in sensitivity labels, allowing for more precise control over data classification and protection.\n\nReference: https://learn.microsoft.com/en-us/microsoft-365/compliance/create-a-custom-sensitive-information-type?view=o365-worldwide"},{"upvote_count":"3","comment_id":"1304000","poster":"derf225","content":"1- Create Sensitive Info type\n2- Create Pattern\n3- Choose Confidence level\n4- Choose and define primary elements\n5- Value for char prox\n6- Choose recommend confidence level\n7 - Submit","timestamp":"1730124960.0"},{"content":"Correct. This can be achieved by using MS AIP.\nhttps://docs.microsoft.com/en-us/azure/information-protection/what-is-information-protection","timestamp":"1729168080.0","poster":"Ruffyit","comment_id":"1299212","upvote_count":"1"},{"upvote_count":"2","content":"On exam 1/2/24","timestamp":"1704508020.0","comment_id":"1114895","poster":"brooklyn510"},{"upvote_count":"1","comment_id":"1070875","timestamp":"1699998960.0","content":"Answer: A\nExplanation:\ncreate Custom Information type first for description of the sensitive Label. Reference:\n \n https://docs.microsoft.com/en-us/office365/securitycompliance/customize-a-built-in-sensitive-information- type","poster":"wardy1983"},{"poster":"KyDD","comment_id":"1018230","content":"Seems like it would be a M365 Security Center.","timestamp":"1695768060.0","upvote_count":"2"},{"content":"Selected Answer: A\nA. Yes","comment_id":"830085","timestamp":"1678033740.0","poster":"majstor86","upvote_count":"3"},{"upvote_count":"1","content":"Ans A is correct","poster":"Irishtk","comment_id":"594685","timestamp":"1651264260.0"},{"comment_id":"569274","timestamp":"1647457440.0","upvote_count":"2","content":"Selected Answer: A\nA is correct answer.","poster":"Eltooth"},{"upvote_count":"1","comment_id":"500258","content":"A is correct","poster":"AS179","timestamp":"1639348260.0"},{"timestamp":"1638065280.0","upvote_count":"1","poster":"rohitmedi","comment_id":"488730","content":"correct answer"},{"upvote_count":"4","comment_id":"420722","poster":"dumdada","timestamp":"1628240760.0","content":"sounds legit"},{"content":"Answer is correct","comment_id":"411897","poster":"Lobe","timestamp":"1626984780.0","upvote_count":"4"}],"choices":{"B":"No","A":"Yes"},"timestamp":"2021-07-22 22:13:00","question_id":24,"answers_community":["A (100%)"],"answer":"A","answer_images":[],"question_images":[]},{"id":"JggWTdL5NbhDGtSgCuX9","choices":{"D":"The ActivityID and Count() parameters.","B":"The ActivityID and CountIf() parameters.","A":"The EventID and CountIf() parameters.","C":"The EventID and Count() parameters."},"exam_id":56,"question_images":[],"question_id":25,"answer_images":[],"answer_ET":"C","unix_timestamp":1625057100,"isMC":true,"question_text":"You have a sneaking suspicion that there are users trying to sign in to resources which are inaccessible to them.\nYou decide to create an Azure Log Analytics query to confirm your suspicions. The query will detect unsuccessful user sign-in attempts from the last few days.\nYou want to make sure that the results only show users who had failed to sign-in more than five times.\nWhich of the following should be included in your query?","url":"https://www.examtopics.com/discussions/microsoft/view/56341-exam-az-500-topic-1-question-31-discussion/","answers_community":["C (77%)","A (23%)"],"topic":"1","discussion":[{"comments":[{"comment_id":"1248246","timestamp":"1721038140.0","poster":"xRiot007","content":"You don't need this part \"latest_failed_login=arg_max(TimeGenerated, Account)\". It is not important when the last login occurred, you already have a filter that will retrieve everything newer than the timeframe. Regarding timeframe, if you define, you should also use it like this \"| where TimeGenerated > ago(timeframe)\"","upvote_count":"1"}],"content":"-- KUSTO Query\n\nlet timeframe = 1d;\nSecurityEvent\n| where TimeGenerated > ago(1d)\n| where AccountType == 'User' and EventID == 4625 // 4625 - failed log in\n| summarize failed_login_attempts=count(), latest_failed_login=arg_max(TimeGenerated, Account) by Account \n| where failed_login_attempts > 5\n| project-away Account1","comment_id":"457879","poster":"Ram9533","timestamp":"1633458900.0","upvote_count":"41"},{"comment_id":"394725","poster":"Rume","comments":[{"timestamp":"1629429420.0","upvote_count":"3","poster":"kakakayayaya","content":"Slightly different, note count and countIF","comment_id":"427841"}],"content":"too many repeat questions - \nAnswer is correct.","upvote_count":"7","timestamp":"1625057100.0"},{"poster":"stonwall12","upvote_count":"2","comment_id":"1355871","content":"Selected Answer: C\nAnswer: C, The EventID and Count() parameters.\n\nReason: To detect unsuccessful sign-in attempts, you need to use the EventID parameter to filter for failed sign-in events. The Count() function is used to aggregate and count these events per user. By using these together, you can identify users with more than five failed sign-in attempts, meeting the requirement of the query.\n\nReference: https://learn.microsoft.com/en-us/azure/azure-monitor/logs/query-language","timestamp":"1739402760.0"},{"content":"You don't need this part \"latest_failed_login=arg_max(TimeGenerated, Account)\". It is not important when the last login occurred, you already have a filter that will retrieve everything newer than the timeframe. Regarding timeframe, if you define, you should also use it like this \"| where TimeGenerated > ago(timeframe)\"","poster":"Ruffyit","timestamp":"1730467260.0","comment_id":"1305819","upvote_count":"1"},{"comment_id":"1257438","content":"Selected Answer: C\nI was tricked because the question doesn't say it would be about on-premises AD logins. Entra ID signins have neither ActivityID not EventID column.","upvote_count":"1","poster":"pentium75","timestamp":"1722253920.0"},{"comment_id":"1185844","upvote_count":"1","content":"the answer is A as the question is asking only to show users who failed to sign in at least 5 times.","poster":"DLR","timestamp":"1711772640.0"},{"upvote_count":"3","content":"Selected Answer: C\nIn Azure Log Analytics, you typically use the Kusto Query Language (KQL) to analyze and query data. When you want to detect unsuccessful user sign-in attempts and ensure that the results only show users who had failed to sign in more than five times, you need to count the occurrences of failed sign-ins per user and then filter the results based on that count.\n\nFor sign-in logs, the relevant information is usually stored in fields like EventID (which identifies the type of event) and UserPrincipalName (or a similar field that identifies the user). The actual names of these fields can vary depending on how the data is structured in your specific Azure Log Analytics workspace.\n\nOption C, \"The EventID and Count() parameters,\" is the closest to what you need, but it's important to use the correct KQL syntax and structure the query properly. Here's how you can structure the query:","timestamp":"1705838640.0","comment_id":"1127780","poster":"Srihari0908"},{"upvote_count":"1","content":"Answer: C\nExplanation:\nKUSTO Query\nlet timeframe = 1d;\nSecurityEvent\n| where TimeGenerated > ago(1d)\n| where AccountType == 'User' and EventID == 4625 // 4625 - failed log in\n| summarize failed_login_attempts=count(), latest_failed_login=arg_max(TimeGenerated, Account) by Account\n| where failed_login_attempts > 5\n| project-away Account1\nReference: https://docs.microsoft.com/en-us/azure/azure-monitor/log-query/examples","timestamp":"1699998960.0","poster":"wardy1983","comment_id":"1070876"},{"timestamp":"1695595740.0","content":"Selected Answer: C\nC. The EventID and Count() parameters.","comment_id":"1016214","upvote_count":"1","poster":"ESAJRR"},{"upvote_count":"3","poster":"ArchitectX","timestamp":"1694726400.0","content":"Selected Answer: C\nC is the right answer","comment_id":"1007930"},{"content":"Selected Answer: C\nC. The EventID and Count() parameters.","comment_id":"945078","timestamp":"1688687580.0","upvote_count":"2","poster":"ESAJRR"},{"timestamp":"1684402620.0","upvote_count":"5","content":"Selected Answer: A\nTo create an Azure Log Analytics query that detects unsuccessful user sign-in attempts and filters for users who failed to sign in more than five times, you would need to include the EventID and CountIf() parameters in your query.\n\nThe EventID parameter helps identify the sign-in events, typically represented by specific event IDs in the logs.\n\nThe CountIf() parameter allows you to specify a condition to count the occurrences that meet that condition. In this case, you would set the condition to count the unsuccessful sign-in attempts.\n\nTherefore, the correct answer is:\n\nA. The EventID and CountIf() parameters.","comment_id":"901003","poster":"Andre369"},{"content":"Answer A is correct.\nThe count() function and countif() function are both used in Azure Log Analytics queries to count the number of records that match a certain condition. However, they differ in the way they apply the condition.\nThe count() function simply counts all records in a given table, without applying any conditions. For example, count(*) would count all records in a table.\nThe countif() function, on the other hand, applies a condition to the count operation. It counts the number of records that match a specific condition, specified using a Boolean expression. For example, countif(Severity == 'Error') would count the number of records where the severity is 'Error'.\nIn summary, the count() function counts all records, while the countif() function counts only the records that match a specified condition.","timestamp":"1681921320.0","poster":"MaryamNesa","comment_id":"874882","comments":[{"poster":"justjeroen","comment_id":"878062","upvote_count":"3","timestamp":"1682238780.0","content":"Can I do something like countif(EventID == 4625) ?"}],"upvote_count":"2"},{"upvote_count":"1","poster":"jaanya","timestamp":"1680498720.0","comment_id":"859544","content":"SecurityEvent\n| where EventID == 4625\n| where TimeGenerated > ago(2d)\n| summarize count() by AccountName\n| where count_ > 5"},{"upvote_count":"2","comment_id":"827205","timestamp":"1677780960.0","poster":"majstor86","content":"Selected Answer: C\nC. The EventID and Count() parameters."},{"upvote_count":"3","timestamp":"1670748960.0","poster":"salmantarik","content":"Correct answer. CountIf returns True of False and can used at a column. Count returns the number of records.","comment_id":"741553"},{"comment_id":"594694","upvote_count":"5","timestamp":"1651266000.0","poster":"Irishtk","content":"Ans is C. Example of the Kusto query at:\nhttps://techcommunity.microsoft.com/t5/core-infrastructure-and-security/failed-login-report-using-log-analytics-and-logic-apps/ba-p/745025","comments":[{"upvote_count":"1","content":"Thanks","poster":"AzureAdventure","comment_id":"971688","timestamp":"1691124240.0"}]},{"timestamp":"1645460820.0","poster":"udmraj","comment_id":"553011","upvote_count":"1","content":"Answer C is correct"},{"content":"Tricky I had assumed its count(if) since its failed attempts","comment_id":"544034","poster":"Charnyashe","timestamp":"1644433500.0","upvote_count":"1"},{"content":"Selected Answer: C\nAnswer is correct","upvote_count":"2","comment_id":"515642","timestamp":"1641208800.0","poster":"the_dstryr"},{"content":"Selected Answer: C\nCorrect","comment_id":"500260","upvote_count":"1","poster":"AS179","timestamp":"1639348380.0"},{"poster":"cfsxtuv33","content":"So, I guess \"C\" is correct? Quite honestly, not sure.","upvote_count":"1","comment_id":"494008","timestamp":"1638658500.0"},{"timestamp":"1638065340.0","comment_id":"488731","content":"correct answer","poster":"rohitmedi","upvote_count":"2"},{"upvote_count":"1","content":"C is correct","comment_id":"474227","timestamp":"1636368960.0","poster":"Ash1109"},{"upvote_count":"3","timestamp":"1634750220.0","comment_id":"465291","poster":"examtopics6969","content":"C is correct"},{"upvote_count":"1","poster":"Ikazimirs","content":"its frustrating when MS words it this way - I believe the logic here is that the Failed even has a unique ID so COUNT() is sufficient - having said that you could say COUNTIF(EventID = iniqueID) and get same result - both are correct!","timestamp":"1633353120.0","comment_id":"457152"},{"comments":[{"poster":"draddo9","comment_id":"453642","upvote_count":"1","comments":[{"comment_id":"455553","poster":"SlavMar","content":"IMO A.\nhttps://docs.microsoft.com/en-us/azure/data-explorer/kusto/query/countif-aggfunction\nReturns a count of rows for which Predicate evaluates to true\nSo you can create predicate that checks if login is failed or successfull","upvote_count":"1","timestamp":"1633092660.0"}],"content":"I think you are wrong mate. Look there - https://docs.microsoft.com/en-us/powerapps/maker/canvas-apps/functions/function-table-counts \n\nCountIf function counts records with logical value. There you have value like \"More/less than five failed tries\" So IMO provided answer is correct","timestamp":"1632860280.0"}],"content":"Ans is \"A. The EventID and CountIf() parameters.\", you must only count the failed logins.","poster":"JChris","upvote_count":"1","comment_id":"452696","timestamp":"1632769680.0"}],"timestamp":"2021-06-30 14:45:00","answer_description":"","answer":"C"}],"exam":{"isImplemented":true,"name":"AZ-500","isMCOnly":false,"isBeta":false,"numberOfQuestions":505,"provider":"Microsoft","id":56,"lastUpdated":"12 Apr 2025"},"currentPage":5},"__N_SSP":true}