{"pageProps":{"questions":[{"id":"Vpuu9VSoSvnwq9E3xlfQ","answer_description":"Reference:\nhttps://azure.microsoft.com/en-gb/overview/what-is-iaas/\nhttps://azure.microsoft.com/en-gb/overview/what-is-paas/\nhttps://azure.microsoft.com/en-gb/overview/what-is-saas/","answer_ET":"","question_id":446,"discussion":[{"upvote_count":"520","comments":[{"timestamp":"1736754780.0","poster":"kamal2907","upvote_count":"3","comment_id":"1339823","content":"Correct answer is NNY\n\nExplanation\nAzure files is - Paas not iaas\nDNS server running on vm is example of - Iaas\nMicrosoft intune is - Saas"},{"upvote_count":"16","poster":"mlop3s","timestamp":"1680414900.0","content":"Fully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard \nhttps://learn.microsoft.com/en-us/azure/storage/files/storage-files-introduction\nSo NNY","comment_id":"858558"},{"upvote_count":"4","content":"Azure Files is a service not infrastructure, so PaaS","poster":"6c89312","timestamp":"1716280020.0","comment_id":"1214817"},{"comment_id":"944218","timestamp":"1688607780.0","content":"2)Yes, that is correct. A DNS server running on Azure virtual machines (VMs) is an example of Infrastructure as a Service (IaaS).","poster":"Kunjuvava","upvote_count":"11"},{"content":"Answer is NYY as per google and chatgpt","timestamp":"1705900140.0","comments":[{"content":"False False True actually.","poster":"Ariel235788","comment_id":"1294900","upvote_count":"1","timestamp":"1728432420.0"}],"poster":"SB9898","upvote_count":"3","comment_id":"1128343"},{"timestamp":"1684481460.0","upvote_count":"2","poster":"semauni","comment_id":"901732","content":"I agree with Azure files being PaaS. In this video from Microsoft, Azure Storage is explicitly listed as PaaS: https://learn.microsoft.com/en-us/training/modules/azure-networking-fundamentals/azure-virtual-network-fundamentals"},{"comments":[{"timestamp":"1707221340.0","comment_id":"1142124","upvote_count":"1","content":"I agree. Az Files is PaaS","poster":"Aqshata"}],"timestamp":"1688607840.0","content":"Azure Files is not an example of Infrastructure as a Service (IaaS). Azure Files is a cloud-based file sharing service provided by Microsoft Azure, which falls under the category of Platform as a Service (PaaS).","upvote_count":"11","poster":"Kunjuvava","comment_id":"944220"},{"content":"Azure file is STORAGE thus Infrastructure Component...Offered as a Service ! So IaaS.\nIaas = VMs a wrong shortcut. Infrastructure encompasses Network, Storage, Compute, Infrastructure Security and Remote accesses. \nIt's even the first line : \n\nInfrastructure as a service (IaaS) is a type of cloud computing service that offers essential compute, storage, and networking resources on demand, on a pay-as-you-go basis. IaaS is one of the four types of cloud services, along with software as a service (SaaS), platform as a service (PaaS), and serverless.\n\nhttps://azure.microsoft.com/en-us/overview/what-is-iaas/","comments":[{"comment_id":"773691","upvote_count":"2","poster":"Hoeishetmogelijk","content":"Indeed it is. Go to this page: https://azure.microsoft.com/en-us/resources/cloud-computing-dictionary/what-is-azure/azure-iaas/#overview\nThen click on the link \"Storage\" and that will get you on this page where Azure Files is mentioned: https://azure.microsoft.com/en-us/products/category/storage/","timestamp":"1673539980.0"},{"timestamp":"1680456720.0","comment_id":"859177","upvote_count":"5","poster":"valid_case","content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol you know and love, SMB (Server Message Block)","comments":[{"poster":"Kanatius","comments":[{"poster":"[Removed]","upvote_count":"1","comment_id":"1043753","content":"Unless I'm wrong, this image is not available in any Microsoft articles such as Learn, and can only be accessed directly via this link. It suggests that they've hidden this image, and thus made it OUTDATED and deprecated.\n\nAzure Files are PaaS. This existing article proves it:\nhttps://learn.microsoft.com/en-us/azure/storage/files/storage-files-introduction\n\"Fully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks.\"\nNo need to manage the underlying infrastructure. PaaS. Simple as.","timestamp":"1697324700.0"}],"content":"No, Azure Files is IaaS\n\nhttps://learn.microsoft.com/en-gb/training/azure-fundamentals/intro-to-azure-fundamentals/media/azure-services-6c41a736.png","timestamp":"1685358060.0","upvote_count":"12","comment_id":"909307"}]},{"comment_id":"492081","content":"Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks.\nhttps://docs.microsoft.com/en-us/azure/storage/files/storage-files-introduction\nSo, Azure files is PaaS with no doubts","poster":"aleksei89123","timestamp":"1638409980.0","upvote_count":"15","comments":[{"timestamp":"1645472640.0","upvote_count":"5","poster":"GetulioJr","comment_id":"553184","comments":[{"comment_id":"853333","poster":"VjAlpha","content":"It clealy says Azure files is fully managed and no OS updates are needed. Files is PaaS - https://learn.microsoft.com/en-us/azure/storage/files/storage-files-introduction","timestamp":"1680012720.0","upvote_count":"3"}],"content":"It is under Compute. It is still IaaS. :)"}]},{"content":"I think your interpretation of the line you quoted is incorrect: not everything that's Compute or Netwoking is IaaS. Services under Serverless Computing for example, are computing services but they are PaaS. Same thing with Container Services or VM Scale Sets.\n\nAnd to quote Microsoft: \"Like IaaS, PaaS includes infrastructure—servers, storage, and networking—but also middleware, development tools, business intelligence (BI) services, database management systems, and more.\"\n\nhttps://azure.microsoft.com/en-us/overview/what-is-paas/\n\nHowever - all Storage services do indeed appear as IaaS (look the image):\n\nhttps://docs.microsoft.com/en-gb/learn/modules/intro-to-azure-fundamentals/tour-of-azure-services","poster":"LiturghianPope","upvote_count":"10","timestamp":"1646734500.0","comment_id":"563149"}],"poster":"Harry28731","timestamp":"1638265620.0","comment_id":"490557","upvote_count":"27"}],"timestamp":"1630512780.0","content":"I concur with the rest:\n\nAzure files is PaaS.\nDNS server on Azure VM is IaaS.\nSo NNY.","poster":"xian05","comment_id":"437313"},{"upvote_count":"114","poster":"Ace_Defective","comments":[{"timestamp":"1636686960.0","poster":"Anindya1994","comments":[{"comments":[{"comment_id":"478313","comments":[{"comment_id":"707093","timestamp":"1667034840.0","comments":[{"poster":"Aly24","content":"Gli account di archiviazione sono PAAS.","upvote_count":"1","comment_id":"1225372","timestamp":"1717669980.0"},{"content":"its really tricky and confusion question, read this sentence from your above link \n\"Like IaaS, PaaS includes infrastructure—servers, storage, and networking—but also middleware, development tools, business intelligence (BI) services, database management systems, and more. PaaS is designed to support the complete web application lifecycle: building, testing, deploying, managing, and updating.\" \nHence PaaS has Server,storage + middleware tools \n\nalthough in picture of services the storage was under IaaS!!","poster":"hebbo777","upvote_count":"2","timestamp":"1672404720.0","comment_id":"761928"}],"content":"Storage account are not PAAS\nhttps://azure.microsoft.com/en-us/overview/what-is-paas/","upvote_count":"3","poster":"Falcon966"}],"poster":"Anindya1994","timestamp":"1636918380.0","content":"I mean to say Storage accounts are PAAS. Storage which is Disk is an IAAS.","upvote_count":"12"}],"timestamp":"1636799580.0","upvote_count":"6","poster":"whyyoutookmyname","content":"Storage is not PAAS\nhttps://azure.microsoft.com/en-us/overview/what-is-paas/","comment_id":"477392"},{"comment_id":"835269","upvote_count":"4","timestamp":"1678469460.0","content":"Azure Storage is IaaS.","poster":"Ciupaz"}],"upvote_count":"4","comment_id":"476649","content":"Azure files and storage both are PAAS"},{"upvote_count":"2","poster":"IndyB","comment_id":"500192","content":"Thank you for that marvelous explanation. I feel confident about this question now and I think you're right.","timestamp":"1639338000.0"},{"comment_id":"765786","timestamp":"1672844340.0","poster":"Hoeishetmogelijk","upvote_count":"1","content":"You are completely right! I indeed see Azure Files mentioned on the page that opens when you click on the \"Storage\" link.","comments":[{"comments":[{"poster":"gauloises22","comment_id":"774627","upvote_count":"1","content":"Also, as with many other questions, anything \"on an Azure VM\" indicates that you need to deploy this VM, otherwise it won't be mentioned, so that alone indicates IaaS. DNS, like Intune, as standalone services (no hint about background infrastructure) are SaaS","timestamp":"1673623980.0"},{"upvote_count":"7","content":"So I think the answer is: Y - N - Y","timestamp":"1673540820.0","poster":"Hoeishetmogelijk","comment_id":"773698"}],"content":"And for the second see this page: https://www.poweradmin.com/blog/dns-in-the-cloud-solid-or-not/#:~:text=DNS%20in%20the%20cloud%20is,a%20Service%20(IaaS)%20solution.\nStating: \"DNS in the cloud is generally considered to be an Infrastructure as a Service (IaaS) solution.\"","comment_id":"773697","timestamp":"1673540700.0","poster":"Hoeishetmogelijk","upvote_count":"2"}]}],"comment_id":"451337","content":"Okay, this one is a pain the a$$. My initial though was NNY but that is wrong. I'd go with YNY now. Somebody will have to do a better explanation on why the second is Yes for me to change that answer. \n\n1. Azure Files is an example of infrastructure as a service. We can see this by following this link: \nhttps://azure.microsoft.com/en-us/overview/what-is-azure/iaas/?OCID=AID2200277_SEM_4f474f37105d10e7fe342e7811e71afe:G:s&ef_id=4f474f37105d10e7fe342e7811e71afe:G:s&msclkid=4f474f37105d10e7fe342e7811e71afe#products\n\nAnd going to the storage services link. We can see that yes, Azure Files is considered as Infrastructure as a Service. \n\nI am sticking with N as DNS server on an AZURE VM is Infrasturcture. You can google and you'll see references also to DNS set up as IaaS. You google DNS PaaS and you get zero, zilch. \n\nMicrosoft Intune is totally Software as a Service. If you studied for the Microsoft 365 Fundamentals then this a give me.","timestamp":"1632562080.0"},{"content":"Azure Blob Storage, Azure Files, Azure Table Storage, and Azure Queue Storage: These are typically considered PaaS offerings because they provide a managed service","timestamp":"1739231100.0","poster":"Dmarcetic","upvote_count":"1","comment_id":"1354706"},{"content":"Azure File is an example of IAAS. \nReferecne: https://learn.microsoft.com/en-us/azure/storage/files/storage-files-planning#management-concepts\n\nThere are two main types of storage accounts you will use for Azure Files deployments:\n\nGeneral purpose version 2 (GPv2) storage accounts and FileStorage storage accounts.\nBoth are part of IAAS.\nAlso if you check the usage of Azure files it has Lift and Shift of appliaction, use as a disk drive.\nSo the usage is like a hard disk which can be considered as IAAS.","poster":"NikPat3125","timestamp":"1738753620.0","comments":[{"upvote_count":"1","content":"\"Azure file shares are fully managed file shares in the cloud that are accessible via the industry standard SMB and NFS protocols.\" based on your link, \"fully managed\" means it is PaaS","poster":"dcdcdcdcdc","comment_id":"1355884","timestamp":"1739403960.0"}],"comment_id":"1351818","upvote_count":"1"},{"poster":"Yanagoo","timestamp":"1738329900.0","upvote_count":"1","content":"NNY is the ans","comment_id":"1349524"},{"timestamp":"1737811080.0","comment_id":"1346460","poster":"trashbox","upvote_count":"2","content":"Y Azure storage account seems to be classified as IaaS by MS\nN Azure Virtual Machines is IaaS\nY Microsoft Intune is SaaS"},{"comment_id":"1313364","poster":"acf4f6b","timestamp":"1731812640.0","upvote_count":"1","content":"Serverless file shares\nDistributed file system built from the ground up to be highly available and durable—no hidden IaaS VMs or NAS filers."},{"upvote_count":"2","comment_id":"1309312","poster":"SureshGupta1989","content":"NNY. Azure File is PaaS. DNS on VM is IaaS, MS Intune is SaaS","timestamp":"1731217500.0"},{"timestamp":"1730367420.0","comment_id":"1305359","upvote_count":"2","poster":"sahal56","content":"NNY\nFiles => PaaS (we dont update underlying runtime or fabric service; just use it :|) )\nDNS on VM => IaaS (VM itslelf IaaS)\nINTUne is SaaS"},{"content":"The answer is NNY CoPilot: Nope, Azure Files is a Platform as a Service (PaaS)., Nope, a DNS Server running on an Azure VM would be considered Infrastructure as a Service (IaaS). Yes, Microsoft Intune is a Software as a Service (SaaS) solution","upvote_count":"2","poster":"PN60","comment_id":"1304104","timestamp":"1730140320.0"},{"timestamp":"1729972320.0","poster":"PN60","comment_id":"1303406","content":"It should be NNY\nCoPilot: Microsoft SQL Server 2019 installed on a VM falls under Infrastructure as a Service (IaaS). DNS Server running on an Azure VM would be considered Infrastructure as a Service (IaaS),","upvote_count":"1"},{"comment_id":"1299452","content":"* Azure Files is part of Microsoft Azure's Platform as a Service (PaaS) offering. So first is a NO\n* An AZURE VM (it does not matter what is installed in it) is always Iaas. So The second one is a NO\n* SaaS (software as a service) refers to software located in the cloud. With this type of software, users access it through the internet, not through installed software. This means that Microsoft Intune is a SaaS software.. So the last one is a YES\nHence: NO, NO, YES","timestamp":"1729199880.0","poster":"Super63","upvote_count":"3"},{"comment_id":"1293872","timestamp":"1728223920.0","content":"Answer is NNY\nwhy Azure files is PAAS and not IAAS\nFully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks. \nSource: https://learn.microsoft.com/en-us/azure/storage/files/storage-files-introduction\nKey benefits section","poster":"Mitra_1","upvote_count":"1"},{"timestamp":"1728166140.0","upvote_count":"2","poster":"ZayanH","content":"NO NO YES","comment_id":"1293621"},{"content":"My answer is NNY","comment_id":"1292122","upvote_count":"2","poster":"GagisaPRO","timestamp":"1727817840.0"},{"content":"Azure Files is actually an example of Platform as a Service (PaaS), not Infrastructure as a Service (IaaS).\n\nAzure Files provides fully managed file shares that can be accessed over industry-standard protocols like SMB (Server Message Block) and NFS (Network File System). Since it abstracts away the underlying infrastructure (e.g., storage hardware, networking, operating system, etc.), users don't have to manage these aspects, which is characteristic of PaaS offerings. Instead, users interact with the service at a higher level, simply storing and accessing files without worrying about the details of managing the underlying infrastructure.\n\nIn contrast, IaaS would provide more control over the underlying infrastructure, such as virtual machines or raw storage resources.","poster":"dstephens","upvote_count":"1","timestamp":"1727807340.0","comment_id":"1292071"},{"upvote_count":"1","timestamp":"1726283460.0","content":"Should it not be NNY?","comment_id":"1283459","poster":"BoPeng"},{"comment_id":"1271732","upvote_count":"1","timestamp":"1724516220.0","content":"NNY acc to GPT","poster":"blkrn2828"},{"poster":"Erasable_Mak","upvote_count":"5","comment_id":"1262762","content":"So i asked Microsoft copilot itself and the answer is:\n\n\n1.) Azure Files is an example of infrastructure as a service (IaaS).\n Answer: No. Azure Files is actually a managed file storage service, which is considered a part of Platform as a Service (PaaS).\n\n2.) A DNS server that runs on an Azure virtual machine is an example of platform as a service (PaaS).\n Answer: No. A DNS server running on an Azure virtual machine would be considered Infrastructure as a Service (IaaS) because it involves managing the underlying infrastructure.\n\n3.) Microsoft Intune is an example of software as a service (SaaS).\n Answer: Yes. Microsoft Intune is indeed a Software as a Service (SaaS) as it provides software over the internet without needing local installation.\n\nSo, the correct answers are:\n\n No\n No\n Yes","timestamp":"1723177560.0"},{"timestamp":"1721927520.0","content":"NNY\n\nAzure files and stroge is PaaS.\nDNS server on Azure VM is IaaS.","comment_id":"1255110","upvote_count":"2","poster":"darthhansie"},{"poster":"Alsari","content":"How can something that runs on A VM be a platform as a service ?","upvote_count":"3","comment_id":"1247758","timestamp":"1720959840.0"},{"comment_id":"1231415","content":"I will go with YNY. Azure Files is a file storage service in Azure that offers fully managed file shares in the cloud accessible via the Server Message Block (SMB) protocol. Azure Files allows you to mount Azure file shares from cloud or on-premises deployments, making it a service that abstracts the underlying infrastructure and provides a platform-level capability. This aligns more with PaaS because it delivers a managed service that developers and IT professionals can use without having to manage the underlying infrastructure.\n\nIn summary, Azure Files is better classified as PaaS rather than IaaS because it provides a managed file storage service that abstracts the complexities of the underlying infrastructure.","timestamp":"1718551440.0","poster":"VaibhavGawali","upvote_count":"2","comments":[{"poster":"VaibhavGawali","content":"My bad, I meand NNY. Somehow I can't edit my answer even though it is awaiting for mderator approval.","upvote_count":"1","comment_id":"1231417","timestamp":"1718551620.0"}]},{"poster":"Bamidele","timestamp":"1718218260.0","comment_id":"1229422","upvote_count":"1","content":"Azure provides storage options for both IaaS and PaaS. It is dependent upon the particular Azure service you are referring to. Absolutely, it is regarded as a PaaS if you're referring to Azure's database services, such as Azure SQL Database. But if you're talking about simple storage services like Azure Files, Blobs, or Discs, those are usually categorised as IaaS since they offer virtual storage space without the extra platform functions associated with PaaS."},{"poster":"doza210","upvote_count":"4","timestamp":"1717840380.0","content":"It should be NNY","comment_id":"1226665"},{"upvote_count":"2","timestamp":"1717263540.0","content":"NO . NO . YES","comment_id":"1222838","poster":"siculoct"},{"comment_id":"1212305","upvote_count":"2","content":"Final Answer: NNY\n- Storage Account (IaaS)\n - Azure blob , azure files, azure queue, azure table are (paas)\n- VM (Iaas)","timestamp":"1715841780.0","poster":"varinder82"},{"content":"That completely depends on the definition and services and do not forget most of the cloud services have evolved to a model that blurs the line between IaaS and PaaS\n\nAzure Storage Services can be categorized under both IaaS and PaaS, depending on the use case.\n\nThey are IaaS since Azure Storage Services provide the fundamental building blocks for cloud-based applications and services, where you get raw storage capacity (like a hard drive in the cloud) and are responsible for how you manage and utilize that capacity.\n\nThey are PaaS since Azure handles all the infrastructure management, maintenance, and scalability, allowing users to focus on how they utilize the storage rather than managing the underlying hardware or OS.\n\nBut according to the old definition and used cases you think most if the services under Azure Storage Services can be count under IaaS but some of them are more aligned with PaaS definiton.\n\nIt's *NY.","upvote_count":"1","poster":"gr8sandhu","comment_id":"1208417","timestamp":"1715177880.0"},{"poster":"JEN_2313_","content":"Answer is Y N Y. \n\n1. Azure Storage = Iaas\n2. Anything Virtual & PaaS is FALSE ALWAYS\n3. Microsoft Intune = SaaS","timestamp":"1714607820.0","comment_id":"1205244","upvote_count":"2"},{"upvote_count":"1","timestamp":"1713228240.0","comment_id":"1196272","poster":"Amolaz900","content":"No \nDNS services running on Azure Virtual Machines would typically fall under the category of Infrastructure as a Service (IaaS). In this setup, you're managing the virtual machines, including the installation, configuration, and maintenance of the DNS software, such as BIND or Windows DNS Server, yourself.\nNo\nAzure File Share falls under the category of Platform as a Service (PaaS). It provides fully managed file shares in the cloud, eliminating the need to manage underlying infrastructure. Users can access Azure File Shares from anywhere using the industry-standard SMB protocol.\nYes"},{"poster":"Nel8","content":"Answer should be N N Y","upvote_count":"1","comment_id":"1195157","timestamp":"1713049620.0"},{"timestamp":"1712945460.0","poster":"RaghuRayapati","upvote_count":"1","comment_id":"1194470","content":"Answer is NNY"},{"content":"Correct answer is: NNY\nExplaination:\n- Azure Files is a Platform as a Service (PaaS). It’s part of Azure’s managed services, meaning you don’t have to worry about infrastructure management, which is typically associated with Infrastructure as a Service (IaaS).\n- A DNS server that runs on an Azure Virtual Machine is an example of Infrastructure as a Service (IaaS). In this case, you’re managing the virtual machine and the DNS server software running on it. This is different from PaaS where the underlying infrastructure including the server software is managed by the cloud provider.\n- Microsoft Intune is a Software as a Service (SaaS). It’s a cloud-based enterprise mobility management (EMM) service that helps enable your workforce to be productive while keeping your corporate data protected.","poster":"theFriday","comment_id":"1192658","upvote_count":"2","timestamp":"1712720940.0"},{"content":"Azure file is Iaas \nDNS server on azure vm is iaas","timestamp":"1712237880.0","upvote_count":"1","comment_id":"1189368","poster":"leels"},{"content":"NO, NO, YES","poster":"Payu1994","timestamp":"1711824300.0","comment_id":"1186278","upvote_count":"1"},{"upvote_count":"1","content":"According to chatGPT\nYes, Azure Files is an example of infrastructure as a service (IaaS).\n\nNo, a DNS server on an Azure virtual machine is not an example of platform as a service (PaaS); it falls under infrastructure as a service (IaaS).\n\nYes, Microsoft Intune is an example of software as a service (SaaS).","comment_id":"1169375","timestamp":"1709976000.0","poster":"KK0021"},{"timestamp":"1709094060.0","content":"Should be NNY","upvote_count":"1","comment_id":"1161249","poster":"Samjb"},{"upvote_count":"3","poster":"jrb_321","comment_id":"1127954","content":"Disk-IAAS, Blob-PAAS and File-SAAS\nAnswer:- NNY","timestamp":"1705854960.0"},{"comment_id":"1119704","poster":"ArmadilloIta","timestamp":"1704975660.0","upvote_count":"3","content":"N-N-Y\nDo you need to update your operating system when using Azure Files? No? It's PaaS\n\"A DNS Server that runs\"... It doesn't say DNS service. It's IaaS\nLast is SaaS"},{"upvote_count":"1","comments":[{"upvote_count":"1","content":"ChatGpt reply for \"Azure file is an example of IAAS true or false\" \nFalse\nAzure File is an example of a Platform as a Service (PaaS) offering in Microsoft Azure, not Infrastructure as a Service (IaaS). Azure File provides fully managed file shares in the cloud, allowing users to easily share files across applications running in Azure and on-premises environments. It abstracts away the underlying infrastructure management, making it a PaaS solution rather than an IaaS solution where users would have more control over virtual machines and networking components.","comment_id":"1151089","poster":"Pratiksha0401","timestamp":"1708011180.0"}],"content":"For Azure File here is what ChatGPT replied:\n\nHello! An Azure File can actually be both IaaS (Infrastructure as a Service) and PaaS (Platform as a Service), depending on how you choose to use it. \n\nIf you use Azure File as a standalone service, where you manually provision and manage the infrastructure resources (such as virtual machines and storage accounts) yourself, then it falls under the IaaS category. \n\nOn the other hand, if you integrate Azure File with other services in the Azure platform, such as Azure App Service or Azure Functions, and leverage the automatic scaling, monitoring, and management capabilities provided by the platform, then it falls under the PaaS category.\n\nSo, whether you want more control over the infrastructure or prefer the convenience of managed services, Azure File can adapt to your needs.","poster":"umavaja","comment_id":"1117064","timestamp":"1704752340.0"},{"comment_id":"1113362","upvote_count":"1","content":"Azure Files is not an example of Infrastructure as a Service (IaaS).\nAzure Files is a Platform as a Service (PaaS) solution that provides fully managed file shares in the cloud. It allows you to create file shares that can be accessed from anywhere using the industry-standard Server Message Block (SMB) protocol.\nWith Azure Files, you do not need to manage underlying infrastructure, such as servers or storage devices. Instead, Azure Files provides a fully managed platform for storing and accessing files, with features such as automatic scaling, high availability, and backup and recovery.\nIn contrast, Infrastructure as a Service (IaaS) solutions, such as Azure Virtual Machines or Azure Virtual Network, provide access to virtualized infrastructure resources, such as servers, storage, and networking. With IaaS, you are responsible for managing and maintaining the underlying infrastructure, including operating systems, applications, and security.\nTherefore, Azure Files is an example of a PaaS solution, not an IaaS solution.","timestamp":"1704348960.0","poster":"KucaStonojka"},{"timestamp":"1703319720.0","content":"I think it should be YNY, the second one is IaaS","poster":"windy610","comment_id":"1103928","upvote_count":"1"},{"content":"Actually, Azure Files is an example of Platform as a Service (PaaS) 1. PaaS is a cloud computing model where a third-party provider delivers hardware and software tools to users over the internet. In this model, the provider hosts the hardware and software on its own infrastructure and is responsible for maintenance, while the user accesses the services through a web browser 1.\n\n answer : N N Y","comment_id":"1100900","poster":"Saranpriya","upvote_count":"1","timestamp":"1703010900.0"},{"timestamp":"1701083280.0","comment_id":"1081443","poster":"JijiRoSSie","upvote_count":"1","content":"NNY\nasked chatgtp!\nAzure Files falls under the category of PaaS because it provides managed file shares that can be accessed using the standard Server Message Block (SMB) protocol.\n\nIaaS (Infrastructure as a Service): You are responsible for managing the virtual machine (VM) that hosts the DNS server, including the operating system, software updates, and any configuration related to the server."},{"comment_id":"1081086","poster":"gfalconx","timestamp":"1701042600.0","content":"the answer here is YNY\n\nAzure files can be considered as either paas or iaas depending on how its used.\nIf you see a virtual machine that must be iaas\nintune is a saas service","upvote_count":"1"},{"upvote_count":"1","timestamp":"1698062580.0","comment_id":"1051793","poster":"JayStolzenwald","content":"I believe the answer is Y,N,Y:\n\n- Azure Files is an example of Infrastructure as a Service (IaaS). It provides managed file shares in the cloud that are accessible via the industry standard Server Message Block (SMB) protocol.\n\n- A DNS server that runs on an Azure virtual machine is also an example of Infrastructure as a Service (IaaS), not Platform as a Service (PaaS). In this scenario, you're managing the operating system and the applications (including the DNS server) running on it.\n\n- Microsoft Intune is an example of Software as a Service (SaaS). It's a cloud-based service that focuses on mobile device management (MDM) and mobile application management (MAM)."},{"poster":"MiyelaniRikhotso","timestamp":"1697392740.0","comment_id":"1044358","content":"Azure files is an example of PaaS.","upvote_count":"2"},{"upvote_count":"2","poster":"dgerok","comment_id":"1028629","timestamp":"1696839960.0","content":"A DNS server that runs on an Azure virtual machine is an example of IaaS, or Infrastructure as a Service, which means that the cloud provider offers computing resources such as servers, storage, and networking that can be configured and managed by the user. The user is responsible for installing, updating, and maintaining the software on the virtual machine, including the DNS server. Therefore, a DNS server that runs on an Azure virtual machine is not a PaaS service, but an IaaS service."},{"upvote_count":"2","content":"Azure Files is not strictly an IaaS or PaaS service, as it can be used in both ways depending on the use case. For example, Azure Files can be used as an IaaS service when it is mounted on a virtual machine (VM) as a disk storage2. Azure Files can also be used as a PaaS service when it is accessed by an application via the REST API2. Therefore, Azure Files is a flexible and versatile service that can support different cloud computing models.","poster":"dgerok","comment_id":"1028625","timestamp":"1696839720.0"},{"poster":"JayAbi1692","timestamp":"1695569820.0","content":"Azure files is PaaS.\nDNS server on Azure VM is IaaS.\nSo NNY.","comment_id":"1015957","upvote_count":"3"},{"upvote_count":"2","poster":"Sanj2023","content":"DNS Server on Azure VM is Iaas, not Paas.. Incorrect answer","comment_id":"1015238","timestamp":"1695495300.0"},{"comment_id":"1014775","upvote_count":"2","poster":"SAFM","content":"N-->because Azure Storage services (therefore files) are Paas\nN-->because VMs are IaaS\nY-->MS intune seems to be SaaS","timestamp":"1695460860.0"},{"content":"This clear the confusion.\n\nAnswer should be. NNY\n\nhttps://search.brave.com/search?q=is+azure+file+a+paas%3F&source=android","poster":"wedie1021","upvote_count":"2","timestamp":"1695157440.0","comments":[{"comment_id":"1011697","content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol known as SMB.1 Azure Files is a cloud storage service that allows Windows Server administrators to access Server-Message-Block-Protocol (SMB) shares in the Azure cloud by setting up file shares in the Azure management console.4 According to some sources, Azure Storage is considered a PaaS solution since it does not require the management of OS updates, load balancing, performance allocation, etc.3 Azure Storage is the foundation for Windows and Linux Azure Virtual Machines and can support large distributed applications.2 Azure PaaS is a deployment and development environment that delivers simple cloud-based apps to complex, cloud-enabled applications.0","upvote_count":"1","timestamp":"1695157500.0","poster":"wedie1021"}],"comment_id":"1011695"},{"upvote_count":"1","poster":"Arshxd","comment_id":"1010196","timestamp":"1695004980.0","content":"Statement 1 is true.\nStatement 2 is false.\nStatement 3 is true."},{"timestamp":"1694218020.0","comment_id":"1002774","content":"No, No, Yes \nAzure file - Iaas\nAVM - Iaas\nMicrosoft Intune - Saas","upvote_count":"1","poster":"Sandip_Bhandari"},{"poster":"Veerti","upvote_count":"4","comment_id":"998318","timestamp":"1693813440.0","content":"Appeared in my exam - 4/9/23\nYNY"},{"poster":"ElPile","upvote_count":"1","timestamp":"1693210620.0","comment_id":"991928","content":"NNY, not sure why using an Azure Virtual Machine is a PaaS."},{"comment_id":"989645","poster":"iamrushabhshahh","timestamp":"1692933420.0","content":"Answer will be NO, No , Yes \n\nAs Azure file is Paas\nIf Dns server is running on custom VM ( vm it self is iaas ) then it became Iaas\nAnd Intune is softwere for managing server , database and all endpoints.","upvote_count":"2"},{"poster":"RajgopalG","upvote_count":"1","timestamp":"1692881940.0","content":"Azure files is IAAS. --> It is actually part of the Azure Storage service, which falls under the category of Infrastructure as a Service (IaaS).\nDNS server on Azure VM is IaaS. a DNS server running on a VM would fall under the IaaS model.\nAns: NNY","comment_id":"989213"},{"timestamp":"1692112200.0","upvote_count":"1","comment_id":"981792","content":"is Azure Files PAAS or IAAS\nChatGPT\nAzure Files is a Platform as a Service (PaaS) offering provided by Microsoft Azure. It's a managed file storage service that allows you to create and manage shared file storage that can be accessed using the standard Server Message Block (SMB) protocol or the Network File System (NFS) protocol. As a PaaS offering, Azure Files abstracts much of the underlying infrastructure management, such as hardware and operating system maintenance, allowing you to focus more on using the storage service itself rather than managing the underlying infrastructure.","poster":"kejo2"},{"content":"DNS and all networking is IaaS","comment_id":"976328","poster":"V_key","timestamp":"1691563980.0","upvote_count":"1"},{"content":"According to chatgpt Azure Files are example of PaaS. \nDNS server on azureVM is example IaaS.\nand microsoft Intune is example of Saas.\nso N/N/Y","timestamp":"1690502640.0","upvote_count":"2","comment_id":"965178","poster":"Riyaaaaa"},{"upvote_count":"2","comment_id":"957092","timestamp":"1689823200.0","comments":[{"timestamp":"1689951780.0","upvote_count":"1","comment_id":"958629","poster":"Bani_studies","content":"wat did u answer ??"}],"poster":"taro123","content":"This question was in exam on Jul 20th 2023"},{"upvote_count":"1","poster":"Vibhu123","comment_id":"954845","content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage.","timestamp":"1689648420.0"},{"comment_id":"954642","content":"Answer is N N Y. \n\nAzure file is not IaaS. You don't manage anything in Azure Files apart from managing auth & creating file shares. Its a fully managed PaaS Solution. \nDNS server running inside a Azure VM is IaaS. On the other hand, Azure DNS is PaaS.","upvote_count":"1","timestamp":"1689629880.0","poster":"oopspruu"},{"poster":"petebear55","comment_id":"929827","timestamp":"1687373220.0","content":"YES\nNO\nYES","upvote_count":"2"},{"timestamp":"1687212180.0","content":"Interesting point from ChatGPT regarding Azure Files:\n\nIt's important to note that while Azure Files is a PaaS service, it can be utilized in both IaaS (Infrastructure-as-a-Service) and PaaS scenarios. You can mount Azure Files shares on Azure VMs, which makes it useful for IaaS scenarios where you require shared file storage across multiple VMs. Additionally, you can also access Azure Files shares from PaaS services like Azure App Service or Azure Functions.","poster":"jojolabubu","comment_id":"927982","upvote_count":"1"},{"upvote_count":"3","comment_id":"909303","content":"From the for data storages, only Azure Tables is Paas. Azure Files, Blob storage, Disks and Queues are IaaS. Look at this image from Microsoft: https://learn.microsoft.com/en-gb/training/azure-fundamentals/intro-to-azure-fundamentals/media/azure-services-6c41a736.png","comments":[{"upvote_count":"2","content":"From the five*** data storages, only Azure Tables is Paas. Azure Files, Blob storage, Disks and Queues are IaaS. Look at this image from Microsoft: https://learn.microsoft.com/en-gb/training/azure-fundamentals/intro-to-azure-fundamentals/media/azure-services-6c41a736.png","timestamp":"1685358000.0","comment_id":"909304","poster":"Kanatius"}],"poster":"Kanatius","timestamp":"1685357940.0"},{"comment_id":"889454","upvote_count":"1","timestamp":"1683211980.0","poster":"speedyweedy","content":"NNY\n\n\nAzure Files provides is an example of PaaS which fully managed file shares in the cloud, making it easy to migrate legacy applications that rely on file shares to the cloud without the need for additional infrastructure to manage. With Azure Files, users can share files across multiple virtual machines (VMs) in the same region or across regions, use standard SMB (Server Message Block) protocol to access the files, and take advantage of built-in features such as snapshots, geo-replication, and integration with Azure Active Directory.\nDNS running on virtual machine is IaaS"},{"poster":"sheilawu","comment_id":"887277","upvote_count":"1","comments":[{"content":"No, Azure Files is IaaS\n\nhttps://learn.microsoft.com/en-gb/training/azure-fundamentals/intro-to-azure-fundamentals/media/azure-services-6c41a736.png","comment_id":"909312","poster":"Kanatius","timestamp":"1685358120.0","upvote_count":"1"}],"timestamp":"1683026220.0","content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol you know and love, SMB (Server Message Block)."},{"poster":"sanjaygdr","comment_id":"867106","timestamp":"1681202880.0","content":"Azure File is a fully managed service in Azure that provides shared file storage in the cloud, and therefore it is not an example of Infrastructure as a Service (IaaS).\na DNS server running on an Azure virtual machine (VM) is an example of Infrastructure as a Service (IaaS) rather than Platform as a Service (PaaS).","upvote_count":"2"},{"timestamp":"1680863580.0","content":"This big picture says Azure files and DNS is Iaas => https://learn.microsoft.com/en-gb/training/modules/intro-to-azure-fundamentals/tour-of-azure-services\n\nAnd Chat GPT says Microsoft Intune is a SaaS: As a cloud-based service, Intune is considered a \"Software as a Service\" (SaaS) offering.\n\n\nSo, the answer is: YNY","upvote_count":"4","comment_id":"863731","poster":"LuchoGonzalez"},{"upvote_count":"1","comment_id":"857120","poster":"Nknow3","timestamp":"1680269520.0","comments":[{"comment_id":"901730","upvote_count":"1","content":"Doesn't \"without having to worry about managing the underlying infrastructure\" mean PaaS instead of IaaS for the first question?","timestamp":"1684481280.0","poster":"semauni"}],"content":"Correct: Y, Y, Y \nY, Azure file provides a fully managed file share in the cloud that can be accessed using the industry standard Server Message Block (SMB) protocol. With Azure File, you can easily move your on-premises file shares to the cloud without having to worry about managing the underlying infrastructure. You can also use it to store and share files across multiple virtual machines in the cloud.\nY, As a SaaS offering, Microsoft Intune provides a complete solution that is hosted and managed by Microsoft. You do not need to install or maintain any software on your own infrastructure, and you can simply subscribe to the service to start using it immediately."},{"timestamp":"1680202500.0","content":"Azure files-storage - Iaas \nDNS - Networking - Iaas \nIntune - SW- Saas","comment_id":"856106","upvote_count":"4","poster":"LA_AL"},{"content":"NNY is correct anser","comment_id":"853849","poster":"jayendra7","upvote_count":"1","timestamp":"1680050280.0"},{"poster":"Taleeya","comment_id":"841444","timestamp":"1679011920.0","content":"It should be NNY.","upvote_count":"3"},{"timestamp":"1677287100.0","content":"see the answer from chatGPT\nNo, a DNS server running in an Azure Virtual Machine is an example of Infrastructure as a Service (IaaS) rather than Platform as a Service (PaaS).\n\nIaaS provides users with virtualized infrastructure such as servers, storage, and networking. Users are responsible for installing and maintaining their own software and operating systems on these virtual machines. In this case, the Azure Virtual Machine is providing the infrastructure for the DNS server to run on.\n\nPaaS, on the other hand, provides users with a platform for building, deploying, and managing their applications. With PaaS, users do not need to manage the underlying infrastructure, as the platform provider handles that. PaaS often includes pre-built components, such as databases and middleware, that can be easily integrated into applications. Examples of PaaS offerings include Microsoft Azure App Service and Google App Engine.","upvote_count":"1","poster":"zhihao","comment_id":"821072"},{"comment_id":"815067","upvote_count":"7","poster":"viktornm","timestamp":"1676886900.0","content":"It must be NNY\n\nAzure Files are an example of PaaS (Platform as a Service) in Azure. Azure Files provides fully managed file shares in the cloud that can be accessed and used by different applications, platforms, and operating systems.\n\nDNS server that runs on an Azure Virtual Machine is an example of Infrastructure as a Service (IaaS), since the VM provides the infrastructure for hosting the DNS server, and the user is responsible for managing and maintaining the underlying operating system and software.\n\nPlatform as a Service (PaaS) typically provides higher-level services, such as application frameworks, databases, and development tools, where the underlying infrastructure is abstracted away from the user, and the provider handles the management and maintenance of the platform."},{"comment_id":"805652","upvote_count":"3","poster":"helpme1","timestamp":"1676147580.0","content":"was on exam 2/11/2023"},{"content":"No, No, Yes\n\n\"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol...\"","poster":"RDIO","comment_id":"799770","timestamp":"1675690740.0","upvote_count":"4"},{"content":"answer is NO/NO/YES","comment_id":"789639","poster":"azirila","timestamp":"1674826680.0","upvote_count":"2"},{"upvote_count":"1","timestamp":"1674817080.0","comment_id":"789522","poster":"Cloud_Ryder","content":"Azure Files is an example of infrastructure as Service --> Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. --> So the answer is No\n\nA DNS server that runs on a VM is an example of PaaS --> Yes --> If you consider the services individually then VM or DNS considered as IAAS\n\nMS In-tune is an example of SaaS --> Yes --> Microsoft In-tune is the SaaS solution provided by Microsoft. Microsoft In-tune is a cloud-based desktop and mobile device management tool."},{"poster":"fraffael","comment_id":"785588","content":"NNY Guys, \nAzure Files Is PaaS\nA DNS Server on Azure VM Is IaaS","upvote_count":"1","timestamp":"1674490620.0"},{"upvote_count":"2","timestamp":"1673988060.0","poster":"AzSimuz","comment_id":"779318","content":"Azure File is Paas,\nDns on a VM is still a VM so is IaaS,\nIntune is SaaS"},{"timestamp":"1673849880.0","poster":"KurtK","content":"The correct answer is YNY:\nAzure Files provides a fully managed file share in the cloud that can be accessed via the standard SMB protocol, NFS and SMB 3.0. It allows you to create file shares that can be accessed by Azure VMs and on-premises machines. It provides a fully managed service that allows you to store and access files in the same way as you would with a traditional file server, but with the scalability and availability of the cloud.\n- In this case, running a DNS server on an Azure virtual machine would fall under the category of IaaS, as the user is responsible for managing and maintaining the virtual machine, including the DNS server software.\n- Intune:SaaS","comment_id":"777359","comments":[{"content":"This is right!","poster":"Sarmad_Mansour","upvote_count":"3","comment_id":"778329","timestamp":"1673906340.0"}],"upvote_count":"4"},{"content":"No | No | Yes\n\n1. Azure Files is PaaS as in Microsoft Learn its mentioned that Azure Files is FULLY managed that means its PaaS. \n“Take advantage of fully managed file shares in the cloud that are accessible via the industry-standard SMB and NFS protocols.”\nhttps://azure.microsoft.com/en-us/products/storage/files/#mosaic-oc2ed1\n\n2. DNS server is just Domain name system which resolute human readable name to computer readable IP address. \nSo installing DNS software on VM (IaaS), how it will become PaaS?\nhttps://www.quora.com/Is-a-DNS-server-that-runs-on-Azure-Virtual-Machine-an-example-of-PaaS-or-IaaS\n\n3. Microsoft Intune is SaaS","upvote_count":"3","comment_id":"772721","timestamp":"1673455140.0","poster":"Rohit2023"},{"content":"While Azure Files can be used to store files that are used by applications, it is not considered to be a PaaS service. It is considered to be a part of IaaS service by Microsoft Azure, since it is a service that provides storage in the cloud, and is built on top of the Azure Storage platform. Additionally, it is not a Platform as it does not provide any developer environment, hosting, development frameworks and other tools.\nWhen DNS is running on a virtual machine (VM) in the cloud, it is considered to be an example of Infrastructure as a Service (IaaS). IaaS is a type of cloud computing service that provides virtualized computing resources over the internet, such as virtual machines, storage, and networking. In this case, the virtual machine is a specific infrastructure that is being used to run the DNS service. The customer is responsible for managing the virtual machine and the DNS service on top of it.\nSaaS is a category of cloud computing that provides software services over the internet, usually on a subscription basis. Instead of installing and maintaining software on individual computers or servers, users can access the software and its associated data over the internet.\nThe correct answer is YNY","poster":"Benzitho","timestamp":"1673378940.0","upvote_count":"3","comment_id":"771732"},{"comment_id":"767257","content":"Azure Files, Azure Blob Storage, Azure Data lakes and Azure Disk storage are IaaS offerings","poster":"etanvandan7","timestamp":"1672978020.0","upvote_count":"2"},{"content":"NNY is correct","comment_id":"766298","poster":"Shreyanka","timestamp":"1672900740.0","upvote_count":"3"},{"comment_id":"766056","poster":"kazan","content":"Ans - NNY","timestamp":"1672863960.0","upvote_count":"2"},{"timestamp":"1672863660.0","poster":"kazan","comment_id":"766053","upvote_count":"3","comments":[{"content":"Agreed. Azure Files is PaaS. \nAzure Files offers fully managed file shares in the cloud that are accessible via the industry standard Server Message Block (SMB) protocol, Network File System (NFS) protocol, and Azure Files REST API.","comment_id":"770833","timestamp":"1673295900.0","poster":"sansan2022","upvote_count":"1"}],"content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol"},{"comment_id":"763936","poster":"xinting","upvote_count":"1","timestamp":"1672687740.0","content":"YNY\nThere's debate over whether Azure Storage is IaaS and PaaS and both got MS evidences. Well Azure Storage is tricky because some part is IaaS and some is PaaS. You can see people from MS use both of them refering to Azure Storage. But I will stick to IaaS because it is clearly on the IaaS products page: https://azure.microsoft.com/en-us/resources/cloud-computing-dictionary/what-is-azure/azure-iaas/?#products"},{"timestamp":"1672405560.0","poster":"hebbo777","content":"answers should be YNY - first two questions are tricky \nFirst Y : Azure File is IaaS -- ref https://azurecharts.com/overview/?f=iaas\n& https://learn.microsoft.com/en-gb/training/modules/intro-to-azure-fundamentals/tour-of-azure-services\nSecond: N because the question is asking about configuring VM then run DNS on it (so its not Azure DNS which part of PaaS) .... this my thought about it!\nthird is Yes","comment_id":"761965","upvote_count":"1"},{"poster":"azirila","comment_id":"761335","content":"In general, PaaS (Platform-as-a-Service) is about a platform where a developer can design and deploy an application. So a regular DNS server runs on a virtual machine is not PaaS.\n\nAn Azure virtual machine is considered IaaS as it offers computing resources.","timestamp":"1672336740.0","upvote_count":"1"},{"poster":"azirila","upvote_count":"2","content":"what is right answer? i thouht No-NO-Yes can anyone confirm this answer?","timestamp":"1672336440.0","comment_id":"761329"},{"comment_id":"755100","upvote_count":"1","poster":"publicsam007","comments":[{"upvote_count":"1","content":"Actually cancel that. Just use links and arrive at your own conclusion. So many contradicting stuff out there. \nFOr the second one it feels right to have it as IaaS cuz DNS is 'networking' (IaaS) and its on a VM (IaaS).\n\nAnd some","poster":"publicsam007","comment_id":"755106","timestamp":"1671910320.0"}],"timestamp":"1671909780.0","content":"YNY.\nI think DNS and Azure DNS are 2 different things.\nFrom Image below, DNS is IaaS.\nhttps://learn.microsoft.com/en-gb/training/modules/intro-to-azure-fundamentals/tour-of-azure-services\nFrom chart in this link, Azure DNS is PaaS\nhttps://azurecharts.com/overview/?m=adv&n=.&f=paas\n\nOh and also Azure files I believe is under Azure storage which is a IaaS according to the link."},{"comment_id":"754285","content":"IAAS - Y\nIAAS - N\nSAAS - Y","timestamp":"1671805680.0","upvote_count":"4","poster":"meister13"},{"poster":"CloudK","content":"It is under Storage: https://azure.microsoft.com/en-us/products/category/storage/ so is IaaS","timestamp":"1671093120.0","comment_id":"745849","upvote_count":"1"},{"timestamp":"1671074220.0","content":"If you created a VM, install the DNS server it's an IaaS. If you simply ran Azure DNS service, in which Microsoft or a 3rd party MSP(Managed service provider) ran the infrastructure layer, it's a SaaS. If your DNS was supplied as part of the package, defined by an opinionated framework, in which DNS is configured by the said platform… it would be a PaaS.","poster":"ImJeetu","comment_id":"745664","upvote_count":"1"},{"content":"Oui, Azure Files est un exemple de service de infrastructure en tant que service (IaaS).\n\nNon, un serveur DNS qui fonctionne sur une machine virtuelle Azure n'est pas un exemple de service de plateforme en tant que service (PaaS). Un serveur DNS exécuté sur une machine virtuelle Azure relève de l'IaaS, car cela implique que le client gère l'infrastructure en utilisant une machine virtuelle fournie par Azure.\n\nOui, Microsoft Intune est un exemple de logiciel en tant que service (SaaS). Dans le modèle SaaS, le fournisseur de logiciel met à disposition une application logicielle sur un serveur à distance, accessible par les clients via internet. Le fournisseur gère l'infrastructure, les mises à jour du logiciel et les sauvegardes de données. Les clients utilisent l'application via un navigateur web ou une application cliente, mais ils ne gèrent pas l'infrastructure ni le logiciel d'application.","timestamp":"1670917860.0","upvote_count":"1","comment_id":"743724","poster":"Amir88888"},{"upvote_count":"1","timestamp":"1670864220.0","comment_id":"743061","poster":"Yamarh","content":". Azure files is Paas \n. DNS server is on Azure VM is Iaas\n. Microsoft Intune is a Saas\nso NNY."},{"upvote_count":"2","timestamp":"1669056900.0","content":"From https://learn.microsoft.com/en-us/azure/storage/files/storage-files-introduction: \"Fully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks.\" - So Azure Files is PaaS.","poster":"MymyH","comment_id":"723838"},{"upvote_count":"2","poster":"folumovich","comment_id":"721835","timestamp":"1668843420.0","content":"YNY is the one for me."},{"poster":"TEMPLE022","upvote_count":"1","comment_id":"720529","timestamp":"1668695640.0","content":"YNY RIGHT ANSWER"},{"timestamp":"1668608040.0","upvote_count":"1","content":"YNY for me too","comment_id":"719726","poster":"_ikka_"},{"comment_id":"716054","poster":"kazan","upvote_count":"1","content":"Ans is Y/N/Y\nAzure files is considered compute\nDNS is IAAS as shown https://www.poweradmin.com/blog/dns-in-the-cloud-solid-or-not/#:~:text=DNS%20in%20the%20cloud%20is,a%20Service%20(IaaS)%20solution.","timestamp":"1668171000.0"},{"timestamp":"1666709400.0","upvote_count":"2","poster":"Faridee","content":"N,N,Y\nAzure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol you know and love, SMB (Server Message Block)","comment_id":"703960"},{"content":"As MS IAAS Service lists (https://azure.microsoft.com/en-us/products/category/storage/, https://azure.microsoft.com/en-us/products/category/networking/), Azure files and Azure Dns are one of Iaas services.","comment_id":"702087","upvote_count":"1","timestamp":"1666521780.0","poster":"chahero"},{"poster":"alexander_panfilenok","content":"Azure files are even serverless (\"Fully managed serverless file shares\n\") https://azure.microsoft.com/en-us/products/storage/files/#overview. It can't be IAAS","comment_id":"701506","timestamp":"1666439160.0","upvote_count":"1"},{"poster":"Wan13","content":"YES / NO / YES.............DNS SERVER IN A VM IS IAAS: https://learn.microsoft.com/pt-br/azure/virtual-machines/linux/azure-dns","timestamp":"1666309320.0","upvote_count":"1","comments":[{"upvote_count":"1","timestamp":"1671388560.0","comment_id":"749091","content":"That link does not have any references to IaaS, PaaS, or SaaS.","poster":"iowaporter"}],"comment_id":"700382"},{"comment_id":"700048","poster":"oopspruu","upvote_count":"1","content":"It should be YNY\n\nAs with a previous question, a server installed on a virtual machine is considered IaaS Solution. The question clearly says \"DNS Server that runs on Azure Virtual Machine\", it doesn't say \"Azure DNS\". Hence it should be a IaaS Solution, not PaaS","timestamp":"1666277400.0"},{"poster":"Moha27med","content":"YNY\nStorage is Infrastructure as a service (IaaS)\nDNS is Infrastructure as a service (IaaS)\nMicrosoft Intune is Software as a service (SaaS)","upvote_count":"2","timestamp":"1665992100.0","comment_id":"697049"},{"content":"All network parts are IaaS. So question 2 is no.","poster":"Canhelp","timestamp":"1665937320.0","comment_id":"696371","upvote_count":"1"},{"upvote_count":"1","content":"Y N Y\n\nFor no 1 answer is in link go to the link and select Storage\n\nhttps://azure.microsoft.com/en-us/resources/cloud-computing-dictionary/what-is-azure/azure-iaas/#products","comment_id":"694257","poster":"Lanka22","timestamp":"1665692280.0"},{"poster":"ayou","upvote_count":"1","timestamp":"1665647760.0","content":"it should be YNY","comment_id":"693720"},{"content":"Statements 1 and 2 should be both No\n\nExplanation: Azure Files is Paas; DNS server is on Azure VM is IaaS.","upvote_count":"1","poster":"Driyan","timestamp":"1664967180.0","comment_id":"686786"},{"comment_id":"680732","upvote_count":"1","poster":"luckygaz","timestamp":"1664280840.0","content":"Azure file - PaaS\nAzure DNS - IaaS\nIntune - SaaS"},{"poster":"ee1974","comment_id":"666924","upvote_count":"1","content":"YNY for me too. DNS is a network service. A.file is storage -> both IaaS","timestamp":"1662984840.0"},{"timestamp":"1662452880.0","comment_id":"660995","comments":[{"upvote_count":"1","comment_id":"678977","timestamp":"1664121720.0","poster":"Dipak25","content":"Why Azure DNS is PAAS? It is IAAS."}],"upvote_count":"1","content":"I GOOGLED IT THOROUHLY THE ANSWERS ALL ARE YYY","poster":"isaw"},{"comment_id":"660850","content":"NO NO YES","timestamp":"1662443400.0","upvote_count":"2","poster":"Lanka22"},{"comment_id":"595161","content":"The correct answer is: YNY\n1.YES. Azure Files is on Windows servers\n2. NO. DNS is running on virtual machine\n3. YES. Intune is Saas (Like Office 365)","upvote_count":"5","timestamp":"1651336680.0","poster":"cdsu74"},{"comment_id":"591301","upvote_count":"1","poster":"u2637ps","timestamp":"1650843360.0","content":"One of the itms that is not clear is who controls the Service. You could install DNS on an IAAS server and then that is not automatically PAAS."},{"upvote_count":"1","comment_id":"590753","timestamp":"1650738840.0","poster":"JimRaynorSC2","content":"Well there is many types of Azure resources related to DNS..\n\"Azure DNS Server\" ressources are IaaS\n\"Azure DNS Zone\" and others resources are PaaS\nGo to the Azure portal and try to create a DNS Server.. everything is pretty clear there"},{"timestamp":"1650710520.0","comment_id":"590557","content":"I was also convinced that Azure Files was PaaS, then I looked at the first graph in the following link : https://techcommunity.microsoft.com/t5/educator-developer-blog/getting-started-with-windows-azure-series-1-overview/ba-p/378385 \n\nUnder \"Infrastructure services\" --> \"Storage\", we can see \"Azure Files\".\n\nCCL: Azure Files is IaaS, so the answer is Yes\n\nI think this graph settles all disputes over what service is PaaS vs IaaS","poster":"Tomv1995","upvote_count":"1"},{"timestamp":"1650438840.0","content":"I cant understand why azure file is iaas if its type of storage and storage is PaaS Solution.","comment_id":"588477","poster":"Yarin_Ben_Aharon","upvote_count":"1"},{"poster":"mehasi","upvote_count":"2","comment_id":"588402","content":"YNY\n\nExplanation by Kelvin Lee, Senior IT Infrastructure Architect (2006-present)\n(https://www.quora.com/Is-a-DNS-server-that-runs-on-Azure-Virtual-Machine-an-example-of-PaaS-or-IaaS)\nIf you created a VM, install the DNS server it's an IaaS. If you simply ran Azure DNS service, in which Microsoft or a 3rd party MSP(Managed service provider) ran the infrastructure layer, it's a SaaS. If your DNS was supplied as part of the package, defined by an opinionated framework, in which DNS is configured by the said platform… it would be a PaaS.\n\nSo in the case of this question, it's an IaaS.","timestamp":"1650418500.0"},{"poster":"oncloud10","timestamp":"1650108780.0","content":"NNY. First, Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol. Then, a DNS on a VM is a IAAS, because you need to configure and develop everything. It is not a service as an app.","upvote_count":"2","comment_id":"586761"},{"upvote_count":"1","timestamp":"1650108660.0","comment_id":"586760","content":"First, Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol. Then, a DNS on a VM is a IAAS, because you need to configure and develop everything. It is not a service as an app.","poster":"oncloud10"},{"upvote_count":"2","poster":"tobal255","content":"is : NO NO YES. Azure Files is PaaS. DNS server on A.VM is Iaas.","timestamp":"1648490760.0","comment_id":"577026"},{"upvote_count":"1","content":"NNY\n\nAzure files is a PAAS service *based on* Azure Storage\nDNS server *inside* a VM is IAAS. Azure DNS is a PAAS, not this one.","comment_id":"568745","poster":"Contactfornitish","timestamp":"1647400080.0"},{"poster":"rnchandole","timestamp":"1647107640.0","content":"NNY\nStorage is PaaS","upvote_count":"1","comment_id":"566299"},{"timestamp":"1646615640.0","comment_id":"562339","poster":"Official","upvote_count":"1","comments":[{"comment_id":"587797","content":"Why is it","poster":"Razuli","upvote_count":"1","timestamp":"1650306840.0"}],"content":"YYY is the perfect solution don't get confused by reading all the comments"},{"upvote_count":"1","comment_id":"560755","content":"Question 1 File Share is an IAAS as it is providing file sharing via SMB or NFS to VM's, it is used as prerequisite to develop a solution on IaaS. It is not technically used directly by end developer building an app or customer accessing UI. \nQuestion 2 answer can be Yes if DNS server is within Azure Virtual Network. So question might be wrongly framed","timestamp":"1646396340.0","poster":"NavShett"},{"content":"Was on exam 03/03/2022","poster":"Diallo18","upvote_count":"1","timestamp":"1646383260.0","comment_id":"560631"},{"content":"i Dont get it why YYY, ? I thought its YNY","upvote_count":"3","poster":"Drealjesusfreak","timestamp":"1645096260.0","comment_id":"549324"},{"upvote_count":"1","timestamp":"1643288820.0","content":"From MS website:\n\"Fully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks.\"\nHence, answer is No","poster":"FilipKrk","comment_id":"533760"},{"content":"First, Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage. It provides fully managed file shares over a protocol. \nThen, a DNS on a VM is a IAAS, because you need to configure and develop everything. It is not a service as an app.. \n=> NNY","poster":"anbaert","comments":[{"upvote_count":"1","timestamp":"1650306900.0","poster":"Razuli","content":"Exactly my thoughts","comment_id":"587798"}],"timestamp":"1642406760.0","comment_id":"525547","upvote_count":"9"},{"poster":"akp1000","content":"Azure Files is Paas according to this (https://docs.microsoft.com/en-us/azure/storage/files/storage-files-introduction): Fully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks.","timestamp":"1642243920.0","upvote_count":"1","comment_id":"524090"},{"poster":"Robdebert","content":"Agree to NNY. Because Azure Files = \"Fully managed serverless file shares\" -> serverless is not IAAS. So Azure Files should be PAAS, shouldn't it?\n\nfrom https://azure.microsoft.com/en-us/services/storage/files/#overview","upvote_count":"3","comment_id":"522728","timestamp":"1642063980.0"},{"comment_id":"522554","upvote_count":"3","timestamp":"1642036200.0","poster":"nav777","content":"Correct Ans is No No Yes"},{"poster":"mikekasky","content":"Microsoft: storage is IaaS (https://azure.microsoft.com/en-us/overview/what-is-azure/iaas)\nNIST: infrastructure as a service as The capability provided to the consumer to provision processing, storage, networks (https://en.wikipedia.org/wiki/Infrastructure_as_a_service)","timestamp":"1641755280.0","comment_id":"520417","upvote_count":"1"},{"upvote_count":"2","timestamp":"1641752820.0","comment_id":"520400","content":"Y ,N ,Y","poster":"VMLaza"},{"content":"For several questions, Answers in site look wrong. And dicussion comments make it even more confusing where mostly half population says a option correct while remaining half it as wrong. What's the use of this framework then?","upvote_count":"2","comment_id":"519521","timestamp":"1641646500.0","poster":"Amit_Pathak_1983"},{"content":"Azure Files is serverless, hence it can’t be PaaS or SaaS. Both need an underlying infrastructure all the time. Azure Files (and other serverless products like Azure Functions) are getting spin up as IaaS only when needed.","poster":"GermanDude","timestamp":"1641504600.0","upvote_count":"2","comment_id":"518640"},{"poster":"arjaycee","content":"No\nNo\nYes","timestamp":"1641484320.0","upvote_count":"1","comment_id":"518332"},{"poster":"Ab_Yov","content":"Azure Files is a PaaS (platform-as-a-service) offering provided by Microsoft Azure that is built on top of Azure Storage.","timestamp":"1640211060.0","upvote_count":"1","comment_id":"507419"},{"poster":"mikep1","upvote_count":"14","timestamp":"1640080080.0","comment_id":"505989","content":"It should be : Y N Y\nit was confirmed by Azure web experts during training session"},{"upvote_count":"1","content":"Azure Files offers fully managed file shares in the cloud that are accessible via the industry standard Server Message Block (SMB) protocol or Network File System (NFS) protocol. Azure Files file shares can be mounted concurrently by cloud or on-premises deployments.\nFully Managed - PaaS. So 1st one is N","poster":"NiKU2403","comment_id":"502447","timestamp":"1639596480.0"},{"timestamp":"1639118520.0","upvote_count":"1","comment_id":"498353","content":"For 2 if the query turned into “Azure DNS is an instance of PaaS” that might be fine. But then to include “VM” withinside the blend that appears like a “VM” administrated with the aid of using the client and consequently IaaS. Straight up disingenuous query from my factor of view as there's no manner to affirm if the VM turned into installation with the aid of using the client or not. So the solution might be incorrect and right. Unless I am lacking something? Can someone make it clear or accurate to me? Thanks in advance.","poster":"stampaprints"},{"timestamp":"1639088100.0","comment_id":"498081","upvote_count":"4","content":"Question 2 answer - NO\nhttps://docs.microsoft.com/en-us/learn/azure-fundamentals/intro-to-azure-fundamentals/media/azure-services-6c41a736.png","poster":"RochaG2"},{"comment_id":"498071","timestamp":"1639086600.0","poster":"mufflon","upvote_count":"1","content":"Asure Files is storage, therefor IaaS.\nSetting up a DNS Server in Azure VMs is IaaS?\nAzure DNS is PaaS\nIntune is Saas\nY-N-Y then"},{"timestamp":"1638815640.0","upvote_count":"2","comment_id":"495345","poster":"uk45h","content":"Hi Guys, Azure Files is example of PaaS - MS States that on their training material :)\nhttps://docs.microsoft.com/en-us/learn/modules/azure-networking-fundamentals/azure-virtual-network-fundamentals"},{"upvote_count":"5","content":"Azure File = Storage = IaaS\nhttps://azure.microsoft.com/en-gb/overview/what-is-azure/iaas/#products\nStorage > Azure File \n\nDNS Server (Either owned or Azure DNS) = Networking = IaaS\nhttps://azure.microsoft.com/en-gb/overview/what-is-azure/iaas/#products\nNetworking > Azure DNS.\n\nMicrosoft Intune : we only put our data and devices > SaaS.\nDon't get confused: DNS and File Storage are infrastructured...offered as a Service, so there is no way it is a platform.","comments":[{"comment_id":"517234","timestamp":"1641367860.0","poster":"tanaka9","upvote_count":"1","content":"but in training materials, they say Azure Storage is PaaS :) and i think training materials are correct, because in Azure Storage/Files you don't manage the OS and don't install any updates"}],"comment_id":"490548","poster":"Harry28731","timestamp":"1638264600.0"},{"comment_id":"486299","poster":"AidenYoukhana","timestamp":"1637792460.0","content":"Azure storage is considered PaaS.","upvote_count":"2"},{"comment_id":"484670","timestamp":"1637629260.0","upvote_count":"2","content":"depends how you see it or interpreted the language... Running DNS on a Azure VM is IaaS whereas Running Azure DNS is PaaS...so pick one...I would simply go with IaaS.","poster":"MS_Learner"},{"upvote_count":"4","poster":"Mozbius_","comment_id":"478483","content":"Here I have found on the Market Place what appears to match exactly the question’s formulation: “a DNS running in a VM” (which IaaS) and not simply “Azure DNS” (which is PaaS). 🤦‍♂️\n\nhttps://azuremarketplace.microsoft.com/en-us/marketplace/apps/virtualpulsesro1607008728942.dns_server_win-2019?tab=overview","timestamp":"1636954440.0"},{"content":"For 2 if the question was “Azure DNS is an example of PaaS” that would be fine. But then to include “VM” in the mix that sounds like a “VM” administrated by the customer and therefore IaaS. Straight up disingenuous question from my point of view as there is no way to confirm if the VM was setup by the customer or not. So the answer could be both be wrong or right. Unless I am missing something? Can somebody clarify or correct me? Thanks in advanced.","timestamp":"1636953420.0","comment_id":"478468","poster":"Mozbius_","upvote_count":"1"},{"upvote_count":"2","timestamp":"1636848480.0","poster":"mikamozg","content":"Azure Files = Azure Storage is IAAS service\nCompute, Storage, Network are all IAAS\nDNS on VM i would say is related to Network which is also IAAS","comment_id":"477866"},{"comment_id":"473435","upvote_count":"3","timestamp":"1636198920.0","poster":"rock3_17","content":"The video in this link, from Microsoft, around the half way mark states clearly that All Storage Account services are PaaS.\n\nhttps://docs.microsoft.com/en-us/learn/modules/azure-networking-fundamentals/azure-virtual-network-fundamentals"},{"upvote_count":"2","content":"2.Why DNS server on Azure VM is PaaS.\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/create-fqdn","timestamp":"1636167180.0","poster":"witoon","comment_id":"473281"},{"upvote_count":"1","poster":"amida168","content":"The answer to the second question should be N. DNS is iaas. If you visit this page.\n\nhttps://azure.microsoft.com/en-us/overview/what-is-azure/iaas/#overview\n\nThen click on networking. You will see Azure DNS is listed.","timestamp":"1636141200.0","comment_id":"473176"},{"upvote_count":"1","content":"I think DNS Server itself is Paas. (not sure, not able to find a proper doc)","comment_id":"473039","timestamp":"1636115460.0","poster":"DeadShotGTX"},{"comment_id":"472422","timestamp":"1636009860.0","poster":"atomb","upvote_count":"1","content":"https://softwarearchitect.ca/azure-paas-vs-iaas-vs-saas/"},{"upvote_count":"3","poster":"diego205","content":"A DNS server that runs on an \"AZURE VIRTUAL MACHINE\" ..... Virtual Machine is IaaS !!!!\nRight answer: Y, N, Y !!!","timestamp":"1635967920.0","comment_id":"472253"},{"comments":[{"upvote_count":"1","poster":"Mozbius_","comment_id":"478460","timestamp":"1636951500.0","content":"It is true that you don’t have to take care of upgrades and faulty disks but it is still identified as IaaS by Microsoft. I guess because you can access the files through SMB while PaaS is accessed through HTTP🤷‍♂️","comments":[{"comment_id":"490552","content":"Stop brainwashing. STORAGE is an Infrastructure Component...offered as a Service. Don't forget that, because if we follow your logic then VM is PaaS too because Microsoft manage the ESX OS updates and the hardware servers.","upvote_count":"2","timestamp":"1638265380.0","poster":"Harry28731"}]}],"poster":"PCCA","content":"Key benefits\nAzure files is PaaS - https://docs.microsoft.com/en-us/azure/storage/files/storage-files-introduction\nKey benefits\nFully managed. Azure file shares can be created without the need to manage hardware or an OS. This means you don't have to deal with patching the server OS with critical security upgrades or replacing faulty hard disks. https://docs.microsoft.com/en-us/azure/storage/files/storage-files-introduction","comment_id":"470854","upvote_count":"1","timestamp":"1635708240.0"},{"content":"Here are my 5 cents on question 2 , so we as users are shaded in the dark, MS automates the DNS server on a virtual machine using docker container therefore the DNS server itself is considered a PaaS","poster":"samehmora","comment_id":"469839","comments":[{"content":"So basically that VM that is mentioned in the question is taken cared of by Microsoft and not a VM setup by the customer. Way to go to make a question ambiguous!","poster":"Mozbius_","upvote_count":"1","timestamp":"1636951620.0","comment_id":"478462"}],"upvote_count":"2","timestamp":"1635522360.0"},{"comment_id":"464587","content":"Please everyone trust me!\nAll answers are TRUE!!!!","upvote_count":"2","poster":"Darius1992","timestamp":"1634637000.0","comments":[{"content":"prove it","poster":"Georgess","comment_id":"467631","upvote_count":"5","timestamp":"1635185700.0"}]},{"content":"Azure files include sharing of data which itself comes under paas , hence azure file can be regarded as paas.","upvote_count":"1","comment_id":"462885","timestamp":"1634362740.0","poster":"Harshul8899"},{"content":"The first question should be Y. Refer to https://softwarearchitect.ca/azure-paas-vs-iaas-vs-saas/","poster":"Cockatoo","timestamp":"1633814340.0","upvote_count":"2","comment_id":"459778"},{"poster":"ramya_roy2001","timestamp":"1633408560.0","content":"Microsoft Intune is the SaaS solution provided by Microsoft.","upvote_count":"2","comment_id":"457470"},{"poster":"radityoardi","content":"IaaS key is = you install your software on your own, manage updates on your own. So, like others debating so much, the 2nd is No.","upvote_count":"1","comment_id":"453786","timestamp":"1632888600.0"},{"upvote_count":"4","poster":"Mev4953","timestamp":"1632487500.0","comment_id":"450892","content":"ADMIN CAN CHANGE THE ANSWER WITH AN EXPLANATION !!!!\nThis is absolutely tricky question and the answer IS NOT enough. I think, ADMIN can explain a little bit instead of giving a couple of links. I think the answer is NNY.\n\nAzure files is like a storage and it should be Paas\nDNS server on Azure VM, so, therefore, it should be IaaS"},{"timestamp":"1632383280.0","poster":"4_abipe","comment_id":"450028","upvote_count":"4","content":"Number 2 answer is confusing, I will rather go with IAAS. Could someone explain why it is PAAS."},{"poster":"DevOpposite","timestamp":"1632114960.0","comment_id":"447983","upvote_count":"1","content":"2. DBMS such as SQL is Paas, so Y is correct"},{"content":"Can anybody explain why the second statement is Y ?\nI thought dns server on an azure VM is IaaS","timestamp":"1632066000.0","poster":"randms26","comment_id":"447696","upvote_count":"2"},{"content":"I think it is definitely NNY","poster":"sk1803","upvote_count":"4","comment_id":"445723","timestamp":"1631777400.0"},{"content":"How is this not NNY?","timestamp":"1631625000.0","poster":"rt_85","upvote_count":"1","comment_id":"444575"},{"upvote_count":"4","content":"Got it 13 September 2021","comments":[{"comment_id":"449289","content":"what is the correct option?","timestamp":"1632286800.0","upvote_count":"1","poster":"avinarsh95"},{"poster":"m_bayram","timestamp":"1631918880.0","content":"what is the good answer","comment_id":"446827","upvote_count":"1"}],"poster":"joesome","comment_id":"443965","timestamp":"1631534880.0"},{"upvote_count":"1","content":"DNS on Azure vm is purely an IaaS","poster":"Sanjay_Das","comment_id":"442054","timestamp":"1631201220.0"},{"poster":"Lucario95","comment_id":"442004","content":"I have to admit that Azure Storages are all set under Iaas:\nhttps://azure.microsoft.com/it-it/overview/what-is-azure/iaas/#products","timestamp":"1631193660.0","upvote_count":"3"},{"poster":"ramanath009","upvote_count":"5","content":"Asked in 04-09-2021 exam","comment_id":"439413","timestamp":"1630808520.0"},{"upvote_count":"12","comments":[{"poster":"Kalzonee3611","upvote_count":"5","content":"But did “you” create the VM or is it managed by Microsoft?","comment_id":"437593","timestamp":"1630550580.0"}],"poster":"Lumidab","comment_id":"437360","content":"A DNS running in a VM is IaaS. Running in a VM is the key. Azure won't upgrade or maintain the software installed in the VM. You do it.","timestamp":"1630516860.0"},{"content":"I am bit confused in 2nd option. A DNS server can be Iaas too.","poster":"audivolvorover","comment_id":"436515","upvote_count":"2","timestamp":"1630428420.0"},{"poster":"Avinash_Duggirala","upvote_count":"3","comment_id":"436419","timestamp":"1630419960.0","content":"I think Azure Files is a PAAS service","comments":[{"poster":"anuradha2603","content":"No Azure files is a storage service and hence it is IaaS","timestamp":"1630661400.0","comment_id":"438446","upvote_count":"4"},{"poster":"Pradh","comment_id":"457812","content":"you please study the concepts properly ...than you may take a look at dumps ..","upvote_count":"1","timestamp":"1633451760.0"}]},{"poster":"Swatul","content":"Azure DNS that run on azure VM is an example of iaas.","comment_id":"436377","upvote_count":"5","timestamp":"1630416720.0"}],"answers_community":[],"question_text":"HOTSPOT -\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer":"","answer_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007400002.png"],"timestamp":"2021-08-31 15:32:00","topic":"1","question_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007400001.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/61176-exam-az-900-topic-1-question-75-discussion/","exam_id":62,"isMC":false,"unix_timestamp":1630416720},{"id":"0CAtHG3zVSGBqPspM5g5","answer_ET":"","unix_timestamp":1630550580,"discussion":[{"comment_id":"444482","content":"What is meant with leveraged virtualization?","timestamp":"1631617440.0","poster":"Zuccerberg","comments":[{"poster":"Super63","timestamp":"1729200300.0","comment_id":"1299454","content":"Leverage can mean two things:\nFinances: the ratio of a company's loan capital (debt) to the value of its ordinary shares (equity); gearing.\nUse: use (something) to maximum advantage. \"the organization needs to leverage its key resources\"\nSo the option can be read as follows:Cloud computing uses virtualization to its maximum advantage by providing services to multiple customers simultaneously","upvote_count":"2"},{"timestamp":"1643495280.0","content":"Cloud is a physical machine (i.e. VM Host) running with many client(i.e. VM guest) to provide services. That mean one client(VM guest) would not bring down the whole VM Host or affecting the performance of other client(VM guest) even they have 100% cpu loading.","poster":"adsjflkadsj","upvote_count":"12","comment_id":"535759"},{"content":"Virtualization is the key to cloud computing, since it is the enabling technology allowing the creation of an intelligent abstraction layer which hides the complexity of underlying hardware or software.","comment_id":"706284","upvote_count":"8","timestamp":"1666946520.0","poster":"urbanbushman"},{"content":"in another words it uses virtualization. It means your OS is not connected to concrete hardware.","timestamp":"1681803300.0","poster":"markbugatti","comment_id":"873386","upvote_count":"4"}],"upvote_count":"19"},{"content":"Right Answer","timestamp":"1634146020.0","comment_id":"461662","upvote_count":"12","poster":"Akinola1"},{"timestamp":"1737811140.0","poster":"trashbox","upvote_count":"1","comment_id":"1346461","content":"Yes, Yes, Yes"},{"comments":[{"content":"2. Yes. Using a public cloud reduces capital expenditure (CapEx) because customers do not need to invest in and maintain physical infrastructure. Instead, they pay as an operating expense (OpEx) based on their usage.","upvote_count":"1","comment_id":"1314633","timestamp":"1732020720.0","poster":"WilsonKKerll"}],"upvote_count":"5","comment_id":"1231418","content":"YYY Answer is correct. \n1: Yes. Cloud computing provides elastic scalability, allowing resources to be scaled up or down based on demand.\n2. Yes. Customers can minimize capital expenditure (CapEx) by using a public cloud, as they do not need to invest in physical infrastructure and can instead pay for resources on a pay-as-you-go basis.\n3. Yes. Cloud computing leverages virtualization to provide services to multiple customers simultaneously, enabling efficient resource utilization and isolation.","timestamp":"1718551800.0","poster":"VaibhavGawali"},{"timestamp":"1711327680.0","comment_id":"1182058","content":"YYY for all the options","upvote_count":"1","poster":"Alonsochaves"},{"comment_id":"1138976","timestamp":"1706928780.0","poster":"flaviolbrito","content":"Na segunda resposta entendo que minimiza esteja certo porque quando compra-se uma licenca de software é considerado capex, logo mesmo na cloud pode acontecer gastos com capex. Se fosse alugar um software (pago por mês ou ano) ai é considerado um gasto recorrente logo seria Opex.","upvote_count":"1"},{"timestamp":"1695461700.0","comment_id":"1014783","upvote_count":"3","content":"I think No. 2 should be \"No\" because the public cloud completely eliminates CapEx for customers, not only reduces them.","poster":"SAFM","comments":[{"upvote_count":"2","content":"I agree with you, but I also agree that we are overthinking it. The right answer is YES","poster":"dvalverde99","timestamp":"1702439640.0","comment_id":"1095117"},{"poster":"gfreire57","timestamp":"1697223000.0","content":"i think it meant to reduce the CapEx in infrastructure needed, but the costumer still need to buy basic infrasctructure such as computers and internet access (providing all the initial connection to the cloud). So I guess \"eliminates\" is a too strong word to describe this.","comment_id":"1042900","upvote_count":"2"},{"timestamp":"1701756000.0","poster":"3cc17f1","comment_id":"1088208","upvote_count":"6","content":"this is overthinking it. A reduction to zero is still a reduction."}]},{"upvote_count":"1","poster":"picho707","content":"There is a difference between cloud computing provides compute scalability to cloud computing \"can\" provide elastic scalability.","timestamp":"1683899460.0","comment_id":"895962"},{"content":"never heard the \"elastic scalability\" because elastic is about auto -scaling while scalability is commonly known as manual-scaling with two categories (Vertical and Horizontal). Any explanation guys?","comments":[{"comments":[{"poster":"pnbtot","content":"there is no term \"elastic scalability\"","comment_id":"1197944","timestamp":"1713445320.0","upvote_count":"1"}],"content":"Elasticity is a subset of scalability pertaining to automated way of scaling up/down. It's just a way to also refer to Auto-scaling.","poster":"cybwear","comment_id":"891437","timestamp":"1683467820.0","upvote_count":"3"},{"comment_id":"929864","poster":"petebear55","timestamp":"1687376460.0","content":"YES I AGREE ... THIS IS A NASTY WAY TO MAKE PEOPLE FAIL AND UNFAIR ... THE QUEWSTION NEEDS REWRITTING","upvote_count":"4"}],"upvote_count":"4","comment_id":"880324","timestamp":"1682423940.0","poster":"jems023"},{"comment_id":"827621","poster":"kqureshi","upvote_count":"4","content":"elasticity is auto scaling, never heard the term elastic scaling.","timestamp":"1677812700.0"},{"comments":[{"comment_id":"948245","poster":"crux_mits","upvote_count":"1","timestamp":"1689004440.0","content":"i completely agree with you. not sure why ppl are ticking YYY."}],"comment_id":"715287","content":"There is no CapEx in the public cloud. When passing from private to hybrid, the CapEx is minimized.","upvote_count":"4","timestamp":"1668089940.0","poster":"kirshoff"},{"comment_id":"672113","poster":"amarjitsahoo","upvote_count":"1","timestamp":"1663488420.0","content":"Correct Y,Y,Y"},{"upvote_count":"1","comment_id":"667725","poster":"amr77","timestamp":"1663051500.0","content":"correct"},{"comment_id":"545882","upvote_count":"7","timestamp":"1644672060.0","poster":"MNJ12345","content":"Does this term \"elastic scalability\" exist?"},{"poster":"nav777","timestamp":"1642036260.0","content":"Yes Yes Yes is Correct Ans.","comment_id":"522555","upvote_count":"6"},{"timestamp":"1641497220.0","upvote_count":"1","content":"Virtualization is the key to cloud computing, since it is the enabling technology allowing the creation of an intelligent abstraction layer which hides the complexity of underlying hardware or software.","poster":"JOJO2050","comment_id":"518519"},{"upvote_count":"2","content":"Yes\nYes\nYes","timestamp":"1641484380.0","poster":"arjaycee","comment_id":"518333"},{"poster":"xiban","upvote_count":"6","content":"what is elastic scalability ?","comment_id":"503138","timestamp":"1639681560.0"},{"content":"Correct","comment_id":"494232","upvote_count":"1","poster":"Dennis_HK","timestamp":"1638700320.0"},{"timestamp":"1638301860.0","poster":"Dicer","upvote_count":"3","comments":[{"timestamp":"1638763260.0","content":"One second - Let me google that for you.","poster":"lovecloud2","upvote_count":"11","comment_id":"494861"}],"content":"What is leveraged virtualization?","comment_id":"490944"},{"comment_id":"453762","upvote_count":"4","content":"correct","poster":"selvi123","timestamp":"1632883260.0"},{"poster":"tonyrz","content":"Correct","comment_id":"449246","upvote_count":"5","timestamp":"1632277020.0"},{"upvote_count":"2","poster":"Waltmas","content":"correct","comment_id":"443641","timestamp":"1631485560.0"},{"upvote_count":"2","content":"Correct","timestamp":"1631207640.0","comment_id":"442096","poster":"Menziwa"},{"comment_id":"438428","content":"Correct","timestamp":"1630659840.0","poster":"Manish_D","upvote_count":"2"},{"timestamp":"1630550580.0","upvote_count":"1","comment_id":"437594","poster":"ifa1","content":"correct"}],"answers_community":[],"exam_id":62,"answer_description":"","answer":"","topic":"1","url":"https://www.examtopics.com/discussions/microsoft/view/61344-exam-az-900-topic-1-question-76-discussion/","question_id":447,"question_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007500001.jpg"],"isMC":false,"timestamp":"2021-09-02 04:43:00","question_text":"HOTSPOT -\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007600001.jpg"]},{"id":"ZqW7GDCCyuug7uSvqssP","answers_community":["D (100%)"],"topic":"1","timestamp":"2021-09-28 06:41:00","question_text":"What is the first stage in the Microsoft Cloud Adoption Framework for Azure?","discussion":[{"timestamp":"1646988900.0","comment_id":"565326","poster":"bogdand","upvote_count":"95","content":"Remember SPRAGM!! \nStrategy - Plan - Ready - Adopt - Govern - Manage \n\n:)","comments":[{"comment_id":"1299456","timestamp":"1729200660.0","poster":"Super63","upvote_count":"5","content":"Very helpful, thanks!. In other words: When it comes to the Microsoft Cloud Adoption Framework for Azure, we must be Super PRAGmatic!"},{"timestamp":"1679011980.0","poster":"Taleeya","comment_id":"841445","upvote_count":"1","content":"Very helpful. Thanks"}]},{"upvote_count":"13","poster":"Otti","timestamp":"1632804060.0","comment_id":"453027","content":"D is Correct."},{"poster":"Jas001","upvote_count":"1","timestamp":"1735453560.0","content":"Selected Answer: D\nStrategy.","comment_id":"1333367"},{"poster":"Alonsochaves","upvote_count":"2","content":"Selected Answer: D\nas the book, we must define the strategy first.","comment_id":"1182059","timestamp":"1711327800.0"},{"upvote_count":"1","comment_id":"1076426","timestamp":"1700582040.0","poster":"intentando","content":"Selected Answer: D\nhttps://learn.microsoft.com/en-us/azure/cloud-adoption-framework/overview"},{"content":"Selected Answer: D\nSPRAGM is the way I memorize","comment_id":"898902","poster":"dearmichael2000","timestamp":"1684216200.0","upvote_count":"2"},{"upvote_count":"1","timestamp":"1681101720.0","poster":"Fotho","content":"Selected Answer: D\nDefinitely correct answer is D","comment_id":"865984"},{"poster":"Lanka22","upvote_count":"2","timestamp":"1662443520.0","content":"Selected Answer: D\nD is Correct.","comment_id":"660851"},{"comment_id":"575700","upvote_count":"1","content":"Selected Answer: D\nD is Correct.","poster":"examsycia","timestamp":"1648317900.0"},{"comment_id":"565086","upvote_count":"1","content":"do they ever ask about the othe stages?","timestamp":"1646955120.0","poster":"cormorant"},{"poster":"Decapon","upvote_count":"2","comment_id":"548975","timestamp":"1645050900.0","content":"Selected Answer: D\nDefine your strategy is the first step"},{"comment_id":"522556","timestamp":"1642036320.0","content":"D is Correct","upvote_count":"2","poster":"nav777"},{"content":"define your strategy","comment_id":"510121","timestamp":"1640593020.0","poster":"heiiisoqq","upvote_count":"2"},{"timestamp":"1640200680.0","content":"D. Define your strategy.","poster":"EvelynAL","upvote_count":"1","comment_id":"507319"},{"poster":"iphone99","upvote_count":"4","comment_id":"459491","timestamp":"1633754160.0","content":"It really helped me a lot."}],"answer":"D","answer_images":[],"question_id":448,"url":"https://www.examtopics.com/discussions/microsoft/view/62998-exam-az-900-topic-1-question-77-discussion/","exam_id":62,"answer_description":"","unix_timestamp":1632804060,"isMC":true,"choices":{"D":"Define your strategy.","C":"Ready your organization.","B":"Make a plan.","A":"Adopt the cloud."},"answer_ET":"D","question_images":[]},{"id":"KF4D8B8JILppz73LIRrD","topic":"1","timestamp":"2021-12-29 19:08:00","url":"https://www.examtopics.com/discussions/microsoft/view/68980-exam-az-900-topic-1-question-78-discussion/","question_text":"HOTSPOT -\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","exam_id":62,"question_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007800001.jpg"],"unix_timestamp":1640801280,"discussion":[{"upvote_count":"25","content":"No No Yes is Correct Ans","timestamp":"1642036320.0","comments":[{"timestamp":"1718552100.0","poster":"VaibhavGawali","content":"I will go wth NNY.\npublic cloud typically involves using shared, virtualized resources provided by third-party cloud service providers, rather than adding the company’s own physical servers. And companies can extend their internal networks to the cloud through means such as hybrid cloud solutions, which integrate on-premises infrastructure with public cloud services.","comment_id":"1231421","upvote_count":"4"}],"poster":"nav777","comment_id":"522557"},{"poster":"pass_gcp","timestamp":"1640929860.0","content":"Answer should be N,N,Y","comment_id":"513903","upvote_count":"7"},{"poster":"RjayC","upvote_count":"1","content":"NO\n\nNO\nYes, that's correct! A hybrid cloud model combines both public cloud and private cloud (or on-premises) resources. The public cloud element is essential for providing scalability","comment_id":"1369631","timestamp":"1741518900.0"},{"timestamp":"1737773820.0","poster":"omsdigital","content":"Yes - NO - Yes","upvote_count":"1","comment_id":"1346308"},{"poster":"BraveSirRobin","timestamp":"1717590480.0","upvote_count":"3","comment_id":"1224711","content":"Question 1 is very poorly worded."},{"poster":"Sandip_Bhandari","timestamp":"1694218740.0","upvote_count":"7","comment_id":"1002777","content":"Yes, a company can extend its internal network into the public cloud by adding its own physical servers or virtual machines (VMs) hosted in the public cloud. This approach is often referred to as \"hybrid cloud\" or \"cloud extension.\n\nNo, a private cloud does not have to be disconnected from the internet. Whether a private cloud is connected to the internet or not depends on the organization's specific requirements and security policies.\n\nYes, that's correct. In a hybrid cloud environment, one of the key components is the public cloud. A hybrid cloud is a computing environment that combines on-premises or private cloud resources with public cloud resources provided by cloud service providers like Amazon Web Services (AWS), Microsoft Azure, or Google Cloud Platform (GCP)."},{"poster":"dkaps06","timestamp":"1692487980.0","upvote_count":"4","content":"You simply can't add physical servers to the public cloud, no matter how hard you try :)","comment_id":"985472"},{"comments":[{"timestamp":"1688047200.0","upvote_count":"2","poster":"aws_arn_name","content":"Only private cloud + public cloud = hybrid. And private cloud is on-premise","comment_id":"938212"},{"upvote_count":"6","poster":"robertirob","comment_id":"937018","timestamp":"1687978080.0","content":"Azure + aws is multicloud not hybrid"},{"poster":"zimzimzimma","comment_id":"939871","content":"Last one is Yes:\nhttps://azure.microsoft.com/en-us/resources/cloud-computing-dictionary/what-is-hybrid-cloud-computing/","timestamp":"1688209860.0","upvote_count":"1"}],"poster":"jojolabubu","timestamp":"1687212720.0","content":"I'll go for NNN\n\nOn-premises + Private = Hybrid\nPrivate x + Private y = Hybrid\n\nAnd btw not the question but worth to be mentioned:\nPublic (Azure...) + Public (AWS) = Hybrid","upvote_count":"2","comment_id":"927985"},{"content":"N N Y","timestamp":"1665634740.0","upvote_count":"6","comment_id":"693588","poster":"hawkvine"},{"comment_id":"522736","content":"Question 1: At https://azure.microsoft.com/de-de/services/virtual-machines/dedicated-host/#features it says, that \"Azure Dedicated Hosts\" are \"your own private cloud in Azure\". So shouldn't it be: YNY?","timestamp":"1642064580.0","upvote_count":"2","poster":"Robdebert","comments":[{"comment_id":"535763","upvote_count":"1","timestamp":"1643495520.0","poster":"adsjflkadsj","content":"\"Azure Dedicated Host provides physical servers that host one or more Azure virtual machines. Your server is dedicated to your organization and workloads—capacity isn't shared with other customers. This host-level isolation helps address compliance requirements. As you provision the host, you gain visibility into and control over the placement of your Azure VMs, and you determine the host's maintenance policies.\"\n\nI think you are not \"adding your own server\" to the cloud, Azure just dedicated a separated server for you."}]},{"content":"Image result for a company can extend an internal network by adding its own physical servers to the public cloud\nA company can extend the capacity of its internal network by using the public cloud. This is very common. When you need more capacity, rather than pay out for new on-premises infrastructure, you can configure a cloud environment and connect your on-premises network to the cloud environment by using a VPN.\n\nAnswer is YNY","upvote_count":"6","timestamp":"1641472560.0","comments":[{"timestamp":"1642741680.0","comments":[{"timestamp":"1650739020.0","content":"\"the only way it should be now is that you were trying to extend a private cloud by adding their servers to the cloud, which obvioulsy is not possible :)\"\n\nThat's literally what the desc. says, so I think its n-n-y","upvote_count":"2","comment_id":"590754","poster":"TitoChuz"}],"upvote_count":"1","comment_id":"528943","poster":"fremadse","content":"Totally agree, must be YNY, the only way it should be now is that you were trying to extend a private cloud by adding their servers to the cloud, which obvioulsy is not possible :)"},{"comments":[{"content":"correct, it says adding server to the public cloud. You cannot add your physical server to the cloud . So it is no","comment_id":"560489","poster":"tacobear","upvote_count":"3","timestamp":"1646361540.0"}],"upvote_count":"6","comment_id":"559946","poster":"sdokmak","timestamp":"1646297880.0","content":"You misunderstood. You can dedicate your own physical server for a private cloud but not for Azure's public cloud."}],"comment_id":"518217","poster":"az_abhishek"},{"poster":"AidenYoukhana","content":"Correct Answers: N N Y","timestamp":"1640801280.0","upvote_count":"6","comment_id":"512534"}],"answers_community":[],"answer_description":"Box 1: No -\nYou cannot add physical servers to the public cloud. You can only deploy virtual servers in the public cloud. You can extend a private cloud by deploying virtual servers in a public cloud. This would create a hybrid cloud.\n\nBox 2: No -\nA private cloud exists in cyberspace and is accessed via the internet.\nBox 3: Yes.\nReference:\nhttps://azure.microsoft.com/en-gb/overview/what-are-private-public-hybrid-clouds/","answer":"","question_id":449,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007800002.jpg"],"isMC":false,"answer_ET":""},{"id":"zP3MShJN91EgxblmWSS7","answer_ET":"","answers_community":[],"question_id":450,"discussion":[{"poster":"Nagy7","comment_id":"680743","timestamp":"1664281500.0","comments":[{"content":"it's worth noting that certain cloud deployment models, such as hybrid cloud or private cloud, may provide options for connectivity that are not solely reliant on the public internet. For example, a hybrid cloud deployment might involve a dedicated private network connection (such as a virtual private network or leased line) between your on-premises infrastructure and the cloud provider's data center. This dedicated connection can offer enhanced security, reliability, and performance compared to relying solely on the public internet.","upvote_count":"4","poster":"samcooldude1430","timestamp":"1686157200.0","comment_id":"917426"},{"timestamp":"1680415380.0","poster":"mlop3s","comments":[{"content":"This only means that your connection is secure and not going public. But you still need Internet to go through it.","poster":"HASAN94","comment_id":"1111071","upvote_count":"8","timestamp":"1704102540.0"}],"comment_id":"858560","content":"Yes. You can use a private link for cloud\nhttps://azure.microsoft.com/en-us/products/private-link","upvote_count":"1"}],"upvote_count":"28","content":"No-No-Yes I think"},{"comment_id":"657678","timestamp":"1662140940.0","poster":"K2001","comments":[{"poster":"FIFAlord","content":"Azure Stack Hub as well","timestamp":"1739478060.0","comment_id":"1356274","upvote_count":"1"},{"timestamp":"1663292880.0","poster":"compgeek718","comment_id":"670384","comments":[{"comment_id":"1043910","upvote_count":"3","timestamp":"1697351940.0","poster":"[Removed]","content":"\"ExpressRoute connections don't route through the public internet\"\n...so you use your own private internet then... keyword: internet...\n#2 is Yes.","comments":[{"upvote_count":"1","poster":"maumari2","comment_id":"1253965","content":"What about Azure Data Box?? You can transfer large amounts of data without using internet, Azure Stack also allows to run Azure service on-premises providing cloud capabilities without requiring constant internet connectivity. ExpressRoute is another example, but it has \"public internet\" in the definition.","comments":[{"content":"some of you are totally over thinking some questions","upvote_count":"2","poster":"NoursBear","comment_id":"1275497","timestamp":"1725094500.0"}],"timestamp":"1721768700.0"}]}],"content":"Correct. https://azure.microsoft.com/en-us/services/expressroute/#overview\n\"Use Azure ExpressRoute to create private connections between Azure datacenters and infrastructure on premises or in a colocation environment. ExpressRoute connections don't route through the public internet, and they offer more reliability, faster speed, and lower latency than typical internet connections. In some cases, using ExpressRoute connections to transfer data between on-premises systems and Azure gives you significant cost benefits.\"","upvote_count":"4"},{"timestamp":"1734715260.0","content":"You are correct but the question dont mention ExpressRoute anywhere","poster":"Veteran903","upvote_count":"1","comment_id":"1329579"},{"timestamp":"1733242980.0","upvote_count":"1","comment_id":"1321448","content":"Can you setup ExpressRoute without logging into Azure portal? At least first time setup would require Internet access.","poster":"scscibibi"},{"content":"huh Express Route is for connection from On Prem. Nothing about on prem in question.","comment_id":"1275502","poster":"NoursBear","timestamp":"1725094680.0","upvote_count":"1"},{"timestamp":"1664219760.0","poster":"McSwindler","upvote_count":"10","comments":[{"poster":"thomas1337","content":"i do never need portal.azure.com for anything, because i could use azure cli for managing my cloud.","upvote_count":"2","comment_id":"704564","timestamp":"1666779060.0","comments":[{"upvote_count":"10","comment_id":"1071120","poster":"amishdotcom","timestamp":"1700027100.0","content":"Can you use azure cli without internet.\nI don't understand why people here even doesn't have common sense."}]},{"timestamp":"1683724260.0","comment_id":"893948","upvote_count":"1","content":"Express route has direct access to Azure management resources and it can connect to Azure virtual networks.","poster":"picho707"}],"content":"You still manage via the Internet. portal.azure.com doesn't go via the Express Route.","comment_id":"680088"}],"upvote_count":"13","content":"What if you use Azure ExpressRoute? Wouldn't that qualify as cloud computing without internet?"},{"comment_id":"1414096","upvote_count":"1","timestamp":"1743405000.0","poster":"Janaf","content":"1-N (obvious), 2-N (ambiguous), 3-Y (obvious) - 2, \"no\" because private cloud is clearly considered as a cloud and do not necessarily requires internet connectivity."},{"comment_id":"1382382","content":"No-No-Yes. Cloud computing could also be privite cloud in an on prem private cloud, could it not??","poster":"Curacao","upvote_count":"2","timestamp":"1741616760.0"},{"upvote_count":"1","timestamp":"1736864340.0","comment_id":"1340380","poster":"ajai1109","content":"ExpressRoute can be used instead of internet"},{"comment_id":"1231422","upvote_count":"3","timestamp":"1718552460.0","poster":"VaibhavGawali","content":"I will go with NYY.\nCloud computing services are typically accessed over the internet, so you need internet connectivity to use cloud computing resources."},{"timestamp":"1715841960.0","poster":"varinder82","upvote_count":"2","content":"Final Answer :\nN\nN - Express Route does not need Internet\nY","comment_id":"1212307"},{"upvote_count":"1","comment_id":"1189455","timestamp":"1712248920.0","content":"A private cloud doesn't necessarily need to have an internet connection. You can have direct links to the private cloud","poster":"PolCara"},{"upvote_count":"4","timestamp":"1711840860.0","content":"No. Cloud computing allows you to use virtualized resources without the need for physical servers on-premises.\nYou must have internet connectivity to use cloud computing.\nYes. Cloud services are accessed via the internet, so connectivity is essential.\nThe costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.\nYes. Generally, cloud services offer more cost-effective scalability compared to traditional on-premises infrastructure.","poster":"Payu1994","comment_id":"1186453"},{"upvote_count":"1","content":"(2) is a poorly defined question. I suppose, we can assume that \"the cloud\" is the \"public cloud\" if not explicitly specified otherwise. In that case the answer is n,y,n","comment_id":"1052608","timestamp":"1698129300.0","poster":"JayStolzenwald"},{"poster":"GRONDBOTTER","comment_id":"1052045","upvote_count":"1","content":"i agree","timestamp":"1698076440.0"},{"comment_id":"962614","upvote_count":"5","timestamp":"1690283340.0","content":"N-Y-Y\nExplanation:\n'cloud computing' in this context should be seen as the 'public cloud' because of the website of Microsoft:\n\"Simply put, cloud computing is the delivery of computing services—including servers, storage, databases, networking, software, analytics, and intelligence—over the internet (“the cloud”)\"\nSource: https://azure.microsoft.com/en-us/overview/what-is-cloud-computing/","poster":"escflow"},{"timestamp":"1689680940.0","poster":"Andrew_S","upvote_count":"3","content":"No for the cloud w/no Internet. Why? Private Cloud requires no Internet. So No-No-Yes","comment_id":"955340"},{"timestamp":"1688118360.0","poster":"Self_Study","comment_id":"938978","content":"Yes, you need to have internet connectivity to use cloud computing in Azure, unless you are using a private cloud that is hosted on your own premises or data center. Even if you use ExpressRoute to create private connections between your network and Azure, you still need internet connectivity to manage and monitor your Azure resources and to access any public cloud services that are not available through ExpressRoute.","upvote_count":"2"},{"upvote_count":"6","content":"THE SECOUND ONE SHOULD BE NO .... AS you can use azure products such as data bricks to move data ... that's an azure product .. for which u don't need internet connectivity. Microsoft should get rid of shixtty questions like this which are designed to persecute individuals and have no place in an exam like this","comment_id":"929869","poster":"petebear55","timestamp":"1687377060.0"},{"content":"how would you even set up an express route without accessing the internet in the first place ? a lot of people are overthinking these questions tbh.","poster":"Frogggy","timestamp":"1682010660.0","comments":[{"upvote_count":"6","content":"True, and my theory is this whole overthinking is because of MS going overboard with grammar/ambiguous interpretation of questions.","comment_id":"907394","timestamp":"1685108340.0","poster":"zimzimzimma"}],"upvote_count":"2","comment_id":"875798"},{"comment_id":"875115","timestamp":"1681941000.0","upvote_count":"2","content":"No Yes No; you can get some cheap servers from a dumpster and use them instead.","poster":"Nick_Hey"},{"content":"second box should be 'NO', the kery is \"must have internet\" but you can connect to server without internet as well.","timestamp":"1677813060.0","comment_id":"827625","poster":"kqureshi","upvote_count":"4"},{"timestamp":"1676467140.0","content":"N\nY\nY\n\nKeywords - cloud computing\n\nsee- https://azure.microsoft.com/en-us/resources/cloud-computing-dictionary/what-is-cloud-computing/\n\nSimply put, cloud computing is the delivery of computing services—including servers, storage, databases, networking, software, analytics, and intelligence—over the Internet (“the cloud”) to offer faster innovation, flexible resources, and economies of scale. You typically pay only for cloud services you use, helping you lower your operating costs, run your infrastructure more efficiently, and scale as your business needs change.","upvote_count":"1","poster":"Fosnefes","comment_id":"809570"},{"comment_id":"779868","upvote_count":"7","timestamp":"1674037980.0","content":"What about a private cloud with my own intranet? Is this not also cloud computing without an internet connection?","poster":"aphesis"},{"content":"I don't agree with answer for Box 2 since you are not forced to publish public IP adresses for the internet. So you can definitely use express Route which is a selling point from Microsoft to achieve better security","poster":"fphaneuf","comment_id":"770958","timestamp":"1673311080.0","upvote_count":"1"},{"content":"Creo que depende de si especificara si se tratan de nubes publicas o privadas. Yo diría NNN, incluso la pregunta 3, si es una nube privada el coste sería el mismo que un centro de datos","poster":"acamposj","comment_id":"741137","timestamp":"1670692920.0","upvote_count":"1"},{"content":"NNY, You can use private (on-prem) cloud computing without internet connectivity","upvote_count":"4","comment_id":"737495","timestamp":"1670394660.0","poster":"Ghospel"},{"comment_id":"734240","timestamp":"1670048280.0","content":"You can use ExpressRoute to Azure Cloud doe Q2 is No.","upvote_count":"1","poster":"osakachan"},{"comment_id":"718972","timestamp":"1668531960.0","poster":"alashi","upvote_count":"1","content":"No-No-Yes\n\nReason for number 2 being NO is: Azure Express Route is a direct connection from on prem network to cloud.. no traffic passes over the internet."},{"comment_id":"706439","upvote_count":"3","poster":"EnriqueS","timestamp":"1666959600.0","content":"I think Q2 should be no.\nYou could have a self-hosted private cloud, only accessible from an internal network, with no internet access."},{"comment_id":"672271","timestamp":"1663499880.0","content":"More poorly worded questions. Answer could also be No for some private clouds.","poster":"Billy235","upvote_count":"9"},{"upvote_count":"1","poster":"Softgam","timestamp":"1662408060.0","content":"No,Yes,Yes","comment_id":"660517"}],"exam_id":62,"timestamp":"2022-09-02 19:49:00","topic":"1","unix_timestamp":1662140940,"isMC":false,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04227/0008000001.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/79523-exam-az-900-topic-1-question-79-discussion/","answer_description":"Box 1: No -\nVirtual Machines works.\n\nBox 2: Yes -\nSimply put, cloud computing is the delivery of computing servicesג€\"including servers, storage, databases, networking, software, analytics, and intelligenceג€\"over the Internet (ג€the cloudג€) to offer faster innovation, flexible resources, and economies of scale.\n\nBox 3: Yes -\nReference:\nhttps://azure.microsoft.com/en-us/overview/what-is-cloud-computing/","answer":"","question_images":["https://www.examtopics.com/assets/media/exam-media/04227/0007900001.png"],"question_text":"HOTSPOT -\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//"}],"exam":{"id":62,"isMCOnly":false,"name":"AZ-900","isBeta":false,"isImplemented":true,"provider":"Microsoft","numberOfQuestions":470,"lastUpdated":"12 Apr 2025"},"currentPage":90},"__N_SSP":true}