{"pageProps":{"questions":[{"id":"jurkBXs1muXxTHpnNlLN","question_text":"Your company has an isolated network used for testing. The network contains 20 computers that run Windows 10. The computers are in a workgroup. During testing, the computers must remain in the workgroup.\nYou discover that none of the computers are activated.\nYou need to recommend a solution to activate the computers without connecting the network to the Internet.\nWhat should you include in the recommendation?","answer_images":[],"answers_community":["A (83%)","B (17%)"],"timestamp":"2019-09-09 00:24:00","discussion":[{"comments":[{"poster":"Henry78","timestamp":"1658654820.0","comment_id":"635948","content":"agree.. VAMT -> MAK -> proxy (offline)","comments":[{"upvote_count":"2","timestamp":"1662231960.0","poster":"Henry78","comment_id":"658765","content":"oh no, at the end of proxy process, it will require a connection to MS\nI've changed my mind to KMS"}],"upvote_count":"2"}],"upvote_count":"26","content":"WAMT is the correct answer here:\nhttps://docs.microsoft.com/en-us/windows/deployment/volume-activation/introduction-vamt","poster":"Mendel","timestamp":"1568269020.0","comment_id":"10719"},{"upvote_count":"11","timestamp":"1567981440.0","poster":"Rad33k","comment_id":"10230","content":"What about KMS operational requirements?\n \"[...] The client or server will activate if the count is high enough. Clients will activate if the count is 25 or higher... The KMS only counts unique connections from the past 30 days, and only stores the 50 most recent contacts. [...]\"\nhttps://docs.microsoft.com/pl-pl/windows-server/get-started/server-2016-activation\n\n\"[...]Computers that receive a count below the activation threshold are not activated.\nThe activation threshold is different for Windows clients and servers:\n*Clients will activate if the count is 25 or higher [...]\"\nhttps://secureinfra.blog/2019/01/13/understanding-volume-activation-services-part-1-kms-and-mak/","comments":[{"timestamp":"1567981920.0","upvote_count":"29","poster":"Rad33k","comments":[{"upvote_count":"1","poster":"Henry78","content":"agree.. VAMT -> MAK -> proxy (offline)","timestamp":"1658654760.0","comment_id":"635947","comments":[]}],"content":"I would go for A - VAMT (proxy activation)\nhttps://docs.microsoft.com/pl-pl/windows/deployment/volume-activation/introduction-vamt","comment_id":"10231"}]},{"timestamp":"1688976960.0","comment_id":"947895","content":"VAMT.. By using this method, only the VAMT host computer requires Internet access.\nThe question states, Without connecting to the internet.\nTherfore the answer must be B, KMS","poster":"pakenna08","upvote_count":"1"},{"content":"Selected Answer: A\nThe correct answer is A. Volume Activation Management Tool (VAMT).\n\nTo activate the computers in the isolated network without connecting to the Internet, you can use the Volume Activation Management Tool (VAMT). VAMT allows you to activate multiple computers simultaneously and can be used in an offline environment.\n\nYou can use VAMT to manage product keys and activation status for Windows, Office, and other products from Microsoft.","comments":[{"comment_id":"846745","content":"Answer B, Key Management Service (KMS), requires internet connectivity to activate computers. KMS is used to activate computers in a network environment and requires a minimum of twenty (25) computers to be activated before it can be used.\n\nAnswer C, Active Directory-based activation, also requires internet connectivity to activate computers. Active Directory-based activation is used to activate computers in an Active Directory domain environment.\n\nAnswer D, the Get-WindowsDeveloperLicense cmdlet, is used to install a developer license on a Windows 10 computer for development and testing purposes. It is not used for activating computers in an isolated network.","timestamp":"1679467620.0","poster":"Buruguduystunstugudunstuy","upvote_count":"1"}],"poster":"Buruguduystunstugudunstuy","timestamp":"1679467500.0","upvote_count":"1","comment_id":"846743"},{"poster":"mrjeet","content":"This was on 1/27/23 test! Know this material!","timestamp":"1674837060.0","upvote_count":"1","comment_id":"789782"},{"comment_id":"704457","upvote_count":"1","timestamp":"1666767480.0","poster":"zm9","content":"VAMT because KMS requires 25 computers"},{"upvote_count":"2","comments":[{"timestamp":"1662556560.0","comment_id":"662520","content":"I need to correct myself, indeed KMS needs at least 25 Clients and VAMT can be used offline: You can use the Volume Activation Management Tool (VAMT) to perform activation for client computers that do not have Internet access. The client products can be installed with any type of product key that is eligible for proxy activation: Multiple activation Key (MAK), KMS Host key (CSVLK), or retail key.","upvote_count":"2","poster":"Barrybobslee"}],"content":"Selected Answer: B\nVAMT prerequisite: Network Connectivity to remote computers via Windows Management Instrumentation (TCP/IP) and Microsoft Activation Web Service on the Internet via HTTPS\n\nSo Answer B","timestamp":"1662556380.0","poster":"Barrybobslee","comment_id":"662517"},{"comment_id":"642488","upvote_count":"1","poster":"Jnorris","content":"Selected Answer: A\nThe answer is A. \n\nKMS requires a minimum 25 computers.\n\n\"KMS volume activation requires a minimum threshold of 25 computers before activation requests will be processed. The verification process described here will increment the activation count each time a client computer contacts the KMS host, but unless the activation threshold is reached, the verification will take the form of an error message rather than a confirmation message.\"\n\nhttps://docs.microsoft.com/en-us/windows/deployment/volume-activation/activate-using-key-management-service-vamt#verifying-the-configuration-of-key-management-service","timestamp":"1659625080.0"},{"comment_id":"634022","timestamp":"1658318040.0","upvote_count":"1","content":"VAMT because KMS requires min of 25 clients","poster":"Mage10"},{"upvote_count":"1","content":"https://docs.microsoft.com/en-us/windows-server/get-started/kms-activation-planning\n\n\"B\" is wrong. needs a minimum of 20 pc's","timestamp":"1656068640.0","poster":"Mikehjf","comment_id":"621604"},{"upvote_count":"1","timestamp":"1654082160.0","content":"Selected Answer: A\nA is correct","comment_id":"610123","poster":"[Removed]"},{"timestamp":"1646920260.0","upvote_count":"3","comment_id":"564824","content":"Selected Answer: A\nAs others suggest, KMS requires 25 clients. Question shows only 20 machines, therefore VAMT should be used.","poster":"Tommo"},{"timestamp":"1639803000.0","upvote_count":"4","content":"Selected Answer: A\nKMS requires 25 clients to be where a VAMT does not","poster":"CGtheConqueror","comment_id":"504027"},{"content":"https://docs.microsoft.com/en-us/windows/deployment/volume-activation/vamt-requirements\n\nCheck Requirements: Connectivity to remote computers via Windows Management Instrumentation (TCP/IP) and Microsoft Activation Web Service on the Internet via HTTPS\n\nKMS by Phone is the best answer I Think","comment_id":"493104","timestamp":"1638530760.0","comments":[{"content":"Nope my bad VAMT (proxy) is the right choice KMS requirements not met: https://docs.microsoft.com/en-us/windows-server/get-started/kms-activation-planning\nClients will activate if the count is 25 or higher. Servers and volume editions of Microsoft Office products will activate if the count is five or greater. The KMS only counts unique connections from the past 30 days, and only stores the 50 most recent contacts.","poster":"RoGr","comment_id":"493108","timestamp":"1638531060.0","upvote_count":"1"}],"upvote_count":"1","poster":"RoGr"},{"poster":"Anon1212","comment_id":"490116","timestamp":"1638209700.0","content":"Answer is A, as KMS requires 25: https://docs.microsoft.com/en-us/licensing/products-keys-faq#:~:text=prior%20to%20deployment.-,What%20is%20the%20Key%20Management%20Service%20(KMS),to%20Microsoft%20for%20product%20activation.","upvote_count":"1"},{"content":"Correct answer is A - since KMS requires 25 clients or more.","timestamp":"1633339020.0","upvote_count":"1","poster":"mikl","comment_id":"456996"},{"content":"I want to say that VAMT Proxy Activation can be used to activate the isolated network. \nHowever, does VAMT need internet access? Is their a core network in this scenario that has internet access which can be used to download and transfer VAMT computer information lists with the use of removable media? \n\nTo my understanding, a KMS host needs 25 or 5 servers within it's network? \nCould you turn 5 of these devices into servers for the sake of activation?!","poster":"Chevorelli","timestamp":"1632379980.0","comment_id":"449977","upvote_count":"1"},{"upvote_count":"1","poster":"CARIOCA","comment_id":"447720","timestamp":"1632067680.0","content":"That question, the answer is VAMT.\n\nYour company has an isolated network used for testing. The network contains 20 computers that run Windows 10. The computers are in a workgroup. During testing, the computers must remain in the workgroup.\nYou discover that none of the computers are activated.\nYou need to recommend a solution to activate the computers without connecting the network to the Internet.\nWhat should you include in the recommendation?\n\nThat question, the answer is KMS."},{"comments":[{"timestamp":"1638425760.0","content":"A. Volume Activation Management Tool (VAMT) ?","upvote_count":"1","poster":"mikl","comment_id":"492179"}],"comment_id":"437781","poster":"Smanga1","content":"None of the answers are correct here - suggest rephrasing the question from 20 to 30 computers in the workgroup. From the reference you shared 'KMS volume activation requires a minimum threshold of 25 computers before activation requests will be processed.'","timestamp":"1630576980.0","upvote_count":"1"},{"upvote_count":"2","timestamp":"1629659940.0","content":"The question asks \"Do you need to recommend a solution to activate the computers without connecting the network to the Internet\" - VAMT needs a connection to connect the network to the Internet, so I believe the template letter B - KMS is correct.","poster":"CARIOCA","comments":[{"upvote_count":"1","timestamp":"1638194520.0","comment_id":"489942","content":"https://docs.microsoft.com/en-us/windows/deployment/volume-activation/plan-for-volume-activation-client\n\nThe KMS requires a minimum number of computers (physical computers or virtual machines) in a network environment. The organization must have at least five computers to activate Windows Server 2012 R2 and at least 25 computers to activate client computers that are running Windows 10. These minimums are referred to as activation thresholds.","poster":"mikl"}],"comment_id":"429472"},{"comments":[{"poster":"mikl","comment_id":"456991","timestamp":"1633338900.0","upvote_count":"1","content":"Same here - I agree."}],"content":"Hi guys, anyone do the exam recently, I'm thinking it must be VAMT, as KMS client activation requires 25 to do so","upvote_count":"2","comment_id":"423331","poster":"NEO101","timestamp":"1628687160.0"},{"upvote_count":"1","timestamp":"1627427280.0","poster":"moroni1995","content":"Hey guys, according to John Christopher from the MD-100 course, scanstate will point to the folder where you want to save the user data and, according to the question the migration to Windows 10 won't clean the drives, remaining the Windows.old folder. This is why scanstate will point to that folder.","comment_id":"415759"},{"timestamp":"1626622980.0","comment_id":"409038","content":"Only the Volume Activation Management Tool (VAMT) is a possible solution here.\n\nThe Key Management Service (KMS) has an activation threshold of at least 25 Windows client computers or 5 Windows Severcomputers. Activation of Windows 10 computers will not occur until at least 25 activation requests from Windows 10 computers have been received by the KMS host.","upvote_count":"1","poster":"akah34"},{"upvote_count":"1","comment_id":"401927","timestamp":"1625748240.0","poster":"Zinkypip","content":"kms is my answer"},{"content":"WAMT is the right answer, here you have the reason, Question is asking for activate internet isolated computers in a workgroup which is cover with the \"scenario2 of Microsoft\":\n\nScenario 2: Proxy Activation Describes how to use two VAMT host computers — the first one with Internet access and a second computer within an isolated workgroup — as proxies to perform MAK volume activation for workgroup computers that do not have Internet access.\n\nhttps://docs.microsoft.com/en-us/windows/deployment/volume-activation/vamt-step-by-step","poster":"Z3r0Wing","upvote_count":"3","timestamp":"1625465220.0","comment_id":"398903"},{"timestamp":"1624882260.0","content":"Hi guys I believe that A is the correct answer here, can you confirm?\nKMS only gets activated with 25 clients","upvote_count":"1","poster":"NEO101","comment_id":"392891"},{"timestamp":"1624258320.0","poster":"harryAus","comment_id":"386847","content":"I think KMS is right answer.\nhttps://docs.microsoft.com/en-us/windows/deployment/volume-activation/activate-using-key-management-service-vamt","comments":[{"poster":"mikl","timestamp":"1633338960.0","comment_id":"456995","upvote_count":"1","content":"Its not - KMS requires 25 clients or more. :("}],"upvote_count":"3"},{"content":"O ponto principal da questão é ser 20 computadores fazendo o gabarito ser A (VAMT) e caso fosse 25 computadores o gabarito mudaria para B (KMS).","upvote_count":"1","poster":"CARIOCA","comment_id":"383546","timestamp":"1623859500.0"},{"poster":"mjstonesr","content":"'A' is correct answer in my opinion. KMS requires 25 client workstations before the activation kicks in. VAMT is a workable solution in this scenario.","comment_id":"377452","timestamp":"1623150720.0","upvote_count":"3"},{"poster":"b3arb0yb1m","comment_id":"328808","timestamp":"1617636540.0","upvote_count":"3","content":"I'll stick with A because: KMS hosts count the most recent connections. When a client or server contacts the KMS host, the host adds the machine ID to its count and then returns the current count value in its response. The client or server will activate if the count is high enough. Clients will activate if the count is 25 or higher. Servers and volume editions of Microsoft Office products will activate if the count is five or greater. The KMS only counts unique connections from the past 30 days, and only stores the 50 most recent contacts."},{"content":"A. Volume Activation Management Tool (VAMT) (correct)\nB. Key Management Service (KMS) (needs more than 25 computers)\nC. Active Directory-based activation (needs to be domain member)\nD. the Get-WindowsDeveloperLicense cmdlet (shows developer license)","comment_id":"324814","comments":[],"timestamp":"1617175740.0","poster":"Goofer","upvote_count":"9"},{"upvote_count":"4","comments":[{"comment_id":"319067","poster":"Luuc","upvote_count":"3","content":"KMS: You can verify KMS volume activation from the KMS host server or from the client computer. KMS volume activation requires a minimum threshold of 25 computers before activation requests will be processed. (https://docs.microsoft.com/en-us/windows/deployment/volume-activation/activate-using-key-management-service-vamt), so KMS is not possible for 20 clients.\n\nVAMT: see the picture of the isolated Lab, a desktop hosting VAMT is the solution. \nhttps://docs.microsoft.com/pl-pl/windows/deployment/volume-activation/introduction-vamt\nSo, based on this the anwser Should be: A - VAMT","timestamp":"1616587140.0"}],"content":"The question stats \"What should you include in the recommendation?\"\nYes, VAMT is used to activate the WORKGROUP computers but you need to include a KMS Server (Answer B) witch will Activate with Microsoft.\nYou need to make one of the WOURKGROUP computers a KMS Server first and install the KMS Host Key on it and activate the KMS Host via the internet or by phone.\nThen you install VAMT on the KMS Server. Once VAMT is installed on the KMS Server, you will use it to discover and activate the other WORKGROUP computers against the KMS Server thus, What should you include in the recommendation - Answer B - a KMS Server.","timestamp":"1610098500.0","comment_id":"262461","poster":"ANDREVOX"},{"upvote_count":"1","timestamp":"1609922280.0","content":"It's VAMT not KMS. KMS needs at least 25 computers in a domain and 5 Windows server machines/vm's","comment_id":"260861","poster":"BjornS96"},{"poster":"1morenickname","content":"This should be VAMT if, for no other reason, than there aren't enough clients to process the activation request. There are only 20 Windows 10 clients in this scenario. They would not activate with KMS until another 5 clients are added.","comment_id":"235142","timestamp":"1607107800.0","upvote_count":"1"},{"content":"Kinda offputting to have the first question give a wrong solution...\nIt can't be KMS because there is a requirement of 25 clients or 5 servers...","upvote_count":"1","comment_id":"212846","poster":"Vallion","timestamp":"1604504760.0"},{"timestamp":"1600775280.0","upvote_count":"2","comment_id":"184375","content":"https://docs.microsoft.com/en-us/windows/deployment/volume-activation/scenario-proxy-activation-vamt","poster":"xphan"},{"timestamp":"1600773000.0","upvote_count":"1","comment_id":"184352","poster":"xphan","content":"With a retail product, the Volume Activation Management Tool (VAMT), which is discussed later in this guide, helps you track and manage keys. For each retail activation, you can choose:\n\nOnline activation\nTelephone activation\nVAMT proxy activation\nhttps://docs.microsoft.com/en-us/windows/deployment/volume-activation/plan-for-volume-activation-client"},{"timestamp":"1591852980.0","content":"Maybe need to change answer to A?","comment_id":"107438","poster":"Prianishnikov","upvote_count":"2"},{"timestamp":"1589205180.0","poster":"rass1981","content":"A is the correct answer. \"MAK proxy activation. MAK proxy activation enables a centralized activation request on behalf of multiple computers with one connection to Microsoft. You configure MAK proxy activation by using the VAMT. MAK proxy activation is appropriate for environments in which security concerns restrict direct access to the Internet or the corporate network. It is also suited for development and test labs that lack this connectivity. MAK proxy activation with the VAMT is shown in Figure 17.\"","comment_id":"87149","upvote_count":"4"},{"content":"I think B is wrong, The KMS server will not activate any windows clients until its activation count reaches 25 clients. A is the correct answer","timestamp":"1588293780.0","poster":"mcc","comment_id":"81920","comments":[{"content":"I also agree with you because if the threshold hasn't reached \"25\" it won't activate and in this scenario the threshold is 20 clients","comment_id":"127526","poster":"phila_","upvote_count":"3","timestamp":"1594020540.0"}],"upvote_count":"6"},{"upvote_count":"1","poster":"K7","timestamp":"1578033540.0","content":"KMS also allows activation to occur in scenarios where the client computer is not able to directly perform activation due to firewalls","comment_id":"34809"},{"poster":"edaddy13","comment_id":"30411","timestamp":"1576601640.0","content":"Testing to see if I can submit comments.","upvote_count":"2"},{"comment_id":"29995","poster":"Dyna15","upvote_count":"4","content":"a KMS key is installed on a KMS host; then, the host is activated over the Internet or by phone using Microsoft’s activation services. The by phone part is important here because the other options don't provide this.","timestamp":"1576485780.0"},{"upvote_count":"4","comment_id":"21481","content":"VAMT: Proxy activation. This activation method enables you to perform volume activation for products that are installed on client computers that do not have Internet access. The VAMT host computer distributes a MAK, KMS host key, or retail product key to one or more client products and collects the installation ID from each client product. The VAMT host sends the installation IDs to Microsoft on behalf of the client products and obtains the corresponding confirmation IDs. The VAMT host then installs the confirmation IDs on the client products to complete their activation. By using this method, only the VAMT host computer requires Internet access. Proxy activation by using the VAMT is beneficial for isolated network segments and for cases where your organization has a mix of retail, MAK, and KMS-based activations.","poster":"EJGreen","timestamp":"1573730160.0"},{"comment_id":"15374","upvote_count":"5","poster":"edlindo","comments":[{"poster":"KornienkoBoris","timestamp":"1571757360.0","comments":[{"poster":"RustStevens","comment_id":"88198","upvote_count":"2","timestamp":"1589365500.0","content":"\"...isolated network used for testing.\" This is the key phrase. I have never used a Test network (environment) that had access to the internet unless there was a specific requirement...otherwise, no internet access in Test Environments."}],"comment_id":"16738","content":"\"You need to recommend a solution to activate the computers without connecting the network to the Internet.\"\nJust add and remove yet another 5 machines. Or move already activated KMS to isolated network from another place.","upvote_count":"2"},{"comment_id":"127528","content":"\"KMS volume activation requires a minimum threshold of 25 computers before activation requests will be processed. \" and in this case/ scenario the threshold is 20 clients . So VAMT is the best answer.","upvote_count":"6","timestamp":"1594020720.0","poster":"phila_"}],"timestamp":"1571136420.0","content":"VAMT host machine needs internet access and the network must NOT be connected to the internet. So KMS server is the best anwser. VAMT uses MAK or KMS to activate licences on behalf of client machines that do not have an internet connection. The VAMT host machine itself dos need an internet connection."},{"poster":"Parzival","content":"Yes it is VAMT.","comment_id":"12509","timestamp":"1569352260.0","upvote_count":"3"}],"answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/4924-exam-md-100-topic-2-question-38-discussion/","unix_timestamp":1567981440,"answer_ET":"A","question_images":[],"question_id":71,"answer":"A","choices":{"C":"Active Directory-based activation","A":"Volume Activation Management Tool (VAMT)","B":"Key Management Service (KMS)","D":"the Get-WindowsDeveloperLicense cmdlet"},"exam_id":95,"topic":"2","isMC":true},{"id":"ShqB9AZ6K44Gx0Og2Jiu","exam_id":95,"answer_ET":"D","question_images":[],"answer_images":[],"question_id":72,"answer_description":"","discussion":[{"comment_id":"1342194","upvote_count":"1","content":"Selected Answer: C\nC. Network Configuration Operators12.\n\nWhy This is the Correct Choice:\nNetwork Configuration Operators: Members of this group have the necessary permissions to manage network configurations, including installing and configuring wireless network profiles, without requiring full administrative privileges.\nLeast Privilege Principle: This approach minimizes the risk by granting only the necessary permissions needed for the task, reducing potential security vulnerabilities.\nAnswer could not be D, HERE IS WHY:\nAdding the support technician to the Administrators group would indeed allow them to install the provisioning package, but it would also grant them full administrative privileges on the devices. This goes against the principle of least privilege, which aims to minimize the permissions granted to users to only what is necessary for their tasks.","poster":"Eagrob_11","timestamp":"1737125040.0"},{"comment_id":"846748","content":"Selected Answer: D\nThe correct answer is D. Administrators.\n\nTo install a provisioning package that configures a wireless network profile on Windows 10 devices, the support technician needs to have administrative privileges on the devices. Therefore, you should add the support technician to the Administrators group.\n\nThe principle of least privilege is the practice of giving users the minimum level of access necessary to perform their tasks. While adding the support technician to the Administrators group may seem to violate this principle, it is necessary in this case to allow the technician to install the provisioning package.","timestamp":"1679467980.0","poster":"Buruguduystunstugudunstuy","upvote_count":"2","comments":[{"poster":"Buruguduystunstugudunstuy","content":"Answer A, Users, does not provide the necessary permissions to install a provisioning package.\n\nAnswer B, Power Users, does not provide the necessary permissions to install a provisioning package.\n\nAnswer C, Network Configuration Operators, provides permissions to manage network configuration settings, but it does not provide the necessary permissions to install a provisioning package.","comment_id":"846749","timestamp":"1679467980.0","upvote_count":"1"}]},{"poster":"CSue","comment_id":"807510","timestamp":"1676300100.0","content":"C is correct - Network Configuration Operators\nThis group has the necessary permissions to install provisioning packages and manage network profiles,","upvote_count":"1","comments":[{"timestamp":"1678544580.0","comment_id":"836131","upvote_count":"1","poster":"Spefx","content":"Did you validate this?\n\nAfter testing this i am confident in saying D is the correct answer.\n\nI followed the following steps:\n- Installed Configuration Designer (Part of ADK)\n- Created a new provisioning package only defining ConnectivityProfiles/WLAN/WLANSettings, SSID & SecurityType.\n- Validated that this provisioning package could succesfully installed with \"Administrator\" rights, removed the provisioning package.\n- Created a test user with \"User\" membership, Installing the provisiong package prompted for Administrator credentials\n- Added the test user to the \"Network Configuration Operators\" Group, Installing the provisioning package prompted for Administrator credentials"}]},{"comment_id":"789784","upvote_count":"3","poster":"mrjeet","timestamp":"1674837060.0","content":"This was on 1/27/23 test! Know this material!"},{"comment_id":"757450","content":"Selected Answer: D\nAnswer is correct.\nApplying a provisioning package to a desktop device requires administrator privileges on the device.\nSource: https://learn.microsoft.com/en-us/windows/configuration/provisioning-packages/provisioning-apply-package","timestamp":"1672060440.0","poster":"Hatsapatsa","upvote_count":"1"}],"unix_timestamp":1672060440,"answers_community":["D (75%)","C (25%)"],"url":"https://www.examtopics.com/discussions/microsoft/view/92871-exam-md-100-topic-2-question-39-discussion/","choices":{"A":"Users","C":"Network Configuration Operators","D":"Administrators","B":"Power Users"},"topic":"2","question_text":"You have 10 new Windows 10 devices.\nYou plan to deploy a provisioning package that will configure a wireless network profile.\nYou need to ensure that a support technician can install the provisioning package on the devices. The solution must use the principle of least privilege.\nTo which group should you add the support technician?","answer":"D","isMC":true,"timestamp":"2022-12-26 14:14:00"},{"id":"l4Zdb1WIQi1pZTRLsqRO","timestamp":"2020-10-24 09:15:00","question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou have a computer named Computer1 that runs Windows10.\nA service named Application1 is configured as shown in the exhibit.\n//IMG//\n\nYou discover that a user used the Service1 account to sign in to Computer1 and deleted some files.\nYou need to ensure that the identity used by Application1 cannot be used by a user to sign in to sign in to the desktop on Computer1. The solution must use the principle of least privilege.\nSolution: On Computer1, you configure Application1 to sign in as the LocalSystem account and select the Allow service to interact with desktop check box. You delete the Service1 account.\nDoes this meet the goal?","answer_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/35080-exam-md-100-topic-2-question-4-discussion/","answer_ET":"B","unix_timestamp":1603523700,"isMC":true,"choices":{"A":"Yes","B":"No"},"answer":"B","topic":"2","exam_id":95,"question_id":73,"question_images":["https://www.examtopics.com/assets/media/exam-media/04292/0003900001.png"],"discussion":[{"upvote_count":"28","comment_id":"261682","content":"this question confusing AF","poster":"tonytones","comments":[{"comment_id":"292264","upvote_count":"6","poster":"Hisandy","timestamp":"1613530860.0","content":"you are not alone"}],"timestamp":"1610008980.0"},{"timestamp":"1656003480.0","upvote_count":"1","content":"Selected Answer: B\nAnswer is No","poster":"jcgm1990","comment_id":"621138"},{"content":"Selected Answer: B\nB. No.","upvote_count":"1","poster":"Tommo","comment_id":"564708","timestamp":"1646906400.0"},{"upvote_count":"3","poster":"TechMinerUK","timestamp":"1644320520.0","content":"Selected Answer: B\nWhilst changing it to use the LocalSystemAccount wouild likely work we need to meet the following criteria:\n\"The solution must use the principle of least privilege\"\nBecause of this the service should use an account which has the minimum needed permissions which is then prevented from logging onto the system","comment_id":"543016"},{"poster":"Goofer","comment_id":"447473","upvote_count":"1","content":"By default, services use a noninteractive window station and cannot interact with the user. However, an interactive service can display a user interface and receive user input. Once LocalSystem account (a services running in an elevated security context) creates a window on the interactive desktop, any other application that is running on the interactive desktop can interact with this window. That is, this exposes the service to any application that a logged-on user executes. Then it will be very dangerous.","timestamp":"1632037740.0"},{"content":"Essa questão ficou muito dividida no gabarito, afinal qual seria a resposta e qual a justificativa? Após um debate de 6 comentários, o gabarito é o mesmo ou não? Aguardo um retorno de todos e gostaria das opiniões do @Anthony_2770 e @Formmj.","timestamp":"1624206900.0","poster":"CARIOCA","upvote_count":"2","comment_id":"386412"},{"comment_id":"377718","poster":"OnyxxOr","content":"The reasoning is the local system account access. With a custom user account you have finer control over permissions and can use the GPO to deny login locally","upvote_count":"4","timestamp":"1623174420.0"},{"timestamp":"1617191880.0","comment_id":"325048","upvote_count":"4","content":"B. No.","poster":"AVP_Riga"},{"content":"Why is this a No? Do I have to keep the service1 account?","comments":[{"poster":"AVP_Riga","comment_id":"317019","upvote_count":"2","content":"It must be turned off \"Allow service to interact with desktop check box\"","timestamp":"1616405760.0"}],"timestamp":"1613544060.0","comment_id":"292329","poster":"Thalex","upvote_count":"1"}],"answer_description":"","answers_community":["B (100%)"]},{"id":"N9RSjRkYnbgvAfFNhhai","question_text":"DRAG DROP -\nYou have a computer that runs Windows 10 and has the Windows Assessment and Deployment Kit (Windows ADK) installed.\nYou need to perform the following tasks:\n✑ Prepare a Windows PE (WinPE) working directory.\n✑ Add scripting support to a WinPE image.\n✑ Mount and unmount a WinPE image.\nWhich command should you use for each task? To answer, drag the appropriate commands to the correct tasks. Each command may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\nNOTE: Each correct selection is worth one point.\nSelect and Place:\n//IMG//","timestamp":"2022-09-03 03:36:00","answer_images":["https://www.examtopics.com/assets/media/exam-media/04292/0007900001.jpg"],"url":"https://www.examtopics.com/discussions/microsoft/view/79640-exam-md-100-topic-2-question-40-discussion/","answer_ET":"","unix_timestamp":1662168960,"isMC":false,"answer":"","topic":"2","exam_id":95,"question_id":74,"answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/winpe-mount-and-customize?view=windows-11 https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/winpe-adding-powershell-support-to-windows-pe?view=windows-11","question_images":["https://www.examtopics.com/assets/media/exam-media/04292/0007800001.jpg"],"discussion":[{"upvote_count":"3","timestamp":"1678545060.0","content":"The answer provided is correct and quite nicely laid out in the following microsoft \"Learn\" article:\n\nhttps://learn.microsoft.com/en-us/windows-hardware/manufacture/desktop/winpe-adding-powershell-support-to-windows-pe?view=windows-11\n\nStep 1: Prepare a local copy of Windows PE files, Example using copype\nStep 2. Mount image, Example using dism /mount-image\nStep 3. Add required components, example using dism /Add-Package","comment_id":"836141","poster":"Spefx"},{"upvote_count":"1","poster":"CSue","content":"You can add scripting support using dism. This tool allows you to add packages and drivers to a Windows Preinstallation Environment (WinPE) image, including support for Windows scripting technologies such as Windows PowerShell and Windows Script Host.","comment_id":"807517","timestamp":"1676300520.0"},{"content":"This was on 1/27/23 test! Know this material!","poster":"mrjeet","comment_id":"789785","upvote_count":"4","timestamp":"1674837060.0"},{"poster":"flabezerra","comment_id":"768773","upvote_count":"1","timestamp":"1673112480.0","content":"I believe the last statement about Add scripting support to a WinPE image is not Dism itself. Looking up the picture in the question, there's probably an option for Startnet.cmd (which is the file where those scripts live) scrolling down Commands tab.\n\nTo add that Startnet.cmd file, you simply copy the file using the Copy command to the %SYSTEMROOT%\\System32 of your customized Windows PE image.\n\nSo the answer of the last statement wouldn't be Dism. I don't think so. I also did not find any resources officially made by Microsoft.\n\nCustomize WinPE With Wallpaper and Custom Startup Script: https://jacobsalmela.com/2016/10/03/customize-winpe-with-wallpaper-and-custom-startup-script/"},{"comment_id":"657952","content":"Copype creates a working directory that contains a standard set of Windows\nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/copype-command-line-options?source=recommendations&view=windows-11\n\nUse DISM to mount the WinPE image into a temporary location on your technician PC:\nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/winpe-mount-and-customize?view=windows-11","poster":"Kock","timestamp":"1662168960.0","upvote_count":"3"}],"answers_community":[]},{"id":"5H2xoY3q27UtRDFFIa9M","answer_description":"Box 1: oobeSystem -\nDuring the oobeSystem configuration pass, settings are applied to Windows before Windows Welcome starts.\nThis pass is typically used to configure Windows Shell options, create user accounts, and specify language and locale settings.\n\nBox 2: specialize -\nThe specialize configuration pass is used to create and configure information in the Windows image, and is specific to the hardware that the Windows image is installing to.\nAfter the Windows image boots for the first time, the specialize configuration pass runs. During this pass, unique security IDs (SIDs) are created. Additionally, you can configure many Windows features, including network settings, international settings, and domain information\n\nBox 3: windowsPE -\nIn the WindowsPE pass you can configure:\n* Windows PE options\n* Windows Setup options\nThese options can include specifying the Windows image to install and configuring a disk on the destination computer.\nNote: There are two different types of settings that you can configure during the windowsPE configuration pass: Settings that apply to the Windows PE environment, such as the display resolution and log file locations for Windows PE. You can also specify settings that apply to the Windows installation, such as configuring disk partitions or enabling dynamic updates.\nReference:\nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/how-configuration-passes-work","exam_id":95,"discussion":[{"timestamp":"1678091220.0","content":"seems corect: \nhttps://learn.microsoft.com/en-us/windows-hardware/manufacture/desktop/how-configuration-passes-work?view=windows-11","poster":"cobran","upvote_count":"1","comment_id":"830632"},{"upvote_count":"1","timestamp":"1662270540.0","content":"It's not in the Bettany 2nd edition of Exam Ref book","comment_id":"658985","poster":"Henry78"}],"answer":"","question_id":75,"answers_community":[],"answer_images":["https://www.examtopics.com/assets/media/exam-media/04292/0008100001.jpg"],"isMC":false,"url":"https://www.examtopics.com/discussions/microsoft/view/79965-exam-md-100-topic-2-question-41-discussion/","question_text":"DRAG DROP -\nYou plan to install Windows 10 by using a Windows Setup answer file.\nYou need to perform the following actions during the installation:\nAdd a local account named Local Admin to the Administrators group.\n//IMG//\n\n✑ Add the model and manufacturer information.\n✑ Configure the disks and partitions.\nWhich Windows Setup configuration pass should you configure for each action? To answer, drag the appropriate configuration passes to the correct actions. Each configuration pass may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\nNOTE: Each correct selection is worth one point.\nSelect and Place:\n//IMG//","answer_ET":"","timestamp":"2022-09-04 07:49:00","question_images":["https://www.examtopics.com/assets/media/exam-media/04292/0007900002.png","https://www.examtopics.com/assets/media/exam-media/04292/0008000003.jpg"],"topic":"2","unix_timestamp":1662270540}],"exam":{"id":95,"provider":"Microsoft","lastUpdated":"12 Apr 2025","numberOfQuestions":398,"name":"MD-100","isImplemented":true,"isMCOnly":false,"isBeta":false},"currentPage":15},"__N_SSP":true}