{"pageProps":{"questions":[{"id":"gn23Ch1ENxTDNwR6rK1j","choices":{"B":"Windows 10","C":"Windows 8.1","D":"Android","A":"Android Enterprise"},"topic":"2","answer":"B","answer_description":"Intune device configuration profiles can be applied to Windows 10 devices and macOS devices\nNote:\nThere are several versions of this question in the exam. The question has two possible correct answers:\n1. Windows 10\n2. macOS\nOther incorrect answer options you may see on the exam include the following:\n1. Ubuntu Linux\n2. iOS\nReference:\nhttps://docs.microsoft.com/en-us/mem/intune/protect/endpoint-protection-configure","question_images":[],"unix_timestamp":1636883580,"answer_ET":"B","exam_id":99,"answers_community":[],"timestamp":"2021-11-14 10:53:00","url":"https://www.examtopics.com/discussions/microsoft/view/65995-exam-ms-101-topic-2-question-82-discussion/","isMC":true,"question_id":246,"discussion":[{"content":"ntune can manage for each supported platform:\n\n macOS settings\n Windows settings","timestamp":"1636883580.0","upvote_count":"9","poster":"Johnnien","comment_id":"478038"},{"content":"windows 11 also","upvote_count":"2","timestamp":"1661181420.0","comment_id":"650341","poster":"rnd3131"}],"answer_images":[],"question_text":"You have a Microsoft 365 tenant.\nYou plan to implement Endpoint Protection device configuration profiles.\nWhich platform can you manage by using the profiles?"},{"id":"yR7cCTyGlhdbzovN2zAT","topic":"2","answer":"A","unix_timestamp":1636069440,"url":"https://www.examtopics.com/discussions/microsoft/view/65476-exam-ms-101-topic-2-question-83-discussion/","exam_id":99,"question_text":"You have a Microsoft 365 tenant that contains 500 Windows 10 devices and a Microsoft Endpoint Manager device compliance policy.\nYou need to ensure that only devices marked as compliant can access Microsoft Office 365 apps.\nWhich policy type should you configure?","choices":{"A":"conditional access","B":"account protection","D":"Endpoint detection and response","C":"attack surface reduction (ASR)"},"isMC":true,"timestamp":"2021-11-05 00:44:00","discussion":[{"poster":"DiscGolfer","comment_id":"472824","upvote_count":"10","content":"Conditional Access \nhttps://docs.microsoft.com/en-us/mem/intune/protect/device-compliance-get-started#integrate-with-conditional-access","timestamp":"1636069440.0"},{"poster":"AK_1234","comment_id":"1337488","upvote_count":"1","content":"Selected Answer: A\nA- conditional access","timestamp":"1736237580.0"}],"question_images":[],"answer_images":[],"answers_community":["A (100%)"],"answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/mem/intune/protect/device-compliance-get-started","question_id":247,"answer_ET":"A"},{"id":"Hu2ClSDBbVW5zfWxunKV","timestamp":"2021-10-30 13:35:00","unix_timestamp":1635593700,"discussion":[{"timestamp":"1635798120.0","comments":[{"comment_id":"1131809","upvote_count":"1","content":"Disable and not configure are same stage disable. Source: https://docs.microsoft.com/en-us/mem/intune/protect/security-baseline-settings-defender-atp?pivots=atp-december-2020#attack-surface-reduction-rules","timestamp":"1706197080.0","poster":"qhuy199"}],"upvote_count":"26","comment_id":"471401","content":"This rule is only applicable to ASR. Device Configuration Profile -> Endpoint protection template -> Microsoft Defender Exploit Guard -> Attack Surface Reduction. Though the question is the height of obfuscation itself, I believe the answer is A. Policy 2 is related to email, Policy 3 is not defining any setting.","poster":"mnak"},{"content":"D: No settings\nAttack surface reduction rules support a merger of settings from different policies, to create a superset of policy for each device. Only the settings that are not in conflict are merged, while those that are in conflict are not added to the superset of rules.\nSource: https://docs.microsoft.com/en-us/mem/intune/protect/security-baseline-settings-defender-atp?pivots=atp-december-2020#attack-surface-reduction-rules","timestamp":"1636053060.0","comment_id":"472728","upvote_count":"24","poster":"Bakje","comments":[{"timestamp":"1641644400.0","upvote_count":"3","content":"Agreed, D\n\nNote\n\nConflict handling:\n\n\"If you assign a device two different ASR policies, the way conflict is handled is rules that are assigned different states, there is no conflict management in place, and the result is an error.\nNon-conflicting rules will not result in an error, and the rule will be applied correctly. The result is that the first rule is applied, and subsequent non-conflicting rules are merged into the policy.\"\n\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#mem","comment_id":"519504","poster":"OneplusOne"},{"comment_id":"503193","timestamp":"1639688100.0","poster":"us3r","upvote_count":"2","content":"disagree. The merge can happen on the ASR rules only, not in the Microsoft Endpoint manager policies. \n\nMost probably the correct answer is A (Policy1)"},{"timestamp":"1638793560.0","comment_id":"495119","content":"I agree, all these settings are in conflict so none of them will apply","upvote_count":"3","poster":"amymay101"},{"timestamp":"1654261320.0","comment_id":"611089","upvote_count":"2","content":"Disagree. That paragraph is related to two asr policies.\nYou missed the most important statement: \n\nPolicy Conflict\n\nIf a conflicting policy is applied via MDM and GP, the setting applied from MDM will take precedence.\n\nReference: https://github.com/MicrosoftDocs/microsoft-365-docs/blob/public/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction.md","poster":"Iamrandom"}]},{"poster":"Feyenoord","comment_id":"903829","timestamp":"1684741680.0","upvote_count":"1","content":"Look at this discussion: https://techcommunity.microsoft.com/t5/microsoft-intune/difference-between-quot-devices-gt-configuration-profiles-quot/m-p/3260865\n\nThere someone tested it and confirmed that a setting in a Device Configuration Profile took precedence over a ASR policy.\n\nSo for me answer is Policy 1, Answer A"},{"content":"IT IS A - Ans","comment_id":"877784","upvote_count":"1","timestamp":"1682216820.0","poster":"prabhjot"},{"comment_id":"855605","timestamp":"1680171660.0","poster":"EsamiTopici","content":"Can anyone explain why it should be D? D should apply when there are multiple asr policies, there is only one asr, shouldn’t policy 1 win?","upvote_count":"1"},{"poster":"Lelek","content":"Selected Answer: D\nThe Answer D. No Settings\n\nhttps://techcommunity.microsoft.com/t5/microsoft-intune/best-practice-for-multiple-configuration-policies/m-p/275893","comment_id":"819397","upvote_count":"1","timestamp":"1677169740.0"},{"poster":"hufflepuff","content":"Selected Answer: D\nSee Bakje's answer.","comment_id":"805944","timestamp":"1676173680.0","upvote_count":"1"},{"content":"Selected Answer: D\nNo settings apply due to policy conflicts as previously stated - see Bakje's answer. Dont get misdirected mistaking the values of the settings with the policies themselves. The values are set to Audit or Disabled, not if the policy itself is audit or disabled.","upvote_count":"2","comment_id":"805942","poster":"hufflepuff","timestamp":"1676173560.0"},{"comment_id":"776877","content":"Answer is D because the setting about \"Block obfuscation of potentially obfuscated scripts\" has 3 conflicting values, so it will no applied (https://learn.microsoft.com/en-us/mem/intune/protect/security-baseline-settings-defender-atp?pivots=atp-december-2020#attack-surface-reduction-rules)","timestamp":"1673804100.0","poster":"psp65","upvote_count":"2"},{"upvote_count":"2","poster":"bac0n","comment_id":"735403","content":"https://docs.microsoft.com/en-us/mem/intune/protect/security-baseline-settings-defender-atp?pivots=atp-december-2020#attack-surface-reduction-rules\n\nThe key here is that this rule, \"Block obfuscation of potentially obfuscated scripts\" is an attack surface reduction rule. You can configure it from the three places the article is talking about. Therefore, the statement in the article applies;\n\nWhen two or more policies have conflicting settings, the conflicting settings are not added to the combined policy, while settings that don't conflict are added to the superset policy that applies to a device.\n\nThe answer is D.","timestamp":"1670183340.0"},{"timestamp":"1667577480.0","upvote_count":"1","poster":"4Shawsy","content":"Selected Answer: D\nConflicting Settings so D","comment_id":"711252"},{"content":"D: No Settings.\nWhen two or more policies have conflicting settings, the conflicting settings are not added to the combined policy, while settings that don't conflict are added to the superset policy that applies to a device.","comment_id":"638565","poster":"soydlm","upvote_count":"1","timestamp":"1658997120.0"},{"upvote_count":"2","poster":"AZalan","timestamp":"1651424460.0","content":"Audit, Disable & Not Configured for the same setting are in conflict >>> will not be applied\nAnswer = D","comment_id":"595670"},{"poster":"Kalzonee3611","comment_id":"551692","upvote_count":"2","content":"I feel this should be “A” - anybody agree?","timestamp":"1645352220.0"},{"comments":[{"content":"I would agree this. There are only four values that an ASR policy can have listed below. This would make the first two in conflict and not apply leaving only the last policy to apply as not configured is not an ASR value.\n\n0 : Disable (Disable the ASR rule)\n1 : Block (Enable the ASR rule)\n2 : Audit (Evaluate how the ASR rule would impact your organization if enabled)\n6 : Warn (Enable the ASR rule but allow the end-user to bypass the block)","upvote_count":"2","comment_id":"663997","timestamp":"1662669240.0","poster":"LK4723"}],"timestamp":"1644840900.0","comment_id":"547101","upvote_count":"2","content":"Policy 3 is assigned to device 1, but the settings have no value. \nTherefore answer C.","poster":"JAPo123"},{"content":"Selected Answer: A\nI think A as well. Auditing is not actively doing anything on the policy, but it's still tracking and pulling logs for the device it attached to and that is \"something\"","timestamp":"1643927400.0","upvote_count":"3","comment_id":"540058","poster":"Joshycannon"},{"poster":"Llex","content":"Selected Answer: A\nA please","comment_id":"515271","timestamp":"1641165420.0","upvote_count":"4"},{"upvote_count":"3","content":"I would see it the same - Policy2 is disabled , Policy 3 not configured which means that they do not apply. Policy 1 is in Audit mode but still applied - so answer A","timestamp":"1640078760.0","comments":[{"comment_id":"597230","content":"\"Disabled\" is a state on the same priority level and in conflict with \"Audit\", it's not \"Do nothing\"","upvote_count":"2","poster":"Bouncy","timestamp":"1651744620.0"}],"comment_id":"505957","poster":"smudo1965"},{"comment_id":"495991","content":"Isn't the point here that none of the policies are being enforced? Audit mode, disabled, not configured. There are no settings actually being applied. D.","poster":"jodtzz","timestamp":"1638880980.0","comments":[{"poster":"hufflepuff","content":"no, those are the values of a specific setting, not the policies themselves. The point of the question is what happens when a specific setting has multiple conflicting values applied due different policies.","upvote_count":"1","comment_id":"805933","timestamp":"1676173020.0"}],"upvote_count":"4"},{"upvote_count":"2","content":"I think the same that user mnak","poster":"MartiFC","comment_id":"471505","timestamp":"1635832200.0"},{"timestamp":"1635593700.0","comment_id":"470203","upvote_count":"11","poster":"Turak64","comments":[{"upvote_count":"1","content":"I feel the same. These answers confuse my life lol","timestamp":"1647180120.0","comment_id":"566888","poster":"ajna_"},{"upvote_count":"1","poster":"JAPo123","comment_id":"566804","content":"Only this setting was not configured.\n\nCould be correct. Microsoft logic.","timestamp":"1647174300.0"}],"content":"How can Policy3 apply when it's set to not configured?"}],"answers_community":["A (58%)","D (42%)"],"answer_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/65124-exam-ms-101-topic-2-question-84-discussion/","exam_id":99,"question_text":"You have a Microsoft 365 tenant that contains a Windows 10 device named Device1 and the Microsoft Endpoint Manager policies shown in the following table.\n//IMG//\n\nThe policies are assigned to Device1.\nWhich policy settings will be applied to Device1?","answer_ET":"A","choices":{"A":"only the settings of Policy1","B":"only the settings of Policy2","D":"no settings","C":"only the settings of Policy3"},"question_id":248,"topic":"2","isMC":true,"answer_description":"","question_images":["https://www.examtopics.com/assets/media/exam-media/04295/0023400001.png"],"answer":"A"},{"id":"Ey1UuQ86NkPSKwvomhRH","answer_ET":"","answer_images":["https://www.examtopics.com/assets/media/exam-media/04295/0023600001.jpg"],"topic":"2","answers_community":[],"url":"https://www.examtopics.com/discussions/microsoft/view/67298-exam-ms-101-topic-2-question-85-discussion/","answer":"","exam_id":99,"isMC":false,"question_images":["https://www.examtopics.com/assets/media/exam-media/04295/0023500001.jpg"],"question_id":249,"question_text":"HOTSPOT -\nYou have a Microsoft 365 E5 tenant that contains 100 Windows 10 devices.\nYou plan to attack surface reduction (ASR) rules for the Windows 10 devices.\nYou configure the ASR rules in audit mode and collect audit data in a Log Analytics workspace.\nYou need to find the ASR rules that match the activities on the devices.\nHow should you complete the Kusto query? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","discussion":[{"timestamp":"1649314860.0","comment_id":"582252","poster":"hans333","upvote_count":"11","content":"DeviceEvents | where ActionType startswith 'Asr'"},{"comment_id":"495938","timestamp":"1638878520.0","poster":"AlexBa","content":"https://docs.microsoft.com/fr-fr/microsoft-365/security/defender-endpoint/attack-surface-reduction?view=o365-worldwide#review-attack-surface-reduction-events-in-the-microsoft-365-defender-portal","upvote_count":"10"},{"upvote_count":"1","timestamp":"1687712280.0","comment_id":"933774","content":"https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/attack-surface-reduction?view=o365-worldwide#review-attack-surface-reduction-events-in-the-microsoft-365-defender-portal","poster":"NitishKarmakar"}],"timestamp":"2021-12-07 13:02:00","unix_timestamp":1638878520,"answer_description":"Reference:\nhttps://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/demystifying-attack-surface-reduction-rules-part-3/ba-p/1360968"},{"id":"UM6O0D0G8bxY48dWY05I","answer_ET":"","answer_images":["https://www.examtopics.com/assets/media/exam-media/04295/0023800001.png"],"topic":"2","answers_community":[],"url":"https://www.examtopics.com/discussions/microsoft/view/65484-exam-ms-101-topic-2-question-86-discussion/","answer":"","exam_id":99,"isMC":false,"question_images":["https://www.examtopics.com/assets/media/exam-media/04295/0023700001.png","https://www.examtopics.com/assets/media/exam-media/04295/0023700002.png"],"question_text":"HOTSPOT -\nYou have a Microsoft 365 E5 tenant that connects to Microsoft Defender for Endpoint.\nYou have devices enrolled in Microsoft Intune as shown in the following table.\n//IMG//\n\nYou plan to use risk levels in Microsoft Defender for Endpoint to identify whether a device is compliant. Noncompliant devices must be blocked from accessing corporate resources.\nYou need to identify which devices can be onboarded to Microsoft Defender for Endpoint, and which Endpoint security policies must be configured.\nWhat should you identify? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","question_id":250,"discussion":[{"content":"I believe the answer to the second question is device configuration policy, device compliance policy and conditional access.","comments":[{"timestamp":"1636306380.0","content":"I agree, surely all 3 need to be configured to provide a complete solution","poster":"amymay101","upvote_count":"10","comment_id":"473985"}],"timestamp":"1636076640.0","upvote_count":"39","comment_id":"472852","poster":"ZuluHulu"},{"timestamp":"1637677920.0","poster":"jkklim","upvote_count":"13","comments":[{"comment_id":"530995","content":"However, this doesn't show Win8.1 as an option and there is no answer that has all devices over then Win8.1...","timestamp":"1642990500.0","upvote_count":"1","poster":"ubt"}],"content":"https://docs.microsoft.com/en-us/mem/intune/protect/advanced-threat-protection#onboard-devices-by-using-a-configuration-profile\n\n\nTo be successful, you'll use the following configurations in concert:\n\nEstablish a service-to-service connection between Intune and Microsoft Defender for Endpoint. This connection lets Microsoft Defender for Endpoint collect data about machine risk from supported devices you manage with Intune.\nUse a device configuration profile to onboard devices with Microsoft Defender for Endpoint. You onboard devices to configure them to communicate with Microsoft Defender for Endpoint and to provide data that helps assess their risk level.\nUse a device compliance policy to set the level of risk you want to allow. Risk levels are reported by Microsoft Defender for Endpoint. Devices that exceed the allowed risk level are identified as noncompliant.\nUse a conditional access policy to block users from accessing corporate resources from devices that are noncompliant.","comment_id":"485092"},{"comment_id":"1144175","timestamp":"1707375660.0","poster":"Amir1909","upvote_count":"1","content":"- Device1, Device2, Device3, and Device4\n- Device configuration Profile, device compliance policy, and conditional access policy"},{"poster":"BigDazza_111","content":"In question #82 apparently only MacOS and Windows devices can be configured with MS Endpoint config profiles. and now in this questions they say all devives can be applied to device config profile. WTF thanks for teaching me the meaning of the word 'obsfucate' ET's!","timestamp":"1695061680.0","comment_id":"1010814","upvote_count":"1"},{"poster":"Mshaty","content":"You plan to use risk levels in Microsoft Defender for Endpoint to identify whether a device is compliant. this is where you draw your answer from.. the policy is to identify whether its compliant or not","comment_id":"907160","timestamp":"1685086620.0","upvote_count":"1"},{"upvote_count":"1","comment_id":"838670","content":"So I was torn but I think I understand why. \n\nYou need a compliance policy and a conditional access policy. However the conditional access is for the application rather than the endpoint. The question states what endpoint policies would need to be implemented. \n\nA configuration profile is irrelevant to this question.","timestamp":"1678784520.0","poster":"ACTOSA"},{"upvote_count":"3","content":"The answer should be\n1 - Device1, Device2, Device3 and Device 4\n2 - Device Configuration profile, device compliance policy, and conditional access policy\n\nIf you look at Microsoft's official documentation, it says that it supports Windows 8.1, in addition to supporting iOS and Android, in addition to Windows 10. You can confirm at the link:\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/minimum-requirements?view=o365-worldwide\n\nAs for the second question, it asks \"security policies that must be configured\", if you look at the beginning of the question, you will find the text \"Noncompliant devices must be blocked from accessing corporate resources.\", so to meet this demand, we first need to configure the Complaince Policy to mark whether the device is compliant or non-compliant, but still need to block if device is non-compliant, so we use Conditioanl Access. And finally the Configuration Profile is for onboarding with the MDE.","timestamp":"1677181620.0","poster":"Lelek","comment_id":"819657"},{"timestamp":"1676175540.0","content":"Ok, think I've sorted out the confusion, I hope this helps. Please flag if I've missed something.\n\nEndpoint supports all the listed devices(include 8.1), however intune only supports: Android, iOS/iPadOS, Windows 10/11\n\nUse compliance policies to set device risk levels.\nUse conditional access policies to block devices that exceed your expected risk levels.\nThe above two policies would be enough if we excluded windows 8.1, but to support that device - \"You can manage Defender for Endpoint security configurations on devices that aren’t enrolled with Intune\"\n\nSo my answer: \n1) device1, device2, device3, device4\n2) device configuration policy, device compliance policy and conditional access.\n\nReferences:\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/minimum-requirements?view=o365-worldwide\nhttps://learn.microsoft.com/en-us/mem/intune/protect/advanced-threat-protection-configure\nhttps://learn.microsoft.com/en-us/mem/intune/protect/advanced-threat-protection#onboard-devices-by-using-a-configuration-profile","poster":"hufflepuff","upvote_count":"2","comment_id":"805965"},{"poster":"EsamiTopici","content":"But is Windows 8.1 correct in the first answer?","timestamp":"1675948380.0","comment_id":"803246","upvote_count":"1"},{"poster":"chrys","upvote_count":"5","timestamp":"1660344600.0","content":"You would need config, compliance, and conditional access policies according to this MS doc:\n\nUse the information and procedures in this article to configure integration of Microsoft Defender for Endpoint with Intune. Configuration includes the following general steps:\n\n- Enable Microsoft Defender for Endpoint for your tenant\n- Onboard devices that run Android, iOS/iPadOS, and Windows 10/11\n- Use compliance policies to set device risk levels\n- Use conditional access policies to block devices that exceed your expected risk levels\nAndroid and iOS/iPadOS, use app protection policies that set device risk levels. App protection polices work with both enrolled and unenrolled devices.\n\nhttps://docs.microsoft.com/en-us/mem/intune/protect/advanced-threat-protection-configure","comments":[{"timestamp":"1675948620.0","upvote_count":"1","poster":"EsamiTopici","content":"so the first answer is wrong(?) windows 8.1 not supported","comment_id":"803249"}],"comment_id":"646041"},{"poster":"itmaster","timestamp":"1650038160.0","upvote_count":"2","content":"Configuration profile is only needed if you want to onbaord devices through intune. The right answer for second question should be: \"compliance policy and conditional access policy only\". However, this is not an option, so I am thinking the question is asking for a solution for both on boadrding devices and controlling access through intune, and if this is the case the second question would be okay to include \"configuraiton profile\" in it, but in that case the answer for the first qustion should be \"device 1 only\", because it is not onbaord Android,IOS, and windows 8 thorugh \"configuration profiles\".","comment_id":"586406","comments":[{"timestamp":"1650038280.0","upvote_count":"1","content":"correction.... because it is not supported* to* onbaord Android,IOS, and windows 8 through \"configuration profiles\"","comment_id":"586407","poster":"itmaster"},{"comment_id":"586409","poster":"itmaster","content":"https://docs.microsoft.com/en-us/mem/intune/protect/advanced-threat-protection-configure#:~:text=There%20isn%27t%20a%20configuration%20package%20for%20devices%20that%20run%20iOS/iPadOS","timestamp":"1650038340.0","upvote_count":"1"}]},{"timestamp":"1638450660.0","comment_id":"492519","poster":"jkklim","content":"Devices managed with Intune:\nThe following platforms are supported for Intune with Microsoft Defender for Endpoint:\n\nAndroid\niOS/iPadOS\nWindows 10/11 (Hybrid Azure Active Directory Joined or Azure Active Directory Joined)","upvote_count":"3","comments":[{"timestamp":"1638450840.0","content":"https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/minimum-requirements?view=o365-worldwide\n\nfor answer 1 ==> all devices","poster":"jkklim","upvote_count":"7","comment_id":"492525"}]},{"timestamp":"1637938380.0","content":"jkklim is linked a good document here. Win10/11, Android and iOS devices can be onboarded. We'd need all 3 policy types to set this up.","comment_id":"487464","poster":"goape","upvote_count":"2"},{"poster":"Johnnien","timestamp":"1636885080.0","upvote_count":"1","content":"https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/onboard-configure?view=o365-worldwide","comment_id":"478053"},{"content":"There's no need to create a configuration policy. You only need to block access when a device is not compliant.\nBut that's not an option so the answer is we need to setup all profiles","poster":"[Removed]","upvote_count":"2","comment_id":"474990","timestamp":"1636480320.0"}],"timestamp":"2021-11-05 02:44:00","unix_timestamp":1636076640,"answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-machines-onboarding?view=o365-worldwide"}],"exam":{"isMCOnly":false,"name":"MS-101","isBeta":false,"numberOfQuestions":449,"lastUpdated":"12 Apr 2025","provider":"Microsoft","id":99,"isImplemented":true},"currentPage":50},"__N_SSP":true}