{"pageProps":{"questions":[{"id":"EzeF9PAGXrKqH44ZqYKT","question_id":21,"url":"https://www.examtopics.com/discussions/microsoft/view/122512-exam-pl-300-topic-1-question-28-discussion/","discussion":[{"comments":[{"comment_id":"1123822","content":"Thanks for your answer! I am a bit confused by the need for direct query.\nI see this requirement: \"The solution must ensure that you can publish a separate report and dataset.\" So does using direct query stop the two semantic models from merging or something?\n\nThe question doesn't say anything about required real-time elements so I don't understand why direct query is needed unless it relates to the separation of report and dataset. \n\nOtherwise seems like something you would decide based on size of data source and the real time accuracy requirement from the business...\n\nBut I have never published a dataset without a report so I am not knowledgeable on the subject..","timestamp":"1705373520.0","poster":"edbf978","comments":[{"upvote_count":"3","poster":"JudT","timestamp":"1711433340.0","comment_id":"1183070","content":"Load and Transform Data in Power Query. Close and Apply your power query Logic in PBI. Build your semantic model and publish it on service without any reports. Open a new PbI instance and connect to your pulished semantic model (via Get Data Menu and select Power BI semantic Models) and a connected live mode will be etablished. This is the best way to achive this requirement. Hope this will help."}],"upvote_count":"7"},{"content":"My brother, you are just quoting documentation. You are not answering the question.","comments":[{"timestamp":"1740240480.0","upvote_count":"2","comment_id":"1360176","poster":"Wadyba","content":"The answer is import for both files. You can not use direct query for dataset in Excel and OneDrive. So which language are you going to use to query the folder. Direct Query is for relational databases where you or the system use SQL to query the source."}],"timestamp":"1740240240.0","poster":"Wadyba","upvote_count":"2","comment_id":"1360174"},{"upvote_count":"1","poster":"NadeemSalam","timestamp":"1739296800.0","content":"Import Mode for both Report File and Dataset.\nas you cannot use DirectQuery or Live Connection as storage modes for a dataset that gets data from Excel files in Microsoft OneDrive.","comment_id":"1355078"},{"upvote_count":"18","comment_id":"1214453","comments":[{"timestamp":"1738575720.0","content":"You're right. I saw the simulation on a super tutorial in YouTube and the answer is Import Mode for both because there is no other storage mode for Excel files and the report inherits the storage mode from the dataset.","comment_id":"1350818","upvote_count":"1","poster":"Pitxunet"},{"poster":"Jane97","content":"Dataset: Direct Query.\nTo keep the data in OneDrive and maintain a live connection to the source, you should use Direct Query for the\ndataset. Direct Query allows Power BI to retrieve and query data from the original data source (in this case,\nthe Excel workbooks in OneDrive) in real-time without importing it into the dataset. This ensures that your\ndataset is always up-to-date and reflects changes made to the source data.","timestamp":"1718788200.0","upvote_count":"1","comment_id":"1232800"}],"content":"Wrong answer, THERE IS NO DIRECT QUERY FOR EXCEL FILES, ONLY IMPORT MODE","timestamp":"1716217920.0","poster":"Mo2011"},{"timestamp":"1722191580.0","poster":"Seda_","upvote_count":"40","comment_id":"1256992","content":"Your answer is wrong. When we read the question we understand that we need to import Excel workbooks using web connector and first of all our source data is Excel. For Excel data source, Direct Query mode is not supported even if the connector is web. Please read Microsoft's direct query supported resources article.\nTHE CORRECT ANSWER IS DEFINITELY REPORT FILE:IMPORT DATASET FILE:IMPORT\n\nNOTE: FRIENDS, PLEASE DON'T FORGET. HIGHLY VOTED ANSWERS ARE NOT ALWAYS CORRECT."},{"content":"Wrong!!!","comment_id":"1284718","poster":"Arth_1111","timestamp":"1726492320.0","upvote_count":"3"},{"timestamp":"1709105640.0","comments":[{"timestamp":"1712631000.0","upvote_count":"1","comment_id":"1191913","poster":"Shree07","content":"This is the correct answer. If we have a separate dataset and a report connecting to this dataset then it would be a Live connect and the Dataset can be Import."},{"upvote_count":"1","comment_id":"1183053","timestamp":"1711431000.0","content":"I agree. Thank you for your contribution","poster":"JudT"}],"upvote_count":"38","comment_id":"1161369","poster":"INDEAVR","content":"I think what they meant to say in this question is that you need to split the report and the dataset and publish them to Service separately: \nhttps://learn.microsoft.com/en-us/power-bi/guidance/report-separate-from-model\nI have done this many times and the solution is:\n1. You split your pbix to a report pbix and a dataset pbix\n2. You publish the dataset to Power BI service.\n3. You live connect your report to the Power BI dataset and then publish it as well.\nhttps://powerbi.tips/2020/06/split-an-existing-power-bi-file-into-a-model-and-report/\n\nSo the correct answer is:\nReport => Liveconnect\nDataset => Import\n\nTechnically, the dataset may use any other connection type but in this case I think it is Import."}],"comment_id":"1027183","upvote_count":"44","timestamp":"1696665960.0","content":"Report file: Import: In Power BI, when you import data, it means that the data is loaded into the Power BI Desktop file. In this case, you would import the data from both Excel workbooks into your Power BI Desktop report file. This allows you to create visuals and reports based on the imported data. Importing the data ensures that you can work with the data even when you're not connected to OneDrive.\n\nDataset: DirectQuery: To keep the data in OneDrive and maintain a live connection to the source, you should use DirectQuery for the dataset. DirectQuery allows Power BI to retrieve and query data from the original data source (in this case, the Excel workbooks in OneDrive) in real-time without importing it into the dataset. This ensures that your dataset is always up-to-date and reflects changes made to the source data.","poster":"jl234"},{"timestamp":"1699017240.0","content":"The question is not very clear.\nI would do it this way:\n1 Import by Dataset\n2 Live connect (to dataset) for report(s).","comments":[{"upvote_count":"2","timestamp":"1737547800.0","poster":"ee0625a","content":"Import Mode for the dataset file (to load and transform data from the Excel workbooks). Live Connection for the report file (to connect to the published dataset in Power BI). Live Connection in this scenario refers to connecting the report file to the published Power BI dataset in the workspace, not directly to the Excel workbooks.","comment_id":"1344729"}],"comment_id":"1061456","poster":"Hyla","upvote_count":"41"},{"comment_id":"1360013","poster":"Jasmine121","content":"Both import.\nDirect Query doesn’t support sharepoint folder/files.","upvote_count":"1","timestamp":"1740195420.0"},{"content":"Dataset File: Import Mode\nReport File: Live Connection\nExcel doesn’t support DirectQuery, so Import Mode is required for the dataset.\nLive Connection lets the report use the published dataset without duplicating data.\nPush Mode isn’t relevant (used for real-time streaming, not Excel).","upvote_count":"3","comment_id":"1349406","poster":"Fatima300","timestamp":"1738308780.0"},{"poster":"MANANDAVEY","upvote_count":"2","content":"both answers are import you can check on microsoft learn","comment_id":"1340556","timestamp":"1736896860.0"},{"poster":"jaume","upvote_count":"1","comment_id":"1312703","content":"I think DirectQuery connection is available when connecting to an excel workbook when is hosted in OneDrive or Sharepoint but it's not clear report must be connected to the Dataset or to excel file. Since there is a Dataset (current Semantic Model), I would move for the Import mode for the report unless any size constraint as it would optimize render of the visuals.\nFor the Dataset, I guess you could set up DirectQuery connection to ensure data is updated without any other refresh action but, again, there are no requirements about size, performance... to clearly decide between Import or DirectQuery.\n\"Live Connection\" is a method to build a report in PBI Desktop without having to build a Semantic Model... this could be the answer for the report in case we could understand the requisite \"...publish a SEPARATE report and dataset\" means report and dataset should be not connected","timestamp":"1731686820.0"},{"timestamp":"1731552900.0","content":"Para esta pregunta, la mejor respuesta sería:\n\nReport file: LiveConnect\nDataset file: Import\nExplicación:\nDataset (Import): Este archivo debe configurarse en modo Import, ya que estamos tratando con datos estáticos en archivos de Excel almacenados en OneDrive. El modo Import permite cargar y almacenar los datos en el modelo de Power BI, facilitando la creación de un conjunto de datos independiente y optimizando el rendimiento para análisis rápidos.\n\nReport (LiveConnect): En el archivo de informe, configuramos LiveConnect, lo cual permite conectarse dinámicamente al conjunto de datos importado. Esto asegura que cualquier cambio en el conjunto de datos se refleje automáticamente en el informe sin necesidad de replicar los datos.\n\nEsta configuración permite un informe independiente del conjunto de datos, minimizando el esfuerzo administrativo y optimizando el rendimiento.","upvote_count":"2","poster":"FabricioMoreno","comment_id":"1311698"},{"timestamp":"1728347040.0","comment_id":"1294506","upvote_count":"2","content":"Excel file stored in one drive is not same as an excel file on your desktop. Live connect can be used with onedrive url to source the excel data. So the answer is live Connect for Dataset, and import for Report file","poster":"hsetin"},{"timestamp":"1727858220.0","upvote_count":"2","comment_id":"1292306","poster":"Dany_pop","content":"Report file: Import\nDataset file: Import\n\nThe question said there are two Microsoft Excel workbooks in a Microsoft OneDrive Folder which requires an Excel connector (or Web). NOTE: Excel connector only supports the Import storage mode"},{"content":"Import, DirectQuery","upvote_count":"1","timestamp":"1723817880.0","poster":"rcaliandro","comment_id":"1267205"},{"timestamp":"1721383500.0","poster":"agelee","comment_id":"1251106","content":"1. Report file: LiveConnect\n2. Dataset file: Import","upvote_count":"7"},{"content":"It's import to the dataset and then live connection to report\nthat's how we build it at work","upvote_count":"1","poster":"Smyrol","comment_id":"1238074","timestamp":"1719485400.0"},{"timestamp":"1717498620.0","comment_id":"1224079","content":"Copilot says: B","upvote_count":"1","poster":"4r3k"},{"timestamp":"1716989460.0","comment_id":"1220979","poster":"4ae4e69","content":"You cannot create a DirectQuery / Live connection to an Excel spreadsheet per Microsoft's documentation on Power BI data sources. For excel it seems the mode is import.","upvote_count":"3"},{"timestamp":"1715310300.0","comment_id":"1209182","content":"You need to publish the report and dataset separately, i.e. they are not in the same pbix. The dataset would use import but once it is published into the Power BI Service the report uses a live connection to the dataset.","poster":"jsav1","upvote_count":"5"},{"upvote_count":"9","poster":"Leopards","content":"In this video it says both are : Import\nI don't see anyone given this answer in the discussion.","comment_id":"1199778","timestamp":"1713719160.0"},{"upvote_count":"5","comment_id":"1197434","content":"The answer provided is rubbish! \nA standalone report file uses a liveconnect stoage mode!! The dataset imports.","poster":"9f73003","timestamp":"1713383820.0"},{"upvote_count":"4","poster":"55884","content":"I would say its:\n\nreport file: import\ndataset file: liveconnect\n\nreport: this is because there were no requirement for real-time and due to the requirement's complexity (combining 2 tables into 1 table) THEN visualize the data. we use import to reduce their high complexity by setting report storage mode as import.\n\ndataset: due to the question's requirement \"create visuals based on the data in the table\", there were no semantic model in the picture. so, liveconnect will be the most suitable because liveconnect can create the visuals/report directly from the existing data without the need of semantic model (unlike directquery where it connects the semantic model to data).\n\nthis is my reference: https://learn.microsoft.com/en-us/power-bi/connect-data/service-live-connect-dq-datasets\n\ncorrect me if I'm wrong!","timestamp":"1711820340.0","comments":[],"comment_id":"1186227"},{"timestamp":"1709877540.0","upvote_count":"3","content":"Report either Live or Direct and dataset should be import because you can create daxs in the dataset and publish it and for the report you can connect it with the dataset via live or direct or dual and publish it","poster":"Aero_1898","comment_id":"1168578"},{"timestamp":"1708884780.0","comment_id":"1159009","upvote_count":"1","comments":[{"upvote_count":"4","content":"shouldn't it the other way round? you wouldn't import the data into the report. you would just connect to the published dataset\n\nReport = Live Connection\nDataset = Import\n\n\"Live connection is a way of connecting a Power BI report to a published Power BI semantic model.\"\n\nSource = https://learn.microsoft.com/en-us/power-bi/connect-data/service-live-connect-dq-datasets","poster":"da66a09","comments":[{"timestamp":"1734702600.0","content":"True. The answer should be: ReportFile - LiveConnect; Dataset file - Import. This is how it would work out:\nI. First, you'd create and publish your dataset:\n1. Create a new Power BI file\n2. Import the Sales tables from both Excel workbooks\n3. Combine/model the data as needed\n4. Publish this as your dataset to the Power BI service\n\nII. Then, to create a report with LiveConnect:\n1. Open Power BI Desktop\n2. Click \"Get Data\"\n3. Select \"Power BI datasets\"\n4. Choose the dataset you published in step I.\n5. This automatically creates a Live Connection to that dataset\n\nThe report will now be connected to your published dataset, and you can create visuals using the data from your combined Sales tables.","comment_id":"1329483","upvote_count":"1","poster":"7Veritas"}],"comment_id":"1196507","timestamp":"1713260700.0"}],"content":"I think the write answer is:\nReport file: Import\nDataset file: LiveConnect\n\nRemember that we want to have a 'separate report' and dataset.\nFor this to work we first the two Excel files to the Power Bi Desktop (do whatever we need to do to transform and prepare it). and this without any reports publish it to the Power Bi Services.\n\nNow we have a semantic model and a report (and empty report) on the workspace of Power BI services. we don't need the report and we can just delete it.\n\nNow in power BI we open a new document and select 'Get Data'>'Power BI datasets' and choose the semantic model that we just published. This is going to be a Liveconnect and I think this is the only way we can connect to a semantic model on Power BI services (if anyone knows any other way, tell me).","poster":"SilentAnalyst"},{"comment_id":"1134921","poster":"pscbs","upvote_count":"8","content":"It is not possible to DirectQuery an excel file - this is only for databases or APIs which support it.\nYour dataset should use import - it will import the excel data into the PBI service.\nYour Report should connect to that dataset, and by default that's done with DirectQuery mode since the data is already in the native PBI format after it's been imported by the service. (you can also import in your report, but it would be redundant)","timestamp":"1706530080.0"},{"content":"The Storage mode is for TABLES in your model. The question asks that you must be able to publish a separate report and dataset. That means the 2 tables must be imported to the model. However, report and dataset are the instances that you publish to Power BI Service workspace. There's no storage mode property that you can set for report and dataset.","timestamp":"1705858800.0","poster":"Chellz","upvote_count":"4","comment_id":"1128019"},{"poster":"edbf978","comment_id":"1123827","content":"Does anyone know how to connect to excel files via direct query? I have tried connecting directly to the files, using SharePoint connector and web connector in power bi desktop and all default to import storage mode and cannot be changed.\n\nAlso if anyone knows how to create a dataset file that doesn't have an accompanying report please provide some guidance. Chat GPT recommended using a PBIT file but this doesn't seem like it meets the requirement of a \"dataset file\"...","timestamp":"1705375200.0","upvote_count":"2"},{"poster":"CookieMingkee","upvote_count":"1","comments":[{"comment_id":"1196506","timestamp":"1713260580.0","content":"Report = Live Connection\nDataset = Import\n\n\"Live connection is a way of connecting a Power BI report to a published Power BI semantic model.\"\n\nSource = https://learn.microsoft.com/en-us/power-bi/connect-data/service-live-connect-dq-datasets\n\nYou would import the excel files not direct query","upvote_count":"1","poster":"da66a09"},{"comments":[{"comment_id":"1168020","content":"Why not Live connection?","upvote_count":"1","poster":"LOCOBI","timestamp":"1709817720.0"}],"timestamp":"1706591460.0","upvote_count":"4","content":"I am able to walkthrough this scenario.\n\n1. I created a blank report using the two Excel files as my dataset connecting via Web and appended it. The method here Import for the dataset.\n\n2. I then published the report. This step created a report with no visuals and a dataset that can be refreshed.\n\n3. I created a new report connecting to the dataset created in step 2.\n\n4. In the report, I selected to Transform the data and Power BI Desktop suggested that I need a direct query connection keeping a local model of the dataset.\n\n5. In the Model View, I selected the table and checked the Advanced Property and can confirm that my storage model is Direct Query.\n\nWith the above step, my answer to the question here is as follows:\n\nDataset = Import\nReport = Direct Query","comment_id":"1135526","poster":"CookieMingkee"}],"content":"How exactly can you change the report's data model from Import to DirectQuery? \n\nI created a simple Excel file in OneDrive and created a Semantic Model (Power BI Dataset) in Power BI Service. I then created a new report, selected Power BI Dataset as source but the only option is \"connect\".\n\nAfter connecting, I went to the Model View and highlighted the table. In Advance, the Storage Mode is blank and greyed out.\n\nUnless someone validated the answer by doing, I'll stick with Import on both Report and Data Model.","comment_id":"1117003","timestamp":"1704746880.0"},{"content":"Actually I've no idea what this question want to ask.","poster":"bbshu0801","timestamp":"1703873100.0","upvote_count":"6","comment_id":"1108977"},{"upvote_count":"4","comment_id":"1100313","timestamp":"1702962180.0","poster":"Dsbuff","content":"For dataset files, I'd think it should be \"Import\" mode. DirectQuery mode keeps the data in the source system and sends queries in real-time. However, Excel files, especially when stored in cloud services like OneDrive, do not support DirectQuery as they are file-based and not database services."},{"content":"chatgpt answer:Report File Storage Mode: Import\n\nReason: Importing data into the report file is suitable when you want to create a self-contained report with the data embedded within it. This is beneficial for scenarios where you want the report to be portable and not dependent on the live connection to the original data source. It provides better performance for visualizations and interactivity within the report.\nDataset File Storage Mode: Direct Query\n\nReason: Using Direct Query for the dataset file allows you to create a connection between Power BI and the original data source (in this case, your Excel workbooks on OneDrive). Direct Query mode ensures that the dataset in Power BI is always synchronized with the latest data in the Excel tables. This way, any changes made to the data in the Excel workbooks reflect immediately in the Power BI dataset, providing real-time or near-real-time data updates without importing the data into Power BI.","timestamp":"1699893840.0","comment_id":"1069515","poster":"golia","upvote_count":"5"},{"upvote_count":"4","content":"I think, \nStep 1: create dataset (Import)\nStep 2: create report with DirectQuery mode (use dataset from step 1)","poster":"RMUK","comment_id":"1045096","timestamp":"1697470920.0"},{"content":"Given answer seems correct , I will create a dataset file separately with Import mode so that i can use Power bi published data set in the Power bi report , So dataset is import and report is Direct Query","upvote_count":"3","timestamp":"1697433840.0","comment_id":"1044684","poster":"Aero_1898"},{"timestamp":"1696926060.0","comments":[{"poster":"IrynaVilner","timestamp":"1697499060.0","content":"There is no storage mode \"Live Connection\"","comment_id":"1045349","upvote_count":"6"}],"comment_id":"1039298","upvote_count":"3","content":"I think for the Dataset it can be Live Connection, \n------","poster":"bogomol312"},{"poster":"fra9031","timestamp":"1696684380.0","comment_id":"1027396","upvote_count":"6","content":"What does it mean storage mode for report and dataset files? Should not it be considered for the tables of the datamodel only?"},{"content":"I think that the import mode is beneficial for both cases.","comment_id":"1025948","timestamp":"1696535040.0","poster":"Mati_123","upvote_count":"6"},{"comments":[{"poster":"bbshu0801","comment_id":"1115023","timestamp":"1704526860.0","content":"import and DirectQuery","upvote_count":"1"}],"timestamp":"1696507800.0","upvote_count":"1","comment_id":"1025621","content":"Guys it's the given answer correct ?","poster":"Nawna"}],"unix_timestamp":1696507800,"answer_description":"","answer_ET":"","answer":"","timestamp":"2023-10-05 14:10:00","answer_images":["https://img.examtopics.com/pl-300/image355.png"],"exam_id":116,"topic":"1","isMC":false,"question_text":"DRAG DROP\n-\n\nYou have two Microsoft Excel workbooks in a Microsoft OneDrive folder.\n\nEach workbook contains a table named Sales. The tables have the same data structure in both workbooks.\n\nYou plan to use Power BI to combine both Sales tables into a single table and create visuals based on the data in the table. The solution must ensure that you can publish a separate report and dataset.\n\nWhich storage mode should you use for the report file and the dataset file? To answer, drag the appropriate modes to the correct files. Each mode may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answers_community":[],"question_images":["https://img.examtopics.com/pl-300/image354.png"]},{"id":"Xdl6znmY0aAFwMcG6S6B","answer_images":[],"answer_description":"","unix_timestamp":1696535160,"question_images":[],"answers_community":["A (92%)","8%"],"exam_id":116,"isMC":true,"topic":"1","question_id":22,"choices":{"A":"Merge queries","B":"Combine files","C":"Append queries"},"timestamp":"2023-10-05 21:46:00","discussion":[{"poster":"DataEngDP","upvote_count":"16","comment_id":"1162779","timestamp":"1709222460.0","content":"There are two primary ways of combining queries: merging and appending.\n\nFor one or more columns that you’d like to add to another query, you merge the queries.\nFor one or more rows of data that you’d like to add to an existing query, you append the query. \nhttps://learn.microsoft.com/en-us/power-bi/connect-data/desktop-shape-and-combine-data"},{"upvote_count":"2","comment_id":"1344731","content":"Selected Answer: A\nMerging the two using the common OrderID Column is a better option","timestamp":"1737548520.0","poster":"ee0625a"},{"poster":"faruk3d","timestamp":"1724941440.0","content":"Selected Answer: A\nA is correct","upvote_count":"1","comment_id":"1274555"},{"timestamp":"1723642860.0","comment_id":"1265798","poster":"rcaliandro","upvote_count":"1","content":"Selected Answer: A\nOf course A, merging (join) queries"},{"content":"Merge is correct","poster":"Kiran37","comment_id":"1252367","timestamp":"1721555700.0","upvote_count":"1"},{"upvote_count":"2","comment_id":"1219352","timestamp":"1716792840.0","poster":"Tinashe16","content":"Merge is correct, because of the distinct individual columns which should remain"},{"content":"As per my understanding both the tables are related to orders, one is header data i.e is dimension, another one is Fact, so column's will be different in both the tables, in such case we need to user Merge","upvote_count":"4","timestamp":"1711188180.0","poster":"Muthukumar_Subbaiyan","comment_id":"1180768"},{"comment_id":"1171296","content":"Selected Answer: A\nMerge = SQL join","upvote_count":"4","poster":"AZFabio","timestamp":"1710188580.0"},{"content":"Merge Queries","timestamp":"1706194860.0","comment_id":"1131780","upvote_count":"2","poster":"Roh1410"},{"comment_id":"1108275","timestamp":"1703819700.0","content":"I hope I get this one on my exam...","upvote_count":"4","poster":"08b2ddd"},{"poster":"Dsbuff","comment_id":"1100317","upvote_count":"1","timestamp":"1702962240.0","content":"Selected Answer: A\nA is correct, hands down."},{"content":"Selected Answer: A\nAnswer A is correct.","timestamp":"1699274880.0","upvote_count":"3","comment_id":"1063839","poster":"TrustMyAnswers"},{"poster":"IrynaVilner","timestamp":"1697499300.0","upvote_count":"3","comment_id":"1045354","content":"Answer A is correct"},{"upvote_count":"4","poster":"gradmes","timestamp":"1696879740.0","content":"Selected Answer: A\nA. Merge queries","comment_id":"1038957"},{"upvote_count":"3","comments":[{"comment_id":"1045210","timestamp":"1697481900.0","poster":"faes","upvote_count":"5","content":"People who´re learning"}],"content":"Selected Answer: A\nSeriously, who even proposes C?","poster":"riwahof","timestamp":"1696836540.0","comment_id":"1028582"},{"content":"Selected Answer: C\nTo combine two tables in Power Query Editor into a single query that contains the unique columns of each table, we should select option C, which is \"Append queries.\"","poster":"jl234","upvote_count":"2","timestamp":"1696665900.0","comment_id":"1027182","comments":[{"upvote_count":"4","comment_id":"1027860","poster":"MateoRook","timestamp":"1696758900.0","content":"Correct answer is A. Merge combines columns. Append combines rows. The question is about related tables."},{"comment_id":"1091736","content":"You can also think of Append like a Union in SQL, it just puts datasets beneath eachother but does not merge any unique values together. Sorry if the explanation is unclear I am still learning myself as well.","poster":"TDwayne","upvote_count":"3","timestamp":"1702117860.0"}]},{"content":"Selected Answer: A\nOption A is correct","upvote_count":"3","poster":"sankeytm","comment_id":"1027139","timestamp":"1696661460.0"},{"timestamp":"1696659480.0","content":"Option A","comment_id":"1027122","upvote_count":"2","poster":"SwapnJ"},{"poster":"Mati_123","upvote_count":"2","comment_id":"1025950","timestamp":"1696535160.0","content":"option D is correct"}],"answer":"A","url":"https://www.examtopics.com/discussions/microsoft/view/122553-exam-pl-300-topic-1-question-29-discussion/","question_text":"You use Power Query to import two tables named Order Header and Order Details from an Azure SQL database. The Order Header table relates to the Order Details table by using a column named Order ID in each table.\n\nYou need to combine the tables into a single query that contains the unique columns of each table.\n\nWhat should you select in Power Query Editor?","answer_ET":"A"},{"id":"pFOkBFYfRKibDgfeDcHN","answer_description":"","answer_images":[],"question_images":[],"exam_id":116,"question_text":"For the sales department at your company, you publish a Power BI report that imports data from a Microsoft Excel file located in a Microsoft SharePoint folder.\nThe data model contains several measures.\nYou need to create a Power BI report from the existing data. The solution must minimize development effort.\nWhich type of data source should you use?","answers_community":["A (71%)","B (27%)","1%"],"discussion":[{"upvote_count":"140","poster":"Nomios","timestamp":"1726840140.0","content":"It should be dataset, because the case states there is already a report published and the datamodel contains measures. therefore and to be able to use the measures in the datamodel you should connect to the existing dataset (which was created when you plublished the report) instead of starting from scratch with the files in the SharePoint folder.","comments":[{"content":"After reading the question multiple times, the biggest takeaway is that its asking directly for data. A SharePoint folder HOLDS data, but it is not data itself. I agree with this and think its the existing dataset","comment_id":"715340","upvote_count":"5","timestamp":"1668093300.0","poster":"NatRob"},{"poster":"Hoeishetmogelijk","upvote_count":"9","timestamp":"1669650900.0","comment_id":"729348","comments":[{"upvote_count":"1","poster":"bbshu0801","content":"Yea, I think so.","timestamp":"1673417520.0","comment_id":"772115"},{"poster":"ZSun","comment_id":"951077","timestamp":"1689292800.0","upvote_count":"8","content":"I think the question is clear:\nPublish the first report, and then create the second report from dataset of the first report","comments":[{"timestamp":"1709747280.0","content":"The question also implies that there is a report already created, so using the PBI dataset will include the calculated metrics","poster":"LOCOBI","upvote_count":"1","comment_id":"1167379"}]}],"content":"The question is confusing because it doesn't tell clearly that there are two reports. So the second report can reuse the dataset of the first one."},{"poster":"cabbagepie","upvote_count":"1","content":"can you provide documentation/reference links on this please?","comments":[{"timestamp":"1728065400.0","poster":"5d477b6","content":"You can check the semantic model, they changed the name from dataset to semantic model.","upvote_count":"2","comment_id":"1293231"}],"comment_id":"838705","timestamp":"1678787880.0"},{"timestamp":"1697118720.0","comment_id":"1041778","poster":"Green13","upvote_count":"7","content":"The answer is Sharepoint folder. The data model was for the previously published PowerBi report. Creating a new report from existing data refers to all Sales data on the sharepoint folder."},{"content":"B is the correct answer. you have to take the data from the data source. How is a data set in power BI a data source? The data source is the excel document.","comment_id":"840518","timestamp":"1678934760.0","poster":"TopCat1583","upvote_count":"11"}],"comment_id":"667717"},{"content":"Selected Answer: A\nreuse the existing dataset.","comment_id":"670781","upvote_count":"24","timestamp":"1663329840.0","poster":"rashjan"},{"content":"Selected Answer: C\nDossier Sharepoint, car le fichier Excel utilisé se trouve dans un dossier Sharepoint","upvote_count":"1","poster":"MirianeAn","comment_id":"1411456","timestamp":"1743189240.0"},{"comment_id":"1360618","timestamp":"1740327960.0","content":"Selected Answer: A\nBy using a Power BI dataset, you can reuse the existing data model—including all the measures—in your new report without having to recreate them, which minimizes development effort.","poster":"Hosna2023","upvote_count":"1"},{"content":"Selected Answer: A\nIts a power bi dataset because youre using the same data, it just take some clicks to connect to the semantic model.","comment_id":"1359041","poster":"tecnoyescas","timestamp":"1740014460.0","upvote_count":"1"},{"upvote_count":"1","poster":"Sonuf","timestamp":"1732809720.0","content":"Selected Answer: D\nMOST WEBSITES HAS THIS ANSWER AS D","comment_id":"1319331"},{"comment_id":"1317925","upvote_count":"1","timestamp":"1732600080.0","content":"Selected Answer: A\nresuing existing data to get the measures that are already created is best","poster":"ThandaPanda11"},{"timestamp":"1732545600.0","poster":"Jaitin","content":"Selected Answer: A\npower bi datasets are most common appoach to reuse single data for multiple reports","upvote_count":"1","comment_id":"1317543"},{"poster":"rcaliandro","comment_id":"1265556","content":"Selected Answer: A\nThe correct answer is A-Power BI dataset (now has benn renamed as Power BI semantic models)","timestamp":"1723620960.0","upvote_count":"2"},{"poster":"NilinET","timestamp":"1722552120.0","comment_id":"1259594","content":"Selected Answer: A\nDataset has been renamed to semantic model, so PBI dataset should be equivalent to PBI Semantic model.\nhttps://learn.microsoft.com/en-us/power-bi/connect-data/service-datasets-rename\nBack to the question, for the purpose of minimizing development effort, by using an existing semantic model may save time from clear, transform and load the data source.","upvote_count":"1"},{"timestamp":"1721288760.0","upvote_count":"1","content":"Selected Answer: B\ncorrect","comment_id":"1250221","poster":"Kiran37"},{"content":"a sharepoint folder","poster":"Nishi_06","upvote_count":"1","comment_id":"1244284","timestamp":"1720433760.0"},{"comment_id":"1237432","timestamp":"1719403500.0","content":"Selected Answer: B\nThe first two sentences were meant to confuse you. The actual question is which \"data source\"","upvote_count":"3","poster":"Migs123"},{"timestamp":"1718867640.0","upvote_count":"1","comment_id":"1233492","content":"I agree. the correct answer should be Dataset, as it refers to create a new PBI based on data (and a dataset) already built","poster":"supersoniccat"},{"content":"Selected Answer: A\nThe correct answer should be Dataset. A connection with the Share folder was initiated for the first report. After publishing the report a Power BI dataset was created and by connecting with it we minimize the development.","upvote_count":"2","comment_id":"1227836","poster":"antouan","timestamp":"1718019540.0"},{"content":"Selected Answer: A\nAgree with Nomios!\nAnswer I am going with: Existing Dataset bc the qs clearly states that the report is already published and the data model of that published report contains measures. Therefore, to be able to use those measures in the already published dataset, use: Existing dataset)","comment_id":"1217959","timestamp":"1716607560.0","upvote_count":"1","poster":"e31df62"},{"upvote_count":"1","comment_id":"1205356","poster":"Grey_Head","content":"Selected Answer: A\nThe solution must minimize development effort.","timestamp":"1714635840.0"},{"comment_id":"1202866","content":"Selected Answer: B\nAnswer is B. Even though there was a published page before, they are trying to create a NEW report which you have to use the sharepoint folder url to get access to the files. lol","upvote_count":"2","timestamp":"1714174080.0","poster":"canopus112"},{"timestamp":"1712753160.0","upvote_count":"2","content":"Hi , im preparing for the 'Microsoft Certified: Power BI Data Analyst Associate' cirt. Ive completed all modules that were on the Syllabus twice and there was no mention of the dataverse. I can see its Power app module thats not on the syllabus...does anyone have a comprehensive of all modules required?","poster":"dataguy1","comment_id":"1192993"},{"timestamp":"1711959120.0","content":"Selected Answer: B\nThe question is: \"Which type of data source should you use?\"\nThe Power BI dataset is NOT a data source. \nhttps://learn.microsoft.com/en-us/power-bi/connect-data/desktop-data-sources\nThus, since it should have minimal developing impact, it should be answer B \"Sharepoint folder\".","upvote_count":"7","comments":[{"timestamp":"1713872580.0","content":"Power BI dataset is litteraly the 2nd option of your link. Answer is A","upvote_count":"4","comment_id":"1200700","poster":"chelchoul"}],"comment_id":"1187300","poster":"Uhoh"},{"content":"Selected Answer: B\nSharepoint","timestamp":"1711253640.0","poster":"Jyothi988","comment_id":"1181319","upvote_count":"2"},{"comment_id":"1167377","timestamp":"1709747160.0","upvote_count":"1","content":"Dataset included calculated tables, while a data flow is a collection of tables.","poster":"LOCOBI"},{"content":"A is the answer:\nI am not convinced with B, the published dataset is already connected to the existing data, and to minimize effort of modeling and creating all the measures you will just reuse everything","upvote_count":"1","poster":"oOHichamOo","comment_id":"1162551","timestamp":"1709211540.0"},{"poster":"Krichounette","comment_id":"1153811","upvote_count":"1","timestamp":"1708335720.0","content":"Selected Answer: A\nFor me is the answer A. the keywords for me are: you publish and not you want to publish or you will publish.\"Existing Data\". Also, the solution must 'minimize developement effort' . If we want to minimize the effort, we won't do the same thing with reconnecting to the sharepoint folder."},{"content":"Selected Answer: A\nyou shall connect to the existing & published PowerBI dataset in order to minimize development effort and reuse the measures. If you connect to SP folder, then you shall start building from scratch","poster":"Andreasdest","comment_id":"1129453","timestamp":"1706008380.0","upvote_count":"1"},{"poster":"SHENOOOO","comment_id":"1127275","upvote_count":"1","content":"Selected Answer: A\nThe Dataset is already there, and the question mentioned that we should minimize development, so the dataset and measures are already existing. A should be the correct answer.","timestamp":"1705755360.0"},{"upvote_count":"4","timestamp":"1705029540.0","poster":"Briarheart1096","comment_id":"1120405","content":"This Question appeared in the Mock Exam provided in Coursera Power BI course and has Sharepoint Folder as the correct answer. Even though i think it should be Dataset"},{"poster":"Masamune1","content":"Selected Answer: A\nWithout a shadow of a doubt, if we want to create a report in PowerBI from a data model that contains measurements, we need to connect directly to that model, so we will use the Power BI Datasets option, if we connected to a Sharepoint folder , we would start from an excel file and nothing could be reused from the data model and its measurements.","upvote_count":"3","timestamp":"1704205980.0","comment_id":"1111959"},{"comment_id":"1095376","timestamp":"1702462500.0","upvote_count":"3","content":"The key word here was \"publish\", in order to access datasets they need to be published first therefore the answer is A.","poster":"LemonYeti"},{"comment_id":"1094875","timestamp":"1702409760.0","content":"Selected Answer: A\nThe set is already done and contains measures. You can build a report on the same dataset.","upvote_count":"3","poster":"Saluk_DE"},{"content":"Correct answer is A","timestamp":"1701375420.0","poster":"Brita_bm","upvote_count":"3","comment_id":"1084734"},{"poster":"Preethamailapuram","upvote_count":"2","timestamp":"1701168900.0","content":"We will utilize an existing Power BI Dataset, the data source of which is a SharePoint folder. Consequently, the data source for the upcoming report will also be solely a SharePoint folder. So answer is B.","comment_id":"1082451"},{"poster":"CookieMingkee","upvote_count":"2","comment_id":"1072113","content":"Selected Answer: A\nThe requirements are:\nYou need to create a Power BI report from the existing data. \nThe solution must minimize development effort.\n\nUsing the Power BI Dataset already lessens the development effort and already contains measures that can used for the new report.","timestamp":"1700105400.0"},{"comment_id":"1069362","upvote_count":"2","timestamp":"1699884060.0","poster":"Rolfvo93","content":"TBH, dataset makes the most sense regarding inflation in the Sharepoint folder. If so, we would have to take the derivative of the inflation to adjust for unexpected polynomial functions which could expand from one folder to the next (which would cause a chain reaction), and eventually leading to power BI shutting down."},{"content":"Selected Answer: A\nA, as it is needed to minimize efforts.","upvote_count":"1","timestamp":"1699253640.0","comment_id":"1063559","poster":"TrustMyAnswers"},{"comment_id":"1043807","poster":"Kish1604","content":"Selected Answer: A\nSince the solution must minimize development efforts and we already have a report with same dataset published, the answer should be Power BI dataset.","timestamp":"1697332740.0","upvote_count":"2"},{"upvote_count":"1","timestamp":"1696612200.0","poster":"SwapnJ","content":"I think it should be a Sharepoint folder. Option B","comment_id":"1026835"},{"comment_id":"1022608","poster":"Nagarajutd15","timestamp":"1696184760.0","content":"Answer is \"A --> Power BI dataset\" because the question says \"You need to create a Power BI report from the existing data. The solution must minimize development effort.\" If we use power bi dataset the development efforts will be less.","upvote_count":"3"},{"timestamp":"1693844820.0","upvote_count":"1","poster":"Igetmyrole","comment_id":"998687","content":"The correct answer is D (an Excel Workbook) it is because using an Excel Workbook as a data source allows you to directly import the data from the EXCEL file into power bi without the need for additional data transformation steps."},{"timestamp":"1693248780.0","content":"Selected Answer: B\nFastest way, like the it is asking.","upvote_count":"1","poster":"dayrell","comment_id":"992566"},{"content":"B:SharePoint Folder\nBecause the data you need is stored in an Excel file in a SharePoint folder, you would access and use that data as your source. This allows you to efficiently work with the existing data and create the report with the least development effort. If you had mentioned that the data is already in a Power BI dataset, then option A would have been the correct choice.","upvote_count":"2","comment_id":"985299","timestamp":"1692459060.0","poster":"Alexks"},{"poster":"monaimonai","content":"Selected Answer: A\ndata model contains measures","upvote_count":"2","comment_id":"974624","timestamp":"1691407260.0"},{"content":"Selected Answer: A\nIt states that it already imported the data from an excel file for an existing report. You are now adding another report that uses the same data. So you just use the dataset","comment_id":"972310","timestamp":"1691165460.0","poster":"MEG_Florida","upvote_count":"3"},{"poster":"RooneySmith","comment_id":"971166","timestamp":"1691070480.0","content":"Selected Answer: B\nOption A is possible choice, but you may be encountered to an error message saying \"DirectQuery isn't available for this dataset\", then it would add development effort. This is why B is safer as there is no difference in the process between choosing a dataset or Sharepoint folder. It would increase the load time, but there is no development effort behind it.","upvote_count":"3"},{"comment_id":"965637","content":"Selected Answer: B\nSharepoint folder","upvote_count":"1","timestamp":"1690557000.0","poster":"AK055"},{"upvote_count":"1","comment_id":"962704","poster":"Ravisha27","timestamp":"1690287780.0","content":"Selected Answer: A\nre-using power BI dataset is a clear choice here."},{"content":"To reuse the existing imported data, we use PBI Dataset resource. Refer >>> https://learn.microsoft.com/en-us/power-bi/connect-data/service-datasets-discover-across-workspaces","poster":"zak2003","comment_id":"956512","timestamp":"1689762240.0","upvote_count":"3"},{"comments":[{"comment_id":"1188759","poster":"0b90882","upvote_count":"1","content":"In this case you cannot benefit from the existing measures that were created in the existing model. By not using the existing model you have the re-create these.","timestamp":"1712161560.0"}],"comment_id":"956182","upvote_count":"2","timestamp":"1689739200.0","content":"Selected Answer: B\nUsing a Power BI dataset would be an appropriate option as well, and it might offer certain advantages over the SharePoint Folder data source depending on your specific requirements and scenario. However, if your goal is to minimize development effort, using the SharePoint Folder data source directly might be a more straightforward approach. It allows you to quickly import data from the Excel file without the need for additional data modeling in Power BI Desktop. It could be especially useful when the Excel file already contains the necessary measures, and you only need to create visuals for reporting","poster":"Stefan1986"},{"poster":"Lavoisier","timestamp":"1689052740.0","comment_id":"948697","content":"The question is to select the type of data source. The answer can't be A, because Power Bi dataset is not a type of data source. The answer is B. SharePoint Folder is a type of data under the category File data source. Ref: https://learn.microsoft.com/en-us/power-bi/connect-data/desktop-data-sources","comments":[{"content":"https://learn.microsoft.com/en-us/power-bi/connect-data/service-datasets-discover-across-workspaces\n\n\"In Power BI Desktop: from the Home ribbon, select Get data > Power BI datasets.\"","timestamp":"1697118120.0","upvote_count":"1","comment_id":"1041774","poster":"Green13"},{"content":"A power bi dataset IS a data soruce https://support.microsoft.com/en-us/office/use-power-bi-desktop-to-connect-with-your-project-data-df4ccca1-68e9-418c-9d0f-022ac05249a2\n\nIt says about a report","poster":"RicoPallazzo7","comment_id":"978610","timestamp":"1691756460.0","upvote_count":"1"}],"upvote_count":"3"},{"poster":"garvenor","timestamp":"1688417640.0","content":"B.The excel dataset is held in SharePoint therefore SharePoint becomes our source.","comment_id":"942208","upvote_count":"2"},{"comment_id":"940912","poster":"JJMC5544","content":"\"you publish a Power BI report\" what do they mean? You have published ? You will publish ? It is difficult to determine whether the question is referring to a specific past instance, an ongoing action, or a future action.","timestamp":"1688304240.0","upvote_count":"2"},{"content":"Selected Answer: A\nA. Power BI dataset\n\nThe Power BI dataset would be the best option in this scenario. If you've already published a Power BI report that imports data from an Excel file located in SharePoint and the data model contains several measures, you can simply use the existing Power BI dataset to create a new report. This would significantly minimize the development effort as you wouldn't need to import and transform the data again or recreate the measures. \n\nIn Power BI Desktop, you can select \"Power BI Datasets\" as your data source and then select the published dataset you want to use. This method allows you to create multiple reports from a single dataset, enabling dataset reusability and consistency across reports. \n\nOptions B, C, and D would require additional data loading and transformation efforts, which are not necessary in this case as the dataset has already been created and published.","comment_id":"928104","upvote_count":"5","timestamp":"1687227420.0","comments":[{"comment_id":"968121","timestamp":"1690808100.0","content":"Power BI dataset is not a data source. Option B is correct","upvote_count":"1","poster":"AlejandroErazo"}],"poster":"visionary4ever"},{"upvote_count":"1","poster":"JonDave","content":"Im going with power bi dataset. You already have the sharepoint dataset imported in a previous report. Use that dataset (power bi dataset) to generate new reports. It takes no development effort (i.e. obtaining the sharepoint link, ensuring correct permissions, etc)","timestamp":"1686919800.0","comment_id":"925174"},{"timestamp":"1682939700.0","poster":"Shalaleh","content":"Selected Answer: A\nThe dataset includes measures. it means dataset is already in power bi.","comment_id":"886141","upvote_count":"1"},{"upvote_count":"2","timestamp":"1682794620.0","content":"Selected Answer: A\nExisting Power BI Dataset\n\nThe key here is that you already have a published Power BI report, and you want to create a new report from that existing data. Using the existing dataset should minimize development effort because the existing file already has a model\nhttps://learn.microsoft.com/en-us/power-bi/connect-data/service-datasets-understand","comment_id":"884627","poster":"lizbette"},{"content":"I strongly support sharepoint site because based on best practice, sales reports are better managed by direct query to the data source","comment_id":"882022","poster":"Addictedx_19","upvote_count":"1","timestamp":"1682542800.0"},{"comment_id":"881756","upvote_count":"2","poster":"SanaCanada","content":"Selected Answer: B\nGiven the answer is correct B.....no confusion, and no need to discuss further\n\nPlain and simple question","timestamp":"1682521800.0"},{"timestamp":"1681463820.0","poster":"newGodking","upvote_count":"1","content":"The appropriate solution is SharePoint. Although the question doesn't mention the existing model, it can be challenging to organize old Power BI data. Starting from scratch is a simpler alternative.","comment_id":"870087"},{"timestamp":"1681209120.0","upvote_count":"2","comment_id":"867195","content":"Yes, its A","poster":"codeson"},{"timestamp":"1680830280.0","poster":"NLeeXTung","comment_id":"863408","upvote_count":"2","content":"Final answer is A. Reason why is:\n+ In the question, it contains this sentences: \"...The data model contains several measures...from the existing data...minimize development effort\" and ..\n+ .. If you aware that the first sentence said: \"you publish a Power BI report that imports data from a Microsoft Excel file located in a Microsoft SharePoint folder\" which should be written in simple past not simple present --> So you already have the data from Sharepoint in PBI dataset.\n+ B only correct if the question is How to collect data from Sharepoint and have no other context."},{"comment_id":"858608","poster":"Aneran","upvote_count":"2","timestamp":"1680421260.0","content":"To minimize development effort, you should use a SharePoint folder as your data source. Since your Microsoft Excel file is already located in a SharePoint folder, using this folder as your data source will allow you to easily import data into your Power BI report without the need for any additional data connectors or setup. Additionally, by using a SharePoint folder as your data source, you can take advantage of Power BI's built-in support for SharePoint, which makes it easy to keep your data up to date and share your report with others."},{"content":"Selected Answer: A\nshould be Dataset","upvote_count":"1","timestamp":"1680328860.0","comment_id":"857616","poster":"Andrew9834523"},{"poster":"Abhi256","upvote_count":"1","timestamp":"1679639820.0","comment_id":"849050","content":"Selected Answer: B\nIn Power BI connect to the Microsoft Excel file located in the Microsoft SharePoint folder. This connector will allow you to import the data from the Excel file into Power BI and create a report from the existing data model with minimal development effort."},{"timestamp":"1679582520.0","content":"Selected Answer: A\nSe debe minimizar el esfuerzo de Desarrollo, utilizar el conjunto de Datos de Power Bi que ya tiene toda la transformación y las medidas.","upvote_count":"2","poster":"DUVANES","comment_id":"848322"},{"poster":"TopCat1583","upvote_count":"3","content":"B- I say SharePoint folder. The data source is Excel file nested in the SharePoint folder. I have several report deriving from one data source(excel inside a SP folder) in my job now. Think this way the data source is imported to Power BI, key work imported meaning the information is saving in Power BI but not updating. How will the imported Power BI data set update when the Excel file updates. It will not upddate?","comment_id":"840517","timestamp":"1678934580.0"},{"poster":"srikanth923","content":"Selected Answer: A\nThe answer is A. Although there are two possible answers, if you use Power BI datasets, any data cleaning steps applied and measures created in the dataset will be automatically applied when the dataset is imported. However, if you import the dataset into Power BI using the SharePoint folder, you'll need to apply the data cleaning steps again, which requires more development work.","timestamp":"1677632220.0","comment_id":"825432","upvote_count":"5"},{"timestamp":"1676026140.0","upvote_count":"1","poster":"skaha","comment_id":"804228","content":"Published report on PBI service, has dataset(existing data), can make many reports as needed. So A- Power BI Dataset is the correct answer."},{"poster":"BabaJee","comment_id":"762025","content":"Selected Answer: A\nexisting dataset to minimise efforts makes sense","timestamp":"1672410060.0","upvote_count":"3"},{"content":"This question ought to be asked like this: You create a Power BI report for your company's sales division that imports data from a Microsoft Excel file that is housed in a Microsoft SharePoint folder. The data model includes a number of measurements. From the current data, a Power BI report must be made. The solution must reduce the amount of development work. Which kind of data source ought you to employ?","poster":"Astroid_1994","comment_id":"761069","upvote_count":"2","timestamp":"1672321200.0"},{"comment_id":"758491","poster":"MBA_1990","upvote_count":"4","content":"Selected Answer: A\nreuse of existing data","timestamp":"1672144980.0"},{"comment_id":"758154","poster":"VinayKadaya","content":"I guess the first line \"For Sales Team\" has an implication here. The data set in Powerbi report that we publish for sales team has measures specific for them. And since the objective or end users of the second Power Bi report is not stated, it would imply we have to obtain data without any filters (which may have been in the first data set)","timestamp":"1672118340.0","upvote_count":"2"},{"timestamp":"1671652860.0","content":"minimize the effort with the measures already created.\nUse the dataset.","comment_id":"752713","upvote_count":"2","poster":"PsgFe"},{"poster":"Dr_Do","timestamp":"1670787960.0","content":"Selected Answer: A\nSeveral measures to be reused --> Dataset","upvote_count":"4","comment_id":"742047"},{"poster":"Hoeishetmogelijk","upvote_count":"4","content":"Selected Answer: A\nI read this question case like this:\n1. You publish a Power BI report with its dataset including measures\n2. You create a second Power BI report using the existing data with a minimal of effort.\n\nSo my conclusion would be to reuse the dataset that was published together with the first report. So answer A.","timestamp":"1669650540.0","comment_id":"729341"},{"timestamp":"1669329240.0","upvote_count":"1","content":"Sharepoint! Powerbi dataset wouldn't allow to use some features which was not declared in the question if was going to be necessary or not.","comment_id":"726246","poster":"Shiiton"},{"poster":"albi123","upvote_count":"1","content":"Answer is \"A\"","timestamp":"1667905020.0","comment_id":"713699"},{"comment_id":"703999","content":"\"...you publish a Power BI report...\" \n\"...The solution must minimize development effort.\"\nSo the solution is A","poster":"Churato","timestamp":"1666713000.0","upvote_count":"1"},{"poster":"Churato","upvote_count":"3","timestamp":"1666429200.0","content":"Selected Answer: A\nA) There's a Dataset already used once","comment_id":"701432"},{"upvote_count":"4","comment_id":"699558","content":"Selected Answer: A\n\"You need to create a Power BI report from the existing data.\"\nthe keywords here is \"EXISTING DATA\"","timestamp":"1666241820.0","poster":"xxfangxx"},{"timestamp":"1664996940.0","upvote_count":"1","comment_id":"687164","content":"Selected Answer: A\nCan use the existing dataset, it contains measures and the requirement was for least development effort. Its entirely possible to use an existing dataset to create a new report within the PowerBI service","poster":"lukelin08"},{"timestamp":"1664734680.0","content":"Selected Answer: B\nIts a sharepoint folder, we are specifically being told that the data is in a SharePoint location","comment_id":"685000","comments":[{"timestamp":"1665553260.0","poster":"Dovoto","content":"Yes. The Microsoft Excel file is in a SharePoint location. But we are asked to \"create a Power BI report from the existing data. The solution must minimize development effort\". So we can reuse the existing dataset.","upvote_count":"2","comment_id":"692684"}],"upvote_count":"3","poster":"Lkra1"},{"content":"Selected Answer: A\nChoosing a Power BI dataset will minimize the development effort.","upvote_count":"2","comment_id":"683171","poster":"Nurgul","timestamp":"1664504520.0"},{"content":"Selected Answer: B\nI looked at the data lineage view in my workspace, and you're correct. If the question was dataset, then the existing Power BI dataset should be reused. In this case, you connect to the data source which is the share point folder.","timestamp":"1663936320.0","upvote_count":"6","poster":"RichardOgoma","comment_id":"677122"},{"comments":[{"content":"I looked at the data lineage view in my workspace, and you're correct. If the question was dataset, then the existing Power BI dataset should be reused. In this case, you connect to the data source which is the share point folder.","comment_id":"677119","upvote_count":"2","poster":"RichardOgoma","timestamp":"1663936260.0"},{"comment_id":"710771","content":"Power BI is also a type of data source. \nhttps://learn.microsoft.com/en-us/power-bi/connect-data/desktop-data-sources","upvote_count":"2","poster":"aish","timestamp":"1667506020.0"}],"content":"B. a SharePoint folder as a datasource. Dataset is not a datasource.\nDataset supports multiple datasources.","comment_id":"674753","poster":"saurinkhamar","timestamp":"1663731300.0","upvote_count":"5"},{"poster":"alosh","timestamp":"1663226280.0","comment_id":"669592","upvote_count":"3","content":"Selected Answer: A\nA : is The Correct Ansower (Dataset)\nthe data is already Existing"},{"comment_id":"669553","poster":"alosh","content":"A : is The Correct Ansower (Dataset)\nthe data is already Existing","upvote_count":"1","timestamp":"1663224300.0"},{"poster":"GGrace","upvote_count":"2","comment_id":"668529","content":"A is the correct answer, we just reuse the existing PBI report dataset","timestamp":"1663117680.0"},{"upvote_count":"2","poster":"blito123","comment_id":"666870","timestamp":"1662982620.0","content":"Dataset is correct, no?"},{"comment_id":"661032","timestamp":"1662455040.0","content":"Power BI Dataflow is the right answer?","poster":"d94949999","upvote_count":"1"},{"timestamp":"1662444240.0","poster":"d94949999","upvote_count":"4","content":"Selected Answer: B\nI think B is the right answer","comment_id":"660862"}],"answer_ET":"A","topic":"1","question_id":23,"unix_timestamp":1662444240,"timestamp":"2022-09-06 08:04:00","url":"https://www.examtopics.com/discussions/microsoft/view/80518-exam-pl-300-topic-1-question-3-discussion/","isMC":true,"choices":{"B":"a SharePoint folder","A":"Power BI dataset","D":"an Excel workbook","C":"Power BI dataflows"},"answer":"A"},{"id":"2oLWXsMRY0xIxzMlEc6B","question_images":["https://img.examtopics.com/pl-300/image361.png"],"question_id":24,"answers_community":[],"answer":"","question_text":"HOTSPOT\n-\n\nYou have a folder that contains 50 JSON files.\n\nYou need to use Power BI Desktop to make the metadata of the files available as a single dataset. The solution must NOT store the data of the JSON files.\n\nWhich type of data source should you use, and which transformation should you perform? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","timestamp":"2024-02-29 12:10:00","unix_timestamp":1709205000,"url":"https://www.examtopics.com/discussions/microsoft/view/134892-exam-pl-300-topic-1-question-31-discussion/","isMC":false,"discussion":[{"content":"The answer is correct ! \n- Folder\n- Delete the Content column","poster":"Florinuca","comment_id":"1162469","upvote_count":"37","timestamp":"1709205000.0","comments":[{"upvote_count":"11","timestamp":"1709877720.0","comment_id":"1168582","content":"buddy you will not be able to see the meta data if you don't expand the attribute","comments":[{"upvote_count":"3","content":"Without expanding the attributes column,\nthe table will show the date accessed, date modified, date created of the files\n\nThese also counts as metadata of the files right?\nSo without expanding the attributes column, the first requirement could be fulfilled\n\nBut without deleting the content column, the second requirement could not be fulfilled","comment_id":"1326753","timestamp":"1734251820.0","poster":"YuanQingTan"},{"poster":"Arnav123","comment_id":"1332163","timestamp":"1735262760.0","upvote_count":"1","content":"yes, you would because it states deleting the content column not delete the content. If content is deleted then there is no actual information of the data, but the metadata will still be there; as it is not part of the content column. Attributes: file name, file ext., file paths and so on."},{"upvote_count":"4","content":"I agree with you, but this question is a little hypothetical. Assume that the table has 5000 columns, what would you prefer the first step to be?\nOption 1:\n-Expand attribute column\n- Delete content column\nIn this case, after expanding, you'll have to scroll a lot to the left, little tough, and then delete content column, end result would be storing metadata.\n\nOption 2:\n- Delete content column\n-Expand attribute column\nThis is most preferable, as you'll see content column in the first column position, delete it and then expand attribute column, end result would be storing metadata.\n\nI'd still go with option 2 in terms of ease. My answer would be \"Delete content column\" for 2nd question.","comment_id":"1205910","poster":"Bhanu__prakash","timestamp":"1714701360.0"},{"poster":"Raj1690","timestamp":"1710704700.0","upvote_count":"4","comment_id":"1176044","content":"I think she is right because the solution says you should get the metadata and \"solution must NOT store the data of the JSON files\". You won't satisfy the second part of the question till you delete the content column first."}],"poster":"Aero_1898"}]},{"content":"I saw video and the answer is\n- Folder\n - Combine the files of Content column","upvote_count":"16","poster":"finlarian","comments":[{"poster":"PD_Ve","upvote_count":"3","content":"In the video, the author explains the answer to 2 different questions: the first question requires the steps to store the metada, in which case, the solution is folder/expand the atributes column. The second question requires the steps to store the data, in which case your answer it is the correct one. For the purpose of the question on discussion, the correct answer, according to the video is folder/expand atribute column.","comment_id":"1290443","timestamp":"1727481480.0"},{"poster":"loganzz","comment_id":"1262724","comments":[{"content":"I agree. Since we need to choose only one option from Transformation, it has to be 'Delete the Content column' to comply with the question (Solution must NOT store the data of the JSON files). Expanding the Attribute column provides more metadata (which would be desirable), but selecting this option won't allow us to 'delete the content column' to comply with the question.","timestamp":"1734703440.0","comment_id":"1329491","poster":"7Veritas","upvote_count":"1"}],"timestamp":"1723169580.0","upvote_count":"2","content":"It’s wrong. We do not need content."},{"upvote_count":"2","poster":"Jonathan_2024","comment_id":"1253382","timestamp":"1721704140.0","content":"You're awesome! Many thanks!"},{"timestamp":"1715160240.0","upvote_count":"2","comment_id":"1208290","content":"you saved my time , god bless you dear","poster":"pradeepsb12588"}],"comment_id":"1207904","timestamp":"1715090460.0"},{"content":"EVEN THOUGH YOU SHOULD EXPAND ATTRIBUTES COLUMN FOR THE METADATA, THE MUST NOT REQUIREMENT GETS PRIORITY. HENCE DELETE THE CONTENT COLUMN IS RIGHT.","upvote_count":"1","comment_id":"1422725","timestamp":"1743595380.0","poster":"BhavnishM"},{"upvote_count":"1","timestamp":"1732234860.0","comment_id":"1316072","poster":"FabricioMoreno","content":"Usar la opción Folder permite importar múltiples archivos como una lista con metadatos en Power Query.\nLa transformación Expand the Attribute column asegura que trabajas únicamente con la información de los metadatos sin almacenar los datos completos de los archivos JSON, cumpliendo con el requisito de no almacenar los archivos JSON completos."},{"poster":"jaume","upvote_count":"2","timestamp":"1731687480.0","content":"It's weird.... this is almost exactly the same as question 15 replacing csv files with JSON files.\nNo discussion about first answer being \"Folder\".\nBe aware of both requisites:\n - \".....make the metadata of the files avilable....\" --> this is data in \"Attributes\n - \"...solution must NOT store the data of the JSON files\" ---> second answer should be to \"Delete the content column\"\nI guess we should consider expanding attributes is implicit as a third step","comment_id":"1312707"},{"comment_id":"1311260","timestamp":"1731503160.0","upvote_count":"1","poster":"Raiist","content":"correct"},{"comment_id":"1296410","upvote_count":"1","content":"If we dont also expand the attributes column we wont get all the metadata will we?","timestamp":"1728718920.0","poster":"JPShields"},{"poster":"LuluSkyy","content":"The correct answer is Folder and expand the attribute column because the attribute column stores the metadata.","timestamp":"1727913540.0","upvote_count":"1","comment_id":"1292558"},{"upvote_count":"1","poster":"00c7ee4","timestamp":"1724779680.0","comment_id":"1273614","content":"Folder y Delete Content:\n\nclaramente indica que no debe guardar los datos de JSON, posteriormente que se expanda los atributos o no es secundario"},{"timestamp":"1724744580.0","comment_id":"1273270","poster":"MattieK","upvote_count":"2","content":"Just tested it. Should be Folder and Expand attribute. The content column will not expand or even show up when you don't delete the the content column."},{"timestamp":"1723818420.0","poster":"rcaliandro","upvote_count":"1","comment_id":"1267210","content":"We need first to load from folder in order to get all the metadata files from it (50 JSON) then we need to remove the content column which is binary"},{"content":"The answer is correct !\n- Folder\n- Delete the Content column","timestamp":"1721556120.0","poster":"Kiran37","upvote_count":"1","comment_id":"1252370"},{"timestamp":"1721387700.0","content":"I tested and the correct option is to \"Expand the Attribute column\". The \"Content\" column is automatically removed when we close the PowerQuery. But if we don't click \"Expand the Attribute column\" we loose these information.","comment_id":"1251143","poster":"agelee","upvote_count":"4"},{"comment_id":"1207740","timestamp":"1715060940.0","upvote_count":"2","content":"Tested - it's folder, expand attribute. There are no contents in the file in the data pane, only attributes. This is because the column is 'binary'","poster":"shazzzy"},{"poster":"dmp1990","upvote_count":"2","comment_id":"1205320","timestamp":"1714630140.0","content":"The thing here is that the question is not about the order or de number of actions hat you have to follow in order to achieve the solution. The question is,\"which action you have to perform?\", so independently of the order, you are going to have to delete the content column. So the answer given is correct."},{"comment_id":"1186675","content":"I tested it. The correct answer is \n1) Folder\n2) Expand the Attribute column.\nI tested with Deleting the Content column and without deleting it, in both cases the content is not visible when you load the data in Power BI Desktop. In order to see the full metadata you should expand the Attributes column.","upvote_count":"12","poster":"INDEAVR","timestamp":"1711873980.0"},{"poster":"hakanc123","upvote_count":"1","content":"İmage is not shown?","comment_id":"1174908","timestamp":"1710586260.0"},{"poster":"AZFabio","upvote_count":"1","timestamp":"1710245520.0","content":"I believe the correct transformation steps would be :\n1. Expand attributes\n2. Delete content\n3. Combine files, getting just 1 table with metadata","comment_id":"1171651"},{"timestamp":"1710183600.0","content":"The answer is incorrect !\n- Folder\n- Expand the attribute column\nDone this in Power BI Desktop","upvote_count":"6","poster":"vcite","comment_id":"1171251"},{"timestamp":"1710066180.0","upvote_count":"2","comment_id":"1170240","poster":"benni_ale","content":"To get METADATA (and not JSON data) I would get data from FOLDER , EXPAND the Attibute column and DELETE the Content column"},{"upvote_count":"3","poster":"MANANDAVEY","timestamp":"1710023220.0","comment_id":"1169899","content":"Data source type: Folder\nTransformation: Delete the Content column.\n\nThis approach will allow you to access the metadata for all the JSON files in the folder without importing the actual data from the JSON files into the dataset."}],"topic":"1","answer_ET":"","answer_description":"","answer_images":["https://img.examtopics.com/pl-300/image362.png"],"exam_id":116},{"id":"pTiGyJM0GuaGo0vsjVqK","answer_description":"","answer_images":[],"answers_community":["BDE (100%)"],"answer_ET":"BDE","question_id":25,"url":"https://www.examtopics.com/discussions/microsoft/view/134893-exam-pl-300-topic-1-question-32-discussion/","question_images":[],"answer":"BDE","isMC":true,"topic":"1","discussion":[{"poster":"Florinuca","content":"The answer is correct! \nB, D and E are the correct options!","comment_id":"1162472","timestamp":"1709205240.0","upvote_count":"21"},{"poster":"ee0625a","upvote_count":"1","content":"Selected Answer: BDE\nChoice A does not help update the file path but applies to datasets already published to the Power BI service. Choice C also does not allow you to change the file path of a data source. It only controls how data is loaded (e.g., cache settings).","timestamp":"1737556860.0","comment_id":"1344797"},{"poster":"f133b89","comment_id":"1338923","content":"Selected Answer: BDE\ncorrect","upvote_count":"1","timestamp":"1736534400.0"},{"poster":"DexTorao","timestamp":"1732016100.0","content":"B , D and E","upvote_count":"1","comment_id":"1314607"},{"timestamp":"1727945280.0","poster":"MANANDAVEY","upvote_count":"4","content":"Selected Answer: BDE\nB. From the Data source settings in Power BI Desktop, configure the file path.\nThis option allows you to update the connection information for the Excel data source, including changing the file path to the new location.\n\nD. From Power Query Editor, use the formula bar to configure the file path for the applied step.\nIf the source step in Power Query shows the file path, you can change it directly in the formula bar to reflect the new file location.\n\nE. From Advanced Editor in Power Query Editor, configure the file path in the M code.\nThe Advanced Editor lets you edit the M code directly, which includes updating the file path to the new location of the Excel data source.","comment_id":"1169901"},{"upvote_count":"2","poster":"rcaliandro","timestamp":"1723643400.0","comment_id":"1265804","content":"Selected Answer: BDE\nB. From the Data source settings in Power BI Desktop, configure the file path. \nD. From Power Query Editor, use the formula bar to configure the file path for the applied step.\nE. From Advanced Editor in Power Query Editor, configure the file path in the M code\nGiven answer is correct"},{"timestamp":"1721596080.0","content":"corrrect","comment_id":"1252719","upvote_count":"1","poster":"niceguysfinishlast"},{"poster":"Kiran37","upvote_count":"1","content":"Correct answer","timestamp":"1721556420.0","comment_id":"1252373"},{"poster":"JudT","timestamp":"1711356600.0","comment_id":"1182334","content":"Checked: Correct","upvote_count":"1"},{"content":"Selected Answer: BDE\nCorrect","poster":"AZFabio","upvote_count":"1","timestamp":"1710246060.0","comment_id":"1171662"},{"comment_id":"1170242","comments":[{"comment_id":"1170244","poster":"benni_ale","content":"Actually I did a quick research and apparently YOU CAN EDIT THE CREDENTIALS FROM SERVICE but YOU CANNOT EDIT THE INPUT PATH FROM SERVICE... Meaning you can only do it from Desktop. So BDE are correct.","upvote_count":"7","timestamp":"1710066840.0"}],"timestamp":"1710066360.0","poster":"benni_ale","content":"Selected Answer: BDE\nNot sure about A though","upvote_count":"1"},{"content":"Correct anwser BDE","timestamp":"1709820720.0","comment_id":"1168070","poster":"LOCOBI","upvote_count":"1"},{"poster":"Manoj1152","timestamp":"1709440440.0","upvote_count":"2","content":"B,C,E IS CORRECT","comments":[{"timestamp":"1712833920.0","upvote_count":"2","poster":"FinelogBiseum","comment_id":"1193717","content":"C is INCORRECT!"}],"comment_id":"1164497"},{"comments":[{"comment_id":"1184132","content":"options C is not about changing it through 'transform data' and then 'data source settings'. (where the path can be changed indeed). In the answer is mentioned the 'data load' which is under 'current file' when you go to 'option and settings' from file menu. And there you don't have the possibility to change the path","timestamp":"1711546080.0","poster":"anett19","upvote_count":"1"}],"comment_id":"1163682","upvote_count":"1","content":"c is correct as well IMO. Data Source settings has the \"change source option\".","poster":"JustdoBI","timestamp":"1709319540.0"}],"timestamp":"2024-02-29 12:14:00","exam_id":116,"question_text":"You have a PBIX file that imports data from a Microsoft Excel data source stored in a file share on a local network.\n\nYou are notified that the Excel data source was moved to a new location.\n\nYou need to update the PBIX file to use the new location.\n\nWhat are three ways to achieve the goal? Each correct answer presents a complete solution.\n\nNOTE: Each correct selection is worth one point.","choices":{"E":"From Advanced Editor in Power Query Editor, configure the file path in the M code.","A":"From the Datasets settings of the Power BI service, configure the data source credentials.","D":"From Power Query Editor, use the formula bar to configure the file path for the applied step.","B":"From the Data source settings in Power BI Desktop, configure the file path.","C":"From Current File in Power BI Desktop, configure the Data Load settings."},"unix_timestamp":1709205240}],"exam":{"numberOfQuestions":334,"lastUpdated":"12 Apr 2025","name":"PL-300","isImplemented":true,"provider":"Microsoft","isBeta":false,"id":116,"isMCOnly":false},"currentPage":5},"__N_SSP":true}