{"pageProps":{"questions":[{"id":"QvOHj9JXTlyf2mwOczkP","unix_timestamp":1662526860,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011100002.jpg"],"discussion":[{"content":"If it's the only field in a table only unique values will be shown.","comment_id":"662018","timestamp":"1662526860.0","comments":[{"upvote_count":"112","comments":[{"timestamp":"1664274240.0","upvote_count":"22","content":"Exactly, only distinct values but the question says \"UnitsInStock has 75 non-null values, of which 51 are unique\", so it does not say 75 distinct values, it says 75 with non-null values, so we can have repeated values. Therefore, I would say 51 / decrease","comment_id":"680627","poster":"Fer079","comments":[{"upvote_count":"3","poster":"i.eniolaabolade","timestamp":"1732972320.0","content":"The 'non-null' means distinct, dont let them confuse you. 75 and Reduce is the answer","comment_id":"1320208"},{"comment_id":"853091","upvote_count":"4","poster":"Shalaleh","timestamp":"1679998560.0","content":"Consider that, this column is in Product dimension table, so all rows are different.","comments":[{"poster":"Shalaleh","content":"and also should consider the distribution of values in the column is not important, just the number of rows are important, since we have 75 non-null values, then we will have 75 rows.","upvote_count":"2","comment_id":"853094","timestamp":"1679998680.0"}]},{"upvote_count":"11","poster":"iccent2","comment_id":"750192","comments":[{"comment_id":"759619","upvote_count":"5","comments":[{"comment_id":"760325","content":"Example: 1,2,3,4,4 contains 5 non-nullable, 4 distinct, 3 unique values. When not summarized and placed in a table, there are 4 rows. The answer to this question should be between 51-75, not one or the other.","upvote_count":"18","poster":"cglax","timestamp":"1672260660.0"},{"timestamp":"1672350900.0","comment_id":"761517","poster":"iccent2","upvote_count":"2","content":"yeah, i think this is the case meaning its 51 rows"}],"timestamp":"1672219080.0","poster":"margarita98","content":"In that case, if you have 5,5,5, the five will only show once, meaning it will show 51 rows, not 75"},{"comment_id":"761527","poster":"iccent2","content":"Tested and 51 is the answer not 75","upvote_count":"5","timestamp":"1672351620.0"}],"content":"No, it cannot display only the unique. You know what that means? It means if you have a number that is distinct but not unique for example, 5,5,5, then it will not capture it because it is not unique. The answer is 75. \n\nUnique means it occurs only once in the column which cannot make up the table rows only. I have actually tried this on PBI with some datatset to confirm.\n\nFor the second question, when you summarise, it will reduce the table.\nfor example, all products with the same productname will return one row if you drag the productname and unitInstock to the table visual.","timestamp":"1671478260.0"}]}],"comment_id":"674282","timestamp":"1663685400.0","poster":"nbn97","content":"only distinct values not unique values\nso the answer is: 75 rows / reduce"},{"timestamp":"1679998800.0","content":"Name of products should be unique. but number of Unitsinstock column does not need to be unique. And since this column is in the Product dimension table, the product names are unique and there are 75 product.","poster":"Shalaleh","upvote_count":"6","comments":[{"upvote_count":"8","comments":[{"timestamp":"1721117880.0","upvote_count":"2","content":"If you have tried in PBI, only put that Unitsinstock column in the table, you will know it should be 51.","poster":"Sophieeeeee","comment_id":"1248761"}],"comment_id":"941327","content":"Correct Answer - Don't Summarize = 75 and After Summarize = 1","poster":"gaikwpa","timestamp":"1688343780.0"}],"comment_id":"853096"},{"poster":"lmrod","comment_id":"972029","timestamp":"1691146500.0","upvote_count":"20","content":"Only distinct values will be shown. Unique isnt't the same that distinct"},{"comments":[{"comments":[{"poster":"Maniula","timestamp":"1690143000.0","upvote_count":"2","content":"Nvm, I forgot that unique in Power BI removes the value from Unique count if the value repeats itself","comment_id":"960800"}],"content":"It's 51. Table doesn't show duplicated values when there's only one field added.\nIt will show 75 if you set \"Summerize by: Count\" but Summerize is set to None in the screenshot.","timestamp":"1690142460.0","upvote_count":"7","poster":"Maniula","comment_id":"960793"}],"content":"The answer is correct. 75 rows / reduce. Tested and agreed.","poster":"Time2excel","timestamp":"1689138660.0","upvote_count":"20","comment_id":"949489"},{"comment_id":"1125585","timestamp":"1705561560.0","content":"Unique just means the value only appears once in the dataset. Distinct shows how many different values there are in the dataset. The table won't exclude a value just because it appears more than once in the dataset. It will represent it in a single row (given the summarization settings). So there for the number of rows will match the number of distinct records.","upvote_count":"6","poster":"edbf978"}],"upvote_count":"59","poster":"Guru1337"},{"comment_id":"666099","upvote_count":"29","content":"1 - 1 ROW\n2 - increase","poster":"OGESSIUSER","timestamp":"1662897900.0","comments":[{"poster":"ThariCD","comment_id":"668697","content":"The summarization is set to 'Don't summarize' so you will have 1 row per value, not 1 row total. If you add a summarization it will decrease the number of rows.","comments":[{"content":"I agree","timestamp":"1663167180.0","upvote_count":"4","comment_id":"669122","poster":"hmax56"},{"content":"SO the Answer is- 1. 75Rows, 2. Reduce, right?","comment_id":"672893","timestamp":"1663559520.0","upvote_count":"10","poster":"Namrata_12"},{"poster":"Jahanif","content":"Nice explanation, ThariCD","comment_id":"1112916","upvote_count":"2","timestamp":"1704298080.0"}],"timestamp":"1663139460.0","upvote_count":"27"},{"content":"Yes, I created a toy excel sheet and tested it. You are correct! The first time we created a table visual, there is only 1 row in the visual and the summarization is set to \"SUM\". After we changed the summarization to \"Dont summarize\", the row increased from 1 row to 51 rows.","upvote_count":"2","comment_id":"949167","comments":[{"timestamp":"1689095100.0","comments":[{"comment_id":"1171675","content":"This is correct. I tried and tested.","timestamp":"1710246780.0","poster":"ReportingPro","upvote_count":"2"}],"poster":"VGG2001","upvote_count":"9","comment_id":"949171","content":"Sorry for the confusion, I think my answer was wrong. I noticed in the question image the summarization is set to \"None\", so when you first create the visual, there should be 51 rows. Later change the summarization will change 51 rows to 1 row, so \"Reduce\""}],"poster":"VGG2001","timestamp":"1689094800.0"},{"comments":[{"comments":[{"comments":[{"timestamp":"1681227180.0","poster":"BiLearn","comments":[{"content":"Test. It should be 51.\nAnd please note that the Unitsinstock column here is not a number, it is text. There is no Sigma sign in front. So there is no SUM summary.","comment_id":"1248762","upvote_count":"1","poster":"Sophieeeeee","timestamp":"1721118060.0"}],"comment_id":"867453","content":"It will be \n1- 75 Rows \n2. Reduce (Summarize By - Sum; it will return only 1 row in table visual)\nI have tested..","upvote_count":"7"}],"content":"You did not test. If there are more non-nullable than unique, there will always be more rows than unique. Example: 1,2,3,4,4 has 3 unique, 5 non-nullable, 4 distinct. Placed in a table shows the rows: 1,2,3,4","poster":"cglax","timestamp":"1672261020.0","comment_id":"760330","upvote_count":"15"}],"timestamp":"1663584720.0","content":"Answer is correct (51 and Reduce). tested","upvote_count":"21","poster":"VeroF","comment_id":"673194"}],"comment_id":"672173","upvote_count":"36","content":"SO it's\n51 \nReduce","poster":"OGESSIUSER","timestamp":"1663493640.0"}]},{"upvote_count":"1","timestamp":"1741596600.0","content":"Tested in PBI with two simple columns\nproduct | unit\nA | 8\nB | 8\nC | 4\nD | 1\n\nWithout summary - it shows 1,4,8 (3 records only)\nWith summary - it shows 21 (1 record only)\n\nSo without summary, it shows only distinct values; while summary shows aggregated (lesser records)","poster":"binny89","comment_id":"1379917"},{"timestamp":"1740973500.0","upvote_count":"1","poster":"sluo","content":"tested in power bi with a 2 column table with repeated values and blanks, it showed 1 row for each distinct value (not non null values), hence it is 51 + reduce","comment_id":"1364220"},{"upvote_count":"2","timestamp":"1731946980.0","poster":"jaume","content":"Tested in my own PBI report, table is returning ALL values in the column (75 non-null values will be listed there, any duplicated value would be listed also duplicated there). We should assume there are no null values in the column, as the table would ALSO REPORT that nulls (so answer, then, should be 75 rows + any additional null row). Is not clear \"is nullable\" is enabled (\"yes\") or disabled (\"no\") as it's like on the right side means it's disabled (in Version: 2.138.782.0 PBI desktop, this option is showing \"Yes\"/\"No\" for the selected value).\nLet's assume this screenshot stands for \"Is nullable\" being disabled, then all 75 non-null values are listed in the visual (if nullable values are not allowed, why to mention there are 75 non-nullable values, this is not testing knowledge but trying once and again to mislead you)","comment_id":"1314068"},{"timestamp":"1727318220.0","upvote_count":"3","poster":"539d541","content":"The data type is whole number therefore when you add only that field to the table, default summarization will occur - hence only 1 row showing total of all those UnitsInStock\n\nChanging the summarization setting is ambiguous since it can be changed to Average, Min, Max etc. I would guess you should say increase though","comment_id":"1289260"},{"content":"Correct","poster":"Monsta","timestamp":"1725371580.0","upvote_count":"1","comment_id":"1277630"},{"content":"So, by default the table contains all the values for a specific field (75 in this case) when we select to don't summarize, then it will be reduced to the number of distinct values (51 in the example). So the given answer is correct","poster":"rcaliandro","timestamp":"1723883760.0","upvote_count":"1","comment_id":"1267562"},{"poster":"Rayen_BF","timestamp":"1723753860.0","upvote_count":"2","comment_id":"1266676","content":"We assume that our column contains 75 non-null values of which 51 are unique, so we have 63 distinct values that will be visualized in the table, so I don't understand why your answers are 75 rows while in powerbi we don't see repeated values in a table."},{"content":"correct answer","comment_id":"1253501","upvote_count":"1","poster":"Kiran37","timestamp":"1721721960.0"},{"upvote_count":"1","content":"The answer is correct. 75 rows / reduce. When added to a table it will show all the non-null values (75). When summarizing by each of those values, then it will only show each discrete value 1 time to show it's frequency of appearance (51 unique characters). 51 < 75 = reduce. Tested and agreed.","timestamp":"1721348400.0","comment_id":"1250746","poster":"[Removed]"},{"upvote_count":"1","comment_id":"1249113","content":"Summarize is set to: None, therefore all values will be shown.","timestamp":"1721149680.0","poster":"Flix"},{"poster":"Tinashe16","timestamp":"1716871680.0","comment_id":"1219990","content":"The question was not well structured, obviously distinct values will be more than 51 (the unique values) since we have 75 non-null values. I happen when you try to theorize practical things.","upvote_count":"1"},{"timestamp":"1716257280.0","comment_id":"1214655","poster":"CookieMingkee","upvote_count":"1","content":"The first question is very tricky.\n\nAssuming that the field accept null values and the question says \"UnitsInStock has 75 non-null values, of which 51 are unique\" should we assume that there is no null value therefor the answer is 75? But what if there is a null value then the answer is 76 that is one (1) null value plus seventy-five (75) non-null values.\n\nI tested this with a smaller set of data 14 Distinct (including 1 null value) and 10 unique. With no summarization, my table visual returned 14 rows (representing the distinct value that includes the null value).\nWith summarization, my table visual returned 1 row.\n\nBecause of that, I will just assume that there are no null values and select 75 for the first question and Decrease to the second question."},{"poster":"MoneyStacking","timestamp":"1714660800.0","comment_id":"1205666","content":"For the Guys and Girls,\n\nAt this page, you will no longer find any free questions from Examtopics. However, if you're hesitant about purchasing Contributor Access, don't hesitate any longer; buy it. It costs only $50 and provides a significant boost to your CV and career. I recently passed with a score of 917 out of 1000. Save yourself time by learning and memorizing all these questions, as 85% of the 50 exam questions were identical to those provided here.\n\nCheers and good luck!","upvote_count":"2"},{"upvote_count":"1","content":"The fact that the values are unique or not is not necessary here. If you are visualising the data for a month and plotting a table with unitstocks for each day, thinking that a record or a row will be removed just because two days in a month had same unitstocks is incorrect. Unless you are summarising(aggregating) records will not be removed on grounds that they do not have a unique value.\nanswer would be 75, reduced.","poster":"Vidushi101","timestamp":"1712724120.0","comment_id":"1192702"},{"comment_id":"1189501","poster":"ElieG","timestamp":"1712256720.0","upvote_count":"2","content":"So how should we answer in the exam if we face like this question where no answer is correct."},{"upvote_count":"1","content":"This question makes no sense:\nit will be 51 values appearing in the visual table for the unique values PLUS the number of distinct values (it could be 1 value or more... so at least we will get 52 values)\nWe have non-null values but if we have null values they will be added also because we are using YES for \"is-nullable\", \nso i think the question is not well formed.\n(try a column from 1 to 51(distinct values) and continue till 75 as u wish and then create a visualization table) and obviously when summarized the rows will be reduced to one.","comment_id":"1189489","poster":"ElieG","timestamp":"1712255640.0"},{"upvote_count":"2","content":"Tried in power bi. when created a table visual with UnitsInStock column(only this column, without ProductID column etc / also without summarization)\nThe number of rows equal the number of distinct values.\nSince we don't have distinct value here, the answer of first box really depends on how we define [unique]....if unique here = distinct, then 51. if there is ProductID in the table visual then 75.","comment_id":"1176362","poster":"kay1101","timestamp":"1710753720.0"},{"content":"Domanda nell'esame di oggi","timestamp":"1709589780.0","poster":"Fra04","comment_id":"1166042","upvote_count":"1"},{"timestamp":"1709563200.0","upvote_count":"1","content":"The UnitsInStock column in PowerBI contains 75 non-null values, out of which 51 are unique1. Therefore, the number of rows in the UnitsInStock column is 75.\n\nAnd, when summarizations are applied the number of rows can only be reduced, since the aggregation process combines multiple rows into a smaller set of summarized values.","comment_id":"1165710","poster":"arrow040"},{"content":"1 Row\n Increase?!\nwhen the datatype is Number, by default the summarization is Sum which means 1 row. \nthe second part is tricky, if changing the summarization means removing it, the number increases, if it means changing to count, max, .. the number of rows stay the same means 1 row.","comment_id":"1162027","poster":"iamSophie","upvote_count":"1","timestamp":"1709158620.0"},{"content":"for instance , if we have column : 1,1,2,2,3 \nso for this, total non null values = 5 , distinct values =3 and unique values = 1\nand based on this we do not have any option..\nupvote if you agree...","poster":"Parth_Mehta","comment_id":"1154795","timestamp":"1708441320.0","upvote_count":"2"},{"comment_id":"1146293","timestamp":"1707565260.0","upvote_count":"3","poster":"INDEAVR","content":"The question makes no sense.\n1. There is no “value” section of the table visual. There is only “columns” section. Even if we assume that the author of the question doesn’t know the difference between a matrix visual and a table visual, and he meant that the visual is a matrix, the question still make no sense because you cannot add a column to the “values” section, you can only add a measure.\n2. There isn’t enough information to answer the question. The number of rows will depend on the other columns of the table visual. For example, if UnitsInStock is the only column in the visual, then there will be only 51 rows. If all Products’ columns are added to the visual there will be 75 rows."},{"comment_id":"1144595","content":"This question makes no sense. Assuming the column is the only value in the table, the displayed values will be the distinct values (not unique).\n\nThis means the 51 unique ones will be there, and the remaining can be between 1-12 potential distinct values (as each has to have at least 2 instances). \n\nIncluding the potential of a null value, the answer is therefore 53-64 values. The only assumption I can make is that the person who wrote the question on ExamTopics messed up by accident and meant to write 'Distinct'.","upvote_count":"2","timestamp":"1707404460.0","poster":"Moppu"},{"timestamp":"1707403560.0","upvote_count":"3","content":"This question is ridiculous. Assuming there are no other columns in the table, the value in the table will be the number of distinct values in the column (not unique).\n\nIf there are 51 unique values, the remaining 24 could be anywhere between 12 and 1 distinct values. This means there will be between 52-63 rows. None of these are answers.","comment_id":"1144565","comments":[{"poster":"ElieG","timestamp":"1712256300.0","upvote_count":"1","comment_id":"1189492","content":"you are absolutely right, that's what I am saying in my comment as well."}],"poster":"Moppu"},{"upvote_count":"1","comment_id":"1136267","poster":"CookieMingkee","timestamp":"1706659680.0","content":"Try stepping through the question.\n\nIf not summarized and placed in the values field, the answer is 51 rows (returning only the unique values in a row).\n\nIf summarized is the number of row returned is a single row that summarizes the value of the column, so the answer here is reduce."},{"content":"75 - Reduce","upvote_count":"1","poster":"SHENOOOO","comment_id":"1132641","timestamp":"1706285280.0"},{"content":"75 values are there. out of that 51 are unique. meaning 51 values appear only once. 75-51= 24 In these 24 , values occur multiple times. As per the actual tryout, we see DISTINCT values in the table. they have said 51 UNIQUE. 75 total values.. but they have not said anything about DISTINCT values. Actually question doesnt give enough info to be able to answer the question. distinct values will lie somewhere between 51 and 75. ( 51 unique values+ some values which have multiple occurrences.... totaling to =75 values. hence as per my opinion, question doesn't give all info to be able to answer.","timestamp":"1704535140.0","poster":"abhijeetbgmcanada","upvote_count":"7","comments":[{"content":"well explaination abhijeet, many of the pl 300 questions have full suspense, they are confusing us.","timestamp":"1706926080.0","poster":"mustafadev","upvote_count":"1","comment_id":"1138955"},{"comments":[{"timestamp":"1706340360.0","upvote_count":"1","content":"52 ~ 63 (+1) if there's null. The question wasn't clear on if there's null. The \"has 75 non-null\" can mean \"has 75 values and they are all non-null\" or \"has 75 non-null + any number of null\"","poster":"Chellz","comment_id":"1133130"}],"timestamp":"1706339880.0","poster":"Chellz","content":"Agree. The DISTINCT count would be 52 ~ 63, which should be the row count when not summarizing. The question doesn't provide a correct answer.","upvote_count":"1","comment_id":"1133121"}],"comment_id":"1115103"},{"poster":"momo1165","comment_id":"1113047","content":"75-Reduce","timestamp":"1704308280.0","upvote_count":"2"},{"content":"In the screenshot: \"Is nullable\" -> Yes, which means all 75 rows (including nulls) will be added. \n\nSo the answer is: 75 rows/ reduce.","timestamp":"1703043840.0","upvote_count":"1","comment_id":"1101180","poster":"Dsbuff"},{"poster":"Mandar77","comment_id":"1055135","content":"I tried creating same scenario in power bi report. The table shoes unique values and when you change property to summarized as SUM then it maintain the table rows.","upvote_count":"3","timestamp":"1698385440.0"},{"upvote_count":"1","timestamp":"1697129040.0","comment_id":"1041928","content":"sorry for confusion, I think they are asking based on table visual: how many rows we can see when we put the field (after giving proper summarize by).\nSummarize by means only 1 result that is one row, so it will reduce from 75 .\ncorrect answer is 75 and reduce.","poster":"RMUK"},{"upvote_count":"1","timestamp":"1697128680.0","content":"75 is correct, but how come it reduce number once you select anything from summarize by ? If I select Count, I get 75 and if select distinct count will get 51. It depends on what you select after you providing summarize by. How come it is Reduce, can anyone explain pls","poster":"RMUK","comment_id":"1041918"},{"content":"Table shows distinct values firstly and then sums up for second step. \nFor Ex. I have 15 rows in table, \n1\n2\n3\n4\n5\n6\n5\n5\n6\n7\n8\n9\n10\n11\n11\nThen 11 Are distinct values and 8 are unique\nWhen I pull it to table 11 are shown \nand then its sum is shown for second step","poster":"sankeytm","comment_id":"1027250","upvote_count":"3","timestamp":"1696674300.0"},{"comment_id":"1027243","upvote_count":"2","timestamp":"1696673700.0","content":"What is final and correct answer to this question? \n75 reduce?\n51 reduce?","poster":"sankeytm"},{"upvote_count":"5","timestamp":"1694724660.0","poster":"sunkkki","content":"I think when they say 75 non-null values, it means 75 \"distinct\" values, not the total number of rows that have non-null values. Distinct and unique are different. If the dataset is like {A, A, B, B, C, D, E, F}, number of distinct values = 6, number of unique values = 4. Power BI will show {A, B, C, D, E, F}, the distinct values, not {C, D, E, F}, the unique values.","comment_id":"1007924"},{"comment_id":"1005809","comments":[{"upvote_count":"1","timestamp":"1694694780.0","content":"no it will be 75 rows. as per the information there are 51 unique values which means there there could be more values that may appear twice. table will display all the values and will display the values that appears twice, only once.","poster":"SamiaAwais","comment_id":"1007615"}],"poster":"lcss27","timestamp":"1694526540.0","upvote_count":"3","content":"Correct Answers: \n1. 51 rows: just did the exercice in PBI, when a numeric column is \"Summarize by None\" and it is the only field in a Table visual only distinct values are displayed.\n2. Reduce: when you change de summarize by setting the number of rows is reduced, e.g. if you change it to \"Summarize by Sum\" and UnitsInStock is the only field in the Table visual only 1 row is displayed"},{"timestamp":"1693924860.0","poster":"Igetmyrole","comment_id":"999611","content":"Rows and Maintain are the correct answers.\nRows: since there are 75 non-null values in the UnitslnStock column, adding it to the Values field well in a table visual will create one row for each of those 75 values.\nMaintain: The UnitlnStock column is currently set to summarize by \"none\" , which means each value is treated as a separate row in the table visual. Changing the summarize by setting to something else (e.g., sum, average, etc.) would affect the values are aggregated but would not change the number of rows in the table visual. Therefore, the number of rows will be maintained.","upvote_count":"1"},{"upvote_count":"1","comment_id":"989722","content":"Testing it in power Bi:\n-The single column contains the sum of the values, so it will spit out a single row\n-Modifying the aggregation (always with only that column in the table) it will retrieve the same results, until you remove and re-add the column to the visual.\n\nAm i wrong?","poster":"RicoPallazzo7","timestamp":"1692945060.0"},{"poster":"aukaab","content":"Once plotted the viz will show all the distinct Values - Now the Unique. Count of Unique does not include the value if its been repeated. \nif - {A, A, B, C, C, D, E, F, F} once plotted all the distinct values in this case {A, B, C, D, E, F} will be plotted not only {B, D, E } which appear only once.","timestamp":"1692301800.0","upvote_count":"2","comment_id":"983960"},{"content":"Answer is correct, I also have test it. \n1. 75 - all non-null value will display\n2. reduce - while change summarize by field, new counts depend on the type of summarize by you select, i.e., Max, Average, Distinct Count, Sum, Min, Count, which should reduce the row counts when there is duplicate value in the rows.","timestamp":"1692242220.0","upvote_count":"4","comment_id":"983202","poster":"kaixin"},{"poster":"kelvin3105","content":"51, reduce","comment_id":"977780","timestamp":"1691678880.0","upvote_count":"2"},{"comment_id":"971911","timestamp":"1691142600.0","poster":"lmrod","upvote_count":"2","content":"I tried to test it, but I didn't get a \"logical\" answer. I created a table with only a column that contains 51 unique non null values (numbers from 1 to 51) an then 24 repeated values (number 52). So I have 75 no-null values and 51 unique values. Then I configured the column like the exhibit (Don't Summarize) and when I create the table, it firstly shows 52 rows (number of distinct values)"},{"comment_id":"958021","content":"I hope I can be the one to close this. When you go to model view. Under properties and then proceed to advanced and select summarize by none. Even the Sum symbol in the field is removed upon selecting summarized by none. \n\nWhen you go back to report view and use those values, all the rows are returned. Thus 75 rows\n\nWhen you changed the sumamrization, it will reduce","upvote_count":"4","poster":"Bnxyl","timestamp":"1689910020.0"},{"upvote_count":"2","poster":"prikha16","timestamp":"1688119860.0","content":"Guys, this is a very easy question, the Answer is \"One\" and \"maintain\". I tested it/\nWhenever we drag any field to \"Values\" in a Matrix (not exactly table visual, table does not have Values well), it by default gets summarized even if default summarization is None. So the field will show \"Count\" , so answer is One row, and when we change the Summarization let's say to \"Sum\", it will still be one row, so -\"maintain\"","comment_id":"938992"},{"upvote_count":"1","content":"I've tested this in Powe Bi Desktop.\n\n1. I only put the UnitsinStock and at first 75 rows appear (with the repeated values). BUT if you click on the Units in stock you will see that you can check the \"Don't Summarize\" option which is also checked in the image of this question. When I check don't summarize, it only shows 51 rows. (Also, it doesn't show rows for null values).","timestamp":"1687442760.0","poster":"elesglar","comment_id":"930643"},{"timestamp":"1687359660.0","comment_id":"929655","poster":"kelvin3105","upvote_count":"1","content":"I tested here and put summarized by none as the definition of the column\nI put the values in matrix and in table and the result of both is 51 rows \n(Sorry if I wrote wrong, I am brazilian)"},{"poster":"prikha16","content":"I am trying to drag such a column in Values in matrix visual and it doesnt work, not possible to drag values. Dont know what is wrong, it only gets dragged to columns","timestamp":"1686980880.0","comment_id":"925784","upvote_count":"1"},{"upvote_count":"2","poster":"rmeng","comment_id":"902422","content":"Aswer is right","timestamp":"1684569420.0"},{"poster":"Nishanth_Varma","upvote_count":"1","content":"Ans is 75 and reduce, because in question it is mention 'added to values', which is a matrix. Values will show the count of all the rows","timestamp":"1683559440.0","comment_id":"892293"},{"poster":"BillyBobby","timestamp":"1682910120.0","comment_id":"885809","content":"51 and reduce. Even though the summarisation is set to 'none' when you add the column to a table visual on it's own, the visualisation will by default give a distinct list of the values. To show all the values in the table visual you have to disable the summarisation setting for that specific visual. For the second part of the question, if you then go and add a default summarisation to the column, then the table visualisation will use that default summarisation and it can only reduce the rows shown to one.","upvote_count":"2"},{"timestamp":"1682635380.0","content":"It is going to display the DISTINCT values (not only unique ones), and I think we do not know how many distinct values might be.","comment_id":"883087","upvote_count":"2","poster":"CristianGP"},{"timestamp":"1682279520.0","content":"This question has no correct answer.\n- Because the table will show the number of distinct values, and this information is not presented in the statement.\n- Second because, if you not delete the visual and create a new, the visual not change if you just change the summarize value. \nSo it is not very clear for me.","upvote_count":"9","comments":[{"comment_id":"1189494","poster":"ElieG","content":"yes there will be at least 52 values shown.","timestamp":"1712256480.0","upvote_count":"1"},{"content":"I agree, distinct is not the same as unique. But not all 75 non-null rows are unique, hence you know there are no duplicates, and it must be 51.","upvote_count":"2","comment_id":"880279","timestamp":"1682421540.0","poster":"semauni","comments":[{"content":"there are duplicates*","poster":"semauni","upvote_count":"2","comment_id":"880280","timestamp":"1682421540.0"}]}],"poster":"wellingtonluis","comment_id":"878765"},{"poster":"AreAre","comment_id":"870033","content":"I tested this one and result is:\n1- 1Row\n2- Increase\nreasons:\nby default when you add the data into the table it will give you the sum of the values in the column so you see only one value = 1 row unless you change the summarized to none then you will see all the distinct values not unique values in the column (answer 2 = Increase) which will be more than 51 in this example. \nso 0 can't be true as well as 75 as well as 51.","timestamp":"1681456140.0","upvote_count":"1","comments":[]},{"comment_id":"868093","poster":"RazaTheLegend","upvote_count":"10","timestamp":"1681291080.0","content":"Well guys this question doesn't really make sense, I tested this, made 75 none-null values and 51 unique (first 51 unique values are just 1-51 and the last 24 values where just 52). Also with all the same settings for the field value, I get 52 rows, you get one row per distinct value therefore, the number is unique values (51)<=distinct values (x)<=total number of None null values (75). Meaning the answer should be somewhere between 52 and 75, but since we have no information about the numbers beside the total and unique we cant really know what is correct as the answer in this case is at least 52 and max 74 (Think about why this is true, make an easy example for youself if needed.) But no matter what no answers here are correct (at least for the this version of Power BI). Then when add summarize it reduces it.","comments":[{"content":"you are absolutely right","comment_id":"1189495","timestamp":"1712256540.0","upvote_count":"1","poster":"ElieG"},{"content":"I completely agree with you. I think that the key is that when they talk about unique values really wanted to say distinct values. In that case rhe answer should be 51","poster":"lmrod","comment_id":"972006","timestamp":"1691144820.0","upvote_count":"2"},{"timestamp":"1698958440.0","content":"I also agree with you. But now the question is... how to answer in the examen:)","upvote_count":"2","poster":"oreshetnik","comment_id":"1060895"}]},{"timestamp":"1679480340.0","comment_id":"846923","upvote_count":"7","content":"CORRECT ANSWER - 75/ REDUCE","poster":"Ayush_Tiwari"},{"comments":[{"timestamp":"1682168400.0","comment_id":"877278","content":"Please stop asking ChatGPT, it is still a kid","poster":"Burabari","upvote_count":"9"},{"poster":"Shalaleh","timestamp":"1679998860.0","upvote_count":"4","content":"when you are asking ChatGPT, ask him several times, it will change his answer :D","comments":[{"timestamp":"1680524100.0","upvote_count":"1","content":"yes, I have tried after the comment...","poster":"pepix74","comment_id":"859883"}],"comment_id":"853097"}],"content":"ChatGPT:\n1)\nWhen a table visual is created in Power BI, and the UnitsInStock column is added to the Values field, there will be 51 rows in the table.\n\nSince there are 51 unique values in the UnitsInStock column, each unique value will appear as a separate row in the table.\n2)\nChanging the \"Summarize by\" settings of the UnitsInStock column and adding the column to a table visual will reduce the number of rows in the table visual.\n\nWhen the \"Summarize by\" setting is set to a summary function such as Sum, Count, Average, Min, or Max, Power BI groups the values of the UnitsInStock column and aggregates the data. The resulting table will have fewer rows than the original table since multiple rows will be combined into a single row based on the summarization function used.","timestamp":"1679393700.0","poster":"pepix74","comment_id":"845776","upvote_count":"2"},{"content":"use 1 to 25, 50 to 75 and fill 26 in all other rows- you will get 51 unique 52 distinct, when you use single column in table visual, you can observe 51 rows and after summarizing it single row will appear","upvote_count":"1","timestamp":"1678679100.0","poster":"dkbsdkbs","comment_id":"837604"},{"upvote_count":"3","comment_id":"828531","poster":"srikanth923","content":"answer: \n- 75 rows (note that the 51 unique values are already included in these 75 values)\n- the number of rows will reduce when aggregation is applied.","timestamp":"1677897900.0"},{"timestamp":"1677830400.0","poster":"TTMS","comment_id":"827750","content":"Tested:\n1. 51\n2. Reduce","upvote_count":"2","comments":[{"upvote_count":"1","poster":"Elektrolite","content":"You didn't test this well enough. You probably didn't include some duplicates with 51 values that appear only once","comment_id":"1171032","timestamp":"1710162840.0"}]},{"poster":"KarthikKumarK","timestamp":"1677219060.0","content":"Answer is correct.\n1. 75 Rows | Because, the property of summarize is NONE.\n2. Reduce | If you enable / select NONE to Summarize, The value will be in 1 row. So, It will REDUCE.","comment_id":"820158","upvote_count":"5"},{"content":"If a table has only one field only distinct values will be shown. \"UnitsInStock has 75 non-null values, of which 51 are unique\". We don't know the number of distinct values. The answer should be between 51 and 75.","upvote_count":"6","poster":"ashflahfhajhd","timestamp":"1676147820.0","comment_id":"805660"},{"timestamp":"1672973160.0","poster":"svg10gh","upvote_count":"6","comment_id":"767217","content":"The right answer is : 75 rows , reduce"},{"poster":"kiwi69","upvote_count":"2","comment_id":"766160","content":"The only answer can be 75 as explained by not2smart but the question is clearly wrong. The statement \"UnitsInStock has 75 non-null values, of which 51 are unique\" would have, as a consequence, a number of distinct values greater than 51 but smaller than 75.","timestamp":"1672878300.0"},{"upvote_count":"3","comment_id":"761053","content":"The right answer is : 75 rows / reduce\n51 unique values doesn't mean that we have 51 distinct, it's different.","poster":"MBA_1990","timestamp":"1672320240.0"},{"timestamp":"1672246380.0","comment_id":"760115","poster":"RichXP","content":"create a excel file with a column with value 1,2..75, then append with value 52,53..75, so you have distinct 75 rows and unique 51 rows. create a table visualization, you will see 75 rows. if you add sum, you see only one row with value of 4374. So the answer is 75 rows / reduce (one row)","upvote_count":"2"},{"comment_id":"760085","upvote_count":"1","poster":"abraao_maia","timestamp":"1672245060.0","content":"The correct answer is 51/reduce"},{"content":"The answer is 75 and reduce.\n- Create a table with a column with 75 non-null values of which 51 are unique and Summarize set to Don' Summarize (None).\n- Create a Table visual with this column selected and you will see only the distinct values, which might be lower than 75, but must be higher than 51 unique values. The only choice is 75 values itself. The key interpretation is: \"of which\" in \"UnitsInStock has 75 non-null values, of which 51 are unique\". There must be other non-unique values than the 51 in there to get to 75, otherwise the 51 values would not be unique.\nChanging Summarize to something other than None, before creating the Table Visual will reduce the rows to 1 in the source table, so reduce is the 2nd answer.","poster":"not2smart","upvote_count":"5","timestamp":"1672159200.0","comment_id":"758792"},{"timestamp":"1671225840.0","comment_id":"747595","poster":"AlexYang_","content":"75;\nreduce","upvote_count":"2"},{"timestamp":"1671002100.0","poster":"Samavia","content":"1. 51 \n2. maintain \ntested","comment_id":"744821","upvote_count":"3"},{"upvote_count":"8","comment_id":"743959","timestamp":"1670932800.0","content":"I think that the text of the question is wrong:\n- if there are 51 unique values, they appear just once, so the rest of the 75 non-null values must be different, so the table should display more than 51 rows.\n- if the table should display 75 rows, that would mean that all the existing 75 non-null values are distinct, when all values are distinct than they all appear just once and are unique.\nThe question and the options don't sum up.","poster":"Hoeishetmogelijk","comments":[{"upvote_count":"2","content":"Yes, exactly! To make matters worse, there is no Values well in the current Table visual, so text is incorrect in referencing that. If I had to guess, I'd assume they meant distinct rather than unique, in which case 51/reduce would be right.","poster":"yahsee33","timestamp":"1671031560.0","comment_id":"745212"}]},{"content":"Correct Answer: 75 and reduce. \nReason: Table shows distinct values. If we have 51 unique values and the rest of the values are non blank, we have to see more then 51 rows. In Answer 75 is available.","timestamp":"1670687760.0","poster":"csillag","comment_id":"741082","upvote_count":"1"},{"upvote_count":"1","comment_id":"740120","timestamp":"1670590860.0","content":"51, decrease","poster":"Patrick666"},{"upvote_count":"5","timestamp":"1670472720.0","poster":"slash_nyk","content":"Tested. It should be 51 Rows. By default, Table visual only displays unique values unless you drag some other field to the table. \n\nSummarizing will reduce","comment_id":"738607","comments":[{"upvote_count":"1","content":"You truly tested it. \nDisplay on the table visual only present the unique values that appear just once by default.\nI created a table using 1,1,2,3,4,5 which is supposed to be 6 rows, but on the table visual, it only displayed 1,2,3,4,5 with the 1just presented once and not twice.\n\nSo, the answer is 51.\nTake note: This is on report viz and not on power query","comment_id":"761524","timestamp":"1672351560.0","poster":"iccent2"}]},{"poster":"rajkoma","comment_id":"737249","upvote_count":"1","content":"For 1st question- It differs on datatype of the column.If its Whole number or Integer, it will be 1 row and if its text it should be 75 rows\nFor the Other one,its again on data type.If its number then reduce and if Text then Maintain. What do you say?","timestamp":"1670365260.0"},{"content":"We're not dealing with a matric here, we're dealing with a simple table. In simple tables values that occur more than once won't be shown in the rows multiple times. Since you're they tell you you have 51 unique values (and the other ones aren't null values) you can be sure it's more than 51. Since you'll already have 51 rows of unique values.\n\nSo the first is answer is 75.\n\nFurthermore, when you add another table, change the sign to summarize, you will add up all the values of the 51 unique values and all the rest. Which means you will get one single row, displaying the sum of all these values.\n\nTherefore, the second answer is reduce.","comment_id":"721395","upvote_count":"4","timestamp":"1668787500.0","poster":"KobeData"},{"comment_id":"717370","content":"1 row, Increase\n\nI think it should be 1 row because the data type is a Whole Number and in default the Summarization is set to be \"Sum\" (If it's a String then might be either 51/75 rows).\n\nAfter changed to \"Don't Summarize\", the table will show all the unique values from the column so number of rows increased","comments":[{"poster":"andregrahamnz","upvote_count":"2","timestamp":"1668572580.0","comment_id":"719311","content":"It doesnt matter what the default summarization is set to; they've shown you the summarization has been set to 'none' to start"}],"upvote_count":"4","timestamp":"1668350580.0","poster":"reeny"},{"poster":"ivanb94","content":"75 rows\nReduce\n\nYou can test it by creating a table with one column that contains 75 non-null values out of which 51 are unique.\nAfter that just drag your column to the simple table and you will see that it has to be more than 51 rows (the table will show the distinct values).\n\nThe part that is confusing is that it doesn't say 75 distinct values, but since there need to be more distinct values than 51, we can assume that all of the 75 values are distinct.\n\nAfter that, just add some summarization and it will show you only one number. \nHope this helps!","timestamp":"1668280320.0","upvote_count":"3","comments":[{"content":"If all 75 values were distinct in this table with 75 rows, every value would cosequently also be unique. If 51/75 are unique, is means the remaining 24 rows MUST contain non-unique values. It could be the same value 24 times, or it could be 12 distinct values, all of which occur twice. But EACH of the remaining values MUST occur at least twice, otherwise they would also be unique. \nErgo: the table visual shows between 52 and 63 rows.\nNone of the given answers is correct.","upvote_count":"2","timestamp":"1671700380.0","comment_id":"753118","comments":[{"timestamp":"1673088840.0","upvote_count":"1","content":"I agree with you!","comment_id":"768455","poster":"apache24"}],"poster":"Luxtra"}],"comment_id":"716885"},{"upvote_count":"6","timestamp":"1668140940.0","poster":"rivecin637","content":"Tested : 51 and maintain.\nOnly unique unique values will be shown.","comment_id":"715765"},{"comment_id":"707319","poster":"naziahassan","timestamp":"1667060100.0","content":"which one is the correct answer then, every one is saying different","upvote_count":"3"},{"upvote_count":"2","comment_id":"690796","timestamp":"1665385560.0","poster":"zerone72","comments":[{"poster":"zerone72","timestamp":"1665385680.0","content":"IF you add another column to the visual, changing the summarization will reduce the number of rows in the visual","comment_id":"690797","upvote_count":"1"}],"content":"75, MAINTAIN !!!\nWhen you add the column to a flat table only distinct (and not unique!) values are display. The question doesn't mention anything about the 75 values being distinct or unique. If you assume they are distinct then the ANSWER IS\n 75.\nThe question doesn't say anything about another column existing in the table and being added to the visual. Therefore, assuming that UnitInStock is the only column, changing the summarization MAINTAIN the number of value (it not a matrix, so values are not summed)"},{"poster":"centrumadresowe","content":"Sorry - 51 and reduce","timestamp":"1665335100.0","comment_id":"690372","upvote_count":"2"},{"timestamp":"1665334380.0","content":"75 Rows / Reduze","poster":"centrumadresowe","upvote_count":"2","comment_id":"690362"},{"upvote_count":"1","poster":"lukelin08","comment_id":"688125","comments":[{"comment_id":"724871","timestamp":"1669176060.0","content":"Tested again and I stand by my answer. 75 values does not mean 75 rows. What we do know is there are 51 unique values. So to test, create a column with the numbers 1-75 on each row > then leave 51 of these row values unique and for the remaining rows duplicate the numbers > then when you add the column to a table it will only show the distinct values which will be 75","poster":"lukelin08","upvote_count":"1"}],"timestamp":"1665093960.0","content":"75 Rows\nReduce"},{"content":"its 75 bcs it says just a simple report, nothing fancy about, and we have 75 non null and 51 unique, but it says just that it will show the rows in a report so it means all rows no matter what difference.\n\nand reduce bcs when we talk about summarization in a column we refer to reducing common values in form of a \"summing\"\n\n75\nreduce","comment_id":"682015","upvote_count":"3","timestamp":"1664388420.0","poster":"Lkra1"},{"comment_id":"680104","content":"I tested the example in powerbi so its 51 rows / reduce. Actually a) it is a distinct values table and b) is one value total summarization","comments":[{"content":"How did you test it? Did You use 75 distinct values or with repeated values?, because the result is not the same. \"Distinct\" is not same as \"Unique\".\nIf you used 75 non-null values of which 51 are unique then it means that 24 values are not unique (each value exist more than once), so your result will be 51 + distinct (the other 24 values) os it´s not possible your result.\nThe only way to have the result of 75 is knowing that we have 75 distinct values and not just 75 values (rows), and the only way to have the result of 51 is having 51 distinct values and not unique (unless all the rows we have are unique, in this case distcint = unique)","poster":"Fer079","comments":[{"comments":[{"comment_id":"753123","content":"How will you end up with 75 rows? The 24 remaining values CANNOT be unique, or there would be 75 unique values and not 51. So each of the remaining 24 must occur at least twice => maximum of 63 rows, minimum of 52 rows. There is no correct answer.","upvote_count":"1","poster":"Luxtra","timestamp":"1671700560.0"}],"poster":"andregrahamnz","comment_id":"719312","content":"Fer079's response to this is correct. There could be 51 unique values and the rest of the values are '1', but that will still result in a MINIMUM of 52 rows. The correct answer based on the information given is 'anywhere between 52 and 75 rows' which rules out all answers EXCEPT 75.","timestamp":"1668572700.0","upvote_count":"3"}],"upvote_count":"5","timestamp":"1664522520.0","comment_id":"683311"}],"poster":"nucleus21","upvote_count":"4","timestamp":"1664221800.0"},{"poster":"Neerajkved","comment_id":"678629","comments":[{"poster":"Neerajkved","upvote_count":"4","timestamp":"1664096940.0","comment_id":"678635","content":"Apologies for second answer , Answer for B will be \"Reduce\" as we are changing setting for summarization from None to a dimension."}],"upvote_count":"4","timestamp":"1664096580.0","content":"Wrong Answer:\nCorrect Answer will Be \nA. 51 because table shows only Unique values by default and this is the only value added in the visual\nB. Increase - Because if we add more dimension to table visual, number of unique combination will increase hence row count will increase.\nReduce"},{"timestamp":"1663560480.0","comment_id":"672907","upvote_count":"5","poster":"Namrata_12","content":"Ans would be- 51, reduce"},{"timestamp":"1663423860.0","poster":"fdsdfgxcvbdsfhshfg","content":"51, decrease","comment_id":"671587","upvote_count":"6"},{"poster":"zagiel","comment_id":"670561","content":"1. 1 rows\n2. When we change option \"Don't summarize\" the count of rows increase\nI did it in Power BI","timestamp":"1663312560.0","upvote_count":"3"}],"answer":"","question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011000001.jpg","https://www.examtopics.com/assets/media/exam-media/04331/0011100001.jpg"],"answers_community":[],"topic":"2","question_id":91,"answer_ET":"","isMC":false,"url":"https://www.examtopics.com/discussions/microsoft/view/80809-exam-pl-300-topic-2-question-24-discussion/","exam_id":116,"answer_description":"Box 1: 75 rows -\nIs nullable allows NULL values in the column.\n\nBox 2: reduce -\nReference:\nhttps://blog.crossjoin.co.uk/2019/01/20/is-nullable-column-property-power-bi/","question_text":"HOTSPOT -\nYou have a column named UnitsInStock as shown in the following exhibit.\n//IMG//\n\nUnitsInStock has 75 non-null values, of which 51 are unique.\nUse the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","timestamp":"2022-09-07 07:01:00"},{"id":"pPZDmZ8sQyflyWFCg7Xj","topic":"2","isMC":false,"timestamp":"2022-09-04 11:06:00","exam_id":116,"answers_community":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011200001.png","https://www.examtopics.com/assets/media/exam-media/04331/0011300001.jpg"],"unix_timestamp":1662282360,"discussion":[{"upvote_count":"56","comments":[{"upvote_count":"1","poster":"Alscoran","content":"I'm wondering if the last one is NO. A question for someone to clarify for me... Wouldn't DISTINCTCOUNT (Balances[AccountID]) be a distinct count of the BALANCES ? So if two accounts have the same balance, wouldn't it only count one time ? Thus giving an incorrect count of the active accounts ?","comments":[{"upvote_count":"2","poster":"jaume","comment_id":"1314069","content":"HI Alscoran, be aware DAX calculation is not counting (distinctcount) the amount for each balance but the [AccountID] therefore, even when two accounts could have exactly the same balance in the last day, they should be counted as 2 as they should not share the same Id)","timestamp":"1731947460.0"},{"content":"I just realized that Balances is the table name, not a column. Ignore me !","timestamp":"1702569300.0","upvote_count":"6","comment_id":"1096612","poster":"Alscoran"}],"comment_id":"1095721","timestamp":"1702490040.0"}],"poster":"dorypl300","content":"NO\nNO\nYES","comment_id":"701371","timestamp":"1666421640.0"},{"poster":"susunz","upvote_count":"18","content":"The date is hierarchy, the lastdate() is based on the hierarchy, which means the measure should be adjusted with the year/month/day level. Thus N-N-Y is correct.","timestamp":"1667014200.0","comment_id":"706919"},{"upvote_count":"1","comment_id":"1267565","timestamp":"1723883940.0","content":"correct No, No, Yes","poster":"rcaliandro"},{"poster":"Kiran37","comment_id":"1253504","upvote_count":"1","timestamp":"1721722140.0","content":"correct answer"},{"poster":"tke44","upvote_count":"4","comment_id":"911843","content":"NO\nNO\nYES","timestamp":"1685603160.0"},{"comment_id":"884833","upvote_count":"1","comments":[{"comment_id":"888912","poster":"joaowendling","upvote_count":"5","content":"No, LASTDATE will return the last date from the current context. If the context is the Year, the last date will be 31/12/year. If the context is the Day, LASTDATE will return the day itself\n\nhttps://learn.microsoft.com/en-us/dax/lastdate-function-dax","timestamp":"1683145080.0"}],"content":"shouldn't the last one be no too? the question says if it would calculate for the day, but doesn't it only calculate for the last day of the month? eg for the month of Jan, would only show Jan30; February would only show Feb28?","timestamp":"1682821680.0","poster":"lizbette"},{"timestamp":"1682578740.0","upvote_count":"3","poster":"Nisa93","comment_id":"882314","content":"NO\nNO\nYES"},{"comment_id":"775079","upvote_count":"8","poster":"yordiye","timestamp":"1673669640.0","content":"No No Yes... Last Date calculates the last day only"},{"upvote_count":"2","comment_id":"724610","poster":"Jay_98_11","content":"correct","timestamp":"1669145700.0"},{"timestamp":"1666796520.0","upvote_count":"3","poster":"Churato","comment_id":"704787","content":"As I was no sure , I did a test here, and Yes, the answer is correct..."},{"comment_id":"699610","timestamp":"1666247820.0","content":"Shouldn't this be YYY? Lastdate \"returns the last date in the current context for the specified column of dates\". Therefore, it will be give you the last day of the year or month depending on the context. If you then do a distinctcount on the accountid, this means that account had a closing balance on that day.","comments":[{"comments":[{"content":"Correct. Understood now! Cheers Shakes103","comment_id":"1183812","timestamp":"1711507440.0","upvote_count":"2","poster":"JudT"}],"timestamp":"1667646780.0","comment_id":"711704","upvote_count":"23","poster":"shakes103","content":"It is NO NO YES and here's why. Just as you mentioned, Lastdate \"returns the last date in the current context for the specified column of dates\" which means it will ONLY RETURN the live account balances for the LAST DAY of the YEAR for year and MONTH for month and not THROUGHOUT THE YEAR & THROUGHOUT THE MONTH as those options stated. Read those options again and the answers will come to you."}],"upvote_count":"2","poster":"Mizaan"},{"upvote_count":"6","poster":"lukelin08","content":"No\nNo\nYes","timestamp":"1665094800.0","comment_id":"688130"},{"timestamp":"1663096800.0","poster":"aloulouder","comment_id":"668358","content":"correct","upvote_count":"5"},{"timestamp":"1662282360.0","poster":"simplex06","content":"It should be No - No - Yes","comment_id":"659134","upvote_count":"5"}],"url":"https://www.examtopics.com/discussions/microsoft/view/80017-exam-pl-300-topic-2-question-25-discussion/","answer_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011300002.jpg"],"question_text":"HOTSPOT -\nYou have a Power BI report.\nYou have the following tables.\n//IMG//\n\nYou have the following DAX measure.\nAccounts :=\nCALCULATE (\nDISTINCTCOUNT (Balances[AccountID]),\nLASTDATE ('Date'[Date])\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer_description":"Box 1: No -\nIt will show the total number of accounts that were live at the last day of the year only.\nNote:\nDISTINCTCOUNT counts the number of distinct values in a column.\nLASTDATE returns the last date in the current context for the specified column of dates.\n\nBox 2: No -\nIt will show the total number of accounts that were live at the last day of the month only.\n\nBox 3: Yes -\nReference:\nhttps://docs.microsoft.com/en-us/dax/distinctcount-function-dax https://docs.microsoft.com/en-us/dax/lastdate-function-dax","answer_ET":"","answer":"","question_id":92},{"id":"r78MFTURNLZlLrj4R0p2","answer_ET":"AB","topic":"2","question_id":93,"answer_description":"","isMC":true,"url":"https://www.examtopics.com/discussions/microsoft/view/83060-exam-pl-300-topic-2-question-26-discussion/","answer_images":[],"discussion":[{"timestamp":"1663756200.0","poster":"sidyndiaye","content":"I agree.","upvote_count":"25","comment_id":"675014"},{"poster":"RazaTheLegend","upvote_count":"17","comment_id":"868110","timestamp":"1681291920.0","content":"Selected Answer: AB\nAB is the correct answer. Grouping in power query reduces the number of rows in the impression table that is gonna be loaded in the model. Creating relationships doesn't increase the size of the model. Therefore, the answer AB is correct!"},{"poster":"rcaliandro","comment_id":"1267566","upvote_count":"1","timestamp":"1723884060.0","content":"Selected Answer: AB\nAB is the correct one"},{"comment_id":"1253508","content":"correct answer","upvote_count":"1","timestamp":"1721722380.0","poster":"Kiran37"},{"poster":"MoneyStacking","upvote_count":"9","timestamp":"1714660740.0","content":"For the Guys and Girls,\n\nAt this page, you will no longer find any free questions from Examtopics. However, if you're hesitant about purchasing Contributor Access, don't hesitate any longer; buy it. It costs only $50 and provides a significant boost to your CV and career. I recently passed with a score of 917 out of 1000. Save yourself time by learning and memorizing all these questions, as 85% of the 50 exam questions were identical to those provided here.\n\nCheers and good luck!","comment_id":"1205664"},{"comment_id":"1191990","content":"Neither option a or d reduce model size but option a at least allows for proper data structure for accurate analysis -> option A the better of the two\noption C increases model size so hard no\noption b reduces model size , yay\ntherefore answer is A and B","upvote_count":"2","timestamp":"1712639580.0","poster":"ab97776"},{"timestamp":"1703044500.0","poster":"Dsbuff","content":"Selected Answer: AB\nCreating one-to-many relationships = optimizing the model. => A is correct.\nGroup the Impressions query in Power Query = pre-summarizing the data which results in a smaller and more efficient data model => B is correct.","upvote_count":"5","comment_id":"1101189"},{"content":"I feel like A and D should be the right answers given the fact that option B does not group by Campaign which is wrong. Any thoughts on this?","timestamp":"1700762400.0","comments":[{"content":"...i also believe that D does not reduce the model size as stated in the requirements. you are keeping the same number of Impressions rows and just adding a DAX measure.","upvote_count":"1","comment_id":"1155629","timestamp":"1708528500.0","poster":"ExamTopPicks"},{"poster":"ExamTopPicks","upvote_count":"2","content":"A and B are correct, i believe. B is grouping the Impressions table, it does not have Campaign ID column. That column is in the Ads table, which remains unmodified in solution B.","timestamp":"1708528260.0","comment_id":"1155627"}],"upvote_count":"4","poster":"fbbucky","comment_id":"1078618"},{"timestamp":"1696855980.0","content":"Guys, I feel like B and C are wrong. They didn't do anything with the campaign but we need to analyze the campaigns. Since D also work, I believe the answer should be \nA & D","upvote_count":"4","poster":"BI_life","comment_id":"1028936"},{"comment_id":"1024832","timestamp":"1696426680.0","poster":"rainy_255","upvote_count":"5","content":"This was in the exam this week."},{"comment_id":"999828","content":"B and C are the correct answers. \nB. This step will help us aggregate the impression data at the desired level of granularity (day, campaign, and site_name) in Power Query itself, reducing the amount of data loaded into the data model. \nC. By creating a calculated table that contains only the necessary columns (Ad_id, Site_name,and impression_date), we further minimize the data model size.","comments":[{"content":"creating a calculated table will increase the data model size","comment_id":"1023079","timestamp":"1696249140.0","upvote_count":"6","poster":"AyoJose"}],"timestamp":"1693940640.0","upvote_count":"1","poster":"Igetmyrole"},{"content":"I would say AD is correct. \nLet us ignore the day and site_name and focus on the Ad vs Campaign.\nThe reason is campaign to Ad is one to many relation thus one campaign can include some Ads. Assume campaignA(Campaign_ID=1) includes Ad1(Ad_id =1)&Ad2(Ad_id =2),\nRowsOfAD1 = Countrows(FILTER(Impressions, [Ad_id]=1)) \nRowsOfCampaign1 = Countrows(FILTER(Impressions, AND([Ad_id]=1,[Ad_id]=2)))\nThey are different.","upvote_count":"4","timestamp":"1693181400.0","comment_id":"991706","poster":"Pocu"},{"upvote_count":"7","poster":"tke44","timestamp":"1685603820.0","comment_id":"911849","content":"A and B for optimisation purpose. even if A and D is working"},{"poster":"Shalaleh","content":"Given answer is correct.","timestamp":"1683015600.0","upvote_count":"2","comment_id":"887150"},{"timestamp":"1673786460.0","comment_id":"776546","content":"Selected Answer: AB\nAB is correct","upvote_count":"4","poster":"ewelaela"},{"upvote_count":"1","poster":"yordiye","timestamp":"1673670240.0","content":"It should be A & D we can created aggregation with COUNTROWS DAX and group by Campaign Name, Date & Site name . B is using wrong columns for calculations","comments":[{"poster":"yordiye","content":"Sorry I am Wring it is A & B","timestamp":"1673670780.0","upvote_count":"7","comment_id":"775086"}],"comment_id":"775081"},{"timestamp":"1672195500.0","upvote_count":"5","comment_id":"759291","poster":"SumaiyaShah","content":"A is correct. I have a doubt about B. Aren't we suppose to group by campaign too? Grouping by AddID, we might have several campaigns against an add. Pls correct me if I am wrong"},{"poster":"AlexYang_","timestamp":"1671225900.0","comment_id":"747596","upvote_count":"1","content":"Selected Answer: AB\nA;B is correct"},{"comments":[{"comment_id":"743994","poster":"Hoeishetmogelijk","upvote_count":"4","timestamp":"1670934540.0","content":"The \"group by\" only affects the Impressions table. The Ads and the Campaigns table stay the same and through the relationships, the Campaign to which the Impression belongs can be retrieved."}],"timestamp":"1670746800.0","comment_id":"741521","content":"we also need group by campaign ? What about that","poster":"slash_nyk","upvote_count":"3"},{"upvote_count":"3","poster":"JukMar","comment_id":"711108","content":"CORRECT","timestamp":"1667563740.0"},{"comment_id":"693895","timestamp":"1665664740.0","upvote_count":"4","content":"Selected Answer: AB\ncorrect","poster":"Hangman_T"},{"content":"Selected Answer: AB\nCorrect","upvote_count":"3","comment_id":"690777","poster":"centrumadresowe","timestamp":"1665384660.0"},{"content":"Correct, A, B","poster":"lukelin08","timestamp":"1665097320.0","upvote_count":"3","comment_id":"688142"},{"comments":[{"comments":[{"poster":"zerone72","timestamp":"1664533800.0","upvote_count":"2","content":"Furthermore, you need relationships in order to group by campaign","comment_id":"683462"}],"timestamp":"1664533740.0","poster":"zerone72","upvote_count":"8","comment_id":"683460","content":"A-B is the correct answer. Grouping in power query reduces the number of rows in the impression table that is gonna be loaded in the model. Creating relationships doesn't increase the size of the model. Therefore, the answer A-B is correct!"}],"content":"In my oppinion, is A, D.\nNot C because groupping by Ad_id increases the data model size and is not required.","comment_id":"682369","timestamp":"1664429700.0","upvote_count":"3","poster":"IxIsa"},{"comment_id":"678004","upvote_count":"4","poster":"GregFred","content":"correct","timestamp":"1664037120.0"},{"upvote_count":"4","timestamp":"1664003340.0","content":"I agree too.","poster":"Snow_28","comment_id":"677664"}],"answers_community":["AB (100%)"],"exam_id":116,"unix_timestamp":1663756200,"question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011400001.png","https://www.examtopics.com/assets/media/exam-media/04331/0011400003.png"],"question_text":"You have the tables shown in the following table.\n//IMG//\n\nThe Impressions table contains approximately 30 million records per month.\nYou need to create an ad analytics system to meet the following requirements:\n✑ Present ad impression counts for the day, campaign, and site_name. The analytics for the last year are required.\nMinimize the data model size.\n//IMG//\n\nWhich two actions should you perform? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point.","answer":"AB","choices":{"A":"Create one-to-many relationships between the tables.","C":"Create a calculated table that contains Ad_id, Site_name, and Impression_date.","D":"Create a calculated measure that aggregates by using the COUNTROWS function.","B":"Group the Impressions query in Power Query by Ad_id, Site_name, and Impression_date. Aggregate by using the CountRows function."},"timestamp":"2022-09-21 12:30:00"},{"id":"qxeCbU3Lxbg2cHWQTb6g","answer_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011800001.jpg"],"timestamp":"2022-10-02 12:11:00","exam_id":116,"topic":"2","answers_community":[],"question_id":94,"isMC":false,"answer_ET":"","answer":"","question_text":"HOTSPOT -\nYou are creating a Microsoft Power BI data model that has the tables shown in the following table.\n//IMG//\n\nThe Products table is related to the ProductCategory table through the ProductCategoryID column. Each product has one product category.\nYou need to ensure that you can analyze sales by product category.\nHow should you configure the relationship from ProductCategory to Products? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","url":"https://www.examtopics.com/discussions/microsoft/view/84214-exam-pl-300-topic-2-question-27-discussion/","discussion":[{"comment_id":"693069","poster":"mindstemall","upvote_count":"108","comments":[{"timestamp":"1737490980.0","comment_id":"1344340","poster":"SylUK","upvote_count":"1","content":"Beside Both is for fact tables and Single for dimension tables."},{"comment_id":"706788","timestamp":"1666996440.0","poster":"learnazureportal","upvote_count":"23","comments":[{"content":"you are both right","upvote_count":"7","poster":"Hoeishetmogelijk","comment_id":"743999","timestamp":"1670934720.0"},{"content":"How did we figure out that the data flows from Product to Product Category and not the other way around??","timestamp":"1688623680.0","comment_id":"944368","poster":"vivian_data","comments":[{"poster":"vivian_data","timestamp":"1688624100.0","comment_id":"944374","content":"Nevermind, here's the answer: \"For one-to-many relationships, the cross filter direction is always from the \"one\" side, and optionally from the \"many\" side (bi-directional). \" \nhttps://learn.microsoft.com/en-us/power-bi/transform-model/desktop-relationships-understand","comments":[{"timestamp":"1728922680.0","poster":"i.eniolaabolade","comment_id":"1297722","upvote_count":"1","content":"one \"to\" many"}],"upvote_count":"12"}],"upvote_count":"1"},{"timestamp":"1688998980.0","content":"This is the wrong explanation about \"Single\".\nWhen we choose one-to-many of \"ProuctCat to Product\", the default direction of single is from ProuctCat->Product. \nHowever, \"analyzing sales by product category\" means, information from sales->Product->ProductCat. This is the opposite direction of our single direction.\nTherefore, it should be Both. \nKeep in mind, the single direction is determined by your one-to-many design.","upvote_count":"7","comment_id":"948199","comments":[{"upvote_count":"5","timestamp":"1694434320.0","content":"But the direction is about the way the filter works. Since analysing sales by ProductCategory means you filter from ProductCategory (via Product) to Sales, the direction is one way from ProductCategory to Sales.","comment_id":"1004753","poster":"Elfmo11"},{"upvote_count":"5","poster":"Bnxyl","content":"Guys take note. This is tested and confirmed. At first, I wanted to abuse you but then something told me to first put it into practice. And yes. It is one to many and Both. Thank you for standing out","timestamp":"1689912240.0","comment_id":"958033"}],"poster":"ZSun"}],"content":"Your answer is correct. however, we don't choose single, b/c it has better performance. b/c data flows from product to ProductCategory. This is the reason, we choose single."}],"content":"Silly comments here. One-to-many because several products have the same product category. Single because the performance is much better and the assignment states only that you need to be able to analyze sales by product category.","timestamp":"1665577260.0"},{"poster":"HamzaMJ","upvote_count":"28","comments":[{"poster":"scotchtapebunny","comments":[{"poster":"Booster21","comment_id":"725398","content":"I totally agree what you said that \"If you do both that means you want to analyze PRODUCT CATEGORY by SALE.\", otherwise single can do the trick. I was confused when to use BOTH earlier.","timestamp":"1669238340.0","upvote_count":"2"},{"comment_id":"1048692","timestamp":"1697799120.0","poster":"Nandini_Shanthaveerappa","upvote_count":"1","content":"For example, if we want to see the sales by product(Coffee, Tea, Milk) in each region(US, UK, IN). Say we dont want show the product names in the visuals if there no sales for that product in a specific region. So we use bidirectional so that the region and product tables are filtered for only sold products.. where it will not return blank if there's no sale for product tea in US .. it shows sales values for Coffee and Milk only"}],"timestamp":"1668814920.0","content":"you want to analyse SALE BY PRODUCT CATEGORY, you need cross filter direction single to make this work. If you do both that means you want to analyze PRODUCT CATEGORY by SALE. This doesn't make sense so there is no need for both. You're going downstream from product category to sales not the other way around. \n\nThis is what I think but I'd be thankful if someone can help me if I am wrong.","comment_id":"721641","upvote_count":"27"},{"poster":"KobeData","upvote_count":"5","comment_id":"721410","content":"Yu always filter from the one side, which in this case, is the productCategory. So one to many - single means filtering from one to the many side, which is correct. So it should be single. Hope this helps.","timestamp":"1668788760.0"}],"content":"1 - One to many because every product category has many products\n2 - Both because we need to analyze sales by product category","timestamp":"1668306540.0","comment_id":"717062"},{"content":"Cross filter direction could be both, and that would provide a better report experience with the slicers in my opinion, but using single is the better performing and therefore default option.","upvote_count":"1","poster":"l0cr","comment_id":"1365280","timestamp":"1741152300.0"},{"poster":"EpicData","upvote_count":"1","content":"Correct","comment_id":"1302842","timestamp":"1729856820.0"},{"comment_id":"1267569","upvote_count":"2","poster":"rcaliandro","content":"This is a classical single one-to-many relationship. The given answer is correct","timestamp":"1723884480.0"},{"upvote_count":"1","comment_id":"1247712","content":"One-to-many because several products have the same product category.\nBoth, because the filter goes via Products and One-to-many is from product to category.","timestamp":"1720947660.0","poster":"Flix"},{"comment_id":"1238588","upvote_count":"2","timestamp":"1719556560.0","poster":"KipngenohVinnie","content":"The answer is correct, one to many, that is from ProductCategory to Products, and direction is Single"},{"comments":[{"upvote_count":"1","comment_id":"1221785","timestamp":"1717097760.0","poster":"Mo2011","content":"No, this means one category has many products so it one (category) to many (products)"}],"timestamp":"1716542340.0","upvote_count":"2","comment_id":"1217337","poster":"Moin23","content":"Each product has one product category.\nisn't one-to-one ? They didn't say, every Product has \"atleast\" one product category\n\nconfigure the relationship from ProductCategory to Products?\nOne - Product Category side\nMany on Product side\n? right"},{"comment_id":"1205663","timestamp":"1714660740.0","upvote_count":"1","content":"For the Guys and Girls,\n\nAt this page, you will no longer find any free questions from Examtopics. However, if you're hesitant about purchasing Contributor Access, don't hesitate any longer; buy it. It costs only $50 and provides a significant boost to your CV and career. I recently passed with a score of 917 out of 1000. Save yourself time by learning and memorizing all these questions, as 85% of the 50 exam questions were identical to those provided here.\n\nCheers and good luck!","poster":"MoneyStacking"},{"poster":"Igetmyrole","timestamp":"1693941540.0","comment_id":"999838","upvote_count":"2","content":"One-to-many\nSingel\nOne-to-many: Each product category can have multiple products belonging to it.\nSingle: Because we want to analyze sales by product category."},{"upvote_count":"1","content":"After further analysis. I think there are two answers available to this\n\nAnswer set A: One to many and Single\n\nAnwer SET B: One to one and both","comment_id":"958045","comments":[{"poster":"Bnxyl","comment_id":"958046","timestamp":"1689913440.0","content":"But thinking deeper, What is the, The product table and Product category table must be having a one to one cardinality otherwise this would mean that the Products table and sales table will be having a many to many relationship considering that they are related via the product ID. \n\nThus to me the final answer should be One to one and then both directions","upvote_count":"1"}],"poster":"Bnxyl","timestamp":"1689913140.0"},{"comment_id":"925780","upvote_count":"2","content":"It asks relationship from product category to product not vice versa. Filter will take place at many * direction. So keeping it one to many means product category to product one to many , which is wrong. As there is not an option of many to one then many to many is the best choice here. And for many to many we always need filter in both directions. So the answer is many to many and both.","poster":"Lavi29","timestamp":"1686979440.0"},{"timestamp":"1686105060.0","content":"question is asking ProductCategory to Product Relation..\nFor sure it will be one to many.. if it was product to productcategory, then it would be one to one\nand cross filter : single for performance..","upvote_count":"2","poster":"bakamon","comment_id":"916795"},{"upvote_count":"2","content":"one-to-many\nsingle","poster":"Shalaleh","comment_id":"887254","timestamp":"1683025080.0"},{"poster":"UlyUkr","timestamp":"1682400840.0","upvote_count":"5","comment_id":"879977","content":"1. One to many, because one Product Category can have many Products.\n2.Single. It allows to calculate Sales by Product Category. Also the best practice as per this article \nhttps://learn.microsoft.com/en-us/power-bi/transform-model/desktop-relationships-understand\nAlso I tested in Power BI. If you have doubts, recreate the issue in Power BI and you will get the correct answer."},{"content":"1 - One to Many\n2- Single direction","timestamp":"1681292340.0","comment_id":"868116","poster":"RazaTheLegend","upvote_count":"1"},{"comment_id":"837584","poster":"Mati_123","upvote_count":"2","content":"1 - One to Many \n2- Single dirction","timestamp":"1678677300.0"},{"poster":"SumaiyaShah","timestamp":"1672195800.0","comment_id":"759296","content":"We cant make a 1 to 1 cardinality relationship single directional I guess","upvote_count":"2"},{"comment_id":"736864","poster":"Patrick666","upvote_count":"4","timestamp":"1670334360.0","content":"One-to-many, both"},{"poster":"Pauwels","upvote_count":"3","comment_id":"728491","content":"I think we should forget that the cardinality is from ProductCategory to Products.\nIt is one to many, single.\n\nOne to many make sure that each product has one product catégories. 2 product can have the same product cat","timestamp":"1669571220.0"},{"comment_id":"705711","upvote_count":"6","timestamp":"1666886100.0","poster":"wzwd","content":"I cannot imagine that there are so many people who want to pass this exam even not knowing the correct answer of this question."},{"poster":"lukelin08","content":"Tested, one-to-one and cross filter direction 'both' works","comments":[{"upvote_count":"1","poster":"NevilleV","timestamp":"1665931260.0","comments":[{"content":"I agree, my answer is incorrect. I believe now it is one-to-many and single filter direction","poster":"lukelin08","comment_id":"729843","upvote_count":"3","timestamp":"1669686900.0"}],"content":"It may but may come up with the wrong answer and has speed implications.","comment_id":"696292"},{"timestamp":"1666248300.0","content":"https://learn.microsoft.com/en-us/power-bi/transform-model/desktop-relationships-understand\n\nBear in mind that bi-directional relationships can impact negatively on performance.","upvote_count":"2","poster":"Mizaan","comment_id":"699617"}],"upvote_count":"2","comment_id":"688153","timestamp":"1665099480.0"},{"upvote_count":"3","timestamp":"1665099300.0","content":"'Each product has one product category' should be one-to-one?","poster":"EMMALEEEEEEEEE","comments":[{"poster":"Mizaan","upvote_count":"3","comment_id":"699613","timestamp":"1666248180.0","comments":[{"comment_id":"749034","upvote_count":"1","poster":"Wadyba","timestamp":"1671380820.0","content":"Don't assume what is not in the question. The question says 'each product has one product category' period."}],"content":"Each product only has one category but each category can have multiple products, hence why one to many."}],"comment_id":"688152"},{"poster":"lukelin08","comment_id":"688144","content":"Couldnt it also be one-to-one relationship because each product has one product category?\nand also if there is a one-to-one matching relationship between the tables then cross filter direction of 'both' would also be alright wouldnt it?","comments":[{"comment_id":"696299","upvote_count":"2","content":"No. Many products can share one category. Eg Category = Cars. Product = Ford, Honda, BMW","timestamp":"1665931500.0","poster":"NevilleV","comments":[]}],"upvote_count":"2","timestamp":"1665097800.0"}],"unix_timestamp":1664705460,"question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011600001.png","https://www.examtopics.com/assets/media/exam-media/04331/0011700001.jpg"],"answer_description":"Box 1: One-to-many -\nThe one-to-many and many-to-one cardinality options are essentially the same, and they're also the most common cardinality types.\nIncorrect: A many-to-many relationship means both columns can contain duplicate values. This cardinality type is infrequently used. It's typically useful when designing complex model requirements. You can use it to relate many-to-many facts or to relate higher grain facts. For example, when sales target facts are stored at product category level and the product dimension table is stored at product level.\n\nBox 2: Single -\nIncorrect:\nBear in mind that bi-directional relationships can impact negatively on performance. Further, attempting to configure a bi-directional relationship could result in ambiguous filter propagation paths. In this case, Power BI Desktop may fail to commit the relationship change and will alert you with an error message.\nReference:\nhttps://docs.microsoft.com/en-us/power-bi/transform-model/desktop-relationships-understand"},{"id":"vvRCWnzs5uFIDNPwTZQf","discussion":[{"upvote_count":"59","comment_id":"660939","timestamp":"1662448860.0","content":"Selected Answer: D\nD is right","poster":"ElijahSu"},{"content":"looks like a typo - D is good as explained below","timestamp":"1662491700.0","poster":"Jukibabu","upvote_count":"23","comment_id":"661596"},{"timestamp":"1737308640.0","content":"Selected Answer: B\nIf you delete DATE table and Date Key, then you eliminate a lot of redundant data","poster":"aa83599","upvote_count":"2","comment_id":"1343122"},{"comment_id":"1314073","upvote_count":"3","poster":"jaume","content":"Selected Answer: D\nD. Remove MovementDate column as the data details are already included in the DateKey column therefore MovementDate information is redundant.\nBy defaultI expect DateKey to be Don't Summarize but anyway, in the question it's not mentioned anything about Summarization.\nRemoving relationship would make impossible to set any analysis based on date (you could split DateKey column and get from there day, month and year but this would increase data model size)\nChanging UnitCost to Integer (this category doesn't exist in PBI but Whole Number!!!) would result in lost of information as values in this column are all decimals","timestamp":"1731948180.0"},{"upvote_count":"1","comment_id":"1296437","timestamp":"1728722880.0","poster":"JPShields","content":"This requires you to notice that MovementDate and DateKey have the same date. I agree that it doesnt tell you they are ALWAYS the same though."},{"comment_id":"1276150","content":"If D is correct - how can we guarrantee that 'Movementdate' always has the same info as DateKey? i.e. having 5 identical rows does not tell us all rows are the same...","timestamp":"1725204480.0","poster":"wistom","upvote_count":"4"},{"comment_id":"1267570","upvote_count":"2","timestamp":"1723884720.0","poster":"rcaliandro","content":"Selected Answer: D\nWe can remove the movementdate 'cause the same information in kept in the datekey column"},{"content":"Selected Answer: D\nD is right one","comment_id":"1254501","poster":"Mohamed_Nasr","upvote_count":"1","timestamp":"1721834340.0"},{"timestamp":"1721722620.0","content":"correct answer","upvote_count":"1","poster":"Kiran37","comment_id":"1253512"},{"upvote_count":"1","content":"Selected Answer: D\nD is correct. We can remove it since it does not provide new information. We can have these information from DateKey column.","comment_id":"1236158","poster":"shahrzadkhb","timestamp":"1719210840.0"},{"upvote_count":"1","content":"For the Guys and Girls,\n\nAt this page, you will no longer find any free questions from Examtopics. However, if you're hesitant about purchasing Contributor Access, don't hesitate any longer; buy it. It costs only $50 and provides a significant boost to your CV and career. I recently passed with a score of 917 out of 1000. Save yourself time by learning and memorizing all these questions, as 85% of the 50 exam questions were identical to those provided here.\n\nCheers and good luck!","comments":[{"timestamp":"1717691100.0","content":"Hey , out of 52 pages , how many pages you referred? Going through 52 pages is not feasible","poster":"Shark13","comment_id":"1225628","upvote_count":"1"}],"timestamp":"1714660740.0","poster":"MoneyStacking","comment_id":"1205662"},{"content":"Selected Answer: D\nD is correct.","poster":"ELJORDAN23","upvote_count":"1","timestamp":"1713878220.0","comment_id":"1200753"},{"content":"Yeah. There's a typo indeed. As per the explanation the response should be D.","comment_id":"1196674","poster":"0e18c76","upvote_count":"1","timestamp":"1713283500.0"},{"poster":"AZFabio","comment_id":"1176647","upvote_count":"1","content":"Selected Answer: D\nD is correct","timestamp":"1710781140.0"},{"upvote_count":"1","content":"You can also remove rows where nothing went in or out","comment_id":"1171041","poster":"Elektrolite","timestamp":"1710163740.0"},{"timestamp":"1709915280.0","content":"Selected Answer: D\nAs per the given explanation option D is crearly the answer. We are achieving required functionality without losing information as both the rows contain same information","poster":"GowthamMupparapu","comment_id":"1168944","upvote_count":"2"},{"comment_id":"1161372","poster":"arrow040","content":"Selected Answer: D\nDates can be removed from fact tables in a data warehouse or analytical database if you replace them with date keys that are linked to a separate date dimension table. Thus, answer D is correct.","timestamp":"1709106840.0","upvote_count":"1"}],"topic":"2","timestamp":"2022-09-03 17:09:00","choices":{"B":"Remove the relationship between Date and Product Inventory","D":"Remove MovementDate.","C":"Change the data type of UnitCost to Integer.","A":"Change Summarization for DateKey to Don't Summarize."},"question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0011900004.png"],"answer":"D","unix_timestamp":1662217740,"isMC":true,"question_text":"You import a Power BI dataset that contains the following tables:\n✑ Date\n✑ Product\n✑ Product Inventory\nThe Product Inventory table contains 25 million rows. A sample of the data is shown in the following table.\n//IMG//\n\nThe Product Inventory table relates to the Date table by using the DateKey column. The Product Inventory table relates to the Product table by using the\nProductKey column.\nYou need to reduce the size of the data model without losing information.\nWhat should you do?","url":"https://www.examtopics.com/discussions/microsoft/view/79836-exam-pl-300-topic-2-question-28-discussion/","answer_description":"","answer_images":[],"answer_ET":"D","exam_id":116,"answers_community":["D (89%)","10%"],"question_id":95}],"exam":{"provider":"Microsoft","numberOfQuestions":334,"id":116,"isBeta":false,"isMCOnly":false,"isImplemented":true,"lastUpdated":"12 Apr 2025","name":"PL-300"},"currentPage":19},"__N_SSP":true}