{"pageProps":{"questions":[{"id":"HHEor8JYbbd66M49rAzp","question_text":"You have a Microsoft Power BI data model that contains three tables named Orders, Date, and City. There is a one-to-many relationship between Date and\nOrders and between City and Orders.\nThe model contains two row-level security (RLS) roles named Role1 and Role2. Role1 contains the following filter.\nCity[State Province] = \"Kentucky\"\nRole2 contains the following filter.\n\nDate[Calendar Year] = 2020 -\nIf a user is a member of both Role1 and Role2, what data will they see in a report that uses the model?","exam_id":116,"answer_description":"","unix_timestamp":1662129000,"url":"https://www.examtopics.com/discussions/microsoft/view/79453-exam-pl-300-topic-2-question-15-discussion/","answers_community":["A (85%)","Other"],"question_images":[],"timestamp":"2022-09-02 16:30:00","topic":"2","discussion":[{"comment_id":"657524","comments":[{"content":"I have tried and I was able to see for the year 2020 and area , so D should be correct","upvote_count":"32","poster":"md_sultan","comment_id":"746428","timestamp":"1671130020.0","comments":[{"timestamp":"1719472500.0","upvote_count":"5","comment_id":"1237947","comments":[{"timestamp":"1726478820.0","upvote_count":"1","poster":"VladStan","content":"Confirmed - did all the tests and A is the correct answer here. The final result of the report is UNION of what each role can see.","comment_id":"1284572"}],"poster":"Sophieeeeee","content":"I also tried by creating two roles and assigned the contrains to each but the result is A. D works when I put both two constrains under the same role."},{"comment_id":"996028","poster":"Mlak_Lou","timestamp":"1693570140.0","upvote_count":"10","content":"Same i made the test. D is correct !"}]},{"upvote_count":"25","timestamp":"1665557460.0","comment_id":"692784","content":"User is limited to only Kentucky AND year 2020. He should not have rights to see other years or areas. Come on guys its simple OR/AND!","comments":[{"timestamp":"1672187220.0","upvote_count":"33","content":"Yes it's simple OR/AND, and you simply don't understand how RLS works. Read Microsoft's doc, and pay attention to this sentence: \"Take care: Should a report user map to both roles, they'll see all Payroll table rows.\"\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\nThat means different rules don't \"merge\" to become the most restrictive of the component rules. In the context of this question, IF I want to restrict this user to see ONLY Kentucky IN the year 2020, then I'd set up a RLS that has both of those conditions...","poster":"cnmc","comments":[{"comment_id":"1219020","poster":"e31df62","content":"cnmc : Thank YOU! YOU R RIGHT!\nStraight away lifted from microsft page: \"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters. What's more, in some scenarios it's not possible to guarantee that a report user doesn't see rows in a table. So, unlike permissions applied to SQL Server database objects (and other permission models), the \"once denied always denied\" principle doesn't apply.\"\nLink: https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\nJust do Cntrl+F and search on this page.","upvote_count":"5","timestamp":"1716737040.0"},{"upvote_count":"2","poster":"semauni","comment_id":"880202","content":"I tend to agree with what you're saying, but in that example it's a TRUE() going against a FALSE(). One role is explicitly going against the other role, in this case both roles could supplement each other. Again, I agree that this likely means that it's not only the intersection of the two conditions you'll see, but I'm not 100% sure based on that example.","comments":[{"timestamp":"1695339540.0","comment_id":"1013446","content":"For example, if a user belongs to both the \"Sales\" and \"Marketing\" roles, they can see data for both these roles.\n\nhttps://learn.microsoft.com/en-us/power-bi/enterprise/service-admin-rls#faq","poster":"itenginerd","upvote_count":"2"}],"timestamp":"1682417220.0"}],"comment_id":"759192"},{"comment_id":"696116","upvote_count":"8","timestamp":"1665910680.0","poster":"NevilleV","content":"Which means D is the correct answer"}],"poster":"NGenov"},{"upvote_count":"24","poster":"Mizaan","comment_id":"698998","content":"D is correct. Why? Because if they could see Kentucky OR 2020 data then they just have to select Kentucky and they would be able to see data from all years, which would defeat the purpose of RLS","comments":[{"upvote_count":"8","comment_id":"759194","content":"They would be able to select Kentucky and they would see the KENTUCKY data from all years. They would not be able to see, say New York data or California for years other than 2020","timestamp":"1672187280.0","poster":"cnmc"},{"upvote_count":"46","timestamp":"1666788300.0","poster":"Churato","content":"\"Multiple role mappings can result in unexpected outcomes.\nWhen a report user is assigned to multiple roles, RLS filters become ADDITIVE. It means report users can see table rows that represent the UNION of those filters.\"\nSource : https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance","comment_id":"704685"}],"timestamp":"1666181460.0"},{"comment_id":"1124734","poster":"edbf978","content":"This does not seem logical at all and is not the expected result however I have tested in Power BI Desktop and can confirm this is correct. It creates an OR filter condition rather than an AND filter condition when more than one role is applied :(","upvote_count":"6","timestamp":"1705472640.0"},{"poster":"itenginerd","content":"A as the answer is validated by the referenced article given in the answer. There's an FAQ, the last of which is \"can a user have multiple roles?\". The doc goes on to state that users in multiple roles get additive access.","comment_id":"1013444","timestamp":"1695339420.0","upvote_count":"1"},{"content":"A is correct :\nhttps://learn.microsoft.com/en-us/power-bi/enterprise/service-admin-rls\n\nQuestion: Can a user belong to more than one role?\nAnswer: A user can belong to multiple roles, and the roles are additive. For example, if a user belongs to both the \"Sales\" and \"Marketing\" roles, they can see data for both these roles.","upvote_count":"10","timestamp":"1697364300.0","poster":"Rasaqh","comment_id":"1044033","comments":[{"timestamp":"1707133140.0","upvote_count":"2","poster":"__Sai_Mounika__","comment_id":"1141023","content":"Then it should be D not A"},{"comment_id":"1055046","poster":"Mandar77","timestamp":"1698371400.0","upvote_count":"8","content":"If I correctly interpret the statement \" if a user belongs to both the \"Sales\" and \"Marketing\" roles, they can see data for both these roles.\" then Answer D is right one. Its \"AND\" condition not a \"OR\"","comments":[{"comment_id":"1095640","upvote_count":"2","timestamp":"1702484640.0","poster":"HarryDhingra","comments":[{"poster":"__Sai_Mounika__","timestamp":"1707133200.0","comment_id":"1141024","upvote_count":"1","content":"How come OR is union?"}],"content":"The roles become additive once user belongs to multiple roles. It means, the union of both the roles will be applied. The union is represented by OR; therefore, answer A is correct."}]}]}],"poster":"Muffinshow","upvote_count":"148","timestamp":"1662129000.0","content":"Selected Answer: A\nWrong , correct answer is A"},{"comment_id":"666618","comments":[{"comment_id":"674403","content":"Thank you, that is the right description.","poster":"rashjan","upvote_count":"1","timestamp":"1663696500.0"},{"timestamp":"1663737960.0","upvote_count":"8","comment_id":"674813","poster":"olajor","comments":[{"timestamp":"1664215500.0","comment_id":"680038","content":"it's A i just recreated the scenario and it shows all the lines for the Role 1 and adds all the lines for the Role 2. so keeps all the lines that meet Role 1 OR Role 2","poster":"nucleus21","upvote_count":"26"}],"content":"Union is everything in both, i.e Role1 and Role2"},{"content":"That means exactly the opposite \"can see table rows that represent the union of those filters.\"\nTables that represent the union of the filters, not the union of the rows displayed by each filter","comments":[{"content":"I'd say that you are talking about the intersection","timestamp":"1692336240.0","comment_id":"984195","poster":"taod","upvote_count":"1"}],"upvote_count":"12","comment_id":"687511","timestamp":"1665034980.0","poster":"Dumi44"}],"content":"Selected Answer: A\nAnswer should be A, from the Microsoft documentation (https://docs.microsoft.com/en-us/power-bi/guidance/rls-guidance): \n\"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.\" \n\nThis means that you would see all data where either Role1 OR Role2 applies, so the answer is A not D.","poster":"ThariCD","timestamp":"1662961680.0","upvote_count":"53"},{"poster":"Chi3fmhlongo","timestamp":"1739788080.0","upvote_count":"1","comment_id":"1357750","content":"Selected Answer: D\nRLS applies an AND condition when multiple roles are assigned, the user will see only the data that meets both conditions."},{"timestamp":"1738726740.0","comment_id":"1351689","content":"Selected Answer: D\nThat means the user will only see data that meets both conditions","upvote_count":"1","poster":"ee0625a"},{"content":"Selected Answer: D\nWhen a user is a member of multiple RLS roles in Power BI, both roles are applied using an AND logic by default. This means the user will see data that satisfies all filters defined by the roles they belong to.","timestamp":"1737088740.0","comment_id":"1342008","poster":"RRconnect","upvote_count":"1"},{"poster":"SUNNYDEPS","upvote_count":"1","content":"Selected Answer: D\nThe correct content is d as RLS is interpreting as AND operator where both the condition should meet.","timestamp":"1737013380.0","comment_id":"1341515"},{"comment_id":"1340421","upvote_count":"1","poster":"namuuu","timestamp":"1736870700.0","content":"Selected Answer: D\nIn Microsoft Power BI, when a user is a member of multiple row-level security (RLS) roles, the intersection of the filters from all the roles is applied. This means the filters are combined using a logical AND condition.\n\nRole1 Filter: City[State Province] = \"Kentucky\"\nThis restricts the data to rows where the State Province value is \"Kentucky.\"\nRole2 Filter: Date[Calendar Year] = 2020\nThis restricts the data to rows where the Calendar Year is 2020."},{"comment_id":"1338844","upvote_count":"1","poster":"njnaro","timestamp":"1736520660.0","content":"Selected Answer: D\nrow-level security (RLS) filters are combined using an AND condition when a user belongs to multiple roles. This means that all the filters from all roles must be satisfied for the data to be visible to the user."},{"poster":"Odidepse","content":"Selected Answer: D\nYou have role1 with applied filters to state of Kentucky and role 2 2020 so uysers will only see Kentucky and year 2020, correct answer is D, dont ignore the filters , I tested it to be sure.","timestamp":"1736313060.0","comment_id":"1337822","upvote_count":"1"},{"timestamp":"1735831500.0","upvote_count":"2","comment_id":"1335634","content":"Selected Answer: A\nA is correct, if there ware only one Rules like City[State Province]= \"Kentucky\" and Date[Calendar Year]=2020 then option D is correct, since two separate rules are present here so A is correct.","poster":"PL300ARIF"},{"poster":"PL300ARIF","timestamp":"1735830300.0","upvote_count":"1","comment_id":"1335622","content":"Selected Answer: D\nIn Power BI, when a user is a member of multiple Row-Level Security (RLS) roles, the roles are combined using an AND logic. This means that the filters from both roles are applied simultaneously, restricting the data the user can view to rows that satisfy all the filter conditions."},{"comment_id":"1327996","timestamp":"1734449520.0","upvote_count":"3","content":"Selected Answer: A\nhttps://www.youtube.com/watch?v=0OPcZeLHbfY","poster":"assettemergaliyev"},{"content":"Selected Answer: D\n\"If a user is a member of both Role1 and Role2\" IT USES THE WORD AND WHICH WILL ALLOW THEM TO SEE BOTH!","poster":"desibaby09","timestamp":"1733939580.0","comment_id":"1325141","upvote_count":"1"},{"upvote_count":"1","comment_id":"1324811","content":"Selected Answer: D\nD. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nExplanation\nIn Power BI, when a user is assigned to multiple Row-Level Security (RLS) roles, the filters from those roles are combined with an AND condition. This means that all filters must apply simultaneously.\n\nRole1 Filter: City[State Province] = \"Kentucky\"\nThis restricts the data to only rows where the State Province is \"Kentucky.\"\n\nRole2 Filter: Date[Calendar Year] = 2020\nThis restricts the data to only rows where the Calendar Year is 2020.\n\nSince the user is a member of both roles, both conditions will apply together. Therefore, the user will see only data that meets both of these criteria:\n\nThe State Province is Kentucky.\nThe Calendar Year is 2020.\nHence, Option D is the correct answer","poster":"olops2002","timestamp":"1733883240.0"},{"upvote_count":"2","comment_id":"1319608","content":"Selected Answer: D\ncombined with an AND relationship","poster":"Rio98","timestamp":"1732866120.0"},{"comment_id":"1318340","poster":"desibaby09","comments":[{"comment_id":"1341279","upvote_count":"1","content":"ChatGPT reported correct answer as D for me as well, complete with all its usual seemingly authoritative well-founded reasoning, but I immediately followed up with this prompt: \"are you sure about this, there is some debate online about whether the RLS filters intersect to create an OR condition instead of an AND?\". At which point it immediately performed a complete 180 and proclaimed A to be correct, complete with a lot of authoritative well founded reasoning :) Caveat emptor. Answer is A.","timestamp":"1736983740.0","poster":"cleeremind"}],"upvote_count":"1","timestamp":"1732663620.0","content":"Selected Answer: D\nChat GPT confirmed as well"},{"content":"Selected Answer: D\nFrom Role 1, user is restricted to data where City[State Province] = \"Kentucky\"\nFrom Role 2, user is restricted to data where Date[CalendarYear] = \"2020\"\nIt cannot happen user can reach some data in the report out of \"Kentucky\" State because it's dated \"2020\" and also cannot see any data for Kentucky from other year than \"2020\" so I vote here for answer D","timestamp":"1731925740.0","poster":"jaume","comment_id":"1313941","upvote_count":"1"},{"upvote_count":"1","poster":"VladAbz","comment_id":"1301830","content":"If you have selected A: What if a record belongs to Kentucky but other province records are present in 2020. Creates ambiguity right? I think D should be correct.","timestamp":"1729647840.0"},{"comment_id":"1300167","poster":"ae8a90c","content":"Selected Answer: A\nOption A","upvote_count":"1","timestamp":"1729370640.0"},{"timestamp":"1729370580.0","comments":[{"content":"sorry I meant A so sorry","poster":"ae8a90c","comment_id":"1300168","upvote_count":"1","timestamp":"1729370700.0"}],"content":"Selected Answer: D\noption D is correct based on the this link","comment_id":"1300166","upvote_count":"1","poster":"ae8a90c"},{"poster":"Arth_1111","timestamp":"1725644460.0","upvote_count":"1","comment_id":"1279722","content":"Selected Answer: D\nits simple, Rule1 and Rule2 applied meaning, Rule1 AND Rule2. \nD is the correct answer"},{"poster":"rcaliandro","timestamp":"1723882020.0","upvote_count":"1","comment_id":"1267550","content":"Selected Answer: D\nOf course D- The user will only see data for which the State Province value is Kentucky AND the Calendar Year is 2020","comments":[{"upvote_count":"1","timestamp":"1724155020.0","poster":"rcaliandro","content":"Sorry, I made a mistake! I tested it and it is A because I created two roles; I am member of both of them and it shows data from Role1 OR Role2.","comment_id":"1269430"}]},{"comment_id":"1267289","upvote_count":"2","poster":"Endeetheanalyst","content":"D is correct.\nAdditive means AND.","timestamp":"1723830540.0"},{"poster":"21studybuddy_","content":"I think in a nutshell, at any point in time user can view the report as SINGLE role. \n\nHence if the user viewing as ROLE1 then City rule would apply, otherwise if the user viewing as ROLE2 year rule would apply. hence the answer is A (which mean the user has option to view as both roles independently).","comment_id":"1263133","upvote_count":"1","timestamp":"1723220580.0"},{"upvote_count":"2","poster":"NaudeDucon","comment_id":"1254733","content":"Selected Answer: A\nThe right answer is A. the user will see RLS 1 or RLS 2.\nIt's a little confusing for some people as they might understand the statement as: RLS 1 AND (not RLS 2) and vice versa. \nHowever, \"OR\" here is like logical operators. They can see, only rows belong to RLS1, only rows belong to RLS 2 and their intersect (both RLS1 & RLS2). In other word, in this case, users can see all [State Province] in 2020, as well as Kentucky through out all [Calendar Year].","timestamp":"1721885160.0"},{"upvote_count":"1","poster":"Kiran37","timestamp":"1721720160.0","content":"correct answer","comment_id":"1253474"},{"poster":"agelee","upvote_count":"1","content":"https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance","timestamp":"1721210820.0","comment_id":"1249518"},{"poster":"Flix","comment_id":"1247696","timestamp":"1720945980.0","upvote_count":"1","content":"With RLS it's always the combination. Meaning: the user sees the full set for 2020 and the full set for Kentucky. If you want the user to only see the year 2020 for Kentucky, than combine this in the same role."},{"comment_id":"1237933","content":"Selected Answer: A\nI tried on Power BI. If you create TWO roles, like Role 1 and Role 2, and assign the province and year to EACH OF THEM SEPERATELY, then the answer will be A -- which is the answer for this question. However, if you only create ONE role and put BOTH province and year UNDER THIS ROLE, the answer will be D.","timestamp":"1719471360.0","poster":"Sophieeeeee","upvote_count":"2"},{"content":"A he will see both","upvote_count":"2","timestamp":"1718301840.0","poster":"souhailftw","comment_id":"1230020"},{"upvote_count":"1","poster":"Tinashe16","content":"I think the confusion on this question is on semantics, a lot people who are saying answer is not D are programmers who want to see brackets enclosing (Kentarky and Year 2020)","timestamp":"1716799080.0","comment_id":"1219403"},{"content":"The correct answer is D.\nThe user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nIn Power BI, if a user is a member of multiple roles, the filters from all roles are applied. This means that the user will only see data that meets all the conditions from all roles. \nIn this case, the user must see data where the State Province is Kentucky (from Role1) and the Calendar Year is 2020 (from Role2).","upvote_count":"1","comment_id":"1208998","poster":"e3ddceb","timestamp":"1715273400.0"},{"upvote_count":"1","timestamp":"1714653900.0","content":"Selected Answer: A\nWhen a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.","poster":"Onizuka911","comment_id":"1205534"},{"timestamp":"1714565280.0","content":"Selected Answer: D\nD. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\nBecause user is member of both Roles and hence member access the data only when they statisfies both the condition.","comment_id":"1205068","poster":"Deva_1","upvote_count":"1"},{"poster":"shahrzadkhb","upvote_count":"1","comment_id":"1199576","content":"I tested in in power BI and I am pretty sure that 'A' is the correct answer.","timestamp":"1713692040.0"},{"upvote_count":"3","poster":"sm222","timestamp":"1713292140.0","content":"Selected Answer: A\nThe answer is A. The terminology is what confuses people. So, according to Microsoft learn . A Union is shown when multiple roles are selected or when a user is a member of both roles. \nThis mean the user will be able to see all rows of Role1 and all rows of role2. \n\nHowever, the terminology will use OR because it means the user will see either of the data from role1 and role2 . If we consider D, it says that user will see data from role1 and role2 which is an intersection or like an inner join which is wrong","comment_id":"1196742"},{"content":"Wrong, correct answer should be A.\n\nBased on description D can not be correct. In the described context (two roles) you would see data from other cities besides Kentucky and you would see data from other years besides 2020.\n\nTo get the results from the intersection between Kentucky and year 2020, you should create one specific role and define on this same role, a filter for the city and another filter for the year. This means, that the rule of AND and OR only applies if both filters, for city Kentucky and year 2020, are defined on the same role. Please check the following youtube video:","timestamp":"1713278520.0","poster":"0e18c76","upvote_count":"1","comment_id":"1196641"},{"timestamp":"1713258720.0","content":"Correct answer is A","poster":"Mani1994","comment_id":"1196492","upvote_count":"1"},{"upvote_count":"1","content":"Selected Answer: A\nWith multiple roles does RLS become more restrictive or permissive? Permissive according to \nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance. \nThe user with 2 roles can see data unrelated to Kentucky, but when they do look at data outside of Kentucky the year filter is applied. When they look at Kentucky data no year filter is applied. \n\nchoice D suggests they can see a very limited set of data. A set of data that is more restrictive and only allows them to see Kentucky data from the year 2020\n\nChoice A might be more clear if it said something like, The user will see data for all State Provinces where the Calendar Year is 2020, with Kentucky related data being unafflicted by Calendar Year filter\n\nthat's too wordy though.","timestamp":"1712727360.0","poster":"ab97776","comment_id":"1192728"},{"upvote_count":"3","poster":"sarraEB","timestamp":"1711801560.0","content":"Selected Answer: A\n\"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.\" UNION takes all the lines of filter 1 and all lines of filter 2 => Answer is A","comment_id":"1186084"},{"content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance","comment_id":"1182506","poster":"Chaka_Mahlo","upvote_count":"1","timestamp":"1711373340.0"},{"comments":[{"poster":"JudT","timestamp":"1711453620.0","upvote_count":"1","content":"Yes. Instead we have to create a new role that will be filtered in both criteria. Thanks for your contribution. A is correct...","comment_id":"1183263"}],"timestamp":"1710979800.0","comment_id":"1178865","upvote_count":"2","content":"Selected Answer: A\nIn the context of Power BI RLS, filters from different tables are combined using OR logic. Therefore, the correct interpretation is that the user will see data where either the State Province is \"Kentucky\" OR the Calendar Year is \"2020\".\n\nSo, option A, \"The user will see data for which the State Province value is Kentucky or where the Calendar Year is 2020,\" is indeed the correct answer.","poster":"ggsss"},{"content":"Selected Answer: B\nCorrect solution is the B. There is a syntax error in the second filter:\nDate[Calendar Year] = 2020 -\nThe '-' is incorrect, it should be [Calendar Year] >= 2020 instead.\n... and the error shows when both Role1 and Role2 is applied in the View as","comment_id":"1170870","upvote_count":"2","timestamp":"1710142860.0","poster":"otapi"},{"upvote_count":"2","timestamp":"1709724240.0","poster":"Abdellatif_Nagy","comment_id":"1167116","content":"If a user belongs to more than one role, they will see the data from all the roles that they are assigned to. Power BI will apply the union of the filters from all the roles to the user’s data view3. For example, if a user is assigned to two roles, one that filters the data by country and another that filters the data by product, the user will see the data for all the countries and all the products that are allowed by the roles."},{"content":"Sneaky and/or question. I selected A because I didn't even read the \"or.\"","timestamp":"1709055480.0","upvote_count":"1","poster":"28485e1","comment_id":"1160876"},{"timestamp":"1708427040.0","content":"Selected Answer: D\nthe answer is in the question:\n\"If a user is a member of both Role1 AND Role2,\"\ninterpret as apply RLS of role1 AND role2;\nmake sense right ?","comment_id":"1154648","poster":"Dani_eL","upvote_count":"1"},{"timestamp":"1707776160.0","upvote_count":"1","poster":"sraakesh95","comment_id":"1148725","content":"Selected Answer: D\nThe correct answer is D. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\nExplanation:\nIn Power BI, when a user is a member of multiple RLS roles, the filters from all roles are applied concurrently."},{"poster":"__Sai_Mounika__","comments":[{"content":"You are right, it throws an error. Correct solution is the B. There is a syntax error in the second filter:\nDate[Calendar Year] = 2020 -\nThe '-' is incorrect, it should be [Calendar Year] >= 2020 instead. \n... and the error shows when both Role1 and Role2 is applied in the View as","comment_id":"1170869","timestamp":"1710142740.0","upvote_count":"1","poster":"otapi"}],"timestamp":"1707133260.0","content":"Am I only the one who thought it would throw an error because of the syntax? 2020 is supposed to be in double quotation marks?","comment_id":"1141026","upvote_count":"2"},{"comment_id":"1137617","content":"After checking, I found that if you give a user two different roles in Power BI, the permissions they get from both roles add up (additive). So, if you were wondering whether this would happen, yes, it does—Option A is the right answer.","poster":"SuniltheMentor","timestamp":"1706790600.0","upvote_count":"2"},{"upvote_count":"5","comment_id":"1114315","timestamp":"1704436680.0","poster":"JohnChung","content":"Selected Answer: A\nThe given answer is wrong. It is ridiculous to say the more roles I got, the less data I can access"},{"content":"if we use the same logic in SQL, the where clause will have Kentucky or 2020, so A makes more sense","comment_id":"1112452","poster":"momo1165","upvote_count":"1","timestamp":"1704251100.0"},{"poster":"Aldeus","comment_id":"1106443","timestamp":"1703633280.0","content":"Bing chat:\nThe correct answer is D. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020123.\n\nIn Power BI, when a user is assigned to multiple roles, the Row-Level Security (RLS) filters become additive. This means that the user can see table rows that represent the union of those filters2. However, it’s important to note that the filters are applied in an “AND” fashion, not “OR”. So, if a user is a member of both Role1 and Role2, they will see the data where both conditions are met, i.e., where the State Province is Kentucky and the Calendar Year is 2020123.\n\nRemember, the implementation of RLS depends on your specific data model and security requirements. It’s always a good idea to test your RLS settings with different user roles to ensure that the data security is as expected2. Let me know if you have any other questions!","upvote_count":"2"},{"content":"Might be confusing, but just know that the correct answer is A.\nOfficial Microsoft Documentation -\nhttps://learn.microsoft.com/en-us/power-bi/enterprise/service-admin-rls\nQuestion: Can a user belong to more than one role?\nAnswer: A user can belong to multiple roles, and the roles are additive. For example, if a user belongs to both the \"Sales\" and \"Marketing\" roles, they can see data for both these roles.","comment_id":"1103168","timestamp":"1703223900.0","upvote_count":"1","poster":"MayurV19"},{"comment_id":"1094533","content":"Selected Answer: A\nAnswer is A, why this website keep getting it wrong?","upvote_count":"2","timestamp":"1702386540.0","poster":"bdub1976"},{"comment_id":"1080485","upvote_count":"1","content":"There is no mention of the relationship between Date and City. Therefore, role 1 applies to orders & city (kentucky), and role 2 applies to orders & date (2020). It will return any orders from kentucky and any orders in year 2020. (OR)","poster":"cokimon","timestamp":"1700974560.0"},{"timestamp":"1698937920.0","content":"\"D\" is correct not \"A\"\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters. \"","upvote_count":"3","poster":"NaderS","comment_id":"1060639"},{"comment_id":"1055318","timestamp":"1698396900.0","upvote_count":"4","poster":"cem_bxl","content":"I am new to this website, I was wondering why there are so many wrong answers on this exam? Mostly the correct answer is hidden in the discussion part."},{"timestamp":"1697138880.0","content":"Selected Answer: A\nA","comment_id":"1042045","poster":"TYLERPBI","upvote_count":"3"},{"comment_id":"1027591","upvote_count":"2","timestamp":"1696704780.0","content":"The correct answer is B - will receiver an error message... Pay attention to the hifen after 2020 ... That makes all the difference! (I tested it)","poster":"AscentA"},{"content":"Option D as per my understanding","upvote_count":"1","timestamp":"1696672380.0","comment_id":"1027234","poster":"SwapnJ"},{"comment_id":"1007760","poster":"Ibritics","timestamp":"1694703480.0","upvote_count":"4","content":"Selected Answer: A\nI have tried it personally. \nI have created two roles on contoso table\nrole1 filter on region = Asia \nrole2 filter year = 2013 \nIf I choose bose roles. I get the data for Asia and another countries for 2013. And for other years I see only Asia. \nSo it's not AND it's OR."},{"upvote_count":"5","poster":"Igetmyrole","timestamp":"1693890660.0","content":"A is the correct answer. \nIn power BI, when a user is a member of multiple roles with different filters, the filters combine in an additive way. Specifically:\n* For filters on different tables, they work together using an OR logic\n* For filters on the same table, they work together using an AND logic. \nIn this case, the user is a member of Role1 and Role2. Let's evaluate the filters:\nRole1: City[State Province] = \"Kentucky\"\nRole2: Date[Caendar Year] = 2020\nSince these filters apply to different tables (City and Date), they work together using OR logic. Therefore, the user will see data where either of these conditions is met. \n City[State Province] = \"Kentucky\" OR\nDate[Caendar Year] = 2020","comment_id":"999066"},{"poster":"jeme","comments":[{"timestamp":"1693531920.0","upvote_count":"1","content":"sorry . D","comment_id":"995579","poster":"jeme"}],"content":"correct b . match of two roles , which means comb of the two role's data","comment_id":"995577","upvote_count":"1","timestamp":"1693531800.0"},{"comment_id":"993987","content":"Correct Answer is D. \nSee snippet below from https://learn.microsoft.com/en-us/power-bi/enterprise/service-admin-rls\nQuestion: Can a user belong to more than one role?\nAnswer: A user can belong to multiple roles, and the roles are additive. For example, if a user belongs to both the \"Sales\" and \"Marketing\" roles, they can see data for both these roles.","upvote_count":"1","poster":"sher72","timestamp":"1693392960.0"},{"poster":"rgabage","timestamp":"1693210320.0","comment_id":"991923","content":"Selected Answer: A\nConfir the right answer is A. I read it on https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance and tried on real report.","upvote_count":"1"},{"content":"Selected Answer: A\nRoles are additive. To see cross-referenced Kentucky AND 2020 you'd need to add both filters to one role.","upvote_count":"2","comment_id":"988483","poster":"ktk8","timestamp":"1692808800.0"},{"timestamp":"1691419080.0","content":"Two Filters can be applied just with OR not AND logic. Otherwise, only both Filters together will filter Roles. So, the correct answer is A","comment_id":"974775","upvote_count":"1","poster":"sergeyitaly"},{"content":"Since the user is a member of both Role1 and Role2, the row-level security filters from both roles will be applied cumulatively. Therefore, the user will see data that satisfies both conditions: where the State Province value is Kentucky and the Calendar Year is 2020.","timestamp":"1691152620.0","upvote_count":"1","comment_id":"972151","poster":"sergeyitaly"},{"poster":"MEG_Florida","content":"Selected Answer: A\nA: Answer is definitely as many stated this is the same as an OR not an AND","upvote_count":"1","timestamp":"1690914960.0","comment_id":"969302"},{"timestamp":"1690349820.0","content":"Answer is Option:A\nReson: When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see entire data where year is 2020 and country is Kentucky it like union not like intersection method.","upvote_count":"1","comment_id":"963397","poster":"Pandi_18"},{"content":"Selected Answer: D\nIf the user is assigned to both roles, the net effect is the INTERSECTION of the two filtered data sets. Role 1 filters the data to only Kentucky rows; Role 2 filters the data to only 2020 rows. So a user assigned to both roles will see only the intersection of the data sets - Kentucky rows for year 2020.","upvote_count":"1","comment_id":"943199","comments":[{"content":"That logic is not correct. What you're describing would be represented like this:\nCity[State Province] = \"Kentucky\" && Date[Calendar Year] = 2020\nAs discussed above, by creating two separate roles, you are invoking OR logic.","comment_id":"951578","poster":"MoxieTT","upvote_count":"3","timestamp":"1689342000.0"},{"poster":"ET_phone_home_son","content":"I re-read the question and I realize that I was thinking of what happens if both filter expressions are used within a single role definition - this results in the intersection of the proscribed data sets. However, when two separate roles are defined as in this question, and the user is assigned to both roles, the net effect is additive, as the MS documentation says, and effectively the user can see all data. Role1 will give a data set of only Kentucky info but everything else; Role2 will give a data set of only 2020 year data, but everything else. The effect of being assigned to both roles is that the user gets <everything else> from each role definition and that is effectively the entire data set.","timestamp":"1688515260.0","comment_id":"943201","upvote_count":"1"}],"poster":"ET_phone_home_son","timestamp":"1688514600.0"},{"comments":[{"upvote_count":"7","content":"Please stop with \"no needs further explanation\", all answers need discussion, not just you being sure about your choice of answer.","timestamp":"1690133760.0","poster":"Maniula","comment_id":"960686"}],"timestamp":"1687199280.0","comment_id":"927809","upvote_count":"2","content":"Correct answer is A, no needs further explanation, but I can confirm it because this question is in the official microsoft practice questions, and the correct answer they give is A.","poster":"RenzoNorero"},{"upvote_count":"1","timestamp":"1685986320.0","content":"The example in this link (https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance) , where multiple roles assignment is explained clearly explains that the answer will be A","poster":"ysk95","comment_id":"915627"},{"poster":"bhappyga","timestamp":"1685751360.0","upvote_count":"1","comment_id":"913095","content":"Tested and its OR condition which means Answer is A"},{"comment_id":"911234","content":"answer D.if a user is a member of both Role1 and Role2, they will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nThis is because row-level security filters are cumulative for users who are members of multiple roles. In this case, Role1 filters the data to only show records where the State Province value is Kentucky, and Role2 filters the data to only show records where the Calendar Year is 2020.","poster":"tke44","timestamp":"1685535960.0","upvote_count":"2"},{"content":"Answer is A as demonstrated here https://www.youtube.com/watch?v=M5K_jKPxdqI","comment_id":"902817","poster":"cokimon","timestamp":"1684627440.0","upvote_count":"5"},{"comment_id":"902365","upvote_count":"1","poster":"UlyUkr","timestamp":"1684560240.0","content":"Correct answer is A. When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance"},{"timestamp":"1684102860.0","comment_id":"897905","poster":"Joezh","content":"More roles mean more privileges. Those privileges should be a union so D is correct.","upvote_count":"1"},{"upvote_count":"1","poster":"ahhida","comment_id":"897829","content":"A is correct user can see all kentucky sales plus all 2020 sales which means role1 or role2","timestamp":"1684088760.0"},{"poster":"Shalaleh","comment_id":"887116","content":"Selected Answer: A\nIt is combination of two roles.","upvote_count":"1","timestamp":"1683013380.0"},{"comment_id":"884801","poster":"lizbette","timestamp":"1682816340.0","content":"Selected Answer: A\nA. The user will see data for which the State Province value is Kentucky or where the Calendar Year is 2020. Most Voted","upvote_count":"1"},{"content":"Selected Answer: D\nI can confirm that the provided answer is correct. When a user is a member of multiple roles that have row-level security (RLS) filters, the filters of all roles are combined, and only the data that satisfies all the conditions is visible to the user. In this scenario, the user is a member of both Role1 and Role2, and Role1 restricts data access based on the State Province, while Role2 restricts data access based on the Calendar Year. Therefore, the user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nIt is important to note that RLS is a powerful feature of Power BI that allows for fine-grained control over data access based on user roles. It is commonly used to restrict data access based on factors such as location, department, or any other criteria that is relevant to the business. As a Power BI expert, I recommend that users take advantage of this feature to ensure that only authorized individuals can access sensitive data.","timestamp":"1682550000.0","comment_id":"882073","poster":"SanaCanada","upvote_count":"5"},{"poster":"pl300machine","content":"Correct answer is A\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.\"","timestamp":"1681535040.0","comment_id":"870653","upvote_count":"2"},{"poster":"Newb007","upvote_count":"1","comments":[{"upvote_count":"2","comment_id":"868401","content":"LMAO woops! I MEAN A!!!! Its A also to whoever is using Chat GPT just asking it \"are you sure\" it will just flip flop between A and D lol. It's A if you read the link provided and scenario","comments":[{"timestamp":"1682144520.0","poster":"Burabari","upvote_count":"2","content":"Stop relying on Chat GPT and look it up yourself to avoid the flipity-flop!","comment_id":"877072"}],"timestamp":"1681305840.0","poster":"Newb007"}],"content":"Its D!\n\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\n\"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters. What's more, in some scenarios it's not possible to guarantee that a report user doesn't see rows in a table. So, unlike permissions applied to SQL Server database objects (and other permission models), the \"once denied always denied\" principle doesn't apply.\"\n\nWhat else is there to explain...","comment_id":"868374","timestamp":"1681304100.0"},{"content":"Selected Answer: A\nWrong , correct answer is A\n\n\"Multiple role mappings can result in unexpected outcomes.\nWhen a report user is assigned to multiple roles, RLS filters become ADDITIVE. It means report users can see table rows that represent the UNION of those filters.\"\nSource : https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance","comment_id":"868015","timestamp":"1681284000.0","poster":"RazaTheLegend","upvote_count":"1"},{"upvote_count":"1","poster":"ilk777","comment_id":"861464","timestamp":"1680638280.0","content":"A\nThe result of each RLS role is what a user CAN see. The name \"filter\" while defining the RLS creates some confusion, but you should think of it similar to any other role based security system, e.g. Windows file security. What happens if you give a user two roles, each of them with access to certain folders in windows? Right, they will see all data that each of the roles are allowed to see."},{"upvote_count":"1","poster":"SanaCanada","comment_id":"859889","content":"Selected Answer: D\nCorrect Answer D\n\nThe correct answer is D. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nWhen a user is a member of multiple roles with conflicting filters, the filters are combined using a logical AND. In this case, the user is a member of both Role1 and Role2, so the filters are combined as follows:\n\nCity[State Province] = \"Kentucky\" AND Date[Calendar Year] = 2020\nThis means that the user will only be able to see data where both of these conditions are true. Therefore, they will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nno confusion, and no need to discuss further","timestamp":"1680524520.0"},{"comment_id":"859886","timestamp":"1680524400.0","poster":"SanaCanada","comments":[{"comment_id":"972120","upvote_count":"1","timestamp":"1691150580.0","comments":[{"poster":"EwoutBI","content":"Let me say that clearer, it gives all the Orders from either Kentucky and/or from the year 2020. So everything from Kentucky (including that from 2020), and everything from 2020 (including other places). Here is the report: https://ibb.co/sV5YGKB","comment_id":"972122","timestamp":"1691150940.0","upvote_count":"1"}],"content":"I re-created it in Power BI with three tables, with View as I was able to see all the Orders from Kentucky, with all OrderYears. In other words, the other cities/state provinces were missing for the user with both roles.","poster":"EwoutBI"}],"upvote_count":"2","content":"Correct Answer\n\nWhen a user is a member of multiple roles with conflicting filters, the filters are combined using a logical AND. In this case, the user is a member of both Role1 and Role2, so the filters are combined as follows:\n\nCity[State Province] = \"Kentucky\" AND Date[Calendar Year] = 2020\nThis means that the user will only be able to see data where both of these conditions are true. Therefore, they will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nNo confusion, and no need to discuss further"},{"poster":"satyambarnwal","timestamp":"1679921820.0","content":"It uses 3 tables and every roles associated with different tables that's why it does not give the error. so our data filter on the basis of year and province. So the correct answer will be D.","upvote_count":"1","comment_id":"852123"},{"comments":[{"comment_id":"852949","upvote_count":"1","content":"Most of the time ChatGPT is incorrect, like this time!","poster":"Shalaleh","timestamp":"1679988360.0"}],"content":"ChatGPT:\nD. The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.\n\nWhen a user is a member of both Role1 and Role2, the row-level security filters are combined using the logical AND operator. This means that the user will only see data that satisfies both filters, which in this case is data for which the State Province is Kentucky and the Calendar Year is 2020.","comment_id":"845693","timestamp":"1679389740.0","poster":"pepix74","upvote_count":"1"},{"poster":"1sourabhpatel1","comment_id":"840543","content":"when a report user is assigned to multiple roles with different RLS filters, the filters become additive, and the user can see table rows that represent the union of those filters.\n\nIn this scenario, the user will see data for which either the State Province value is Kentucky or the Calendar Year is 2020, as both RLS filters are applied simultaneously. Therefore, option A is the correct answer, and options B, C, and D are incorrect.","timestamp":"1678940160.0","upvote_count":"2"},{"upvote_count":"1","content":"I have tested this --the answer is A. In the guide, it also says \"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters\" \nIn here \"union of those filters\" means not \"and\". The data for both tables means \"or\" in this context","timestamp":"1678875840.0","poster":"Akin_Eren","comment_id":"839773"},{"upvote_count":"2","content":"Selected Answer: D\nSomeone had this issue and asked about it in the PBI Forum. Appears belonging to 2 groups restricts the user more. \nCorrect Answer: D","timestamp":"1678720920.0","comment_id":"838024","poster":"Daveeeee"},{"content":"Correct Answer C\n\nIf a user is a member of both Role1 and Role2, they will only see data for which the State Province value is Kentucky.\n\nThis is because the two filters from the two roles cannot be combined as they are applied to different tables. The filter in Role1 is applied to the City","timestamp":"1678268820.0","upvote_count":"1","poster":"SanaCanada","comment_id":"832786"},{"upvote_count":"1","content":"Answer is A. Roles are \"or'd\". If the conditions were within the one role then D would be correct ie conditions within a role are and'ed but as they are in separate roles A is the right answer (yes I tested both scenarios to be sure ;)","poster":"Neilsy","timestamp":"1678007100.0","comment_id":"829778"},{"content":"Chat gpt: \nYes, I'm absolutely sure that this is the correct answer. I apologize for any confusion that my previous response might have caused.\n\nTo summarize, if a user is a member of both Role1 and Role2, they will see the Orders data that satisfies either of the two conditions, which means:\n\nThe orders are placed in cities located in Kentucky because of Role1 filter.\nThe orders have a date in the calendar year 2020 because of Role2 filter.\nThis includes all orders data that meets either of the conditions, regardless of whether they are placed in Kentucky or in other states such as New York.","poster":"Ridderxxl","comment_id":"825145","upvote_count":"2","timestamp":"1677609060.0"},{"poster":"KarthikKumarK","upvote_count":"1","content":"Answer is D (AND)","timestamp":"1677215700.0","comment_id":"820126"},{"timestamp":"1675917840.0","comment_id":"802830","poster":"Sultanoid","content":"D is correct. The use of multiple roles per person is NOT recommended. See guide paragraph 2.\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance","upvote_count":"1"},{"upvote_count":"1","poster":"HemantGorle","timestamp":"1673804520.0","comment_id":"776883","content":"Selected Answer: A\nWhen a report user is assigned to multiple roles, RLS filters become ADDITIVE"},{"upvote_count":"1","comment_id":"776245","poster":"Ashishsingh07","content":"Guys if you try it, you will find that answer is A","timestamp":"1673770200.0"},{"comment_id":"775053","content":"A is correct","timestamp":"1673665200.0","upvote_count":"1","poster":"yordiye"},{"timestamp":"1673514840.0","upvote_count":"1","poster":"JukMar","comment_id":"773299","content":"D is correct"},{"upvote_count":"3","content":"Tested. Answer A is correct","timestamp":"1673398920.0","poster":"Sushvij","comment_id":"771928"},{"poster":"svg10gh","timestamp":"1672958040.0","content":"D is correct answer.","comment_id":"767105","upvote_count":"1"},{"timestamp":"1672160940.0","poster":"RichXP","content":"Selected Answer: A\nlook the sample from https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\none role returns true, another role returns false, users with both role would see all rows.\nalso \"Multiple role mappings can result in unexpected outcomes\", it is not like role permission in other area.","upvote_count":"1","comment_id":"758822"},{"upvote_count":"1","content":"take a look the sample from https://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance, if one role filter is true, another is false, then users with both role would see all rows.","comment_id":"758816","timestamp":"1672160640.0","poster":"RichXP"},{"timestamp":"1671850320.0","content":"Tested, it shows data of both roles. Its option D","upvote_count":"1","poster":"mdnaseershah","comment_id":"754668"},{"timestamp":"1671806160.0","comment_id":"754293","poster":"opek","content":"Selected Answer: A\nExample from MS Learn linked below:\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\n\"Consider a model with two roles: The first role, named Workers, restricts access to all Payroll table rows by using the following rule expression:\n\nDAX:\nFALSE()\nA rule will return no table rows when its expression evaluates to false.\n\nYet, a second role, named Managers, allows access to all Payroll table rows by using the following rule expression:\n\nDAX:\nTRUE()\nTake care: Should a report user map to both roles, they'll see all Payroll table rows.\"\n\nIt seems to be indeed A in that scenario. User will see the data from the first as well as the second filter, it is FILTER A OR FILTER B (not FILTER A AND FILTER B)","upvote_count":"3"},{"content":"Example from MS Learn linked below:\nhttps://learn.microsoft.com/en-us/power-bi/guidance/rls-guidance\n\n\"Consider a model with two roles: The first role, named Workers, restricts access to all Payroll table rows by using the following rule expression:\n\nDAX:\nFALSE()\nA rule will return no table rows when its expression evaluates to false.\n\nYet, a second role, named Managers, allows access to all Payroll table rows by using the following rule expression:\n\nDAX:\nTRUE()\nTake care: Should a report user map to both roles, they'll see all Payroll table rows.\"\n\nIt seems to be indeed A in that scenario. User will see the data from the first as well as the second filter, it is FILTER A OR FILTER B (not FILTER A AND FILTER B)","comment_id":"754292","upvote_count":"1","timestamp":"1671806100.0","poster":"opek"},{"upvote_count":"1","content":"Selected Answer: D\nD is correct","timestamp":"1671221520.0","comment_id":"747552","poster":"AlexYang_"},{"timestamp":"1670994060.0","poster":"prad_raj1","comment_id":"744733","upvote_count":"1","content":"Answer is A"},{"content":"Selected Answer: D\nCouldn't be OR.\nUsually, filters are working in 2 ways:\n- Most restrictive\n- Cumulative\n\nBecause in PBI, RLS couldn't apply more restrictive - they are different, it applies cumulative.\n\nAnswer: D","timestamp":"1670829960.0","poster":"Dr_Do","upvote_count":"1","comment_id":"742505"},{"comment_id":"732017","poster":"jboiret","content":"Selected Answer: A\nCorrect anser is A, I've just tested with Power Bi Desktop","timestamp":"1669844820.0","upvote_count":"1"},{"upvote_count":"1","poster":"sharmila29","timestamp":"1669758360.0","content":"So actually there is no correct answer given in the choice.","comment_id":"730881"},{"comment_id":"730878","content":"D is wrong. since we have 2 different roles one for Kentucky ignoring the year and second role for the year 2020 ignoring the region. So the user with both role should be OR not and AND. because the role Kentucky will diplay many years of data and year 2020 will show any region in that year. so the logic is actually all the region and all the year. Since no year filter in Kentucky and no region filter in year. Make sense?\n\nD)The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.","timestamp":"1669758240.0","poster":"sharmila29","upvote_count":"1"},{"timestamp":"1669742940.0","poster":"Hoeishetmogelijk","upvote_count":"2","content":"I would say the the correct answer is D (restrictions role 1 AND role 2).\nBut when I read the online documentation (RLS filters become ADDITIVE. It means report users can see table rows that represent the UNION of those filters) it seems that the answer should be A (restrictions of role 1 OR role 2)\nSo I think it is answer A, but I have to say that this goes completely against my logic.","comment_id":"730672"},{"content":"Roles perform like unions and not intersections. For example, if a person is assigned two roles \"Sales Manager\" and \"Union member\", this particular person is both a Sales Manager and a Union member. What a Sales Manager can do is totally different from what a Union member can do, and those two roles may not have much if anything in common. Still, a person who are assigned both roles should be able to do jobs of both roles","upvote_count":"1","comment_id":"726332","timestamp":"1669341180.0","poster":"AzureJobsTillRetire"},{"timestamp":"1669145100.0","comment_id":"724603","content":"Selected Answer: D\nand/or logic","upvote_count":"1","poster":"Jay_98_11"},{"comment_id":"723222","upvote_count":"1","poster":"cygwin","content":"Selected Answer: A\nA is right","timestamp":"1669014420.0"},{"upvote_count":"1","timestamp":"1668783900.0","poster":"Pauwels","comment_id":"721346","content":"Correct answer is D"},{"content":"When a report user is assigned to multiple roles, RLS filters become additive. It means report users can see table rows that represent the union of those filters.","timestamp":"1668137160.0","upvote_count":"3","comment_id":"715730","poster":"rivecin637"},{"poster":"Bot_1","content":"yes answer is d","timestamp":"1667878440.0","upvote_count":"2","comment_id":"713460"},{"timestamp":"1666899600.0","content":"The answer is A and not D. If a user is a worker and Role1 access to payroll is FALSE and the same employee is a manager and has role2 access to payroll which is TRUE, the employee will see all payroll bcos RLS is additive. \nSo, on role1 = Kentucky, they can see all the years under Kentucky and on role2 = year 2020, they can see all state provinces under year 2020 and not just kentucky.","upvote_count":"2","poster":"iccent2","comment_id":"705877"},{"upvote_count":"2","comment_id":"691665","content":"Selected Answer: A\nI have checked with a sample data, it shows the union of sets, A or B.","poster":"Nurgul","timestamp":"1665456300.0"},{"content":"The answer is A","timestamp":"1665132780.0","poster":"samad1234","upvote_count":"1","comment_id":"688473"},{"upvote_count":"1","content":"Selected Answer: A\nCorrect answer = A","poster":"lukelin08","timestamp":"1665086520.0","comment_id":"688086"},{"poster":"nucleus21","content":"Selected Answer: A\njust recreate a simlpe dataset and shows all the lines for both roles.","comment_id":"680042","timestamp":"1664215740.0","upvote_count":"3"},{"content":"D is correct answer as user will only see data filtered using RLS","poster":"Neerajkved","upvote_count":"1","comment_id":"677631","timestamp":"1663998120.0"},{"timestamp":"1663942140.0","upvote_count":"3","poster":"RichardOgoma","content":"Selected Answer: D\nThe COMBINED filters create a context for the data rendered for the user. The logic is AND not OR.","comment_id":"677229"},{"poster":"David_Zed","upvote_count":"6","comment_id":"668070","content":"Selected Answer: D\nBoth filters will apply, that mean Filter from role1 AND Role2, not Role1 OR Role2","timestamp":"1663075860.0"},{"poster":"Manikom","timestamp":"1662968940.0","content":"Selected Answer: D\nboth filters should be met D","upvote_count":"3","comment_id":"666713"},{"poster":"June15","timestamp":"1662944760.0","content":"Also in Topic 2 Question #8 in DA-100","comment_id":"666527","upvote_count":"1"},{"upvote_count":"4","poster":"olajor","timestamp":"1662719820.0","content":"D is correct, if a user is a member of both roles both filters will apply, i.e \"and\"","comment_id":"664422"}],"answer":"A","answer_images":[],"choices":{"A":"The user will see data for which the State Province value is Kentucky or where the Calendar Year is 2020.","B":"The user will receive an error and will not be able to see the data in the report.","D":"The user will only see data for which the State Province value is Kentucky and the Calendar Year is 2020.","C":"The user will only see data for which the State Province value is Kentucky."},"answer_ET":"A","question_id":81,"isMC":true},{"id":"zWU1DZLuiyIMDZzavXAG","question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are modeling data by using Microsoft Power BI. Part of the data model is a large Microsoft SQL Server table named Order that has more than 100 million records.\nDuring the development process, you need to import a sample of the data from the Order table.\nSolution: From Power Query Editor, you import the table and then add a filter step to the query.\nDoes this meet the goal?","answers_community":["B (54%)","A (46%)"],"answer_images":[],"unix_timestamp":1662280560,"question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/80001-exam-pl-300-topic-2-question-16-discussion/","exam_id":116,"answer_description":"","topic":"2","isMC":true,"timestamp":"2022-09-04 10:36:00","question_id":82,"discussion":[{"upvote_count":"79","content":"I agree with the answer. \nB. No","poster":"simplex06","comment_id":"659090","comments":[{"timestamp":"1681166640.0","poster":"BiLearn","content":"A, should be correct. We have concept of Query Folding. If we apply the steps and it can be converted to Native Query then it will execute as is.\nBy development process it might mean by building Power BI Report, the view might be production view and as it is having 100 Million record. We cannot update the view for Power BI development.","upvote_count":"28","comments":[{"poster":"Seda_","comments":[{"content":"haklisin seda","poster":"signofanopeneye","comment_id":"1259115","upvote_count":"3","timestamp":"1722463440.0"}],"content":"If you import the entire table, you will increase memory usage and may experience performance issues. Applying a filter only affects the visibility of the data, while still keeping the entire table in memory. Therefore, a more effective method is to sample or filter directly on the data source.","upvote_count":"12","timestamp":"1722098580.0","comment_id":"1256363"},{"upvote_count":"3","comment_id":"1209535","timestamp":"1715377200.0","content":"but before you apply the filter, you need to load the entire data in full to query editor, then you apply the filter, which turns into native query. It's best when you just add a where clause in sql query when importing","poster":"hypersam"},{"timestamp":"1681166940.0","comments":[{"upvote_count":"1","content":"Tested - The correct answer is A - So how you will apply the filter? \nLoad your data in Power query. \nCreate a \"new parameter\" from \"Manage Parameters Menu\" and assign your sample \"start date\" in \"current value\" field and reach ok. \nFilter your Datekey column by the created \"new parameter\" to get your sample in the model.Hope this will help.","poster":"JudT","timestamp":"1711460580.0","comment_id":"1183345"},{"content":"So from:\nhttps://learn.microsoft.com/en-us/power-query/power-query-folding\n\nIf the View Native Query option isn't enabled (greyed out), this is evidence that not all query steps can be folded. However, it could mean that a subset of steps can still be folded. Working backwards from the last step, you can check each step to see if the View Native Query option is enabled.\n\nSo is that enabled by default?","poster":"LouStar2","timestamp":"1685785740.0","comment_id":"913432","upvote_count":"1"}],"content":"Great Explanation by Sana\nCorrect Answer A\n\nYes, when you use Power Query Editor to import a table with a filter in Power BI, only the filtered data is imported into the data model.\n\nThe Power Query Editor is used to transform and shape the data before it is loaded into the data model. When you apply a filter step to the query in Power Query Editor, it will only select the records that meet the filter criteria, and exclude the records that do not. This filtered data is then loaded into the data model.","upvote_count":"16","comment_id":"866671","poster":"BiLearn"}],"comment_id":"866666"},{"poster":"Denjarus","content":"B is correct. This will load the entire table in the first step when you import. Instead add a WHERE clause to the SQL statement","upvote_count":"14","comment_id":"706826","timestamp":"1667001120.0","comments":[{"timestamp":"1679989980.0","comment_id":"852986","content":"It seems the correct answer is A, \"Yes\". because the question said importing in POWER QUERY and not POWER DESKTOP. and before importing POWER DESKTOP it uses filter step and filters the data. it means it will import only part of the table into power bi desktop. Although it is not recommended but still it works. please let me know if I am wrong.","upvote_count":"8","poster":"Shalaleh"}]}],"timestamp":"1662280560.0"},{"comments":[{"comment_id":"775054","timestamp":"1673665380.0","poster":"yordiye","content":"I agree","upvote_count":"1"},{"content":"Query folding is only possible when using Direct Query. However, the exercise states import, so query folding cannot be used and as a consequence the filter cannot be pushed into the query.","comment_id":"778743","comments":[{"upvote_count":"8","timestamp":"1673948400.0","comment_id":"778750","poster":"Remko_K","content":"Correction: For a DirectQuery or Dual storage mode table, the Power Query query must achieve query folding. For an Import table, it may be possible to achieve query folding."}],"timestamp":"1673948040.0","poster":"Remko_K","upvote_count":"5"}],"content":"I think query folding can push the filter into the query so A yes","timestamp":"1662972060.0","comment_id":"666751","upvote_count":"32","poster":"H_E_Z"},{"comment_id":"1362888","poster":"Curious236","content":"Selected Answer: A\n\"During the development process, you need to import a sample of the data from the Order table.\". This approach meets this goal thanks to query folding, as after the filtering step, the native query sent to the data source will be modified to import only the rows that meet the condition.","timestamp":"1740729300.0","upvote_count":"1"},{"timestamp":"1739407080.0","poster":"ee0625a","comment_id":"1355903","content":"Selected Answer: A\nFiltering ensures that we select only a manageable number of rows such as 100, 000 that will help test what we want to analyze rather than having 100 million rows","upvote_count":"1"},{"content":"Selected Answer: B\nB. It stated \"From Power Query Editor, you import the table and then add a filter step to the query.\" Can't do this. If imported through and SQL and not the table, then it is probably a Yes.","poster":"kinlee","upvote_count":"1","comment_id":"1355549","timestamp":"1739353080.0"},{"comment_id":"1351692","upvote_count":"1","poster":"ee0625a","timestamp":"1738727520.0","content":"Selected Answer: A\nPower Query Editor allows filtering data at the query level, which means only the filtered data will be imported into Power BI, reducing the data load"},{"timestamp":"1738036980.0","content":"Selected Answer: A\nIn Power Query Editor, when you add a filter step to the query, only the filtered subset of data is loaded into the Power BI model. This approach allows you to work with a smaller sample of the data during development while maintaining the ability to later remove or adjust the filter for the full dataset.","upvote_count":"1","poster":"SilBri_830","comment_id":"1347720"},{"poster":"485307a","upvote_count":"1","timestamp":"1737733320.0","content":"Selected Answer: A\nA is correct same results chat gpt returned me","comment_id":"1346174"},{"upvote_count":"2","timestamp":"1737088980.0","comment_id":"1342010","poster":"RRconnect","content":"Selected Answer: B\nyou can select the required data in the sql query itself instead of importing all data and then apply filter in power query"},{"content":"Selected Answer: A\nB is correct as to minimize the data size while in the development phase","upvote_count":"1","timestamp":"1737013860.0","poster":"SUNNYDEPS","comment_id":"1341522"},{"poster":"SylUK","content":"Selected Answer: B\nB is the answer you can only apply the filter at the source through SQL for example no after loading the entire table.","comment_id":"1339208","upvote_count":"1","timestamp":"1736607060.0"},{"timestamp":"1736414760.0","poster":"Peggym","comment_id":"1338263","content":"Selected Answer: B\nDuring the development process, you need to import a sample of the data from the Order table.: if you choose A you import the whole table and then filter it, so you should adjust the sql statement","upvote_count":"1"},{"poster":"Odidepse","comment_id":"1337825","content":"Selected Answer: A\nCorrect answer is Yes , this solution works because adding a filter step in Power Query Editor limits the data imported, allowing you to work with a sample of the table during development.","upvote_count":"1","comments":[{"content":"In the question it is stated that the filter is applied after importing the data... it's too late. So the answer is B.","upvote_count":"1","timestamp":"1738669320.0","poster":"Pitxunet","comment_id":"1351318"}],"timestamp":"1736313240.0"},{"upvote_count":"1","comment_id":"1327126","poster":"YuanQingTan","content":"Selected Answer: A\nWhen the data is imported to power query, then filtered, query folding is possible, hence the filtering is done by the source before retrieving it back to power query.\n\nI tested this\n1) import a table from SQL to power query.\n2) saved the PBIX file.\n3) Checked the size of the PBIX file.\n4) Open power query and add a filter step to the table.\n5) Save the PBIX file.\n6) Checked the size of the PBIX file and noticed that the file size actually decreased.\n\nThis shows that only the required data is imported\nIf the entire data from the SQL is imported to power query, then only filtered by power query, i would imagine that the file size will remain unchanged.","timestamp":"1734314820.0"},{"content":"Selected Answer: A\nYes, that approach meets the goal. By importing the table into Power Query Editor and then applying a filter step to the query, you can create a manageable sample of the data from the large Order table. This method ensures you have a representative subset of the data to work with during development without needing to load all 100 million records","comment_id":"1321041","timestamp":"1733158920.0","upvote_count":"1","poster":"rules169"},{"comment_id":"1317272","upvote_count":"1","content":"Selected Answer: A\nThis solution meets the goal because adding a filter step in the Power Query Editor effectively limits the amount of data imported during the development process. This approach allows you to work with a sample of the data from the Order table while reducing resource usage and improving performance.","poster":"Mo_Suhail","timestamp":"1732497600.0"},{"content":"Selected Answer: B\nFiltering data once it has been imported could improve further calculations, but data has been already imported..... so I don't think a DAX expression would prevent the entire table import into the model","poster":"jaume","upvote_count":"1","timestamp":"1731926340.0","comment_id":"1313944"},{"poster":"jaume","comment_id":"1313943","content":"Selected Answer: B\nIn the solution it's stated \"...you import the table and then add a filter step...\" so all data is already imported into the model.....once again questions in these test makes me feel they are not testing PBI knowledge but our understanding of the text.\nI would vote for B here because my understanding here is we haven imported entire table in the first step of the query, filter should have been applied BEFORE importing that data (when setting the connection to SQL table by using a WHERE)","upvote_count":"1","timestamp":"1731926220.0"},{"upvote_count":"1","comment_id":"1308678","timestamp":"1731056220.0","content":"Selected Answer: A\nWhen you import a table and apply a filter in Power Query, only the filtered (sample) data will be loaded into the Power BI data model.\nThis reduces the size of the data loaded during development and improves performance.","poster":"Mouche40"},{"content":"The statement says that \"you import the data and then add the filter step.\" So the answer is NO. If the filter was added before importing then YES.","timestamp":"1728280440.0","comments":[{"upvote_count":"1","poster":"Odidepse","content":"In Power BI, when you connect to a large table in Power Query, you aren’t bringing in all the data right away. Instead, you can apply filters in Power Query, and only the filtered data will be loaded into your report.\n\nSo, even if you first connect to the whole table and then add a filter, Power BI will only import the smaller, filtered dataset when you load it. Therefore, it’s fine to apply the filter after connecting, and the answer should be YES, the solution works.","comment_id":"1340110","timestamp":"1736818260.0"}],"comment_id":"1294044","upvote_count":"2","poster":"VladAbz"},{"poster":"rcaliandro","comment_id":"1267552","upvote_count":"1","content":"Selected Answer: B\nI agree it is NO 'cause the question asked to avoid importing data from the source so it should be filtered using a WHERE SQL Condition","timestamp":"1723882260.0"},{"comment_id":"1250173","upvote_count":"1","timestamp":"1721285220.0","poster":"ak0017","comments":[{"content":"In the exam, In this type of questions which is likely a yes or no answer, there is no option for you to 'review later' where you can go back to the question. Once you answer it, that is it, no turning back, unlike other type of questions such as hot spot , multiple choices, drag and drop type questions","poster":"Odidepse","comment_id":"1340111","upvote_count":"1","timestamp":"1736818560.0"},{"poster":"Banana2001","upvote_count":"1","comment_id":"1253261","content":"Hola, quiere decir que una vez que respondas la pregunta, no tienes derecho a volver a la pregunta para cambiar la respuesta.","timestamp":"1721679240.0"}],"content":"Hello Guys,\nCan you explain me this line. , once we start this section, we cannot go back?\n\"After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\"\nThanks"},{"poster":"Smyrol","comment_id":"1238114","content":"I think this is B as the question says:\n'During the development process, you need to import a sample of the data from the Order table.'\n\nso it means only a part must be imported - this is to be achieved by where clause.\nI mporting and filtering will still import all and then filter","upvote_count":"1","timestamp":"1719488220.0"},{"comment_id":"1202829","poster":"greenlever","timestamp":"1714168140.0","upvote_count":"1","content":"B is correct"},{"comment_id":"1172083","poster":"Giuditta","content":"Power Bi is not that smart. even if you have a step that filters data away, it will FIRST import all the data AND THEN apply the filter.\nyou must operate on the first step: import, so a query can do the magic here","timestamp":"1710281520.0","upvote_count":"1"},{"upvote_count":"4","timestamp":"1709115540.0","comment_id":"1161514","poster":"Dani_eL","content":"Selected Answer: B\nproposed solution states : Import THEN apply a filter --> meaning applying a filter on a 100miio records table -> valid ? hello no!"},{"poster":"Dani_eL","timestamp":"1708427220.0","content":"Selected Answer: B\nImporting 10millions+ and then adding a filter ???\nTo get a sample just use a Select Top N statement where N is the number of records you want to upload","comment_id":"1154649","upvote_count":"1"},{"upvote_count":"1","comments":[{"poster":"Elektrolite","comment_id":"1170943","content":"When you first import, it only selects the first few rows in the table, it doesn't load the whole table into memory","upvote_count":"1","timestamp":"1710154440.0"}],"content":"The answer is No because you firstly import the entire data source (that it takes time to load) and after that you apply a filter step in Power Query Editor.","timestamp":"1708097820.0","comment_id":"1152097","poster":"Florinuca"},{"upvote_count":"2","comment_id":"1145375","timestamp":"1707472500.0","poster":"Clemzy96","content":"The Answer should be A. Yes because the question simply asks if the solution works, its not asking for the most optimal one which would be to add a 'WHERE' clause in SQL before importing"},{"comments":[{"poster":"CookieMingkee","upvote_count":"1","content":"You might be referring to the Table View not the Power Query. The Table View displays only 1000 records.","timestamp":"1716245940.0","comment_id":"1214615"}],"timestamp":"1706477820.0","upvote_count":"1","poster":"CookieMingkee","content":"Selected Answer: B\nImporting without a filter will bring all the 100 million records before you apply a filter. Using the native query language with \"where\" clause will filter the data even before importing it into Power BI Desktop.","comment_id":"1134468"},{"poster":"SHENOOOO","content":"Selected Answer: B\nB is correct, if you are thinking to add a filter later after you load the data, then PowerBI is still Loading the whole table first before getting into the filter step. The appropriate action is to add a where section in the SQL Query.","comment_id":"1128882","upvote_count":"1","timestamp":"1705942380.0"},{"upvote_count":"1","comment_id":"1044913","content":"Selected Answer: B\nB is correct","poster":"Sessiz","timestamp":"1697456760.0"},{"comment_id":"1025484","poster":"bingomutant","content":"the question is ambiguous. The requirement is to import a SAMPLE to PowerBI. Not the whole database. However importing the whole database into PQE and THEN filtering so as to import a sample into Power BI seems to satisfy the question so answer is yes. Unfortunate phrasing .","upvote_count":"2","timestamp":"1696495800.0"},{"upvote_count":"5","content":"This was in the exam this week.","poster":"rainy_255","comment_id":"1024830","timestamp":"1696426620.0"},{"timestamp":"1696222140.0","poster":"ExamPage","comments":[{"content":"the question does not ask for efficiency. We are merely asked is the requirement met. whicch it is.","poster":"bingomutant","upvote_count":"1","timestamp":"1696495500.0","comment_id":"1025474"}],"content":"Selected Answer: B\nB. No\n\nImporting the entire table and then adding a filter step in Power Query Editor would not be an efficient solution for working with a large table with more than 100 million records. This approach would still load all the data into memory during the import process, potentially causing performance issues and consuming a significant amount of system resources. A more efficient approach would be to apply the filter at the source, either by using a SQL query to retrieve a sample of the data or by configuring the data source options to import only a subset of the records that meet your criteria.","comment_id":"1022808","upvote_count":"1"},{"poster":"RicoPallazzo7","content":"There is query folding that can filter at the soruce the data. It must be said that even without it the goal is respected, we have a sample, not optimized but we have it","timestamp":"1695299100.0","comment_id":"1013061","upvote_count":"1"},{"upvote_count":"1","timestamp":"1693891080.0","poster":"Igetmyrole","comments":[],"content":"B is the answer. \nImporting the entire table and then adding a filter step in Power Query Editor does not meet the goal of importing a sample of the data. This approach imports the entire table into Power BI, which can be inefficient and time consuming, especially when dealing with a large table with more than 100 million records. It doesn't reduce the amount of data imported; it only filters the data after it has been loaded into Power BI.","comment_id":"999072"},{"upvote_count":"6","comment_id":"964553","comments":[{"poster":"Kalyso","content":"I answered the same.","timestamp":"1725912960.0","comment_id":"1281232","upvote_count":"1"}],"poster":"Ravisha27","content":"Selected Answer: A\nI was thinking of option B as correct answer. but upon reading the question again, it says 'does it meet the goal' I switched my answer to option A. it does meet the goal. they haven't mentioned anything on optimization or query folding.","timestamp":"1690450500.0"},{"poster":"miro26","timestamp":"1690184580.0","comment_id":"961284","content":"Correct Answer A","upvote_count":"1"},{"upvote_count":"1","comment_id":"957729","content":"Selected Answer: B\nThe answer is No","timestamp":"1689865980.0","poster":"Bnxyl"},{"timestamp":"1688397420.0","content":"I think YES, because In Power Query, the load preview by default is 1000 row.","upvote_count":"3","comments":[{"comments":[{"timestamp":"1699432560.0","upvote_count":"1","poster":"TrustMyAnswers","content":"But the question clearly states that you will apply the filter.","comment_id":"1065430"}],"content":"It's just a preview, whole data will be loaded if you don't apply filters","comment_id":"960696","poster":"Maniula","upvote_count":"1","timestamp":"1690134300.0"}],"poster":"JJMC5544","comment_id":"941971"},{"upvote_count":"2","timestamp":"1686941760.0","comment_id":"925487","content":"agree to disagree. im going with A, yes","poster":"JonDave"},{"upvote_count":"1","content":"used to do the explanation under B option, using a where statement for instance.","comment_id":"911284","timestamp":"1685537340.0","poster":"tke44"},{"upvote_count":"2","timestamp":"1684076640.0","content":"The question is whether it meets the requirement and not if it's the most optimised way of requirement so I option A is correct because while it might not be the most optimised way, it does meet the requirement.","comment_id":"897631","poster":"KARELA"},{"timestamp":"1683634920.0","poster":"Andrew_Chen","upvote_count":"8","content":"I tried three ways. 1. Load the whole table, it got the largest file size. 2. Use the Power Query Editor, and import the filtered data. 3. Use a WHERE clause and import the data. No.2 and No.3 got exactly same file size, so I think it's a YES here.","comment_id":"893084"},{"poster":"mirzotti","timestamp":"1683538560.0","comment_id":"891972","content":"Selected Answer: A\nRead the question carefully. It states '... you need to IMPORT a sample of the data...' . 'Does this meet the goal?' Of course it does. The data is only imported in the model after the last step is implemented. For sure, the query would be faster with an SQL statement but that was not the question, was it?","upvote_count":"6"},{"upvote_count":"2","timestamp":"1682426340.0","poster":"vivekmani2021","content":"Selected Answer: A\nPower query will use query folding when the source is a SQL DB , this will only import the filtered rows and not the entire table","comment_id":"880380"},{"comment_id":"880367","content":"Correct Answer is YES , Power query is capable of query folding when the source is a SQL database . So in this case adding a date filter is equivalent of writing a native SQL query with a Where clause , This will only import the filtered rows and not the entire table","upvote_count":"2","timestamp":"1682426100.0","poster":"vivekmani2021"},{"upvote_count":"2","poster":"wellingtonluis","comment_id":"878746","content":"I agree. Correct answer is B - No.\npay attention \"you need to import a sample of the data from the Order table\", Not import all data and see a sample.","timestamp":"1682276880.0"},{"poster":"Newb007","comment_id":"868415","upvote_count":"2","content":"DOES THIS MEET THE GOAL? YES is it best practice/easiest? maybe not but pay attention to the question. these multi solution type of questions on MS exams are tricky like this.","timestamp":"1681306800.0"},{"poster":"RazaTheLegend","content":"Selected Answer: A\nLet me end this discussion, A is the correct answer as some queries can be folded note that this is visible in the editor window under view native query if this option is greyed out it is not possible.\n\nhttps://learn.microsoft.com/en-us/power-query/power-query-folding\n\nNow how to determine whether it is possible to do folding here look in the same link, it talks about sources that support folding where relational databases which an sql Server is. Thus meaning this query will fold and therefore won't take the data but filter at the source. \nsince SQL database is a relational database","upvote_count":"9","timestamp":"1681287780.0","comment_id":"868053"},{"upvote_count":"7","poster":"SanaCanada","timestamp":"1680524760.0","comments":[{"timestamp":"1682417460.0","content":"I am discussing this further: query folding + it does meet the goal, which was the question","upvote_count":"3","poster":"semauni","comment_id":"880207"},{"content":"Nope your answer is wrong, Power query will not import the entire data if the source is SQL as it will use query folding by default . However if the source was a CSV or something else it will import then entire data and then apply the filter","timestamp":"1682426280.0","comment_id":"880376","upvote_count":"4","poster":"vivekmani2021"}],"content":"Selected Answer: B\nCorrect Answer B\n\nImporting the entire table and then adding a filter step in Power Query Editor may not be an efficient solution because it will still import all the data from the table before applying the filter. Instead, a better solution would be to write a SQL query that selects a sample of the data from the Order table and then import that query result into Power BI. This approach will ensure that only the required data is imported into Power BI, improving performance and reducing the amount of memory needed to process the data.\n\nNo confusion, and no need to discuss further","comment_id":"859895"},{"upvote_count":"4","poster":"KhaledGH","content":"Selected Answer: A\nI agree with A, query folding","comment_id":"859713","timestamp":"1680512880.0"},{"content":"Selected Answer: A\nA - YES.\nI just tried it and caught the query in profiler. The query with the predicate defined in the step \"flies\" to the SQL server.","upvote_count":"3","poster":"jiriz","timestamp":"1679855520.0","comment_id":"851394"},{"timestamp":"1679167440.0","content":"Chat GPT says:\n\nYes, importing the table using Power Query Editor and adding a filter step to the query can help in importing a sample of the data from the Order table.\n\nBy adding a filter step, you can apply certain conditions to filter out a subset of the data that you want to import. This can be useful when dealing with large tables, as it allows you to limit the amount of data being imported and processed, which can help improve performance.\n\nHowever, it is important to note that depending on the size of the sample you are importing, even with filtering, it may still take a long time to import the data. It may be helpful to consider using other techniques such as data sampling or partitioning to optimize the import process further.","upvote_count":"2","poster":"TalktomeGoOse","comment_id":"843098"},{"poster":"Jae17","timestamp":"1678363440.0","content":"Answer should be A \nImporting the table from SQL Server using Power Query Editor and then adding a filter step to the query will allow you to import a sample of the data from the Order table. By applying a filter step, you can choose to import only a subset of the records based on specific criteria. This can help reduce the amount of data that needs to be loaded into Power BI and improve query performance during development.","comment_id":"833927","upvote_count":"2"},{"poster":"SanaCanada","comments":[{"timestamp":"1702480260.0","poster":"Alscoran","comment_id":"1095580","upvote_count":"1","content":"Why does Sana have two answers ???"}],"timestamp":"1678341240.0","comment_id":"833628","upvote_count":"3","content":"Correct Answer A\n\nYes, when you use Power Query Editor to import a table with a filter in Power BI, only the filtered data is imported into the data model.\n\nThe Power Query Editor is used to transform and shape the data before it is loaded into the data model. When you apply a filter step to the query in Power Query Editor, it will only select the records that meet the filter criteria, and exclude the records that do not. This filtered data is then loaded into the data model."},{"upvote_count":"1","comment_id":"829790","poster":"Neilsy","timestamp":"1678008120.0","content":"if you apply the filter then click Close & Apply to load the data then A, (assuming the filter could be incorporated into the sql select statement)...??"},{"content":"Selected Answer: B\nanswer is B, This is because we are first importing all the data in then we are filtering the data","upvote_count":"2","comment_id":"828501","timestamp":"1677893760.0","poster":"srikanth923"},{"timestamp":"1673804760.0","poster":"HemantGorle","upvote_count":"5","comment_id":"776888","content":"Selected Answer: A\nQuery folding will take place and there would be limited data"},{"comment_id":"767110","content":"Selected Answer: B\nB Is correct","upvote_count":"2","poster":"svg10gh","timestamp":"1672958640.0"},{"poster":"MBA_1990","timestamp":"1672242000.0","content":"Selected Answer: B\nB is correct\nA will load all the table before filtering data","comment_id":"760046","upvote_count":"4"},{"content":"Selected Answer: B\nA loads the entire table depending on the type of power bi access the user has. So it should be sorted out at the source.","comment_id":"755188","timestamp":"1671918720.0","poster":"jsking","upvote_count":"3"},{"poster":"Goksha","timestamp":"1671603780.0","upvote_count":"1","content":"I agree with the answer. Ans is No.\nBecause it will load entire data using importing the and by applying, so we have to use where before loading that into powerbi","comment_id":"751927"},{"poster":"thanhtran7","timestamp":"1671203040.0","content":"A. Find the discussion from Q18, DA-100","comment_id":"747318","upvote_count":"5"},{"content":"B is correct","comment_id":"740508","timestamp":"1670626680.0","poster":"csillag","upvote_count":"1"},{"poster":"Patrick666","upvote_count":"1","content":"I agree with the answer. \nB. No","comment_id":"740100","timestamp":"1670589720.0"},{"upvote_count":"2","comment_id":"738576","content":"I agree with B. We should use a SQL statement to get a sample of data","timestamp":"1670469180.0","poster":"slash_nyk"},{"upvote_count":"3","comment_id":"730688","timestamp":"1669743900.0","poster":"Hoeishetmogelijk","content":"Selected Answer: B\nB is correct"},{"timestamp":"1669545720.0","upvote_count":"4","content":"I think the question was written wrongly.. the question should be \"what is best practice\" or something like that instead of \"Does this meet the goal\". would take a life to refresh but yes meet the goal.","comment_id":"728133","poster":"Shiiton"},{"comments":[{"comment_id":"761396","poster":"pr1812","content":"IF you apply complex logic after filtering in Power Query then for those new steps query folding will not work but for apply filter step you will still be able to view the native query.","timestamp":"1672341000.0","upvote_count":"1"}],"content":"Selected Answer: B\nWe should add the filter directly to the where clause and not rely on query folding for filtering. This is because that query folding is not always guaranteed. For example, if we perform complex logics after filtering in Power Query that are not supported in SQL queries, query folding might not happen. It is a good practice to add the filter directly to the where clause to guarantee that only required data is fetched.","timestamp":"1669401360.0","comment_id":"727022","upvote_count":"4","poster":"AzureJobsTillRetire"},{"upvote_count":"4","timestamp":"1669068720.0","comment_id":"723966","poster":"Hoeishetmogelijk","content":"Selected Answer: B\nNo, this would first import al the 100 million rows and after that filter the greatest part out.\nSo the answer is B. No"},{"upvote_count":"4","timestamp":"1668939960.0","poster":"HemantGorle","comment_id":"722529","content":"Selected Answer: A\nA is correct (due to query folding filters will be passed to source) and it meets our goal."},{"comment_id":"722122","content":"Correct answer\nB) No","timestamp":"1668877260.0","upvote_count":"2","poster":"powerbibuddy"},{"content":"The \"then apply a filter\" part should give it away that the whole table is loaded (i.e. no query folding is done). Second, it says you need to IMPORT a SAMPLE. It doesn't say import the table and extract a sample. While there is some ambiguity, the best answer is B.","timestamp":"1668810600.0","comment_id":"721606","poster":"scotchtapebunny","upvote_count":"2"},{"comment_id":"720427","poster":"rivecin637","upvote_count":"6","timestamp":"1668686100.0","content":"Selected Answer: A\nIT IS YES, QUERY FOLDING IS HAPPENING\nsee : https://learn.microsoft.com/en-us/power-query/power-query-folding#transformations-that-can-achieve-folding"},{"comment_id":"718723","content":"Selected Answer: B\nB is the answer","upvote_count":"3","timestamp":"1668516060.0","poster":"Traineeveneficus"},{"content":"To answer the question you need to ask yourself: \"is query folding happening\"? If yes, then the correct answer is \"A: Yes\".\nI do not see a reason why \"query folding\" is not happening, and that's because not only we are importing from a structured data source (Microsoft SQL Server, which support \"query folding\") but we are also applying a simple filter (which will be easly translated into a native query).\nPlease note: even if we are using a native SQL query (i.e.: SELECT * FROM table), we can still enable \"query folding\" (source: Guy in a Cube: https://www.youtube.com/watch?v=8hjdOCni_ZY or if you prefer an official Microsoft source: https://learn.microsoft.com/en-us/power-query/native-query-folding)\nSource for understanding \"query folding\": https://learn.microsoft.com/en-us/power-query/query-folding-basics","comment_id":"712573","poster":"Tiz88","timestamp":"1667760360.0","upvote_count":"8"},{"poster":"shakes103","content":"The question here is: Does this meet the goal?\nThe answer is A: YES. Why?\nBecause it can be done using native query in the Power Query.\nRead from doc: \"Power Query enables you to specify your native database query in a text box under Advanced options when connecting to a database. In the example below, you'll import data from a SQL Server database using a native database query entered in the SQL statement text box. The procedure is similar in all other databases with native database query that Power Query supports.\"","upvote_count":"4","timestamp":"1667566080.0","comment_id":"711144"},{"content":"A is correct, use of query folding","comment_id":"711094","timestamp":"1667562600.0","poster":"JukMar","upvote_count":"2"},{"poster":"velvarga","timestamp":"1667512260.0","content":"Selected Answer: B\nadd WHERE clause to the SQL statement, so I would say B","upvote_count":"3","comment_id":"710807"},{"comment_id":"707089","poster":"Lewiasskick","upvote_count":"2","timestamp":"1667034540.0","content":"Selected Answer: B\nFirst of all, the query from the database is a native query, the following as query folding will not take place for a native query, it must be B\nhttps://learn.microsoft.com/en-us/power-query/native-query-folding"},{"poster":"xxfangxx","timestamp":"1666338360.0","comment_id":"700628","content":"Selected Answer: B\nAnswer is B, because you wanna import 'SAMPLE' data, not import the whole data then filter it.","upvote_count":"8"},{"comment_id":"700355","content":"B is correct","poster":"huizi","timestamp":"1666304880.0","upvote_count":"2"},{"upvote_count":"4","poster":"Mizaan","content":"Selected Answer: B\nQuery folding will push the filter to the data source","timestamp":"1666181520.0","comment_id":"699001"},{"content":"Selected Answer: B\nB is correct the filter is added after the import. (And it wouldn't be a sample)","poster":"Manzy2599","comment_id":"694356","timestamp":"1665704280.0","upvote_count":"6"},{"timestamp":"1665330600.0","content":"Selected Answer: A\nAnswer A is correct","poster":"centrumadresowe","comment_id":"690312","upvote_count":"2"},{"timestamp":"1665091020.0","content":"answer is A. It will use query folding for the filtering of x amount of rows","comment_id":"688099","poster":"lukelin08","upvote_count":"1"},{"content":"Selected Answer: B\nFilter is applied after the import so B","comment_id":"685795","timestamp":"1664831760.0","poster":"Manzy2599","upvote_count":"2"},{"upvote_count":"2","comment_id":"678092","poster":"babinaprad","content":"Which one is the correct answer is it A or B. I think B?","timestamp":"1664041020.0"},{"upvote_count":"3","poster":"RichardOgoma","comment_id":"677231","content":"Selected Answer: B\nThe best practice is to pass the processing workload to the data source. Create a view with a where clause satisfying your requirements.","timestamp":"1663942260.0"},{"content":"Selected Answer: A\nQuery folding takes place, A meets the conditions","comment_id":"671453","upvote_count":"9","timestamp":"1663413420.0","poster":"fdsdfgxcvbdsfhshfg"},{"poster":"ecwang","upvote_count":"3","comment_id":"671222","timestamp":"1663384440.0","content":"Anser A is correct."},{"content":"Anszer is correct, you need to send an sql query to the server to get a sample","comment_id":"669086","timestamp":"1663164180.0","upvote_count":"1","poster":"hmax56"},{"upvote_count":"1","poster":"learnazureportal","content":"Answer is correct.","timestamp":"1663097880.0","comment_id":"668370"}],"choices":{"A":"Yes","B":"No"},"answer":"B","answer_ET":"B"},{"id":"N4ZBiGhqOh0nE3x15YVI","answer_description":"","question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are modeling data by using Microsoft Power BI. Part of the data model is a large Microsoft SQL Server table named Order that has more than 100 million records.\nDuring the development process, you need to import a sample of the data from the Order table.\nSolution: You write a DAX expression that uses the FILTER function.\nDoes this meet the goal?","choices":{"B":"No","A":"Yes"},"answer_images":[],"question_id":83,"url":"https://www.examtopics.com/discussions/microsoft/view/80003-exam-pl-300-topic-2-question-17-discussion/","exam_id":116,"topic":"2","discussion":[{"timestamp":"1666900200.0","content":"Also, common sense, we are trying to import a sample of the data meaning that the data is not yet on Power BI, so where are we going to filter with DAX? On the SQL server? That is not possible hence the answer B is correct.","upvote_count":"15","poster":"iccent2","comment_id":"705892"},{"content":"answer is NO, we need to add a WHERE clause to the SQL statement.","timestamp":"1667562720.0","upvote_count":"13","comment_id":"711096","poster":"JukMar"},{"timestamp":"1738728000.0","content":"Selected Answer: B\nThe FILTER function in DAX operates after data is already loaded into Power BI.\nSince the Order table has over 100 million records, using DAX filtering does not reduce the dataset size before import, meaning all data would still be loaded into memory, slowing down performance.","comment_id":"1351695","upvote_count":"1","poster":"ee0625a"},{"content":"Selected Answer: B\nNo, this solution does not meet the goal. The FILTER function in DAX is used for filtering data within the context of a DAX expression, usually for creating calculated columns, measures, or tables within a Power BI model. It does not help in importing a subset of data from the SQL Server table into Power BI.\n\nTo import a sample of the data from a large SQL Server table during the development process, you should use Power Query to apply a filter at the query level. This way, only the filtered subset of data is imported into Power BI, making it more manageable and efficient.","poster":"rules169","comment_id":"1321042","upvote_count":"1","timestamp":"1733159040.0"},{"timestamp":"1723882320.0","poster":"rcaliandro","comment_id":"1267553","content":"Selected Answer: B\nAgain, NO because we have to filter by using a WHERE condition","upvote_count":"2"},{"poster":"Saluk_DE","content":"Selected Answer: B\nDAX is applicable in the last step only, so it is not useful for preventing a fully load. answer must be NO","upvote_count":"4","timestamp":"1702418640.0","comment_id":"1094994"},{"poster":"rainy_255","timestamp":"1696426620.0","comment_id":"1024829","content":"This was in the exam this week.","upvote_count":"2"},{"comment_id":"999078","poster":"Igetmyrole","upvote_count":"3","timestamp":"1693891380.0","content":"The answer is B.\nWriting a DAX expression using the FILTER function alone does not meet the goal of importing a sample of the data into Power BI. The FILTER function in DAX is used for filtering data within a calculated table or a measure, but it does not control the amount of data imported during the data loading process.\nTo import a sample of the data efficiently, you should use Power Query to apply filters during the data loading process, so only the relevant subset of data is imported."},{"upvote_count":"2","comment_id":"986515","content":"Selected Answer: B\nB because You can write dax in power bi desktop so it's already load","poster":"mustafaalhnuty","timestamp":"1692622500.0"},{"timestamp":"1685550300.0","comment_id":"911414","upvote_count":"1","content":"No, sql statement only can solve it","poster":"tke44"},{"timestamp":"1683013680.0","comment_id":"887122","upvote_count":"2","poster":"Shalaleh","content":"Selected Answer: B\nWe cannot write DAX expression at this point! DAX expression is in report part."},{"upvote_count":"3","poster":"RazaTheLegend","comment_id":"868047","content":"Selected Answer: B\nThe correct answer is B. This is because all of the data is first loaded into Power BI before being filtered.","timestamp":"1681287180.0"},{"timestamp":"1677894180.0","content":"Selected Answer: B\nThe correct answer is B. This is because all of the data is first loaded into Power BI before being filtered.","comment_id":"828502","upvote_count":"2","poster":"srikanth923"},{"upvote_count":"1","poster":"yordiye","timestamp":"1673665680.0","content":"B or No because the Data is already loaded. It is good to select the columns we need at source level .eg create view . Other wise we can bring to power query and filter is before we load it . He query folding will send the query back to the data source","comment_id":"775056"},{"poster":"samad1234","comment_id":"698121","upvote_count":"2","content":"The correct answer is B","timestamp":"1666089420.0"},{"content":"Selected Answer: B\nB is correct","upvote_count":"5","timestamp":"1665091080.0","poster":"lukelin08","comment_id":"688102"},{"content":"Answer is Correct.","comment_id":"668371","timestamp":"1663097940.0","upvote_count":"1","poster":"learnazureportal"},{"timestamp":"1662280680.0","comments":[{"comments":[{"comment_id":"699006","timestamp":"1666181700.0","upvote_count":"2","poster":"Mizaan","content":"Agree with MilouSluijter. If you apply filter at DAX stage, the data is already in the model"}],"poster":"MilouSluijter","upvote_count":"5","comment_id":"661017","timestamp":"1662454140.0","content":"Yes but in that case you import all data from the order table while the question states you only need to import a sample. So B is correct"}],"content":"You can write a DAX expression after you import the data.","comment_id":"659094","poster":"simplex06","upvote_count":"1"}],"answer":"B","unix_timestamp":1662280680,"question_images":[],"answers_community":["B (100%)"],"timestamp":"2022-09-04 10:38:00","answer_ET":"B","isMC":true},{"id":"mx7GEzA4RAd8Tm471KzP","answers_community":["A (100%)"],"choices":{"B":"No","A":"Yes"},"answer":"A","answer_ET":"A","discussion":[{"timestamp":"1665091140.0","upvote_count":"18","comment_id":"688103","poster":"lukelin08","content":"Selected Answer: A\nA is correct"},{"comment_id":"1073223","poster":"kimii1993","upvote_count":"9","timestamp":"1700218500.0","content":"Selected Answer: A\nThis was on the exam today. Passed with 917/1000\n- I said: A. Yes"},{"timestamp":"1731926520.0","comment_id":"1313947","upvote_count":"1","poster":"jaume","content":"Selected Answer: A\nfinally, we are filtering the data in the initial step, when connecting data model to the SQL database by using the WHERE clause.\nThis will filter data when connection is set and it will result in a smaller (than the entire table) dataset being imported into our data model\nMy vote here is for solution A"},{"upvote_count":"1","poster":"Raiist","timestamp":"1731503280.0","comment_id":"1311264","content":"Selected Answer: A\nFor me A"},{"timestamp":"1723882380.0","comment_id":"1267554","poster":"rcaliandro","content":"Selected Answer: A\nA. Yes - In this case we filter from the import the data","upvote_count":"1"},{"comments":[{"comment_id":"1256364","timestamp":"1722098940.0","upvote_count":"3","comments":[{"poster":"Seda_","timestamp":"1722098940.0","content":"A is correct.","upvote_count":"1","comment_id":"1256366"}],"content":"NO. If you import the entire table, you will increase memory usage and may experience performance issues. Applying a filter only affects the visibility of the data, while still keeping the entire table in memory. Therefore, a more effective method is to sample or filter directly on the data source.","poster":"Seda_"}],"poster":"greenlever","upvote_count":"1","content":"B is correct","comment_id":"1202828","timestamp":"1714168020.0"},{"poster":"rainy_255","content":"This was in the exam this week.","comment_id":"1024828","upvote_count":"4","timestamp":"1696426560.0"},{"content":"The answer is A.\nAdding a WHERE clause to the SQL statement used to retrieve data from the Microsoft SQL Serve table named Order can meet the goal of importing a sample of the data into Power BI.","poster":"Igetmyrole","upvote_count":"1","timestamp":"1693891620.0","comment_id":"999079"},{"comment_id":"911420","upvote_count":"1","poster":"tke44","timestamp":"1685550540.0","content":"A is correct"},{"timestamp":"1681287180.0","content":"Selected Answer: A\nThe correct answer is A. This means that the data is being filtered at the source database itself, using a SQL query with a WHERE clause.","poster":"RazaTheLegend","comment_id":"868048","upvote_count":"1"},{"comment_id":"828503","upvote_count":"3","poster":"srikanth923","timestamp":"1677894300.0","content":"Selected Answer: A\nThe correct answer is A. This means that the data is being filtered at the source database itself, using a SQL query with a WHERE clause."},{"content":"Selected Answer: A\nA is correct","poster":"AlexYang_","timestamp":"1671221520.0","comment_id":"747554","upvote_count":"2"},{"comment_id":"730609","poster":"NuriaIzard","upvote_count":"1","timestamp":"1669738500.0","content":"As the basis is Microsoft SQL (or OData Feed, for that matter), it is actually possible to achieve the goal without a where clause, since this clause will be added by the Power Query enginge. So I think that indeed, query folding is possible and therefore, the answer should be Yes"},{"poster":"samad1234","comment_id":"698122","timestamp":"1666089420.0","upvote_count":"2","content":"Ais the correct Answer"},{"comments":[{"content":"Yes better to use query folding I think. You are talking about indexing the data source right ?","poster":"yordiye","timestamp":"1673665800.0","comment_id":"775057","upvote_count":"1"},{"upvote_count":"3","comments":[{"upvote_count":"1","comment_id":"691149","poster":"Dovoto","timestamp":"1665406560.0","content":"But these is no WHERE clause in your statement. It would have been easier if the TOP 1000 was mentioned.","comments":[{"timestamp":"1669117140.0","comment_id":"724281","upvote_count":"2","content":"In practice you would most probably take a sample of the most recently created rows, using a WHERE clause and filtering on a date column.","poster":"Hoeishetmogelijk"}]}],"content":"You are over thinking it. Its asking for a sample of the data in a table with more than 100 million rows. So a simple select statement like the below would return a sample data set of 1000 rows from the Order table. \nSelect TOP (1000) *\nFrom [dbo].[Order]","comment_id":"688104","timestamp":"1665091320.0","poster":"lukelin08"}],"content":"Selected Answer: A\nIn my opinion the goal can only be met if you for example know the Id of an item and then filter for this. So the goal can be met but it an ugly solution.","timestamp":"1663697100.0","upvote_count":"4","comment_id":"674417","poster":"rashjan"}],"url":"https://www.examtopics.com/discussions/microsoft/view/82973-exam-pl-300-topic-2-question-18-discussion/","question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are modeling data by using Microsoft Power BI. Part of the data model is a large Microsoft SQL Server table named Order that has more than 100 million records.\nDuring the development process, you need to import a sample of the data from the Order table.\nSolution: You add a WHERE clause to the SQL statement.\nDoes this meet the goal?","answer_description":"","question_images":[],"question_id":84,"answer_images":[],"isMC":true,"topic":"2","unix_timestamp":1663697100,"exam_id":116,"timestamp":"2022-09-20 20:05:00"},{"id":"vCCGdgNNGCroOtvbvNqo","question_text":"DRAG DROP -\nYou are preparing a financial report in Power BI.\nYou connect to the data stored in a Microsoft Excel spreadsheet by using Power Query Editor as shown in the following exhibit.\n//IMG//\n\nYou need to prepare the data to support the following:\n✑ Visualizations that include all measures in the data over time\n✑ Year-over-year calculations for all the measures\nWhich four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.\nSelect and Place:\n//IMG//","question_id":85,"question_images":["https://www.examtopics.com/assets/media/exam-media/04331/0009800001.jpg","https://www.examtopics.com/assets/media/exam-media/04331/0009800004.jpg"],"discussion":[{"comment_id":"666628","comments":[{"timestamp":"1740906840.0","upvote_count":"1","poster":"0002110","content":"Yes ! this is correct way","comment_id":"1363875"},{"content":"I have tried it in Power BI and it's correct ! the other answer provided is less intuitive because at the end you'll have the measure (year) column as text, and the \"attribut\" column (where there are revenue, overheads etc.) will not be renamed","upvote_count":"1","comment_id":"1340888","poster":"ferben","timestamp":"1736945580.0"},{"poster":"Rasaqh","content":"This makes sense instead thier answers. \n\nTheir answers would have also made sense if there is inclusion of another step which should 'Rename Attribute to Measure after the renaming of \"Measure \" to \"Year\" . \n\nThe entire steps would become:\n1. Transpose \n2. Use first row as heade\n3. Unpivot all columns other than \"Measure\"\n4. Rename \"Measure \" to \"Year\"\n5. Rename \"Attribute\" to \"Measure\"","timestamp":"1697361060.0","comment_id":"1044013","upvote_count":"9"},{"timestamp":"1735490340.0","content":"Where is Transpose?","comment_id":"1333603","poster":"Srilatha_B","upvote_count":"1"},{"timestamp":"1732102080.0","poster":"DexTorao","upvote_count":"1","content":"i agree","comment_id":"1315215"},{"content":"in this method we can plot the graph but we cant about calculate year on year growth for revenue since all the measures are available in the single column.","timestamp":"1714892580.0","upvote_count":"4","comment_id":"1206795","poster":"Kaarthi_2788"},{"comment_id":"809315","timestamp":"1676453940.0","comments":[{"upvote_count":"1","timestamp":"1682417820.0","comments":[{"timestamp":"1682418120.0","poster":"semauni","comment_id":"880217","comments":[{"poster":"prikha16","timestamp":"1688113380.0","comment_id":"938921","upvote_count":"2","content":"If we need to have visuals that show all measures over time, it would be better to have the measures in separate columns"}],"content":"I stand corrected, you want a year-to-year calculation for all the measures. That means that you need to keep the measures and the years intact. I think both is possible","upvote_count":"4"}],"poster":"semauni","comment_id":"880216","content":"Transpose swaps rows and columns, which is not at all what you want.\nSource: https://learn.microsoft.com/en-us/power-query/transpose-table"}],"upvote_count":"2","content":"Why shouldn't? The titles should be on the top.","poster":"Taras_Navakhatska"},{"timestamp":"1671593820.0","comments":[{"comment_id":"751918","poster":"AzureJobsTillRetire","content":"Please disregard. long hours studying and I had brain frozen. My apologies.","timestamp":"1671602040.0","upvote_count":"7"}],"comment_id":"751839","poster":"AzureJobsTillRetire","content":"Hi guys, I am wondering how you can do the second step - Unpivot all columns other than \"Measure\"? There is no column called \"Measure\" unless you transpose or unpivot it. This is a much more serious problem than the problem with the last step in the transpose solution - being the failure of change data type of \"Year\" to date.","upvote_count":"3"},{"comment_id":"745124","poster":"marcionlinerj","content":"I agree.\nUsing the transpose solution, when changing the data type of the Year column to date, the date is incorrectly transformed. It doesn't happen when using this solution.","timestamp":"1671025500.0","upvote_count":"3"},{"comment_id":"673406","content":"I have tested this example and I agree that there is no need to transpose. As for the last forth step it should be chosen only because the task requires to indicate 4 steps \"Which four actions should you perform in sequence? \"","poster":"roal","timestamp":"1663600800.0","upvote_count":"3"},{"content":"Agreed!","comment_id":"674823","poster":"olajor","timestamp":"1663738920.0","upvote_count":"3"},{"comment_id":"698170","poster":"lugesy","timestamp":"1666092780.0","upvote_count":"4","content":"https://learn.microsoft.com/en-us/power-query/unpivot-column\nYour answer is consistent with the explanation in the link."},{"content":"For whom still has confuse about this Answer, Test by yourself, make a Excel table and import it to PowerBI, you will see how this Answer works so well","comment_id":"745995","poster":"Xikta","upvote_count":"2","timestamp":"1671103620.0"},{"content":"Its really easy to replicate these questions in Power BI, which is also the point of the exam. \n\nI can confirm that the above answer is correct by simply recreating the steps using sample data.","upvote_count":"6","poster":"NotMeAnyWay","comment_id":"703919","timestamp":"1666705800.0"},{"content":"the resulting table has \"measure\" as its column name in first column because this process does not rename \"measure\"","comment_id":"752725","upvote_count":"1","timestamp":"1671653820.0","poster":"charles879987"},{"content":"Tested and confirmed. ThariCD method is the answer.\nYou can use the transpose also but that takes like 5 steps and not 4 steps.","upvote_count":"2","timestamp":"1672348560.0","poster":"iccent2","comment_id":"761498"},{"upvote_count":"1","comment_id":"724285","poster":"Hoeishetmogelijk","timestamp":"1669117320.0","content":"I agree completely. These steps lead to the desired result. Transposing doesn't."},{"poster":"SajjR","upvote_count":"4","comments":[{"upvote_count":"4","timestamp":"1672258260.0","poster":"cglax","content":"Your first method is correct. Revenue and Overhead are both measures, therefor should be under the Measures column. There should be one column for dollar value, not three. The jorv method is a pivoted view of the data. Thari method is the raw data view (we want this in power query). In a report, we can then create a matrix to show the jorv view.","comment_id":"760287"}],"comment_id":"759964","content":"Actually tried this method and it moves each measure to a row i.e. \nRevenue - 2016 - 0.5\nRevenue - 2017 - 0.6\nOverheads - 2016 - 0.11\nOverheads - 2017 - 0.33\n\n@jorv86 method seems to work perfectly i.e.\nYear - Revenue - Overheads - Cost\n2016 - 0.5 - 0.11 - 0.2","timestamp":"1672238760.0"},{"upvote_count":"1","content":"Agreed!","comment_id":"1040014","poster":"WeiKitLim","timestamp":"1696986480.0"},{"comment_id":"949504","content":"The answer is not wrong. There are two different approaches to solving this question imho.","poster":"Time2excel","comments":[{"upvote_count":"1","timestamp":"1696004100.0","poster":"TigerTienie","comment_id":"1020928","content":"You are 100% right, there is more than one way to solve problem. Tried the steps in answer and it works 100%.\nThariCD: The suggested steps will also work except Measure column will have Revenue, Overhead and Cost of goods in it...But result will work in Matrix."},{"content":"The answer given is demonstrably wrong. If nothing else, when you unpivot all the columns other than Measure, you would NEVER then rename the *Measure* column to year. You'd rename the *Attribute* column as year.\n\nSo regardless of what the right answer is (I'm still wrestling with that), the given answer of Transpose, Use Headers, Unpivot cols other than Measure, rename the Measure column as Year cannot be correct.","upvote_count":"1","comments":[{"content":"I gotta eat my words. I spent some time with this cuz it was on my exam today. I ended up working out the same answer as the site has... Still no idea if my take is right, but you can disregard what I said above, at the very least.","upvote_count":"1","timestamp":"1695412140.0","comment_id":"1014452","poster":"itenginerd"}],"poster":"itenginerd","comment_id":"1014182","timestamp":"1695391440.0"}],"timestamp":"1689140700.0","upvote_count":"5"},{"content":"In step 1, the year is converted to header so you can no longer use it as value so you can no longer use it as a variable (e..g plot it on x axis - which can only take one variable), because the each year number itself is a dimension.","timestamp":"1700979000.0","comment_id":"1080505","poster":"cokimon","upvote_count":"1"},{"upvote_count":"3","timestamp":"1675019820.0","poster":"Zakirul973","content":"I am totally agreed with you. I tested it and confirmed, thanks.","comment_id":"791973"},{"content":"you rename \"Attribute\" to \"YAER\". what about \"Value\" column? you do not rename it?\nI have test your solution. but it does not work. by this way we have several rows for \"Revenue\" and other rows under \"Measure\" column.","comment_id":"853006","upvote_count":"1","poster":"Shalaleh","timestamp":"1679991900.0"},{"poster":"AZ94","upvote_count":"2","content":"I think that ThariCD is right. I've tested the two approaches with PowerQuery and both are apparently working BUT it is says that we have to provide a \"Year-over-year calculations for all the measures\" so we have to change the data type of \"Year\" to date.","comment_id":"923068","timestamp":"1686742260.0"},{"comment_id":"1094558","content":"Agreed. If you transpose first and go in the order of the answer listed, the Year will not be a date type and you can't create \"Visualizations that include all measures in the data over time\"!!!","comments":[{"poster":"maymia87","comment_id":"1165824","timestamp":"1709571540.0","content":"You are right the Year will not be a date type, but why is that? Because otherwise the transpose should suffice to get YOY visualizations using further DAX measures.","upvote_count":"1"}],"timestamp":"1702387620.0","upvote_count":"3","poster":"bdub1976"},{"comment_id":"961348","poster":"miro26","content":"let\n Source = Excel.Workbook(File.Contents(\"C:\\Users\\miros\\Documents\\test_finace.xlsx\"), null, true),\n Arkusz1_Sheet = Source{[Item=\"Arkusz1\",Kind=\"Sheet\"]}[Data],\n #\"Promoted Headers\" = Table.PromoteHeaders(Arkusz1_Sheet, [PromoteAllScalars=true]),\n #\"Unpivoted Other Columns\" = Table.UnpivotOtherColumns(#\"Promoted Headers\", {\"Mesure\"}, \"Attribute\", \"Value\"),\n #\"Renamed Columns\" = Table.RenameColumns(#\"Unpivoted Other Columns\",{{\"Attribute\", \"Year\"}}),\n #\"Changed Type\" = Table.TransformColumnTypes(#\"Renamed Columns\",{{\"Year\", type date}}),\n #\"Extracted Year\" = Table.TransformColumns(#\"Changed Type\",{{\"Year\", Date.Year, Int64.Type}})\nin\n #\"Extracted Year\"","timestamp":"1690188360.0","upvote_count":"2"},{"content":"Agreed! for all the folks that are ask for the need of last step change to data type, its needed for time intelligence DAX functions.","comment_id":"680067","timestamp":"1664217720.0","poster":"nucleus21","upvote_count":"6"},{"comment_id":"1156619","content":"I think both answers are correct. The answer given and this solution will result in the same thing.","upvote_count":"4","poster":"Thee_Great_Banu","timestamp":"1708627260.0"},{"upvote_count":"2","content":"Kudos, worked!\nprovided answer is wrong or may be right if only - Rename Attribute to Measure after the renaming of \"Measure \" to \"Year\" .. However, we cannot get the same results as here when we change the datatype of year column to date. TESTED","poster":"__Sai_Mounika__","timestamp":"1707135120.0","comment_id":"1141058"}],"poster":"ThariCD","upvote_count":"398","content":"Answer is wrong, the table shouldn't be transposed, the order should be: \n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date (Date > Year)","timestamp":"1662962340.0"},{"upvote_count":"199","comments":[{"comments":[{"poster":"ggggghowmanygs","timestamp":"1741056420.0","content":"Wow, first time I've seen this pay wall in you tube, wished I could downvote this comment (and YT!)","upvote_count":"1","comment_id":"1364702"},{"content":"The whole playlist is gold to prepare the PL 300","upvote_count":"1","comment_id":"1351325","poster":"Pitxunet","timestamp":"1738669800.0"}],"poster":"assettemergaliyev","timestamp":"1734451260.0","content":"https://www.youtube.com/watch?v=0sci44xnto0&list=PLApPcvU5-R24K3mbxORV7T3ckVLfDjmHF&index=20","upvote_count":"7","comment_id":"1328019"},{"poster":"maymia87","comment_id":"1164835","timestamp":"1709475480.0","content":"I agree, I think people disagree because they are not on the same page on the desired outcome table. Since we need a table with the following columns, you just need to transpose:\nYear Revenue Overheads Cost of goods.\nUnpivot in useful if the column measure had category values (Countryname, Productname...) not measures. Here we do not want the measures to repeat.","upvote_count":"5"},{"comment_id":"758909","poster":"RichXP","upvote_count":"3","content":"tried, this one is correct.","timestamp":"1672165260.0"},{"content":"You cannot change the data type of only a years to date otherwise it will auto generate a DDMMYY format","timestamp":"1689869400.0","comment_id":"957807","upvote_count":"7","poster":"Bnxyl"},{"comment_id":"957111","poster":"safz","upvote_count":"2","content":"ya i agreed, transpose the table.","timestamp":"1689825600.0"},{"poster":"gripasha1","timestamp":"1671592140.0","upvote_count":"9","comments":[{"comment_id":"755193","upvote_count":"8","content":"No if you try it with power bi you probably noticed that changing the year data type from text to date would give you some weird date column. But if you try following the solution by ThariCD you can see that it works without a problem.","timestamp":"1671919800.0","poster":"jsking","comments":[{"content":"Totally agree with you. I've tried it myself, the year shows something like 1905. It means if you transpose it first, it may look like correctly for the first 3 steps, but the final step approves it wrong.","upvote_count":"5","poster":"catpoisoncat","comments":[{"comment_id":"772602","timestamp":"1673445540.0","upvote_count":"2","content":"Absolutely true!!!! I was puzzled by the year 1905. The way for the year to work is with promoted headers and unpivot. Overheads, revenue and Cost of goods are indeed measures. This is the only solution that allows agregation and less columns.","poster":"JoaoTrade","comments":[{"upvote_count":"4","timestamp":"1688157960.0","content":"when we do transpose, Power BI recognizes the year column as a number, then we convert it to date format, it calculates the date as 1900/01/01 + 2006 days, that's why we got 1905. so we need to convert year column from number to text, then from text to date, then we can get a normal 2016/01/01 as we did with unpivot","comment_id":"939379","poster":"Judyjudy"}]},{"content":"Does anyone know why it shows 1905 while transforming from text to year in this way? Why it works in the unpivoted method instead?","poster":"letiwang","timestamp":"1680075600.0","comment_id":"854143","upvote_count":"1"}],"comment_id":"764174","timestamp":"1672710300.0"}]}],"content":"I've tried this with Excel (yes, I've typed it all out, lol) and your solution here is correct.\nSolution by ThariCD is not working!","comment_id":"751824"},{"upvote_count":"7","timestamp":"1685500260.0","content":"I've tested it myself. Your answer is correct. Revenue, Overheads, COGS should be in separate columns.","poster":"Nurgul","comment_id":"910743"},{"content":"Yes I Agree","timestamp":"1695039780.0","upvote_count":"2","poster":"emilienmarion","comment_id":"1010573"},{"poster":"Regina18","comments":[{"content":"rename measure to year","timestamp":"1709443320.0","comment_id":"1164506","upvote_count":"1","poster":"Manoj1152"}],"timestamp":"1703921580.0","upvote_count":"5","content":"This is incorrect, you shouldn't transpose the table first. Instead, follow these steps in order:\n\nUse the first row as the header.\nTranspose the table.\nRename \"Attribute\" to \"Year.\"\nChange the data type of \"Year\" to date (Date > Year)\nhttps://learn.microsoft.com/en-us/power-query/transpose-table","comment_id":"1109502"}],"comment_id":"707422","poster":"jorv86","content":"To me, \n1. Transpose the table \n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.\n\nYo don't need to unpivot but transpose because you need the measures in columns. Don't you agree?","timestamp":"1667071320.0"},{"comment_id":"1362897","timestamp":"1740731100.0","content":"in order not have to choose \"change the year column to date type\", which impact the values of year column, here is the suggested sequence: \n1. Use headers as the first row\n2. Transpose\n3. promote the header\n4. rename measure to year.\nWith this approach, we can use data to calculate measure over time. feel free to test this approach!","poster":"Curious236","upvote_count":"1"},{"content":"It is not recommended to convert data type of \" Year\" to date, it should be number or text, as it might potentially be converted to another date value, example 2023 as 30-Dec-1899 (following Excel's date system)","poster":"Curious236","timestamp":"1740730380.0","upvote_count":"1","comment_id":"1362894"},{"comment_id":"1340688","upvote_count":"1","content":"Answer is wrong. The order should be : 1.Use the First row as Header. 2. Unpivot all the columns other than Measure. 3 Rename the Measure column as Year. 4.change the data type of the year column to date . when you use replace : When placing the first row as a header, the data type changes to numeric and changing it back to string would generate an additional step that is not contemplated in the solution.in this problem should be used unpivot. thanks.","poster":"hebertorosillo","timestamp":"1736919060.0"},{"timestamp":"1731940140.0","upvote_count":"2","content":"I've created same excel table and imported into my own pbix.\nI've: 1.-TRANSPOSED the table, 2.- PROMOTED headers, 3.- RENAMED \"measure\" as \"year\" and, at this point I'm able to set a visual (line graph) with the three measures year over year\n Changing data type of {2016, 2017, 2018, 2019, 2020} column to DATE type results in ({08/07/1905, 09/07/1905, 10/07/1905, 11/07/1905, 12/07/1905}) column so, if 4 actions are required here, only other action I can select is to 4.- UNPIVOT other columns than measure. \nWith that 4 actions I still can represent the 3 measures over all years and I guess some custom DAX calculations can be defined to get the YoY calculations","poster":"jaume","comment_id":"1314030"},{"comment_id":"1307289","content":"1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.\n\nI tested this and worked","upvote_count":"3","comments":[{"poster":"TheSylas","content":"The date format will be wrong. ThariCD's solution gives the correct date format.","comment_id":"1330192","timestamp":"1734816780.0","upvote_count":"1"}],"poster":"mghf61","timestamp":"1730799240.0"},{"poster":"madimad","comment_id":"1292897","timestamp":"1727976780.0","upvote_count":"2","content":"Transpose the table\nUse the first row as headers\nRename the Measure column as Year\nChange the datatype of the Year column to Date\nits the correct answer"},{"comment_id":"1283075","content":"Answer is correct. I just try on my computer and works perfectly.","timestamp":"1726216080.0","upvote_count":"1","poster":"mapr"},{"upvote_count":"1","timestamp":"1723882800.0","comment_id":"1267556","poster":"rcaliandro","content":"I totally agree with ThariCD:\n1 - Use the first row as headers (we now have column names)\n2 - Unpivot all the columns other than Measure (we have years in one column only)\n3 - Rename the Attribute column as Year (we have the year column)\n4 - Change the data type of the Year column to Date (I only have a doubt for this step, why an year should be considered as a Date???)"},{"comment_id":"1250138","poster":"hayleyxiong33","content":"The answer is wrong the table should not be transposed","timestamp":"1721278380.0","upvote_count":"1"},{"timestamp":"1721120280.0","poster":"agelee","comment_id":"1248779","content":"With Transpose there is an issue to do in one step conversion of Year data type from Int to Date (it has to be done in 2 steps int->text->date) and it results in 5 steps, not 4. IDK the answer here.","upvote_count":"2"},{"content":"• 1. Transpose the table \n• 2. Use first row as headers \n• 3. Rename the Measure column as Year \n• 4. Change the data type of the Year column to Date.","comment_id":"1247565","timestamp":"1720918500.0","poster":"SeethaG","upvote_count":"1"},{"comment_id":"1215271","poster":"greenlever","content":"The given answer is correct.","timestamp":"1716333600.0","upvote_count":"2"},{"timestamp":"1715623620.0","comment_id":"1211011","poster":"Mo2011","upvote_count":"5","content":"Transpose\nUse the first rows as headers\nRename the measure as year\nChange the data type of the year column"},{"upvote_count":"1","poster":"SIH007","timestamp":"1714376940.0","content":"Sorry, but the last step is wrong, if you change the year to datatype date you would get 17th July, 1905.\nActually my problem is: which 4th option do I select when all remaining options are wrong?????","comment_id":"1203900"},{"poster":"0e18c76","comment_id":"1196651","timestamp":"1713280260.0","upvote_count":"4","content":"The 3rd step is wrong. You do not need to unpivot. \n\nThe solution must be:\n\n1. Transpose the table \n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.\n\nThis is really a tricky questions and most of us tend to go immediately to \"unpivot other columns\". The key here is to check the data carefully. And if you noticed on the first column, besides the first row which is measure, the other rows are all fields as well. So transpose instead of unpivot."},{"comment_id":"1184875","poster":"rdwn_akml","content":"TRANSPOSE the table\nUse first row as header\nRename the measure column as Year\nChange the data type of the year column to Date","upvote_count":"2","timestamp":"1711641720.0"},{"comment_id":"1178188","content":"Tested in Power BI, Both unpivot and transpose worked. \nI think the answer depends on the desired format of outcome table.\nIf you want a 3 * 15 (row * col) table, with each measure and year to be a dependent row, then unpivot.\nIf you want a 5 * 4 (row * col) table, with measures(revenue etc.) are columns and year in the row, then transpose.","timestamp":"1710933600.0","upvote_count":"3","poster":"kay1101"},{"upvote_count":"1","content":"1. Transpose\n2. first row as header\n3. Rename the measure coloumn as year\n4. Change the datatype\n\n100% TESTED SEQUENCE in PowerBI !!!","poster":"MANANDAVEY","comment_id":"1173656","timestamp":"1710444420.0"},{"content":"answer is right; when you transpose you obtain the correct order requested by the question;\nyear to products \n2016-product1;\n2016-product2;\n2016-product3; and so on\n\nwhen you unpivot, you obtain a different order;\nproduct to years\n2016-product1;\n2017-product1;\n2018-product1; and so on","upvote_count":"2","poster":"Dani_eL","timestamp":"1709119620.0","comment_id":"1161559"},{"poster":"Dani_eL","comment_id":"1154687","content":"Tested in PBI Desktop with the exact same excel sheet;\n\nTranspose : first column values become first row and each row contains its respective values\n\nUse first Row as Headers: first row containing values from first excel column, promoting that first row make it a row header : correct.\nPay attention to an automatic applied step changing types on the fly too such as:\n= Table.TransformColumnTypes(#\"Promoted Headers1\",{{\"Measure\", Int64.Type}, {\"Revenue\", type number}, {\"Overheads\", type number}, {\"Cost of Goods\", type number}})\n\nUnpivot Other Columns (having measure column selected):\ncreates 3 columns : Measure - Attribute - Value\nMeasure column contains YEAR values only\n\nRename Measure Column to YEAR : because it's the data in it.\n\nNow you can filter by attributes and see the evolution year by year","upvote_count":"3","timestamp":"1708430880.0"},{"content":"1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" column to Date\nReference:\nhttps://docs.microsoft.com/en-us/power-query/unpivot-column","timestamp":"1706910900.0","poster":"ikramus","upvote_count":"2","comment_id":"1138867"},{"timestamp":"1706791920.0","upvote_count":"3","poster":"SuniltheMentor","comment_id":"1137624","content":"To solve the problem, it needs only 3 steps\n1) Use first row as header\n2) Unpivot all columns other than \"Measure\"\n3) Rename Attribute to Year\n\nBut if we go with 4 steps as asked in the question, then we need to do the below sequence\n1) Transpose\n2) Use first row as header\n3) Unpivot all columns other than \"Measure\"\n4) Rename \"Measure \" to \"Year\""},{"comment_id":"1135551","comments":[{"upvote_count":"2","comment_id":"1135554","poster":"CookieMingkee","content":"Steps 3 and 4 should be swapped because once you rename the Measures as Year, you cannot unpivot except for the measure because there is no measure column.","timestamp":"1706597700.0"}],"content":"The answer is correct if you follow through with the step.\n(1) Transpose the table.\nResults:\nHeader: Column 1 | Column 2 | Column 3| Column 4\nFirst Row: Measure | Revenue | Overheads | COGS\nNext Row: YEARS | Value of R | Value of OH | Value of COGS\n\n(2) Use First Row as Header\nResults: \nHeader: Measure | Revenue | Overheads | COGS\nRows: YEARS | Value of R | Value of OH | Value of COGS\n\n(3) Rename Measures to Year\nResults:\nHeader: Year | Revenue | Overheads | COGS\nRows: YEARS | Value of R | Value of OH | Value of COGS\n\n(4) Unpivot Other Columns \nResults:\nHeader: Year | Attribute| Value\nRows: YEARS | Measure | Values\n\nTest the results:\n(1) Create a table matrix.\n(2) Place the YEAR as Row\n(3) Place the Attributes as Column\n(4) Place the Values as value.\n\nResults:\n\nYou get a Year over Year report for Revenue, Overheads, and COGS.","poster":"CookieMingkee","timestamp":"1706597340.0","upvote_count":"3"},{"content":"I've checked on PBI. The correct order is\nUse first row as header.\nUnpivot all columns other than \"Measure\"\nRename \"Attribute\" to \"Year\"\nChange data type of \"Year\" to date","timestamp":"1706531400.0","comment_id":"1134935","upvote_count":"3","poster":"jacintopintos"},{"poster":"Chellz","timestamp":"1706291580.0","upvote_count":"3","content":"The key to this question is what data type(text or number)of the year value can be converted to a date type. In the suggested answer, after transposing, all the year values are still numbers, which when changed into date type, will use the Excel sequential serial number method, so you get 1905-07-08. In the most voted answer, the year values were first promoted as header, and after unpivoting became text values under the column \"Atrribute\". Text \"2017\" will be converted to \"2017-01-01\" when changed to date type.","comment_id":"1132705"},{"comment_id":"1126186","timestamp":"1705610760.0","upvote_count":"4","poster":"cs3122","content":"Amazing at how often the suggested answer is incorrect. The CORRECT answer is:\n\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date"},{"poster":"Jahanif","comment_id":"1112627","content":"Those of you who don't agree with the suggested answer -\nGo create a similar table and apply the steps as they are and see for yourself. By the way, changing the data type will only mess things up, so stop saying stupid sh**.","upvote_count":"1","timestamp":"1704274200.0"},{"upvote_count":"1","poster":"08b2ddd","timestamp":"1703907480.0","content":"I tried both methods out, but if you transpose the date screws up, so you don't transpose, you just unpivot, but I'm just trying to work out why the date screws up with transpose???","comment_id":"1109375"},{"timestamp":"1703058180.0","poster":"Male777","content":"\"Transpose will not work here\". We need Everything to be as the column header only - \"Transpose\" is of no use.","upvote_count":"1","comment_id":"1101351"},{"poster":"tatacsi","comment_id":"1097371","timestamp":"1702648800.0","upvote_count":"2","content":"Unpivoting generates a mess, but changing column Year to date also changes the data. It looks like there are only 3 points here that can be used..."},{"timestamp":"1699956660.0","upvote_count":"4","content":"this is taking my whole day. everybody talks about the \"change to Date issue\". Actually, you can still do something with the column 2016---2020 as numbers. \n\nWhat strikes me is the step to unpivot it. when we unpivot them, all the values like revenue, overhead cost, and Cost of goods sold come under the same column, which is problematic as explained below.\n\nwe can still have these figures wrt to year and categories(rev, overhead, cost). but it will give us 2 totals: \n1) a total of rev, a total of cost. and a total of cost of goods sold for each, \n2) total of rev, overhead and cost for each year (actually number as 2017)+, which makes no sense as you normally subtract costs from the revenue.\n\nSo the given answer is correct, but it still has flaws. \n\nThe 6th option can not be in the answer, because we can't change data type from number to date directly. we need to change first to text.","comment_id":"1070223","poster":"og44"},{"content":"1. Transpose\n2. Use first row as header\n3. rename \"Measure\" to year\n4. Change data type of \"Year\" to date","poster":"RMUK","comment_id":"1045123","comments":[{"content":"if you TRANSPOSE you already have the header composed by the content of first column, \nthe first row will be 0.5 ; 0.11 ; 0.203438etc","poster":"AdrianBalescu","comment_id":"1099247","upvote_count":"2","timestamp":"1702847880.0"}],"upvote_count":"4","timestamp":"1697472120.0"},{"comment_id":"1042607","timestamp":"1697196240.0","content":"Practical Solution:-\nTranspose\nUse first row as headers\nrename measure column to Year\nchange data type of year column to date","upvote_count":"4","poster":"Fayyu_1"},{"comment_id":"1025101","content":"Im not agreeing with the answer.\n\nI think we should use first row as header,unpivot all other columns other than \"Measure\",Rename Attribute to Year and change data type","upvote_count":"2","timestamp":"1696446600.0","poster":"hkisser"},{"comment_id":"1024831","content":"This was in the exam this week.","poster":"rainy_255","upvote_count":"2","timestamp":"1696426620.0"},{"timestamp":"1693892700.0","content":"Action 1: Use headers as the first row. This action ensures that the column names are correctly identified.\nAction 3: Rename the Attribute column as Year. To have a meaningful name for the year column.\nAction 5: Transpose the table. To change the structure from having years as columns to having years as rows. This step will make it easier to work with the data form visualization and year-over-year calculations. \nAction 6: Unpivot all the columns other than Measure. This will transform the data into a format where you have three columns: \"Measure\", \"Year\", and \"Value.\"","poster":"Igetmyrole","comment_id":"999104","upvote_count":"1"},{"content":"where is Attribute column in the table screenshot . everybody saying rename Attribute column to Year . but where is attribute column.","comments":[{"poster":"Saravanaprabu22","comment_id":"1016386","content":"When you use unpivot column, the Year column result will be shown as attribute as header.","timestamp":"1695613380.0","upvote_count":"3"}],"poster":"Nehaap","upvote_count":"1","timestamp":"1692726540.0","comment_id":"987655"},{"content":"To me,\n1. Transpose the table\n2. Use first row as headers\n3. Unpivot all columns other than \"Measure\"\n4. Rename the Measure column as Year","poster":"AlejandroErazo","comment_id":"979876","timestamp":"1691917800.0","upvote_count":"1"},{"upvote_count":"8","content":"I generated the table and tested all Suggested Queries. All are wrong because of repeated measure or year except this:\n\n1. Transpose table\n2. use first row as header\n3. Rename Measure to Year \n4. Change Year type to Date\n✔✔✔✔✔✔✔✔✔✔✔✔✔✔","timestamp":"1690719120.0","comment_id":"967082","poster":"ApacheKafka"},{"poster":"Chita_3385","upvote_count":"5","content":"I test from my side, after transpose, I can't change type of Year, it's number default, if I change it to date or datetime, it changes wrong value. Does anyone change type successfully?","comment_id":"965309","comments":[{"comment_id":"972139","upvote_count":"1","content":"No, there is no need to change the datatype, int is perfectly fine to deal with years in this data.","timestamp":"1691152020.0","poster":"EwoutBI"},{"timestamp":"1698938460.0","comment_id":"1060644","content":"yes, it's the same for me","upvote_count":"2","poster":"oreshetnik"}],"timestamp":"1690523280.0"},{"timestamp":"1689869580.0","poster":"Bnxyl","content":"I have done it practically\n1. Tranpose will give us 4 columns i.e Column1,2,3,4\n2. Use the first rows as headers will make Measures in column 1 as Header, Revenue in column 2 as header, Overheads in column 3 as Header and finally cost of goods in column 4 as Header\n\n3. Select Measures and Unpivot other columns leaves you with 3 columns i.e Measure, Attributes and Value column\n4. Rename Measures to Year","comment_id":"957814","upvote_count":"5"},{"comment_id":"926101","comments":[{"content":"Tested and agreed.","timestamp":"1689140880.0","poster":"Time2excel","comment_id":"949506","upvote_count":"1"}],"timestamp":"1687017360.0","poster":"JonDave","content":"1. Transpose Table\n2. Use first row as headers \n3. Unpivot all columns other than measure\n4. Rename Measure column to year \n\nwhen you recreate this in power query make sure to select \"unpivot other columns\" after selecting the \"Measures\" column. You'll then be renaming the \"Measures\" column to \"Year\". No need to change the data type to create a visualization. \n\nTest it by creating a stacked column chart:\nx-axis = Year\nY-axis = Sum of Value\nLegend = Attribute","upvote_count":"9"},{"content":"Whenever I change data type to date it comes 7/07/1905 - I have tested the given answer and it works perfectly - the problem is that all solutions presented here they add \"change data type\" - if it wasnt for that all of them would work - but they are just 3 steps. The answer provided has 4 steps and it also works.","poster":"isahgomes","upvote_count":"3","timestamp":"1686028560.0","comment_id":"915913"},{"upvote_count":"5","content":"I have tested in Power BI\ncorrect order or answer is\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change the the data type of \"Year\" to date\n\nIf you start ordering from or with Transpose then you need 5 steps to get the desired result as said in question. Because with Transpose one more step is required to rename \"Attribute\" to \"Measure\"","timestamp":"1683502320.0","poster":"SanaCanada","comment_id":"891723"},{"poster":"lizbette","comment_id":"884810","upvote_count":"3","content":"ThariCD is correct. I did this in PowerBI myself. If you do the transpose version, you get a weird 1905 date when you change data type to year. It has to be the ThariCD way","timestamp":"1682818020.0"},{"comment_id":"881355","content":"this solution is absolutely correct, I have tested:\n1-transpose\n2-use first row as header\n3.rename measure to year\n4. change data type to date","poster":"Shalaleh","upvote_count":"2","timestamp":"1682500440.0"},{"timestamp":"1681733880.0","upvote_count":"3","content":"Hello what is the right answer?","comment_id":"872676","poster":"Nadiaa"},{"poster":"RazaTheLegend","timestamp":"1681288080.0","content":"Answer is wrong, the table shouldn't be transposed, the order should be:\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date (Date > Year)","comment_id":"868057","upvote_count":"1"},{"comment_id":"868049","upvote_count":"1","timestamp":"1681287240.0","poster":"RazaTheLegend","content":"Answer is wrong, the table shouldn't be transposed, the order should be:\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date (Date > Year)"},{"upvote_count":"1","comment_id":"863722","poster":"niki_dat","content":"It works. \n1. Transpose the table\n2. Use first row as headers \n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.\nBut you need to turn off auto-detection of data in the settings Power BI. Because after using first row as headers it changes type of Year on whole number(123) and then you cant transform it in correct year, it will be 1905.","timestamp":"1680863340.0"},{"upvote_count":"2","poster":"quxxy","comments":[{"comment_id":"880219","timestamp":"1682418180.0","upvote_count":"1","poster":"semauni","content":"No conditions of making different aggregations? The question asks YTY calculations over all the measures, so I don't get what you mean?"}],"comment_id":"841893","content":"Actually both ways are works well. But there is one difference: performance. In case when we do \"transposed table\", we need to put three measures with aggregations on visualisations, which in a long term could provide reducing performance... And with unpivoting you need to put only one measure, other works well.\nBut if we need to do different types of aggregations on every measure, than we need to work with \"transposed table\".\nMy answer is the same with TahriCD: there are no conditions of making different aggregations.","timestamp":"1679049420.0"},{"upvote_count":"1","content":"ThariCD is correct","comment_id":"839832","timestamp":"1678879380.0","poster":"Akin_Eren"},{"comment_id":"838073","upvote_count":"1","content":"Just tested this. made excel sheet with data in question. imported into PowerBI.\nuse first row as headers\nunpivot other columns (with Measure selected)\nRename Attribute to Date\nChange Data Type to Year (made 2016 to 1/1/2016)\n\nOutcome of table in PowerBI\n\nMeasure - Year - Value\nRevenue - 1/1/2016 - .5\nRevenue - 1/1/2017 - .6\n..\nOverheads - 1/1/2016 - .11\n..\nCost of Goods - 1/1/2016 - .204","timestamp":"1678725120.0","poster":"mecham"},{"comment_id":"834220","upvote_count":"3","poster":"jharnakalan","content":"Actually given answer by Examtopic is correct","timestamp":"1678382940.0"},{"content":"The answer given is wrong: \n1. Use the first row as headers (new headings will be Measure, 2016, 2017, ...)\n2. upivot all the other columns except Measure (you will now have 3 columns in total: Measure, Attributes which contains years, and values which contains values)\n3. Rename the Attributes column to years\n4. change the data type of year to date (this will actually change 2017 to 1/1/2017 which is not correct but this is the best answer)","upvote_count":"2","timestamp":"1677895200.0","comment_id":"828509","poster":"srikanth923"},{"timestamp":"1677829740.0","upvote_count":"2","comment_id":"827744","content":"For me is:\n1. Transpose.\n2. Use first row.\n3. Unpivot other than measure.\n4. Change the name from measure to year","poster":"TTMS"},{"comment_id":"826746","poster":"cbha95","content":"Using ThariCD's method, the measure column contains the year not revenue or overheads. The answer posted is correct.","timestamp":"1677753480.0","upvote_count":"1"},{"content":"I'm Data analyst, What I do is,\n1. Use the first row as headers.\n2. Transpose the table.\n3. Rename the Measure column as Year.\n4. Change the data type of the Year column to Date","comment_id":"820128","poster":"KarthikKumarK","timestamp":"1677216300.0","upvote_count":"4"},{"timestamp":"1676872920.0","content":"I tried with same test data and working perfectly while following below steps:\n1 - Transpose the table\n2 - User first row as header -- Till this step it will display the data in proper table format\n3 - Rename \"Measure\" to \"Year\"\n4 - Change data type of \"Year\" column as \"Data\"","comment_id":"814870","comments":[{"content":"According to this step, In the last case, the first remaining column needs to be deleted. The solution is here:\n\n1. Use the first row as headers.\n2. Transpose the table.\n3. Rename the Measure column as Year.\n4. Change the data type of the Year column to Date","timestamp":"1678787760.0","comment_id":"838703","poster":"Pinha","upvote_count":"1"}],"poster":"Mati_123","upvote_count":"2"},{"timestamp":"1676631240.0","upvote_count":"1","comment_id":"811770","content":"Tried both Transpose and Unpivot, and they both work.","poster":"sobiero"},{"upvote_count":"2","timestamp":"1674717480.0","poster":"Mati_123","content":"I have tried with same data and below are the correct steps:\n1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.","comment_id":"788472"},{"content":"For me : \n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date.\n\nWhy should we change the type of Year to date?","timestamp":"1672245900.0","poster":"MBA_1990","comment_id":"760101","upvote_count":"1"},{"comment_id":"755196","upvote_count":"3","timestamp":"1671920100.0","poster":"jsking","content":"This question seems super easy but its actually very tricky because the transposing it first without anything else and do the remaining steps works find. However, when it comes to changing the year column data type to date requires an additional step where you first have to change the data type to text and then change it back to date. So only since there is no mention of \"Change the year data type to text\" and then \"Change year data type again to date\" which is not mentioned among the answers provided the correct answer would be one that is provided by ThariCD."},{"poster":"opek","timestamp":"1671807420.0","comment_id":"754311","upvote_count":"3","content":"ThariCD's answer creates a mess with Headers under Measure column making it unusable.\nTested it myself importing a mockup Excel table just like in the example.\n\n1. Transpose\n2. Promote Headers\n3. Change Measure to Year\n4. Change type of Year to date"},{"content":"1. Transpose --> https://learn.microsoft.com/en-us/power-query/transpose-table \n2. Promote 1st row as headers\n3. Change the type of the column Year to Date\n\nI don't see any reasons to unpivot. Take a look in the ling above, explains actually same scenario.","upvote_count":"1","timestamp":"1670830860.0","poster":"Dr_Do","comment_id":"742515"},{"comment_id":"741421","content":"Hi All, i have trired transposing and unpivot as suggested in the forum. Below is my result: \n1. Tranposing led to \"year\" value is not showing the original year after changing data type to Date. Values have changed to 1905 with different dates\n2. Unpivotting has retained the original value（2016，2017 etc) after changing data type to Date\n3. YoY works well after changing year column to Date (didnt execute Date>Year). Power BI prompted error whn he year column is in integer (after unpivoting) or date->Year\n\nHence, the answer shoud be:\n1. Use first row as heard\n2. unpivot all except measure\n3. change attribite to Year\n4. change data type of Year to date (dont need Date->Year as it will convert it back to integer)","timestamp":"1670735100.0","poster":"NonstopLearning","upvote_count":"7"},{"content":"i tried to change year data type to DATE and the values changed to year 1905 with different dates.","poster":"NonstopLearning","upvote_count":"1","comment_id":"741413","timestamp":"1670733660.0"},{"content":"1- Use first row as header \n2- Unpivot other columns\n3- Rename column attribute as year\n4- Change Year datatype\n\nOther sequence is (5 steps)\n1- Transpose \n2- Use first row as header\n2- Transpose \n3- Rename column Measure to Year\n4- Unpivot\n5- Change Year column data type to Date","poster":"slash_nyk","upvote_count":"2","comment_id":"738589","timestamp":"1670470380.0"},{"timestamp":"1670349420.0","poster":"rajkoma","content":"Yes Answer is correct becoz as per 1st requirement in the question it requires all measures together to display over time,which can be possible with unpoviting only","upvote_count":"1","comment_id":"737091"},{"upvote_count":"1","timestamp":"1669739220.0","poster":"NuriaIzard","comment_id":"730623","content":"Attention please: Unpivot refers to a column named Measure, but there is actually no column with that name, therefore transpose would be more accurate"},{"timestamp":"1669570140.0","content":"Please guys : \n\ntry this it's works like magik\n\nThe correct answer should be:\n1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date","poster":"Pauwels","upvote_count":"5","comment_id":"728476"},{"poster":"AzureJobsTillRetire","upvote_count":"3","comment_id":"727037","timestamp":"1669402980.0","content":"The correct answer should be:\n1. Transpose the table \n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date\n\nWe can use either transpose or unpivot to complete the job, but not both. The step \"Use first row as headers\" is only related to transpose and for unpivot this step is not required."},{"timestamp":"1669142160.0","poster":"TZCT1FX","comment_id":"724563","content":"The answer is not correct. ThariCD has it right. If you use the steps above, the Year column is a wholenumber type. You cannot do YoY calculations with that.","upvote_count":"1"},{"content":"In pivoting/unpivoting transformation, you can not perform one action without the other. i.e when you unpivot a set columns, you equally have to pivot the remaining columns as different steps. Since the questions provided only one of the steps(unpivoting) without the other, then the transformation is not pivoting/unpivoting. The transformation is Transpose which is:\n1.transpose the table\n2.use first rows as headers\n3.change fist column(measure) to Year\n4.change data type to year","poster":"Wadyba","upvote_count":"3","comment_id":"718369","timestamp":"1668470160.0"},{"upvote_count":"9","timestamp":"1668177780.0","poster":"Glubbs","content":"The correct Answer is:\n1 - Transpose\n2 - Use first row as headers\n3 - Rename the Measure col as Year\n4 - Change the data type of the Year col to Date\nThe video shows how to do it: https://www.youtube.com/watch?v=0sci44xnto0&list=PLApPcvU5-R24K3mbxORV7T3ckVLfDjmHF&index=20","comment_id":"716132"},{"upvote_count":"5","comment_id":"714877","timestamp":"1668047640.0","poster":"Pocu","content":"To fully understand this question, we need to understand what is 1 dimension,2 dimension table and what is the purpose of transpose and unpivot. Golden rule is: 1 dimension table is the destination. For this question specifically, it is already a 1 dimension table. Simply\n1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date."},{"poster":"Kate000","upvote_count":"2","comment_id":"711891","content":"tried changing the data type to date, and it can't get the correct date,\nI think it should set up a date table later or other methods for the year-over-year calculation...\n\nI tested with the step below:\n1. transpose\n2. use first row as header\n3. unpivot (actually it just changed the ordering in this case)\n4. Rename the measure column as year","timestamp":"1667667000.0"},{"content":"I GET IT USING THESE STEPS:\n1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date.","timestamp":"1667373780.0","poster":"youssef_yt89","upvote_count":"5","comment_id":"709673"},{"comment_id":"705911","poster":"iccent2","upvote_count":"2","timestamp":"1666901220.0","content":"The given answer is the correct answer. You must first transpose the table so that the year will be on one column. Check here: https://learn.microsoft.com/en-us/power-query/unpivot-column"},{"timestamp":"1666277460.0","comment_id":"700049","content":"Comments on my previous answer, as for me there is no need to unpivot the columns or change the data type.","upvote_count":"3","poster":"DBAH"},{"upvote_count":"2","comments":[{"poster":"CHT1988","upvote_count":"3","content":"I also agree. \nNo need to change the data type, Visualization only needs the Year (if you change it, it will pop the day/month as well\nWebsite's answer put the Year as 1st column.","timestamp":"1667835660.0","comment_id":"713144"}],"timestamp":"1666277040.0","poster":"DBAH","comment_id":"700042","content":"The given answer is correct, I've tested it."},{"comment_id":"698153","upvote_count":"3","poster":"samad1234","content":"The correct answer : \n1- Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\"","timestamp":"1666091580.0"},{"poster":"SaidDjaiz","comment_id":"693953","content":"1- Transpose the table\n2- User the first row as headers\n3-Unpivot all columns other than Measure\n4-Rename \"Attribute\" to \"Year\"","timestamp":"1665669600.0","upvote_count":"2"},{"poster":"golden_barrell","comments":[{"comment_id":"692796","timestamp":"1665558360.0","upvote_count":"2","poster":"Dibsy","content":"The Measures are Revenue, Overheads and Cost of Goods, not the Years, so the answer is like ThariCD said"}],"upvote_count":"6","content":"I think that the correct answer should be:\n1. Transpose the table\n2. Use first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date\n\nAn example very similar to this case is shown here https://learn.microsoft.com/en-us/power-query/transpose-table","comment_id":"691885","timestamp":"1665475620.0"},{"comment_id":"688111","upvote_count":"3","poster":"lukelin08","content":"Answer is\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date (Date > Year)\n\nusing the transpose function the column \"Year\" cannot be changed to Date type","timestamp":"1665092280.0"},{"timestamp":"1664035860.0","upvote_count":"1","comment_id":"677969","content":"first row as headers , unpivot, rename , change type","poster":"GregFred"},{"timestamp":"1663825260.0","upvote_count":"3","content":"In order to support the following: \"Year-over-year calculations for all the measures\", we need to change the data type of Year to Date, due to we need a date column to use YoY function, so my answer would be:\n1. Use first row as header\n2. Unpivot all columns other than \"Measure\"\n3. Rename \"Attribute\" to \"Year\"\n4. Change data type of \"Year\" to date\n\nIf you try to use transpose function you will check that the column \"Year\" cannot be changed to Date type due to it´s recognized as a whole number","poster":"Fer079","comment_id":"675758"},{"timestamp":"1662720480.0","poster":"olajor","upvote_count":"8","comments":[{"upvote_count":"3","timestamp":"1663738860.0","comment_id":"674822","content":"nvm I agree with ThariCD now.","poster":"olajor"}],"content":"Answer is correct","comment_id":"664433"},{"timestamp":"1662467880.0","content":"It's a wrong answer.\n\nshould be:\n1. Transpose the table\n2. User the first row as headers\n3. Rename the Measure column as Year\n4. Change the data type of the Year column to Date","comments":[{"comment_id":"662541","upvote_count":"5","timestamp":"1662557640.0","content":"Why would you need to change the data type of the year column to Date ?\nI've tested another solution for achieving the same result :\n- Use first row as header\n- Unpivot all columns other than \"measure\"\n- Rename \"attribute\" to \"year\"","poster":"zerone72"}],"upvote_count":"5","poster":"Jukibabu","comment_id":"661219"}],"url":"https://www.examtopics.com/discussions/microsoft/view/80615-exam-pl-300-topic-2-question-19-discussion/","timestamp":"2022-09-06 14:38:00","answer":"","topic":"2","answer_ET":"","answer_images":["https://www.examtopics.com/assets/media/exam-media/04331/0009900001.jpg"],"answers_community":[],"exam_id":116,"answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/power-query/unpivot-column","unix_timestamp":1662467880,"isMC":false}],"exam":{"isMCOnly":false,"provider":"Microsoft","isBeta":false,"name":"PL-300","isImplemented":true,"lastUpdated":"12 Apr 2025","id":116,"numberOfQuestions":334},"currentPage":17},"__N_SSP":true}