{"pageProps":{"questions":[{"id":"hgGoseINfise7rVYrYzF","discussion":[{"content":"Selected Answer: AB\nhttps://docs.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware","comment_id":"654834","comments":[{"upvote_count":"2","content":"B E\nhttps://learn.microsoft.com/en-us/azure/backup/security-overview","timestamp":"1678545600.0","comment_id":"836153","poster":"ChaBum"}],"upvote_count":"34","poster":"malone0001","timestamp":"1726902900.0"},{"timestamp":"1662914700.0","comment_id":"666285","poster":"simonseztech","upvote_count":"21","content":"Selected Answer: AB\nKeyword are CONTROLS and ENSURE. So A & B both are the answer. https://docs.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware"},{"comment_id":"1288637","upvote_count":"2","content":"I think the correct answer is BC. The question states clearly \"in the event of a successful ransomware attack\". The ransomware attack does not delete backups and does not modify backup schedules. The attack purpose is to encrypt. That said by using option C (C. Encrypt backups by using customer-managed keys (CMKs)) you will guarantee that an additional encryption attempt made by Ransomware will not be successful as at that point the backups will be already encrypted.","comments":[{"upvote_count":"1","timestamp":"1736929620.0","comment_id":"1340736","poster":"alessag","content":"I don't think the C is correct because this feature doesn't support backup of virtual machines (VMs); look at https://learn.microsoft.com/en-us/azure/backup/encryption-at-rest-with-cmk?tabs=portal#considerations (third bullet)"}],"timestamp":"1727186580.0","poster":"svpulver"},{"comment_id":"656313","upvote_count":"6","timestamp":"1727150340.0","poster":"d3an","content":"Selected Answer: AB\n'You need to recommend which CONTROLS must be enabled to ENSURE that Azure Backup can be used to RESTORE the resources in the event of a successful ransomware attack.'\n\nWhilst helpful for auditing purposes and detection of a malicious attack, monitoring configuration changes and alerting after a change is made does not represent a CONTROL which ENSURES Azure Backup can be used to RESTORE the resources.\n\nAnswers are therefore A and B.","comments":[{"upvote_count":"2","comment_id":"836169","content":"agreed, E would help detecting the attack, but has nothing to do to \"ensure that Azure Backup can be used...\"","timestamp":"1678546140.0","poster":"ChaBum"}]},{"comment_id":"816492","content":"Selected Answer: AB\nSoft delete protection, even if a malicious actor deletes a backup (or backup data is accidentally deleted). Backup data is retained for 14 additional days, allowing the recovery of a backup item with no data loss.\nAs part of adding an extra layer of authentication for critical operations, you're prompted to enter a security PIN before modifying online backups.\n\nhttps://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware","timestamp":"1727150340.0","upvote_count":"2","poster":"nited"},{"comment_id":"821748","upvote_count":"2","content":"Selected Answer: AB\nChecks have been added to make sure only valid users can perform various operations. These include adding an extra layer of authentication. As part of adding an extra layer of authentication for critical operations, you're prompted to enter a security PIN before modifying online backups.\nSoft delete protection, even if a malicious actor deletes a backup (or backup data is accidentally deleted). Backup data is retained for 14 additional days, allowing the recovery of a backup item with no data loss","poster":"Gurulee","timestamp":"1727150340.0"},{"poster":"zellck","comment_id":"902446","content":"Selected Answer: AB\nAB is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature-cloud\nConcerns about security issues, like malware, ransomware, and intrusion, are increasing. These security issues can be costly, in terms of both money and data. To guard against such attacks, Azure Backup now provides security features to help protect backup data even after deletion.\n\nOne such feature is soft delete. With soft delete, even if a malicious actor deletes a backup (or backup data is accidentally deleted), the backup data is retained for 14 additional days, allowing the recovery of that backup item with no data loss. The additional 14 days of retention for backup data in the \"soft delete\" state don't incur any cost to you.\n\nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature#authentication-to-perform-critical-operations","timestamp":"1727150340.0","upvote_count":"7"},{"upvote_count":"7","poster":"gujjudesi420","timestamp":"1727150340.0","comment_id":"949270","content":"Options B (Require PINs for critical operations), D (Perform offline backups to Azure Data Box), and E (Use Azure Monitor notifications when backup configurations change) are not directly related to ensuring the availability and restore capabilities of Azure Backup in the event of a ransomware attack.\n\nTherefore, the recommended controls to include in the strategy for protecting against ransomware attacks and ensuring the usability of Azure Backup for resource restoration are:\nA. Enable soft delete for backups\nC. Encrypt backups by using customer-managed keys (CMKs)","comments":[{"upvote_count":"1","poster":"alessag","timestamp":"1736929380.0","content":"I don't think the C is correct because this feature doesn't support backup of virtual machines (VMs); look at https://learn.microsoft.com/en-us/azure/backup/encryption-at-rest-with-cmk?tabs=portal#considerations (third bullet)","comment_id":"1340735"}]},{"comment_id":"1134669","upvote_count":"3","timestamp":"1727150340.0","content":"A. Enable Soft Delete for Backups: Soft delete adds an additional layer of protection for your backup data. Even if a backup is deleted (whether accidentally or maliciously), it is retained for an additional period (14 days by default for Azure VMs and 30 days for Azure Blob Storage). During this retention period, the backup data can be recovered, ensuring that you can restore from these backups even if they are targeted in a ransomware attack.\n\nB. Require PINs for Critical Operations: This control adds an extra layer of security by requiring a PIN for critical operations, such as deleting backup data or changing backup configurations. This can prevent malicious actors from easily performing destructive actions, even if they have compromised your environment. It's a form of multi-factor authentication that ensures only authorized users can perform sensitive operations on your backups.","poster":"Jonny_Cage"},{"upvote_count":"1","timestamp":"1727150280.0","comment_id":"1288374","poster":"Ruttoh","content":"To ensure that Azure Backup can be used to restore resources in the event of a successful ransomware attack, you should include the following controls:\n\nA. Enable soft delete for backups: This feature protects your backup data from accidental or malicious deletion by retaining deleted backup data for 14 additional days, allowing you to recover it before it’s permanently lost1.\n\nB. Require PINs for critical operations: This adds an extra layer of security by requiring a security PIN for critical operations, ensuring that only authorized users can perform such actions"},{"timestamp":"1716819540.0","poster":"bxlin","comment_id":"1219607","upvote_count":"1","content":"Agreed with B and E\n\nA - enable soft delete on a resource, e.g storage account. not on backup\nC - does not help.\nD - \"Store backups in offline or off-site storage\" would be a perfect choice. but using Azure Data Box is incorrect, which is a data transfer device to move data from on-prem to Azure cloud. it is not a long-term data storage solution.","comments":[{"timestamp":"1736929860.0","comment_id":"1340740","poster":"alessag","upvote_count":"1","content":"I don't think E is correct because when you receive a notification is too late because question require CONTROL (preliminary check) to ENSURE you can do remediation tasks (for instance recovery deleted backup)."}]},{"poster":"Bett","content":"Currently the solutions published by Microsoft are BD:\n-Store backups in offline or off-site storage and/or immutable storage.\n-Require out of band steps (such as MFA or a security PIN) before permitting an online backup to be modified or erased.\n\nhttps://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware#steps-to-take-before-an-attack\nAbout Offline Backup -> https://learn.microsoft.com/en-us/azure/backup/offline-backup-overview","upvote_count":"2","comment_id":"1183153","timestamp":"1711444380.0"},{"timestamp":"1710429840.0","poster":"masby661","upvote_count":"2","comment_id":"1173518","content":"Selected Answer: AC\nhttps://learn.microsoft.com/en-us/azure/backup/protect-backups-from-ransomware-faq"},{"comments":[{"content":"AB...there is no where in the steps to guard against ransomware did they say perform offline backups to azure data box...but soft delete protection and PIN/MFA use is advised\n\nhttps://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware","poster":"ubiquituz","comment_id":"1164207","upvote_count":"1","timestamp":"1709396100.0"}],"content":"Selected Answer: BD\nhttps://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware\n\nPlease refer to the section 'Steps to take before an attack'.\nSome of the steps mentioned are:\n1. Store backups in offline or off-site storage - (Option B)\n2. Require out of band steps such as MFA or a security PIN (Option D)\n\nOption A - does not seem to be a valid choice as Soft Delete is enabled by default \nOption C - Not mentioned in the MS link above\nOption E- Not mentioned in the MS link above\n\nTherefore, B & D are the correct choices as per MS article and not what the votes indicate.","upvote_count":"3","poster":"SFAY","timestamp":"1706897220.0","comment_id":"1138770"},{"poster":"Charly80","upvote_count":"1","comment_id":"1126508","content":"\"Soft Delete\" doesn't works with Storage Account : https://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature-cloud?tabs=azure-portal","timestamp":"1705649280.0"},{"timestamp":"1700567040.0","upvote_count":"2","poster":"TomasValtor","content":"Answer: BD\n\nCheck this link (slide 20). https://view.officeapps.live.com/op/view.aspx?src=https%3A%2F%2Fdownload.microsoft.com%2Fdownload%2F7%2F5%2F1%2F751682ca-5aae-405b-afa0-e4832138e436%2FRansomwareRecommendations.pptx&wdOrigin=BROWSELINK","comment_id":"1076244"},{"timestamp":"1695083460.0","upvote_count":"6","poster":"itmaster","comment_id":"1010946","content":"A, C, and E are best practices for ransomware attack:\nhttps://learn.microsoft.com/en-us/azure/backup/protect-backups-from-ransomware-faq\nThe right answer is A, soft delete, and C, enabling CMK, to be able to restore after successful attack. If the attack deletes the data, enabled soft delete will restore it. If the attack encrypts the data, the backups that are encrypted by CMK cannot be tampered with and can be decrypted and restored."},{"upvote_count":"1","timestamp":"1692196500.0","comment_id":"982677","content":"Selected Answer: BE\nActually given answer is correct,\nhttps://learn.microsoft.com/en-us/azure/backup/protect-backups-from-ransomware-faq","poster":"sbnpj"},{"content":"A & B are the right answers.","upvote_count":"1","poster":"Holii","comment_id":"938409","timestamp":"1688060340.0","comments":[{"upvote_count":"2","timestamp":"1727150340.0","comment_id":"938413","content":"A is a valid answer choice\n\nB is a valid answer choice- MFA or security PIN is a recommendation for permitting an online backup be modified or erased\n\nC is \"not\" a valid answer choice- it's not needed since PMKs will be used to encrypt backups by default. CMK would add an extra layer of encryption (using your own keys)\n\nD is \"not\" a valid answer choice- Azure Backups should be stored in offline or off-site storage- and Azure Data Box would be the recommended tooling. However, this is more of a 'perk' and doesn't help with the restoration. Assuming you have an online data store, by going offline you're not necessarily adding anything but a more robust/faster backup transition.\n\nE is a not a valid answer choice- I don’t understand what having notifications turned on would do in the case of preventing a ransomware attack other than provide you knowledge that someone backed up your system.","poster":"Holii"}]},{"upvote_count":"2","comments":[{"comment_id":"938415","poster":"Holii","upvote_count":"1","timestamp":"1688060580.0","content":"It's not a post-attack question, it's premeditative.\nA&B."}],"poster":"BeefStroganoff","timestamp":"1686464040.0","content":"The question says \" to restore the resources in the event of a successful ransomware attack\".\nWhich makes me think that:\nB - won't make a difference, attack alreade happened\nC - encrypted backups are re-encrypted by ransomware, helps with leakage prevention\nE - too late for that\nWhich leaves only 2 options:\nA - can be useful to restor what attackers deleted\nD - This is a \"Plan B\" if \"A\" does not work\nWhich means the answers are A D\nOpinions?","comment_id":"920459"},{"comments":[{"upvote_count":"1","timestamp":"1688121660.0","poster":"Holii","content":"I'd agree that Azure Monitor is needed to obtain insight, but it does little to nothing to prevent an actual ransomware attack from hitting your backups once it's inside.\nThis would fall more in-line with Multi-User Access/PIM controls being set, in this case being MFA or a PIN for critical role operations.","comment_id":"939011"}],"upvote_count":"2","poster":"Maniact165","timestamp":"1684236780.0","content":"Selected Answer: AE\nAE according to https://learn.microsoft.com/en-us/azure/backup/protect-backups-from-ransomware-faq thoughts?","comment_id":"899117"},{"content":"Selected Answer: AC\nA. Enable soft delete for backups and C. Encrypt backups by using customer-managed keys (CMKs) should be included in the recommendation.","poster":"exampasser06","upvote_count":"1","comment_id":"876952","timestamp":"1682126520.0"},{"content":"Selected Answer: AB\nSoft delete and PIN; See step #4, #5 documented here: https://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature#prevent-attacks","comment_id":"868105","poster":"Gurulee","upvote_count":"2","timestamp":"1681291680.0"},{"content":"Selected Answer: AC\nTo ensure that Azure Backup can be used to restore resources in the event of a successful ransomware attack, the two controls that should be enabled are:\n\nA. Enable soft delete for backups: This feature ensures that backups are retained even if an attacker tries to delete them. The backups can be recovered from the soft-deleted state within the retention period.\nC. Encrypt backups by using customer-managed keys (CMKs): This feature ensures that backups are encrypted with keys that are under the control of the customer, making it difficult for attackers to access and read the data.\n\nTherefore, the correct answers are A and C.\n\nNote: B, D, and E are not relevant controls for protecting against ransomware attacks in Azure Backup.","upvote_count":"1","poster":"loverboz","timestamp":"1679584200.0","comments":[{"comment_id":"859844","timestamp":"1680520320.0","upvote_count":"1","content":"The controls are needed on the backup solution - that's the key here.. In case, the primary data gets encrypted as a result of the successful ransomware attack then the backup should be in the secured state to fulfill the need. I think BE options are correct here!","poster":"shahnawazkhot"}],"comment_id":"848351"},{"timestamp":"1679434260.0","poster":"PrettyFlyWifi","upvote_count":"4","content":"Selected Answer: AE\nThis is a horrible question. Check out the FAQ link below, it lists the exact items. Only problem is, it lists 3 of the available options as \"best practice\" as per https://learn.microsoft.com/en-us/azure/backup/protect-backups-from-ransomware-faq#what-are-the-best-practices-to-configure-and-protect-azure-backups-against-security-and-ransomware-threats\n\nI'd say it was A and E, as they are both listed, plus I'm not leaning towards the CMK answer, as it quotes \"By default, backup data at rest is encrypted using platform-managed keys (PMK). For vaulted backups, you can choose to use customer-managed keys (CMK) to own and manage the encryption keys yourself. \", so CMK is added on top.","comment_id":"846381"},{"comment_id":"832579","upvote_count":"3","content":"Selected Answer: AC\nThe two controls that should be included in the recommendation to ensure that Azure Backup can be used to restore resources in the event of a successful ransomware attack are:\n\nA. Enable soft delete for backups: This feature allows you to recover your deleted backups for a retention period even if they were deleted due to ransomware attacks or accidental deletion.\n\nC. Encrypt backups by using customer-managed keys (CMKs): This control ensures that the backups are encrypted with customer-managed keys (CMKs), which means that only the customer can decrypt the backup data, making it more secure against ransomware attacks.\n\nTherefore, the correct answers are A and C.","timestamp":"1678255320.0","poster":"OCHT"},{"comment_id":"829857","upvote_count":"2","timestamp":"1678014660.0","poster":"AJ2021","content":"Selected Answer: AB\nTricky question, but for me it's A&B as the most correct.\nhttps://learn.microsoft.com/en-us/training/modules/recommend-ransomware-strategy-by-using-microsoft-security-best-practices/2-plan-for-ransomware-protection-extortion-based-attacks"},{"upvote_count":"1","timestamp":"1677250800.0","poster":"Airebyc","comment_id":"820637","content":"Options A and C are the most suitable recommendations to ensure that Azure Backup can be used to restore resources in the event of a successful ransomware attack.\n\nOption A - \"Enable soft delete for backups\" allows you to recover backups that were accidentally or intentionally deleted by a ransomware attacker before they are permanently deleted.\n\nOption C - \"Encrypt backups using customer-managed keys (CMKs)\" protects backups against ransomware attacks since the encryption key is managed by the customer rather than Azure. This means that ransomware attackers cannot access the encryption key and decrypt the backups."},{"upvote_count":"1","content":"AC\n\nA. Enable soft delete for backups - this allows for the recovery of deleted backups in case they are affected by ransomware attacks.\n\nC. Encrypt backups by using customer-managed keys (CMKs) - this ensures that backups cannot be restored without the encryption keys, which provides an additional layer of protection against ransomware attacks.\n\nB. Require PINs for critical operations, E. Use Azure Monitor notifications when backup configurations change, and D. Perform offline backups to Azure Data Box are not directly related to the recommended controls for protecting against ransomware attacks.","poster":"MichaelMu","timestamp":"1677213960.0","comment_id":"820113"},{"comment_id":"812457","upvote_count":"2","content":"Selected Answer: AC\nAI: To ensure that Azure Backup can be used to restore resources in the event of a successful ransomware attack, the following two controls should be enabled:\n\nA. Enable soft delete for backups: Soft delete is a feature that allows you to recover deleted backups for a specified period of time. By enabling soft delete for backups, you can recover backups that were deleted or modified during a ransomware attack.\n\nC. Encrypt backups by using customer-managed keys (CMKs): By using customer-managed keys, you have complete control over the keys used to encrypt backups. This can provide an extra layer of security against ransomware attacks, as attackers would need to have access to the keys to decrypt the backups.\n\nTherefore, the recommended controls are A (Enable soft delete for backups) and C (Encrypt backups by using customer-managed keys).","timestamp":"1676673360.0","poster":"Fal991l"},{"poster":"AWS56","comment_id":"807888","timestamp":"1676328540.0","upvote_count":"2","content":"Selected Answer: AB\nAB is the right answer"},{"poster":"Ernsqk23","upvote_count":"2","comment_id":"806217","content":"Selected Answer: BE\nOption B we all agree\nSoft delete is enabled by default. I think that E is the best option to generate an alert if there is a configuration change in Azure Backup.","timestamp":"1676198580.0"},{"content":"This is tricky one. Initially I went with A, B. But then see B, E is better choice for protecting backups versus data integrity targeted for backup","timestamp":"1675940520.0","poster":"Gurulee","upvote_count":"1","comment_id":"803116"},{"comment_id":"803098","poster":"Gurulee","upvote_count":"1","content":"I think about keyword 'ensure', which points to protecting integrity of data being backed up. I initially lean towards A, B. But I then I think about ways to protect data for trustworthy backups...","timestamp":"1675939620.0"},{"content":"Selected Answer: AB\nadditional information for soft delete\nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature-cloud","timestamp":"1675700760.0","poster":"Sec_Expert","upvote_count":"2","comment_id":"799954"},{"timestamp":"1675248960.0","comment_id":"795025","content":"A. Enable soft delete for backups.\nC. Encrypt backups by using customer-managed keys (CMKs).","poster":"rmafnc","upvote_count":"1"},{"upvote_count":"2","poster":"nieprotetkniteeetr","content":"Selected Answer: BE\nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-security-feature-cloud","comment_id":"776480","timestamp":"1673781540.0"},{"timestamp":"1669562160.0","upvote_count":"5","comment_id":"728365","comments":[{"timestamp":"1669681260.0","poster":"Sec_Arch_Chn","upvote_count":"1","comment_id":"729737","content":"Additional reference - https://learn.microsoft.com/en-us/azure/backup/monitoring-and-alerts-overview (Check 'Get alerted to critical backup incidents')"}],"content":"Selected Answer: BE\nB & E are correct. \nA is wrong as it's mentioned as 'Enable Softdelete' instead of 'Enable Softdelete Protection'\n\nhttps://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware\nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-monitoring-use-azuremonitor","poster":"Sec_Arch_Chn"},{"timestamp":"1662665700.0","content":"A and B","upvote_count":"3","poster":"tester18128075","comment_id":"663973"},{"upvote_count":"2","content":"A and B per MS docs","timestamp":"1662470580.0","poster":"TJ001","comment_id":"661265"},{"timestamp":"1662367080.0","poster":"JMGENZOR","content":"Following the MS recommendations are A and B","comment_id":"659931","upvote_count":"2"},{"comment_id":"658828","poster":"HardcodedCloud","content":"Selected Answer: AB\nAnswers A,B. Azure Monitor notifications are mainly used for alerting for suspicious activities. It won't ensures the recoverability of Azure backup.","upvote_count":"2","timestamp":"1662246900.0"},{"comment_id":"657275","content":"AE i think so","timestamp":"1662113340.0","upvote_count":"1","poster":"Alex_Burlachenko"},{"poster":"prabhjot","comments":[{"timestamp":"1672571700.0","poster":"TJ001","content":"agreed overall; however what helps to 'restore data' and 2 answers let to choose A and B","upvote_count":"1","comment_id":"763166"}],"upvote_count":"4","content":"to me 3 options looks good \n1) Azure Backup now provides new and improved alerting capabilities via Azure Monitor. If you're using the older classic alerts solution for Recovery Services vaults, we recommend you move to Azure Monitor alerts.\n2)Require PINs for critical operations.\n3) On the Security Settings blade, note that Soft Delete (For workload running in Azure) is Enabled. this point also seems valid option.","comment_id":"654580","timestamp":"1661907780.0"}],"answer_description":"","question_text":"You have an Azure subscription that contains virtual machines, storage accounts, and Azure SQL databases.\nAll resources are backed up multiple times a day by using Azure Backup.\nYou are developing a strategy to protect against ransomware attacks.\nYou need to recommend which controls must be enabled to ensure that Azure Backup can be used to restore the resources in the event of a successful ransomware attack.\nWhich two controls should you include in the recommendation? Each correct answer presents a complete solution.\nNOTE: Each correct selection is worth one point.","question_id":41,"isMC":true,"timestamp":"2022-08-31 03:03:00","choices":{"C":"Encrypt backups by using customer-managed keys (CMKs).","B":"Require PINs for critical operations.","E":"Use Azure Monitor notifications when backup configurations change.","D":"Perform offline backups to Azure Data Box.","A":"Enable soft delete for backups."},"answer_ET":"AB","url":"https://www.examtopics.com/discussions/microsoft/view/78565-exam-sc-100-topic-1-question-8-discussion/","answer":"AB","topic":"1","answers_community":["AB (75%)","9%","Other"],"unix_timestamp":1661907780,"exam_id":121,"question_images":[],"answer_images":[]},{"id":"ojcafrbNdPThkInsVUt1","discussion":[{"comment_id":"653867","content":"I would go for:\na) Azure AD application (https://docs.microsoft.com/en-us/azure/active-directory/manage-apps/what-is-application-management)\nb) An access package in identity governance (https://docs.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-access-package-create)","timestamp":"1661841120.0","upvote_count":"124","poster":"Jasper666","comments":[{"poster":"prabhjot","content":"agree - How do I create an Azure AD application?\nRegister an application with Azure AD and create a service principal\nSign in to your Azure Account through the Azure portal.\nSelect Azure Active Directory.\nSelect App registrations.\nSelect New registration.\nName the application. Select a supported account type, which determines who can use the application.","timestamp":"1661909220.0","upvote_count":"4","comment_id":"654591"},{"comment_id":"764063","timestamp":"1672697400.0","upvote_count":"5","poster":"JohnBentass","content":"Agreed with this one, answer is A, A"},{"content":"AGREE with this one","timestamp":"1664662200.0","poster":"Curious76","upvote_count":"1","comment_id":"684503"},{"comment_id":"749350","timestamp":"1671414720.0","content":"The requirement is pretty clear: \"Enable Azure AD authentication for App1\" hence A","poster":"sunilkms","upvote_count":"4"},{"upvote_count":"2","poster":"dudus999","timestamp":"1692194100.0","content":"exactly 100%","comment_id":"982646"}]},{"comment_id":"653828","upvote_count":"27","content":"Answer is incorrect\n\nBox 1 is the Azure AD Application\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/develop/quickstart-register-app\n\nBox 2 is Access Package in Identity Governance\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-access-package-create","timestamp":"1661835960.0","poster":"BillyB2022"},{"poster":"Dirkonormalo","timestamp":"1730827560.0","content":"Yes, Box 2 is Access Package for me too. I was wondering about Access Review. \nAccess Reviews are used to re-view: Stale account or Periodic requests\nAccess Pagackes are used for requesting access and grouping packages for roles and partners. The Package can be based used with a workflow to contain stages for approval. \nhttps://learn.microsoft.com/en-us/entra/id-governance/entitlement-management-access-package-create\nIn Identity Governance, start the process to create an access package.\n\nSelect the catalog where you want to put the access package and ensure that it has the necessary resources.\n\nAdd resource roles from resources in the catalog to your access package.\n\nSpecify an initial policy for users who can request access.\n\nSpecify approval settings and lifecycle settings in that policy.","upvote_count":"2","comment_id":"1307474"},{"upvote_count":"3","content":"Azure AD Application Registration & An access package","comment_id":"1213615","timestamp":"1716097380.0","poster":"Navya6784"},{"content":"On Exam 8 Apr. 2024 scored 764\nAnswered Azure AD application Registration (updated answer) and Access package in Identity governance","comment_id":"1192109","poster":"Baz10","upvote_count":"6","timestamp":"1712650380.0"},{"comment_id":"1079325","comments":[{"poster":"mscloudguru24","content":"Correct, in the exam, it's now Application Registration.","upvote_count":"3","comment_id":"1122555","timestamp":"1705239720.0"}],"poster":"JG56","content":"Selected answer: Azure AD application REGISTRATION and Access package in Identity governance, In exam Nov 23","timestamp":"1700836200.0","upvote_count":"7"},{"timestamp":"1700569200.0","comment_id":"1076273","poster":"TomasValtor","content":"a) Azure AD application (https://docs.microsoft.com/en-us/azure/active-directory/manage-apps/what-is-application-management)\nb) An access package in identity governance (https://docs.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-access-package-create)","upvote_count":"1"},{"poster":"smanzana","upvote_count":"2","comment_id":"1052241","content":"Box1: Azure AD application \nBox2: An access review in Identity Governance","timestamp":"1698093960.0"},{"timestamp":"1696589280.0","content":"got this in exam 6oct23. passed with 896 marks. I answered \nAZURE AD APP REGISTRATION\nAN ACCESS PACKAGE IN IDENTITY GOVERNANCE","upvote_count":"10","comment_id":"1026462","poster":"cyber_sa","comments":[{"timestamp":"1736320800.0","poster":"haifaalse","upvote_count":"1","content":"Dear, \nFrom where you studied?","comment_id":"1337861"}]},{"upvote_count":"2","timestamp":"1695024360.0","comment_id":"1010373","poster":"slobav","content":"Box1: Azure AD application\nBox2: An access review in Identity Governance\nYou can find explanation here:\nhttps://www.youtube.com/playlist?list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y"},{"poster":"sbnpj","upvote_count":"2","timestamp":"1690921080.0","content":"Agree ans is AA","comment_id":"969378"},{"comment_id":"945796","content":"Azure AD Application and Access Package in Identity Governance are the correct answers.","poster":"ChrisBues","timestamp":"1688744520.0","upvote_count":"2"},{"content":"1. Azure AD application\n2. Access package in Identity Governance\n\nhttps://learn.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-overview#what-are-access-packages-and-what-resources-can-i-manage-with-them\nEntitlement management introduces the concept of an access package. An access package is a bundle of all the resources with the access a user needs to work on a project or perform their task. Access packages are used to govern access for your internal employees, and also users outside your organization.","timestamp":"1684570260.0","upvote_count":"3","comment_id":"902435","poster":"zellck"},{"timestamp":"1681460100.0","poster":"Gurulee","comment_id":"870058","upvote_count":"2","content":"Box one is self explanatory with AAD App, and box two is Access Package in Identity Governance. The giveaway was \"Users will request access to App1 through the My Apps portal\"\nhttps://learn.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-scenarios#access-package-manager-allow-employees-in-your-organization-to-request-access-to-resources"},{"upvote_count":"3","timestamp":"1679584920.0","poster":"loverboz","content":"To enable Azure AD authentication for App1, use Azure AD application\nTo implement access requests for App1, use an access package in identity governance\n\nTo enable Azure AD authentication for App1 and provide access security, the recommended solution is to use an Azure AD application. You should create an Azure AD application, configure the necessary permissions, and assign users and groups to the application.\n\nAn access package in identity governance should be used to implement access requests for App1. Identity Governance provides access packages that allow users to request access to specific applications, groups, or roles. The request is routed to the appropriate approver, who can either approve or reject the request. Access packages can be created, managed, and assigned in the Azure portal, and can be customized to include specific access policies and permissions. This provides a streamlined and secure way to manage access to App1, ensuring that only authorized users can access sensitive data or resources.","comment_id":"848368"},{"upvote_count":"2","comment_id":"825442","timestamp":"1677632880.0","content":"If you really delve deep, its a sneaky question. As it states your app is running in the Azure App Service, and if you read about it, you can configure AAD as the identity provider here inside the resource group: https://learn.microsoft.com/en-us/azure/app-service/scenario-secure-app-authentication-app-service-as-user\n\nSo you don't need to touch 'Azure AD application' settings at all. The app gets registered by default when following the steps above.","poster":"PeteNZ"},{"timestamp":"1673782320.0","poster":"nieprotetkniteeetr","content":"Azure AD Application https://learn.microsoft.com/en-us/azure/active-directory/develop/authentication-flows-app-scenarios\nAn access package in Identity Governance https://learn.microsoft.com/en-us/azure/active-directory/governance/entitlement-management-access-package-create#requests","comment_id":"776482","upvote_count":"1"},{"poster":"awssecuritynewbie","timestamp":"1672698180.0","content":"I would agree with A)\n\nBUt for the second option, the question to be lacking good answering because in the real lie you would just permit the group under the \"groups\" for the publish apps and add it in there but i would go with B as that is the only sensible option available.","comment_id":"764072","upvote_count":"1"},{"content":"A,A is correct","comment_id":"758544","upvote_count":"2","poster":"TJ001","timestamp":"1672147380.0"},{"comment_id":"717865","timestamp":"1668419280.0","upvote_count":"1","poster":"[Removed]","content":"Box 2 is Access Package in Identity Governance"},{"timestamp":"1667937060.0","content":"the correct answer is (A-B) you would need Azure app registration to enable Azure AD auth for web app and you must use an Access policy to implement access request for the web app\n\nhttps://www.mathworks.com/help/mps/server/configure-access-control-using-azure-ad.html\nhttps://learn.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad","poster":"omarrob","comment_id":"714086","upvote_count":"3"},{"poster":"AcidoNZ","timestamp":"1667021640.0","comment_id":"706989","upvote_count":"2","content":"Its correct you need a managed identity, User authentication can begin with authenticating the user to your app service as described in the previous section.\nOnce the app service has the authenticated identity, your system needs to connect to backend services as the app:\n\nUse managed identity. If managed identity isn't available, then use Key Vault.\n\nThe user identity doesn't need to flow further. Any additional security to reach backend services is handled with the app service's identity.\n\nOnce the app service has the authenticated identity, your system needs to connect to backend services as the app:\n\nUse managed identity. If managed identity isn't available, then use Key Vault.\n\nThe user identity doesn't need to flow further. Any additional security to reach backend services is handled with the app service's identity.\n\nhttps://learn.microsoft.com/en-us/azure/app-service/scenario-secure-app-authentication-app-service#connect-to-backend-services-as-app"},{"poster":"dakasa","comment_id":"701979","comments":[{"timestamp":"1666615200.0","comment_id":"703016","content":"You can't add user to an MSI, this would be only use to grand the application access to azure resources not to provide any user authentication","poster":"blopfr","upvote_count":"3"}],"timestamp":"1666509360.0","content":"Why you do not consider Managed Identities for Azure AD instead of Azure AD application? I think Managed Identity is a more modern and secure way of providing access to azure apps. Azure AD application is more suitable if it is a third-party or on-premises service/app.\nhttps://learn.microsoft.com/en-us/azure/app-service/overview-managed-identity?tabs=cli%2Chttp","upvote_count":"2"},{"timestamp":"1662665880.0","comment_id":"663975","upvote_count":"4","content":"A and B.\nAzure AD\nAccess Package","poster":"tester18128075"},{"content":"Selection 1: Azure AD application. You need first to register your app in AAD, then add users or group to this app so they can used it.\nSelection 2: An access package in Identity Governance.\nUsers will request access to App1 through the My Apps portal. A human resources manager will approve the requests.","comment_id":"658830","poster":"HardcodedCloud","timestamp":"1662247260.0","upvote_count":"4"},{"upvote_count":"2","timestamp":"1661875680.0","comment_id":"654185","poster":"Alex_Burlachenko","content":"Box 2 is Access Package in Identity Governance"},{"upvote_count":"2","comment_id":"653743","timestamp":"1661824440.0","comments":[{"timestamp":"1661992980.0","comment_id":"655629","upvote_count":"3","poster":"PlumpyTumbler","content":"I have to say access package with Identity Governance, actually because of the required HR approval."}],"poster":"PlumpyTumbler","content":"To implement access requests from users to secure app access Azure AD Conditional Access App Control would do the trick. Use this link for reference: https://docs.microsoft.com/en-us/defender-cloud-apps/proxy-intro-aad#how-session-control-works\n\nAccess reviews are great, but that isn't what this question is about."}],"answer_ET":"","answer_description":"","topic":"1","question_text":"HOTSPOT -\nYou are creating the security recommendations for an Azure App Service web app named App1. App1 has the following specifications:\n✑ Users will request access to App1 through the My Apps portal. A human resources manager will approve the requests.\n✑ Users will authenticate by using Azure Active Directory (Azure AD) user accounts.\nYou need to recommend an access security architecture for App1.\nWhat should you include in the recommendation? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","timestamp":"2022-08-30 03:54:00","answer_images":["https://img.examtopics.com/sc-100/image207.png"],"exam_id":121,"question_images":["https://www.examtopics.com/assets/media/exam-media/04228/0002900001.jpg"],"isMC":false,"answer":"","url":"https://www.examtopics.com/discussions/microsoft/view/78360-exam-sc-100-topic-1-question-9-discussion/","answers_community":[],"question_id":42,"unix_timestamp":1661824440},{"id":"fnUafY5um1UPkHgfqt9i","unix_timestamp":1662586800,"exam_id":121,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04228/0011300002.jpg"],"answer_description":"Box 1: No -\n\nBox 2: Yes -\nUsers will connect to ClaimsApp by using a URL of https://claims.fabrikam.com.\nNeed certificate for HTTPS.\n\nTLS/SSL certificates -\nTo enable the HTTPS protocol for securely delivering content on a Front Door custom domain, you must use a TLS/SSL certificate. You can choose to use a certificate that is managed by Azure Front Door or use your own certificate.\n\nBox 3: Yes -\nBy default, Azure Front Door will respond to all user requests regardless of the location where the request is coming from. In some scenarios, you may want to restrict the access to your web application by countries/regions. The Web application firewall (WAF) service in Front Door enables you to define a policy using custom access rules for a specific path on your endpoint to either allow or block access from specified countries/regions.\nNote: Requirements. Security Requirements\nFabrikam identifies the following security requirements:\nג€¢ Internet-accessible applications must prevent connections that originate in North Korea.\nReference:\nhttps://techcommunity.microsoft.com/t5/azure-architecture-blog/permit-access-only-from-azure-front-door-to-azure-app-service-as/ba-p/2000173 https://docs.microsoft.com/en-us/azure/frontdoor/front-door-custom-domain-https#tlsssl-certificates","discussion":[{"content":"it's not clear why the first is NO since all the instances of ClaimsApp is on app services and can be protected by the FD1. for me is YES/YES/YES","comment_id":"679642","timestamp":"1679828340.0","poster":"emiliocb4","upvote_count":"29"},{"comments":[{"content":"https://learn.microsoft.com/en-us/azure/frontdoor/front-door-faq#what-regions-is-the-service-available-in-\nAzure Front Door is a global service and isn't tied to any specific Azure region. The only location you need to specify while creating a Front Door is the resource group location, which is specifying where the metadata for the resource group gets stored. The Front Door profile itself is created as a global resource and the configuration is deployed globally to all edge locations.","comment_id":"905856","upvote_count":"2","poster":"zellck","timestamp":"1700834520.0"},{"comment_id":"903185","poster":"zellck","upvote_count":"1","content":"https://learn.microsoft.com/en-us/azure/web-application-firewall/afds/waf-front-door-geo-filtering\nBy default, Azure Front Door will respond to all user requests regardless of the location where the request is coming from. In some scenarios, you may want to restrict the access to your web application by countries/regions. The Web application firewall (WAF) service in Front Door enables you to define a policy using custom access rules for a specific path on your endpoint to either allow or block access from specified countries/regions.","timestamp":"1700576160.0"}],"content":"YYY is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/frontdoor/front-door-custom-domain-https#tlsssl-certificates\nTo enable the HTTPS protocol for securely delivering content on a Front Door custom domain, you must use a TLS/SSL certificate. You can choose to use a certificate that is managed by Azure Front Door or use your own certificate.","comment_id":"903184","timestamp":"1700576100.0","upvote_count":"8","poster":"zellck"},{"timestamp":"1711008600.0","upvote_count":"2","content":"No,Yes,Yes\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&index=9\nQuestion 114","comment_id":"1012830","poster":"slobav","comments":[{"content":"no video with the video link","upvote_count":"2","poster":"Ramye","comment_id":"1125375","timestamp":"1721246520.0"}]},{"content":"Focusing on this \"ClaimsApp will be deployed to Azure App Service instances that connect to Vnet1 and Vnet2\" and with those two Vnet's in different regions, which is supported by FD; my answer would be Yes/Yes/Yes","comment_id":"855483","timestamp":"1696062480.0","poster":"Gurulee","upvote_count":"2"},{"comment_id":"843720","content":"Front Door is non-regional and can be used across regions. Therefore, as noted in the case: \"A virtual network named Vnet1 in the East US Azure region\nA virtual network named Vnet2 in the West Europe Azure region\", and with ClaimsApp being deployed to both vNet's; I believe its YES to first item.","timestamp":"1695117780.0","upvote_count":"1","poster":"Gurulee"},{"upvote_count":"2","timestamp":"1690064220.0","content":"For Box 1 I would choose Yes\n\nThe question is whether 'FD1 can be used to protect all the instances of ClaimsApp.'. The requirement also mentioned 'ClaimsApp will be deployed to Azure App Service instances'. So the required scope of protection is only App Service instances, not Vnet1, Vnet2 and ClaimsDB.\n \nAzure Front Door with WAF able to protection layer 7 web application hosted in Azure App Service.\n \nAzure Web Application Firewall on Azure Front Door\nhttps://learn.microsoft.com/en-us/azure/web-application-firewall/afds/afds-overview","comment_id":"784815","poster":"OrangeSG"},{"upvote_count":"1","poster":"darren888","timestamp":"1678773360.0","content":"Q1, FD1 be used to protect all the instances of ClaimsApp. as per case study. ClaimsApp will be deployed to Azure App Service instances that connect to Vnet1 and Vnet2. Maybe the answer is no because it cant protect Vnet1 and Vnet2 it is a layer 7 firewall to protect web apps. any thoughts?","comment_id":"668585"},{"content":"Why is the first question No?","poster":"MallonoX_111","upvote_count":"1","timestamp":"1678232400.0","comments":[{"comments":[{"poster":"Gurulee","timestamp":"1696062180.0","upvote_count":"3","content":"When it says \"all instances of ClaimsApp\", I would interpret that as how many instances of the app itself and not the related database, etc.. Tricky misleading question in my opinion.","comment_id":"855477"},{"upvote_count":"6","timestamp":"1678577760.0","content":"I don't know if there are others instances can't be protected. But from what I read, ClaimsDB is not asked in the question. The question only mentioned ClaimsApp, which is the app service itself.","comment_id":"666461","poster":"pangchn","comments":[{"upvote_count":"1","content":"If you follow your interpretation then should be yes.","poster":"Granwizzard","comment_id":"667306","timestamp":"1678651200.0"}]}],"poster":"Granwizzard","content":"The front door only works with HTTP and HTTPS, and connections to a database use other ports or protocols.\nIn this case, only the web app can be protected, since the question is related to all instances it can't protect the DB.","timestamp":"1678541100.0","upvote_count":"5","comment_id":"666066"}],"comment_id":"662912"}],"url":"https://www.examtopics.com/discussions/microsoft/view/81035-exam-sc-100-topic-10-question-1-discussion/","question_text":"HOTSPOT -\nYou are evaluating the security of ClaimsApp.\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","question_id":43,"answer_ET":"","topic":"10","answers_community":[],"isMC":false,"question_images":["https://www.examtopics.com/assets/media/exam-media/04228/0011300001.jpg"],"answer":"","timestamp":"2022-09-07 23:40:00"},{"id":"fsDInBYmt9rM64GPjp4z","question_text":"You need to recommend a solution to scan the application code. The solution must meet the application development requirements.\nWhat should you include in the recommendation?","answer_ET":"A","topic":"10","answer":"A","isMC":true,"answers_community":["A (100%)"],"timestamp":"2022-08-30 02:42:00","question_id":44,"choices":{"B":"Azure Key Vault","C":"Azure DevTest Labs","D":"Application Insights in Azure Monitor","A":"GitHub Advanced Security"},"answer_description":"","unix_timestamp":1661820120,"url":"https://www.examtopics.com/discussions/microsoft/view/78355-exam-sc-100-topic-10-question-2-discussion/","question_images":[],"discussion":[{"timestamp":"1709174520.0","upvote_count":"15","poster":"PlumpyTumbler","comment_id":"653717","content":"Selected Answer: A\nMicrosoft has an entire learning module about this. https://docs.microsoft.com/en-us/learn/modules/introduction-github-advanced-security/2-what-is-github-advanced-security"},{"upvote_count":"7","comment_id":"767057","poster":"MrsSunshine","timestamp":"1720207800.0","content":"Selected Answer: A\nbecause the other choices just don't make any sense... :)"},{"content":"Selected Answer: A\nA is the answer.\n\nhttps://learn.microsoft.com/en-us/training/modules/introduction-github-advanced-security/2-what-is-github-advanced-security","upvote_count":"1","poster":"zellck","timestamp":"1732197780.0","comment_id":"903174"},{"upvote_count":"2","timestamp":"1721212620.0","content":"Selected Answer: A\nAnswer is correct, GitHub Advanced Security","comment_id":"778906","poster":"zic04"},{"content":"Selected Answer: A\nAnswer is correct, GitHub Advanced Security","timestamp":"1711770540.0","comment_id":"683154","upvote_count":"3","poster":"JCkD4Ni3L"}],"exam_id":121,"answer_images":[]},{"id":"1r147JUkQytVIwux5ycQ","discussion":[{"comment_id":"657457","timestamp":"1693660260.0","content":"Selected Answer: AD\nAccess Reviews are not relevant here.\nMonitor real-time needs Conditional Access & Defender for Cloud Apps","upvote_count":"33","poster":"JaySapkota"},{"upvote_count":"15","content":"Selected Answer: AD\nhttps://docs.microsoft.com/en-us/azure/active-directory/conditional-access/concept-conditional-access-session#conditional-access-application-control\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/app-proxy/application-proxy-integrate-with-microsoft-cloud-application-security","poster":"PlumpyTumbler","comment_id":"657694","timestamp":"1693677720.0"},{"upvote_count":"3","comment_id":"1011604","poster":"sherifhamed","timestamp":"1726768980.0","content":"Selected Answer: AD\nA. Azure AD Conditional Access: Azure AD Conditional Access allows you to define policies and rules that control access to your applications and services based on specific conditions. You can use it to enforce multi-factor authentication, device compliance, location-based access, and more, providing advanced security controls for your SharePoint Online and Exchange Online resources.\n\nD. Microsoft Defender for Cloud Apps (formerly known as Microsoft Cloud App Security): This service provides advanced security features for cloud applications, including Office 365 apps like SharePoint Online and Exchange Online. It helps you monitor user activities, control access, and detect and respond to threats in these applications, ensuring the security of your data."},{"upvote_count":"4","comments":[{"content":"https://learn.microsoft.com/en-us/sharepoint/authentication-context-example\nWith Azure Active Directory authentication context, you can enforce more stringent access conditions when users access SharePoint sites.\n\nYou can use authentication contexts to connect an Azure AD conditional access policy to a SharePoint site. Policies can be applied directly to the site or via a sensitivity label.","timestamp":"1716292260.0","poster":"zellck","comment_id":"903158","upvote_count":"2"}],"comment_id":"903156","timestamp":"1716292140.0","content":"Selected Answer: AD\nAD is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/conditional-access/overview\nThe modern security perimeter now extends beyond an organization's network to include user and device identity. Organizations can use identity-driven signals as part of their access control decisions.\nConditional Access brings signals together, to make decisions, and enforce organizational policies. Azure AD Conditional Access is at the heart of the new identity-driven control plane.\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/protect-office-365\nConnecting Office 365 to Defender for Cloud Apps gives you improved insights into your users' activities, provides threat detection using machine learning based anomaly detections, information protection detections (such as detecting external information sharing), enables automated remediation controls, and detects threats from enabled third-party apps in your organization.","poster":"zellck"},{"content":"Selected Answer: AD\nApplication Security Requirements mentioned in the question are as follows...\n\"Monitor and control access to Microsoft SharePoint Online and Exchange Online data in real time.\"\nTherefore, AD appears to be a right answer here.","poster":"shahnawazkhot","upvote_count":"2","comment_id":"864418","timestamp":"1712553180.0"},{"poster":"Gurulee","upvote_count":"2","content":"Selected Answer: AD\nFocusing on main requirements: \"Identify internal applications that will support single sign-on (SSO) by using Azure AD Application Proxy.\nMonitor and control access to Microsoft SharePoint Online and Exchange Online data in real time.\", definitely conditional access and MDCA","timestamp":"1711796460.0","comment_id":"855519"},{"content":"Selected Answer: AD\nA & D\nFor real time > Conditional access","poster":"SofiaLorean","comment_id":"804522","upvote_count":"1","timestamp":"1707579960.0"},{"comments":[{"poster":"sergioandreslq","timestamp":"1698076920.0","upvote_count":"2","comment_id":"702300","content":"No, Access review is used to continue checking group membership and roles.\nThe Answer is Conditional access and Microsoft Defender for Cloud Apps"}],"comment_id":"700239","upvote_count":"1","poster":"drod","content":"Selected Answer: BD\nhttps://learn.microsoft.com/en-us/azure/active-directory/app-proxy/application-proxy-config-sso-how-to","timestamp":"1697829480.0"},{"upvote_count":"3","timestamp":"1696038720.0","content":"Selected Answer: AD\nCorrect answer is A & D","poster":"JCkD4Ni3L","comment_id":"683156"},{"upvote_count":"1","content":"I think it is A and B","poster":"Bharat","timestamp":"1693680900.0","comment_id":"657738"},{"comment_id":"657508","poster":"[Removed]","timestamp":"1693664100.0","content":"Has to be AzureAD Conditional Access!!!","upvote_count":"5"}],"question_text":"You need to design a strategy for securing the SharePoint Online and Exchange Online data. The solution must meet the application security requirements.\nWhich two services should you leverage in the strategy? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point.","answer_description":"","answer_ET":"AD","timestamp":"2022-09-02 15:11:00","question_id":45,"url":"https://www.examtopics.com/discussions/microsoft/view/79424-exam-sc-100-topic-11-question-1-discussion/","answer_images":[],"answer":"AD","choices":{"B":"access reviews in Azure AD","A":"Azure AD Conditional Access","D":"Microsoft Defender for Cloud Apps","C":"Microsoft Defender for Cloud","E":"Microsoft Defender for Endpoint"},"answers_community":["AD (98%)","2%"],"isMC":true,"unix_timestamp":1662124260,"exam_id":121,"question_images":[],"topic":"11"}],"exam":{"isBeta":false,"name":"SC-100","numberOfQuestions":247,"lastUpdated":"12 Apr 2025","id":121,"isImplemented":true,"provider":"Microsoft","isMCOnly":false},"currentPage":9},"__N_SSP":true}