{"pageProps":{"questions":[{"id":"im4w3jR6an4perSNNtnT","exam_id":122,"question_images":["https://img.examtopics.com/sc-200/image139.png","https://img.examtopics.com/sc-200/image140.png"],"answer_images":["https://img.examtopics.com/sc-200/image141.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/95998-exam-sc-200-topic-3-question-54-discussion/","answer":"","isMC":false,"answer_description":"","answer_ET":"","answers_community":[],"discussion":[{"upvote_count":"28","comment_id":"945575","comments":[{"upvote_count":"1","comments":[{"upvote_count":"6","content":"I misread. Select yes if statement is true. Then B = No. :)","comment_id":"1074838","comments":[{"comment_id":"1243640","timestamp":"1720316940.0","upvote_count":"2","content":"I hate those kind of questions... its so easy to misread ! Especially under pressure.. they should just go with the straight true/false.","poster":"sebas12345"}],"timestamp":"1700418420.0","poster":"ethhacker"}],"comment_id":"1073974","poster":"ethhacker","timestamp":"1700310000.0","content":"B equals YES. Watchlist can be updated. Guess you misread."}],"poster":"theplaceholder","timestamp":"1688727600.0","content":"A) Yes -- AccountCustomEntity = Username\nB) No -- Watchlists can be updated\nC) No -- IPCustomEntity != IPList"},{"content":"The Answer is: \nYes \nNo\nNo","comment_id":"1271637","poster":"user636","upvote_count":"2","timestamp":"1724497680.0"},{"timestamp":"1722272160.0","poster":"smanzana","content":"Yes\nNo\nNo","comment_id":"1257595","upvote_count":"3"},{"comment_id":"1113069","upvote_count":"2","content":"No - AccountCustomEntity= Usersname not AccountEntity\nNo - Watchlist can be updated\nNo - IPcustoeEntity - IPlist","poster":"estyj","timestamp":"1704310380.0"},{"poster":"Murtuza","comment_id":"1099107","content":"Username Field is set as AccountCustomEntity in the query so the answer to the question should be NO","timestamp":"1702833780.0","upvote_count":"1"},{"content":"Correct Option","timestamp":"1698448860.0","upvote_count":"1","comment_id":"1055902","poster":"chepeerick"},{"poster":"chepeerick","comment_id":"1045411","timestamp":"1697502660.0","content":"Yes, Yes, no","upvote_count":"1"},{"upvote_count":"2","timestamp":"1691990700.0","content":"Yes no yes","comment_id":"980468","poster":"donathon"},{"timestamp":"1691323740.0","content":"Yes, No, Yes is correct","poster":"billo79152718","upvote_count":"1","comment_id":"973802","comments":[{"content":"That's what I'm seeing too","poster":"Coolcat2023","upvote_count":"2","timestamp":"1691435460.0","comment_id":"974920"}]},{"comment_id":"788642","comments":[{"content":"https://learn.microsoft.com/en-us/azure/sentinel/entities-reference#entity-types-and-identifiers\n\nThis article does not mention IPList anywhere. The IPCustomEntity is not set to IPList in the query. The answer for this question (to my understanding) is no.","comment_id":"945577","upvote_count":"1","poster":"theplaceholder","timestamp":"1688727660.0"},{"content":"if i misunderstund the wording of the first sentence as it seems inverted for me\nin this case it would be \nY,N,Y\n:)","comments":[{"comment_id":"788651","poster":"Fcnet","timestamp":"1674731880.0","content":"misunderstood","upvote_count":"3"}],"upvote_count":"10","comment_id":"788646","timestamp":"1674731400.0","poster":"Fcnet"}],"timestamp":"1674731220.0","poster":"Fcnet","content":"The account entity is set as the username not the opposite \nThe username is not set as the account entity it's the opposite\n1 should be no\n\nthe watchlist can be updated so\nhttps://learn.microsoft.com/en-us/azure/sentinel/watchlists-manage#edit-a-watchlist-item \n2 should be No\n\nIPList var refers to the entity type Ip Address yes\nhttps://learn.microsoft.com/en-us/azure/sentinel/entities-reference#entity-types-and-identifiers\n3 should be Yes\n\nSo my guess \nN,N,Y","upvote_count":"3"},{"timestamp":"1674134700.0","comments":[{"timestamp":"1675596180.0","comments":[{"content":"Ignore me. I misunderstood.","comment_id":"798776","timestamp":"1675596300.0","upvote_count":"2","poster":"yoton"}],"content":"Uh.. If the watchlist can not be updated after it is created then the answer is yes.. because it's asking if the statement \"The watchlist can not be updated after is created.\" Is right or not.","comment_id":"798775","poster":"yoton","upvote_count":"1"}],"poster":"learnlearnlearn","comment_id":"781161","upvote_count":"4","content":"\"The watchlist can not be updated after it is created\" should be \"No\". This here are docs explaining how to edit them https://learn.microsoft.com/en-us/azure/sentinel/watchlists-manage#edit-a-watchlist-item"}],"question_id":186,"topic":"3","unix_timestamp":1674134700,"timestamp":"2023-01-19 14:25:00","question_text":"HOTSPOT\n-\n\nYou have the following KQL query.\n\n//IMG//\n\n\nFor each of the following statements, select Yes if the statement is true. Otherwise. select No.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//"},{"id":"cvmLLLFDcgC5Rb6gQ2Ew","topic":"3","timestamp":"2023-01-22 07:25:00","answers_community":[],"exam_id":122,"discussion":[{"comment_id":"783973","upvote_count":"8","content":"Answer is correct. https://learn.microsoft.com/en-us/azure/sentinel/watchlists-manage#edit-a-watchlist-item","poster":"ACSC","comments":[{"comment_id":"783975","timestamp":"1674368760.0","content":"Wrong copy and paste. This is the correct link: https://learn.microsoft.com/en-us/azure/sentinel/normalization-develop-parsers#validate-the-output-schema","upvote_count":"25","poster":"ACSC","comments":[{"content":"Thanks mate","comment_id":"933749","upvote_count":"2","poster":"tirajvid","timestamp":"1687709940.0"}]},{"comment_id":"1012086","timestamp":"1695199620.0","poster":"Anil0512","content":"To the point - thank you","upvote_count":"1"}],"timestamp":"1674368700.0"},{"content":"Correct","poster":"smanzana","comment_id":"1257597","upvote_count":"1","timestamp":"1722272280.0"},{"upvote_count":"1","content":"https://learn.microsoft.com/en-us/azure/sentinel/normalization-develop-parsers\nvalidate the output schema","timestamp":"1708374300.0","comment_id":"1154266","poster":"louisaok"},{"upvote_count":"1","poster":"Murtuza","content":"<parser name> | getschema | invoke ASimSchemaTester('<schema>')","timestamp":"1702833420.0","comment_id":"1099103"},{"comment_id":"1055903","content":"Correct Option","poster":"chepeerick","upvote_count":"1","timestamp":"1698448920.0"}],"isMC":false,"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace.\n\nYou develop a custom Advanced Security Information Model (ASIM) parser named Parser1 that produces a schema named Schema1.\n\nYou need to validate Schema1.\n\nHow should you complete the command? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_description":"","question_images":["https://img.examtopics.com/sc-200/image142.png"],"answer":"","url":"https://www.examtopics.com/discussions/microsoft/view/96434-exam-sc-200-topic-3-question-55-discussion/","answer_images":["https://img.examtopics.com/sc-200/image143.png"],"question_id":187,"answer_ET":"","unix_timestamp":1674368700},{"id":"D5m37vzPM6O5UBMxEDRw","url":"https://www.examtopics.com/discussions/microsoft/view/97080-exam-sc-200-topic-3-question-56-discussion/","exam_id":122,"topic":"3","question_id":188,"answers_community":[],"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace that has User and Entity Behavior Analytics (UEBA) enabled.\n\nYou need to identify all the log entries that relate to security-sensitive user actions performed on a server named Server1. The solution must meet the following requirements:\n\n• Only include security-sensitive actions by users that are NOT members of the IT department.\n• Minimize the number of false positives.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","timestamp":"2023-01-28 19:53:00","isMC":false,"unix_timestamp":1674931980,"answer_images":["https://img.examtopics.com/sc-200/image145.png"],"answer_ET":"","question_images":["https://img.examtopics.com/sc-200/image144.png"],"answer_description":"","discussion":[{"comments":[{"poster":"tirajvid","content":"Thanks. Correct answer","comment_id":"944392","timestamp":"1688626260.0","upvote_count":"3"}],"poster":"ACSC","upvote_count":"49","content":"Answer is: Join kind = inner, IdentityInfo\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-with-ueba#embed-identityinfo-data-in-your-analytics-rules-public-preview","timestamp":"1674931980.0","comment_id":"790962"},{"poster":"DaraVasu","comment_id":"807360","content":"Answer is Join Kind = inner, Identityinfo\n\nFound this in Microsoft documentation","upvote_count":"7","timestamp":"1676290380.0"},{"comment_id":"1257598","content":"Join kind = inner \nIdentityInfo","poster":"smanzana","upvote_count":"2","timestamp":"1722272460.0"},{"upvote_count":"1","poster":"7d801bf","comment_id":"1242004","content":"Answer is join kind = inner and indetifyinfo","timestamp":"1720091460.0"},{"upvote_count":"1","comment_id":"1191487","poster":"DChilds","timestamp":"1712569380.0","content":"Correct on the table to be queried because IdentityInfo table only gives us information about the accounts and not UEBA events however to match the two tables (users not in IT group table with the defined security-sensitive actions defined in UEBA) join kind = inner is the join type to use.\n\njoin kind = inner\nBehaviourAnalytics"},{"comment_id":"1059957","timestamp":"1698860220.0","upvote_count":"2","poster":"Kurdd","content":"To correlate Microsoft Entra sign-in logs with the IdentityInfo table in an alert that's triggered if an application is accessed by someone who isn't a member of a specific security group:\n\n\nSigninLogs\n| where AppDisplayName == \"GithHub.Com\"\n| join kind=inner (\n IdentityInfo\n | summarize arg_max(TimeGenerated, *) by AccountObjectId) on $left.UserId == $right.AccountObjectId\n| where GroupMembership !contains \"Developers\"\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-with-ueba#embed-identityinfo-data-in-your-analytics-rules-public-preview"},{"content":"Correct Option","poster":"chepeerick","upvote_count":"1","timestamp":"1698448980.0","comment_id":"1055905"},{"upvote_count":"4","timestamp":"1691996160.0","comment_id":"980542","poster":"donathon","content":"SecurityEvent\n| where EventID in (\"4624\",\"4672\")\n| where Computer == \"My.High.Value.Asset\"\n| join kind=inner (\n IdentityInfo\n | summarize arg_max(TimeGenerated, *) by AccountObjectId) on $left.SubjectUserSid == $right.AccountSID\n| where Department != \"IT\""},{"timestamp":"1688730480.0","upvote_count":"2","poster":"devop23","comment_id":"945602","content":"BehaviorAnalytics doesnt have department field so id have to say the answer is wrong"}],"answer":""},{"id":"q1GVvTTNBbaNZaj1g5aH","exam_id":122,"question_id":189,"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace.\n\nYou need to create a KQL query that will identify successful sign-ins from multiple countries during the last three hours.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answers_community":[],"question_images":["https://img.examtopics.com/sc-200/image146.png"],"topic":"3","isMC":false,"timestamp":"2023-01-22 13:26:00","discussion":[{"poster":"ACSC","content":"Correct.\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimAuthentication/imAuthSigninsMultipleCountries.yaml","timestamp":"1674390360.0","comment_id":"784278","upvote_count":"19"},{"upvote_count":"1","content":"Correct","timestamp":"1722272580.0","poster":"smanzana","comment_id":"1257601"},{"upvote_count":"1","timestamp":"1703765880.0","content":"The key word in the question \" sign in \" implies authentication so its a given there","poster":"Murtuza","comment_id":"1107746"},{"upvote_count":"1","poster":"chepeerick","content":"Correct Option","comment_id":"1055906","timestamp":"1698448980.0"},{"comments":[{"comment_id":"1050401","timestamp":"1697966520.0","content":"agreed answer is correct","upvote_count":"1","poster":"danb67"}],"content":"query: |\n let timeframe = ago(3h);\n let threshold = 2;\n imAuthentication\n | where TimeGenerated > timeframe\n | where EventType == 'Logon'\n and EventResult == 'Success'\n | where isnotempty(SrcGeoCountry)\n | summarize","poster":"donathon","comment_id":"980544","timestamp":"1691996280.0","upvote_count":"1"},{"poster":"JoeP1","comment_id":"961992","content":"The ScrGeoCountry is obvious from the isnotempty() 2 lines above, but imAuthentication requires ASIM knowledge.","timestamp":"1690227540.0","upvote_count":"3"}],"answer_ET":"","url":"https://www.examtopics.com/discussions/microsoft/view/96479-exam-sc-200-topic-3-question-57-discussion/","answer":"","answer_images":["https://img.examtopics.com/sc-200/image147.png"],"unix_timestamp":1674390360,"answer_description":""},{"id":"oZ4jtBmrOLjoX4jrgDr1","discussion":[{"poster":"[Removed]","comments":[{"comment_id":"999937","poster":"Fez786","content":"so whats the correct answer? \nPAYG\n90 DAYS\n\n??","comments":[{"upvote_count":"4","content":"Correct ---documented here: https://azure.microsoft.com/en-ca/pricing/details/microsoft-sentinel/\n\nWith the commitment option, the least amount you can commit is 100 GB which is more expensive than PAYG for 20 GB / day data ingestion.","timestamp":"1708656300.0","poster":"Ramye","comment_id":"1156621"}],"timestamp":"1693949760.0","upvote_count":"5"}],"timestamp":"1675196700.0","content":"I got a total cost of 104.40 (20 G) vs 342.52 (100g Commitment) per day. Pay as you go is the better choice.","comment_id":"794597","upvote_count":"16"},{"timestamp":"1673960400.0","comment_id":"778930","content":"https://azure.microsoft.com/en-us/pricing/details/microsoft-sentinel/?cdn=disable\n\nPAYG sounds more practical here due to the commitment tier being 100gb which is much more than 20gb.","upvote_count":"12","comments":[{"comment_id":"778931","content":"For daily ingestion","upvote_count":"1","timestamp":"1673960460.0","comments":[{"upvote_count":"1","comments":[{"upvote_count":"1","comment_id":"851807","content":"ah the tier is a fixed fee, nevermind.","poster":"evilprime","timestamp":"1679899080.0"}],"poster":"evilprime","content":"the 100gb tier is max gb's a day, the price per gb is lower then the daily gb price as the payg model. So in the end the 100gb per day is cheaper for the 20gb.","timestamp":"1679899020.0","comment_id":"851806"}],"poster":"david124"}],"poster":"david124"},{"comment_id":"1401536","content":"Commitment tiers\nIn addition to the pay-as-you-go model, Log Analytics has commitment tiers, which can save you as much as 30 percent compared to the pay-as-you-go price for Analytics Logs. With commitment tier pricing, you can commit to buy data ingestion for a workspace, starting at 100 GB per day","upvote_count":"1","poster":"Onimole","timestamp":"1742560080.0"},{"timestamp":"1722272760.0","comment_id":"1257603","upvote_count":"4","poster":"smanzana","content":"PAYG\n90 days","comments":[{"comment_id":"1294998","timestamp":"1728454980.0","poster":"talosDevbot","upvote_count":"1","content":"Answer 1: PAYG\nPAYG = $104.4/day (current price of $5.22/GB * 20)\nCommitment tier = $342.52/day (rate of the 100GB/day which is the lowest and cheapest commitment tier)\n\nAnswer 2: 90 days\n\"Retention beyond 90 days and up to 2 years will be charged per the standard Azure Monitor retention prices\""}]},{"upvote_count":"3","timestamp":"1711577880.0","comment_id":"1184428","content":"20G per day is too small for Commitment price tier.","poster":"ostralo"},{"upvote_count":"1","poster":"Murtuza","comments":[{"poster":"Ramye","upvote_count":"2","content":"The better option is PAYG\nDocumented here: https://azure.microsoft.com/en-ca/pricing/details/microsoft-sentinel/","comment_id":"1162825","timestamp":"1709226540.0"}],"content":"Based on this article it appears that \" Commitment Tier \" is considered best practices for Sentinel Logs\nhttps://charbelnemnom.com/top-best-practices-for-deploying-azure-sentinel/","comment_id":"1107760","timestamp":"1703766960.0"},{"upvote_count":"3","content":"I find this a very odd question. Tier is out of the question.\nBut why are people not considering the \"daily cap\". I know it's not something you would want to do practically, but a daily cap of 20 GB would limit the costs though...","comment_id":"1056922","timestamp":"1698593220.0","poster":"kabooze"},{"content":"Correct Option","poster":"chepeerick","comment_id":"1056395","timestamp":"1698520800.0","upvote_count":"1"},{"comment_id":"995589","upvote_count":"1","content":"Once Microsoft Sentinel is enabled on your Azure Monitor Log Analytics workspace, every GB of data ingested into the workspace, excluding Basic Logs, can be retained at no charge for the first 90 days. >> 90 days and PAYG because 20GB only which makes PAYG cheaper.","poster":"donathon","timestamp":"1693533360.0"},{"content":"Answer is Correct\n1. Commitment Tiers allow you to reserve a fixed amount of daily data ingestion capacity for Azure Monitor and Azure Sentinel for a fixed, predictable daily fee.\n\n2. Data ingested into either classic or workspace-based Application Insights is retained for 90 days without any charge.\n\nRef: https://azure.microsoft.com/en-us/pricing/details/monitor/","comment_id":"858592","upvote_count":"4","poster":"liliap","comments":[{"upvote_count":"1","content":"True, given answer is correct. To minimize costs for daily ingested data and maximize the data retention period without incurring extra costs, you should use the Commitment Tiers for your Microsoft Sentinel workspace. Commitment Tiers provide discounted pricing based on a commitment to a specific amount of data ingestion per day, allowing you to optimize costs while maintaining the required data retention period.","timestamp":"1689617220.0","poster":"User92","comment_id":"954498"}],"timestamp":"1680419880.0"},{"upvote_count":"6","timestamp":"1676146860.0","comment_id":"805640","content":"On exam 2-11-2023","poster":"altecer"},{"timestamp":"1675168920.0","upvote_count":"3","content":"by default retention is free up to 90 Days.\n\nRetention for Application Insights data types default to 90 days and will get the workspace retention if it is over 90 days","comment_id":"794142","poster":"herta"},{"comment_id":"793032","poster":"saurabh123sml","upvote_count":"4","timestamp":"1675095480.0","content":"first should be PAYG"}],"url":"https://www.examtopics.com/discussions/microsoft/view/95699-exam-sc-200-topic-3-question-58-discussion/","question_text":"HOTSPOT\n-\n\nYou have an Azure subscription.\n\nYou plan to implement a Microsoft Sentinel workspace. You anticipate that you will ingest 20 GB of security log data per day.\n\nYou need to configure storage for the workspace. The solution must meet the following requirements:\n\n• Minimize costs for daily ingested data.\n• Maximize the data retention period without incurring extra costs.\n\nWhat should you do for each requirement? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_images":["https://img.examtopics.com/sc-200/image149.png"],"question_id":190,"exam_id":122,"answer":"","answers_community":[],"question_images":["https://img.examtopics.com/sc-200/image148.png"],"topic":"3","isMC":false,"answer_description":"","answer_ET":"","timestamp":"2023-01-17 14:00:00","unix_timestamp":1673960400}],"exam":{"isImplemented":true,"isBeta":false,"provider":"Microsoft","numberOfQuestions":371,"name":"SC-200","lastUpdated":"12 Apr 2025","id":122,"isMCOnly":false},"currentPage":38},"__N_SSP":true}