{"pageProps":{"questions":[{"id":"mVSvWs4T61UUqScDn1B2","exam_id":122,"answer":"","topic":"1","url":"https://www.examtopics.com/discussions/microsoft/view/100037-exam-sc-200-topic-1-question-37-discussion/","question_text":"DRAG DROP\n-\n\nYou have an Azure subscription that contains the users shown in the following table.\n\n//IMG//\n\n\nYou need to delegate the following tasks:\n\n• Enable Microsoft Defender for Servers on virtual machines.\n• Review security recommendations and enable server vulnerability scans.\n\nThe solution must use the principle of least privilege.\n\nWhich user should perform each task? To answer, drag the appropriate users to the correct tasks. Each user may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","timestamp":"2023-02-20 13:26:00","isMC":false,"answers_community":[],"answer_description":"","question_images":["https://img.examtopics.com/sc-200/image154.png","https://img.examtopics.com/sc-200/image155.png"],"question_id":31,"answer_ET":"","discussion":[{"comment_id":"824883","timestamp":"1677593100.0","upvote_count":"32","comments":[{"timestamp":"1735870980.0","content":"it should be user 3 and user 1.","poster":"landfils","comment_id":"1335862","upvote_count":"4"},{"timestamp":"1726136280.0","content":"Agree with wsrudmen, based on this link https://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions User1 and user1","upvote_count":"1","poster":"mimguy","comment_id":"1282576"},{"upvote_count":"8","comment_id":"1161832","timestamp":"1709139840.0","content":"Both are User3.\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions","poster":"mb0812"},{"poster":"scruzer","upvote_count":"3","comments":[{"comments":[{"content":"I actually tested this out some more...\nWhat a weird question. \n\nMicrosoft Defender for Servers on Virual Machines requires at least Contributor-level on your subscription.\nTo enable Vulnerability assessment for machines (server vulnerability scans on Azure and hybrid machines) you need at least User Access Administrator or Owner on the subscription.\n\nDoesn't matter what your RBAC is, cause these changes are all being performed on the subscription; and the settings page is viewable without Reader.\n\nI'm going to throw this up and say:\nUser3 (assuming they mean the Contributor from the subscription-level)\nUser2 (assuming you are an Owner/User Access Admin with the least-privilege RBAC role)\n\nPlease correct me if I am wrong.","comment_id":"869776","poster":"Holii","upvote_count":"3","timestamp":"1681420980.0"}],"comment_id":"869685","poster":"Holii","content":"Roles listed here do not include actions for enabling server vulnerability scans.\nTested in my demo tenant, Security Reader role can enable vulnerability assessment features on Azure and Hybrid machines.\n\nDue to PoLP, answer is:\nUser1, User2.","timestamp":"1681412340.0","upvote_count":"5"}],"timestamp":"1678722960.0","comment_id":"838043","content":"This is correct! It is clearly listed here. \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions"},{"upvote_count":"1","timestamp":"1699699020.0","comment_id":"1067767","content":"Correct. Required roles and permissions: Owner (resource group level) can deploy the scanner.","poster":"ethhacker"}],"poster":"wsrudmen","content":"It should be User1 for both!\nHow security reader can enable server vulnerability scans?\n\nUser1\nUser1"},{"content":"I would say the answer is User 3 for both, User 1 is an AAD role and not RBAC. \nSecurity Administrator != Security Admin.\n\nContributor can enable plans = Servers Plan\nContributor can apply fix = Enable vulnerable scan from recommendations","timestamp":"1699302180.0","poster":"danlo","upvote_count":"13","comment_id":"1064223"},{"comment_id":"1411802","content":"Contributor role. To do that, you'd need a role like Security Reader or Security Administrator, which includes the ability to view recommendations.\n\nWith the Security Reader role in Microsoft 365 Defender, you can review security recommendations, but you cannot enable server vulnerability scans or make any changes to security configurations.\n\nSo option should be User 1 for both.","timestamp":"1743270360.0","upvote_count":"1","poster":"Kreuz"},{"timestamp":"1724784540.0","content":"Based on the principle of least privilege, you should assign the tasks to the users as follows:\n\nEnable Microsoft Defender for Servers on virtual machines: This task involves enabling a security feature and possibly making changes to resources. The user who should perform this task is User1 (Security Administrator). The Security Administrator has the necessary permissions to manage security features like Microsoft Defender.\n\nReview security recommendations and enable server vulnerability scans: This task primarily involves reviewing security information and enabling scans, which can be done by a Security Reader. The user who should perform this task is User2 (Security Reader). Security Readers can view security recommendations and configure scans, making them the most appropriate role for this task.\n\nSo, the tasks should be assigned as follows:\n\nEnable Microsoft Defender for Servers on virtual machines: User1\nReview security recommendations and enable server vulnerability scans: User2","comment_id":"1273653","poster":"dyavlito","upvote_count":"1"},{"content":"User 1 and User 3","upvote_count":"1","comment_id":"1242584","timestamp":"1720165560.0","poster":"7d801bf"},{"timestamp":"1709406840.0","comment_id":"1164341","poster":"Ramye","upvote_count":"3","content":"The first box is certainly user 3 - contributor that has less permission than Security Admin.\nSo both boxes User 3 contributor"},{"content":"For all those vouching for User 2 for either of the boxes, check this link. NOWHERE it is mentioned that Security Reader can Enable Defender Plans or do the scans. So only option is User1 or User3. For second box, it is Contributor (User3) straight away as Security Admin cannot apply security recommendations. For first box, both user1 and 3 can do the job. However, Contributor has lesser privileges. Hence both boxes = User3","upvote_count":"3","comments":[{"timestamp":"1709312220.0","poster":"mb0812","comment_id":"1163632","content":"https://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions","upvote_count":"1"}],"poster":"mb0812","timestamp":"1709312220.0","comment_id":"1163631"},{"poster":"Ramye","timestamp":"1708984020.0","comments":[{"poster":"Ramye","timestamp":"1708984140.0","content":"To clarify \nAbove I meant Contributor when said Contribute.","upvote_count":"1","comment_id":"1160102"}],"upvote_count":"1","comment_id":"1160101","content":"Based on the least privilege principles, the answer for both is User3 - Contribute. Explanations are given below:\n\n- Contribute has the least privilege who can Enable / disable Microsoft Defender plans\n- Contribute has the least privilege who can View alerts and recommendations and Enable vulnerable scan from recommendations"},{"content":"User 1\nUser 2\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management","comment_id":"1116367","poster":"bitmako","upvote_count":"1","timestamp":"1704684660.0"},{"timestamp":"1703249160.0","poster":"Murtuza","comment_id":"1103365","upvote_count":"1","content":"Security Reader: A user that belongs to this role has read-only access to Defender for Cloud. The user can view recommendations, alerts, a security policy, and security states, but can't make changes."},{"poster":"Chris2pher","comment_id":"1102130","timestamp":"1703127180.0","content":"based on the role matrix only the security admin (S1) can do both. if you select S2 it cannot enable server vulnerability scan while the contributor can do that, the question did not mention subscription level. I think both S1 or S1 and S3","upvote_count":"1"},{"content":"User1\nUser1","upvote_count":"1","comment_id":"1068783","poster":"smanzana","timestamp":"1699814820.0"},{"poster":"Ghost042","timestamp":"1699258860.0","upvote_count":"3","content":"Required roles and permissions: Owner (resource group level) can deploy the Vulnerability scanner while security Reader can only view findings. Answer is Contributor, Security Admin","comment_id":"1063632"},{"upvote_count":"4","content":"user 1\n& User 3\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions\n\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management","comment_id":"1053122","poster":"kabooze","timestamp":"1698175860.0"},{"poster":"chepeerick","comment_id":"1051132","timestamp":"1698010560.0","content":"Correct User1 and User2","upvote_count":"1"},{"upvote_count":"2","comments":[{"upvote_count":"1","content":"So the correct answers would be 1: Contributor, 2: Owner. \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management","comment_id":"1028733","poster":"hovlund","timestamp":"1696846260.0"}],"content":"A VERY big thing to keep in consideration is that Security Administrator is an Entra ID Role, not RBAC, the RBAC role that can administrate Defender for Cloud is Security ADMIN, there is a difference. With that said, i must be contributor for both, or hope that there is different answers in the real test...","timestamp":"1696846140.0","comment_id":"1028732","poster":"hovlund"},{"comment_id":"1016968","poster":"Gurulee","upvote_count":"1","timestamp":"1695658080.0","content":"Tricky, tricky! Following least priv., and referring to https://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions, I believe User1 for both is the answer. In the referenced link, the table notes show add/assign initiatives and enable/disable Defender plans for Security Admin."},{"timestamp":"1693001880.0","comment_id":"990421","poster":"Yurri","upvote_count":"4","comments":[{"timestamp":"1708984680.0","upvote_count":"2","comment_id":"1160107","poster":"Ramye","content":"How come the Security Admin has less permission than the Contibutor?\n\nBoth can enable Microsoft Defender plans but Contributor has less permission based on https://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions"}],"content":"User 1. \nSecurity Administrator: This role can enable Microsoft Defender plans for servers. This role is granted the minimum permissions to enable and configure security-related settings, but not to create or delete resources in the Azure subscription.\n\nUser 3. \nContributor: This role has permissions to create and manage all types of Azure resources, including security features. Assigning the Contributor role at the resource group level for the specific servers should be sufficient to enable server vulnerability scans."},{"comment_id":"970237","content":"The solution must use the principle of least privilege\nUser1\nUser3","upvote_count":"3","poster":"xping85","timestamp":"1690983660.0"},{"timestamp":"1690938420.0","upvote_count":"2","comment_id":"969530","content":"User1 for both. https://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management >> Contributor cannot enable the scan","poster":"donathon"},{"timestamp":"1689752940.0","poster":"billo79152718","comments":[{"poster":"billo79152718","timestamp":"1689768300.0","upvote_count":"1","comment_id":"956591","content":"Read the question for what it is."}],"upvote_count":"1","comment_id":"956396","content":"I will go with User1 on both options.\n\nI will not assume anything if Contributor is not mentioned at subscription level."},{"timestamp":"1689597960.0","comments":[{"poster":"Marchiano","comment_id":"973724","upvote_count":"1","timestamp":"1691317500.0","content":"I see most of you are going with User 1 (Security Admin) or 2 (Security Reader) for the \"enable vulnerability scans\", however, I couldn't find any official source that explicitly specifies that they can do this type of task."}],"upvote_count":"3","poster":"Marchiano","comment_id":"954231","content":"Enable MS Defender for Servers on virtual machines: User 1 (Security administrator)\nSource: https://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions\nReview Security recommendations and enable server vulnerability scans: User 3 (Contributor)\nSource: https://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management\n\nIt is not clear for me if this is requested at Subscription level or not, because if it is, then it will be User 3 on both"},{"timestamp":"1689034860.0","poster":"TomasValtor","comment_id":"948490","upvote_count":"3","content":"it should be User1 : Enable / disable Microsoft Defender plans \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/permissions#roles-and-allowed-actions\n\nand User3: \nRequired roles and permissions: Owner (resource group level) can deploy the scanner\nSecurity Reader can view findings\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-defender-vulnerability-management"},{"upvote_count":"3","timestamp":"1687190220.0","content":"On exam - 19 June 2023","poster":"imhere4you","comment_id":"927659"},{"upvote_count":"1","timestamp":"1682290200.0","content":"Wouldn't 'enabling vulnerability scans' mean turning on scans at the subscription level under Environment settings?\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/auto-deploy-vulnerability-assessment#automatically-enable-a-vulnerability-assessment-solution\n\nIf so, what permission is required to modify the subscription environment setting?\nWould that not be Security Administrator, making both answers User1?","poster":"therealletsgo","comment_id":"878845"},{"content":"well this is what chatgpt thinks: \nBased on the principle of least privilege, the appropriate users for each task are:\n\nTo enable Microsoft Defender for Servers on virtual machines: User 1 - Security administrator, since this task requires administrative privileges and the ability to configure security settings.\n\nTo review security recommendations and enable server vulnerability scans: User 2 - Security reader, since this task only requires read-only access to security information and the ability to view security recommendations. However, User 3 - Contributor can also perform this task if they have been granted the appropriate permissions to access the security recommendations and enable server vulnerability scans.","poster":"evilprime","upvote_count":"1","timestamp":"1679990760.0","comment_id":"852994","comments":[{"poster":"Holii","content":"ChatGPT has provided the wrong answer each time I have referenced it. I would be wary about accepting responses from the platform.","timestamp":"1681390380.0","comment_id":"869415","upvote_count":"11"}]},{"comment_id":"850666","poster":"bsongwk","timestamp":"1679796360.0","upvote_count":"2","content":"To enable Vulnerability Scan, need Contributor right."},{"comment_id":"820586","poster":"[Removed]","timestamp":"1677248040.0","content":"https://learn.microsoft.com/en-us/azure/defender-for-cloud/plan-defender-for-servers-roles#defender-for-cloud-roles","upvote_count":"1"},{"upvote_count":"2","content":"Enable Microsoft Defender for Servers on virtual machines: Sercurity admin = User1\n\nReview security recommendations = Security reader = User 2 \nbut ...\nand enable server vulnerability scans = Security Admin = User 1","timestamp":"1676992020.0","comments":[{"upvote_count":"1","poster":"Holii","content":"Microsoft Defender for Servers can enable vulnerability assessment for machines on Azure and hybrid. This change can be made by Security Reader, but the subscription-level of this account may need Contributor as well (That I did not verify)","timestamp":"1681412520.0","comment_id":"869687"}],"comment_id":"816705","poster":"Valunchai"},{"comment_id":"815203","poster":"[Removed]","timestamp":"1676895960.0","content":"So the correct mapping of users to tasks is:\n\nEnable Microsoft Defender for Servers on virtual machines:\n\nUser 1 (Virtual Machine Contributor)\nReview security recommendations and enable server vulnerability scans:\n\nUser 2 (Security Reader)","upvote_count":"4"}],"unix_timestamp":1676895960,"answer_images":["https://img.examtopics.com/sc-200/image156.png"]},{"id":"Pq1O4iOQM3CmwK9anlZD","url":"https://www.examtopics.com/discussions/microsoft/view/100661-exam-sc-200-topic-1-question-38-discussion/","answer_description":"","answers_community":[],"topic":"1","question_id":32,"discussion":[{"timestamp":"1685036340.0","comment_id":"906811","comments":[{"content":"Correct","comment_id":"1301782","poster":"Nikki0222","timestamp":"1729645440.0","upvote_count":"1"},{"timestamp":"1708986540.0","upvote_count":"2","content":"you have to choose 1 option from each box. You seem to have chosen 2 options from the bottom box.","comment_id":"1160119","poster":"Ramye"}],"content":"EmailAttachmentInfo\n| where Timestamp > ago(1h)\n| where Subject == \"Document Attachment\" and FileName == \"Document.pdf\"\n| join (DeviceFileEvents | where Timestamp > ago(1h)) on SHA256","upvote_count":"6","poster":"omar_alhajsalem"},{"poster":"Pradeep064","comment_id":"1129245","timestamp":"1705992240.0","upvote_count":"5","content":"This question seems a bit unusual, and I'm wondering if it's still relevant. The reason being, the \"EmailAttachmentInfo\" schema doesn't appear to include a \"Subject\" column, and the question suggests filtering based on this \"Subject\" column."},{"poster":"Edindude","content":"EmailAttachmentInfo\n| where Timestamp > ago(1h)\n| where FileName == \"Document.pdf\"\n| join kind=inner (DeviceFileEvents | where Timestamp > ago(1h)) on SHA256","upvote_count":"2","comment_id":"1353396","timestamp":"1739018400.0"},{"content":"I don't know man, It seems like the second table of options is a mistake/typo.\n\nyou need \"join (DeviceFileEvents | where Timestamp > ago(1h)) on SHA256\" to appropriately select the relevant rows to apply the time filter on.\n\nseems outdated on the current Schema","timestamp":"1728177480.0","poster":"Adam7777","comment_id":"1293677","upvote_count":"3"},{"comment_id":"1051230","poster":"chepeerick","timestamp":"1698018060.0","upvote_count":"1","content":"this is correct"},{"content":"https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-best-practices?view=o365-worldwide#optimize-the-join-operator\n\"Apply time filters on both sides—Even if you're not investigating a specific time window, applying time filters on both the left and right tables can reduce the number of records to check and improve join performance.\"","timestamp":"1695758100.0","comment_id":"1018149","poster":"Gurulee","upvote_count":"1"},{"timestamp":"1679620920.0","content":"Wondering is this typo? \n| where Timestamp < ago (1h) --> show only less than one hour which matches. This satisfy the requirement of “Only show emails sent during the last hour”. This should be the correct one.\n\nBut Answer: (| where Timestamp > ago (1h)) how come has greater than is correct answer?? This returns more than our of dataset results right?\nRef: https://learn.microsoft.com/en-us/sharepoint/dev/general-development/keyword-query-language-kql-syntax-reference","poster":"gg7648","upvote_count":"3","comments":[{"timestamp":"1679649420.0","upvote_count":"1","poster":"ultraRunningCA","content":"This is correct, the answer should be 'where timestamp < ago(1h)' to meet the requirement of “Only show emails sent during the last hour” and to \"optimise the query\" the time filter needs to be applied first, so the Join should be the second option","comment_id":"849151","comments":[{"timestamp":"1679650380.0","upvote_count":"1","content":"now I'm not so sure... on the page given by mwoodc the answer provided is shown as :\n\n*Apply time filters on both sides* — Even if you're not investigating a specific time window, applying time filters on both the left and right tables can reduce the number of records to check and improve join performance. The query below applies Timestamp > ago(1h) to both tables so that it joins only records *from* the past hour:\n\nEmailAttachmentInfo\n| where Timestamp > ago(1h)\n| where Subject == \"Document Attachment\" and FileName == \"Document.pdf\"\n| join kind=inner (DeviceFileEvents | where Timestamp > ago(1h)) on SHA256\n\nif you ask bing chat/chatGPT, this is what the query retrieves\nThis KQL query will retrieve information about the email attachments with the subject “Document Attachment” and the file name “Document.pdf” that were sent within the last hour. It will then join this information with the DeviceFileEvents table on the SHA256 hash value\n\nwhich is what the question is asking for...","comment_id":"849166","poster":"ultraRunningCA"},{"upvote_count":"2","timestamp":"1681414560.0","comment_id":"869709","content":"Wrong. This will search for logs from an hour ago till infinity in the past (until your specified time range).\n\nEven plugging this into KQL logs for a test run will throw an error on the statement with a recommendation to change it from < to >\n\nRecommendation:\nThe query time filter may not be efficient. The TimeGenerated filter is looking for smaller than rather than larger than. This may result in querying high volume of very old data that is retained in the system. It is recommended to add a minimum TimeGenerated to be evaluated or to specify a time range to this query (see: https://aka.ms/logqueryperf/time).","poster":"Holii"}]},{"timestamp":"1681195380.0","poster":"teouba","comment_id":"867017","content":"Ago() function subtracts the given timespan from the current UTC time.\nSo if current time is 9.00am, then using ago(1h) means that time goes to 8.00am, so in order to check the timespace 8.00-9.00 you need to use timestamp > ago(1h)","upvote_count":"11"}],"comment_id":"848840"}],"unix_timestamp":1677248460,"answer_ET":"","exam_id":122,"answer_images":["https://img.examtopics.com/sc-200/image158.png"],"isMC":false,"timestamp":"2023-02-24 15:21:00","answer":"","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 E5 subscription.\n\nYou need to create a hunting query that will return every email that contains an attachment named Document.pdf. The query must meet the following requirements:\n\n• Only show emails sent during the last hour.\n• Optimize query performance.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_images":["https://img.examtopics.com/sc-200/image157.png"]},{"id":"PNvbMzir29YjweggKsfp","answer_images":[],"choices":{"A":"Disable legacy protocols on the computers listed as exposed entities.","D":"Install the Local Administrator Password Solution (LAPS) extension on the computers listed as exposed entities.","B":"Enforce LDAP signing on the computers listed as exposed entities.","C":"Modify the properties of the computer objects listed as exposed entities."},"discussion":[{"content":"Selected Answer: C\nOption A, disabling legacy protocols, is not relevant to the question since it's a security measure that restricts the use of legacy protocols that may be less secure than modern protocols.\n\nOption B, enforcing LDAP signing, is also not relevant to the question since it's a security measure that ensures that LDAP traffic is signed and encrypted.\n\nOption D, installing the Local Administrator Password Solution (LAPS) extension, is not relevant to the question since it's a solution that automatically manages local administrator account passwords to help prevent credential theft.\n\nTherefore, the correct answer is C. Modify the properties of the computer objects listed as exposed entities.","upvote_count":"23","timestamp":"1676896320.0","poster":"[Removed]","comment_id":"815213"},{"poster":"Dmend","content":"C. Modify the properties of the computer objects listed as exposed entities.\nhttps://learn.microsoft.com/en-us/defender-for-identity/security-assessment-unconstrained-kerberos","timestamp":"1678280940.0","upvote_count":"7","comment_id":"832978"},{"content":"correct C","upvote_count":"1","timestamp":"1730138400.0","poster":"Pleno","comment_id":"1304081"},{"content":"This question was in the exam 27/04/2024.","comment_id":"1203111","timestamp":"1714221780.0","upvote_count":"4","poster":"DChilds"},{"timestamp":"1698018120.0","content":"correct C","poster":"chepeerick","comment_id":"1051233","upvote_count":"2"}],"answer_description":"","answer":"C","question_text":"Your company has an on-premises network that uses Microsoft Defender for Identity.\n\nThe Microsoft Secure Score for the company includes a security assessment associated with unsecure Kerberos delegation.\n\nYou need remediate the security risk.\n\nWhat should you do?","timestamp":"2023-02-20 13:32:00","topic":"1","unix_timestamp":1676896320,"question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/100040-exam-sc-200-topic-1-question-39-discussion/","answers_community":["C (100%)"],"isMC":true,"answer_ET":"C","exam_id":122,"question_id":33},{"id":"jn3hx9CJ7ez9NpXSgcmO","answers_community":[],"isMC":false,"answer_ET":"BC","exam_id":122,"answer_images":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0001400001.png","https://www.examtopics.com/assets/media/exam-media/04261/0001400002.png","https://www.examtopics.com/assets/media/exam-media/04261/0001400003.png","https://www.examtopics.com/assets/media/exam-media/04261/0001400004.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/63282-exam-sc-200-topic-1-question-4-discussion/","answer":"BC","question_id":34,"discussion":[{"comments":[{"poster":"AlaReAla","content":"I echo, as the requirement is not for audit, but to prevent. So the answer should be A & D.","comments":[{"content":"Agree, auditing doesnt prevent anything only monitors and reports","poster":"Startkabels","comment_id":"460719","timestamp":"1633971300.0","upvote_count":"2"},{"poster":"JohnAvlakiotis","comment_id":"458981","upvote_count":"7","timestamp":"1633654500.0","content":"Agreed, link to reinforce https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#powershell"}],"comment_id":"455661","upvote_count":"17","timestamp":"1633114260.0"},{"upvote_count":"23","timestamp":"1726771620.0","poster":"Metasploit","content":"A,D.\n\nThese are 2 complete solutions on their own. Not a step by step by step.\n1) Add the rule and enable it.\n2) Add the rule, set the rule to overwrite existing rules, and enable it.\n\n\"Set-MpPreference will always overwrite the existing set of rules. If you want to add to the existing set, use Add-MpPreference instead.\"\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#powershell\n\nThe command does not need to mention anything about block because the GUID references a Rule with already set actions.\n\nConfiguration Manager name: Block Office application from creating child processes\nGUID: d4f940ab-401b-4efc-aadc-ad5f3c50688a\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference?source=recommendations&view=o365-worldwide#block-all-office-applications-from-creating-child-processes","comment_id":"690141"},{"upvote_count":"1","poster":"smanzana","content":"I agree, A and D","comment_id":"1066657","timestamp":"1699557120.0"},{"upvote_count":"8","comment_id":"998558","timestamp":"1693832280.0","content":"agree @JohnAvlakiotis A,D...\nThe question or task is to PREVENT. Audits do not accomplish this task.","poster":"BMG6"}],"comment_id":"454483","content":"Should be A, D.","upvote_count":"109","poster":"JohnAvlakiotis","timestamp":"1632947340.0"},{"comments":[{"content":"Yes, normally we add a new audit policy with Add-MpPreference and change the policy to enabled with Set-MpPreference, but in this case, each correct answers presents a complete solution, A&D Right, cause Set can change and create policies too, and Add-MpPreference can only add new policies.","upvote_count":"2","timestamp":"1643225700.0","poster":"pedromonteirozikado","comment_id":"533190"}],"poster":"Haz56","timestamp":"1639755480.0","upvote_count":"13","comment_id":"503764","content":"I would say A&D as the question states \"Each correct answer presents a complete solution.\", so choosing one of the audit options would not be a complete solution on its own to prevent the action"},{"timestamp":"1729644540.0","poster":"Nikki0222","content":"Answer is A,D","comment_id":"1301749","upvote_count":"3"},{"upvote_count":"3","timestamp":"1721106060.0","poster":"Hawklx","content":"It is A and D but we cannot vote for it","comment_id":"1248685"},{"content":"A and D is correct since we need to prevent users and not monitor them.","upvote_count":"2","timestamp":"1719438600.0","poster":"4b097e5","comment_id":"1237760"},{"poster":"Harryd82","content":"A & D is correct answer","timestamp":"1714861080.0","upvote_count":"1","comment_id":"1206685"},{"content":"It is A and D. B and C Place their respective commands in audit mode, which only generates logs and does not take any other action","upvote_count":"1","timestamp":"1714397160.0","poster":"28meters","comment_id":"1204031"},{"comment_id":"1202696","timestamp":"1714148760.0","upvote_count":"1","poster":"AVN1711","content":"correct me if I am wrong, but: first sentence is \"Your company uses line-of-business apps that contain Microsoft Office VBA macros.\" that is mean you already have something and it should work, so you set to Audit only as an exclusion for this particular Macros you need to use, al others/new still gonna be blocked.. so the correct answer is B and C"},{"comment_id":"1056769","timestamp":"1698577980.0","poster":"Dracula666","upvote_count":"1","content":"Add-MpPreference -AttackSurfaceReductionRules_Ids D4F940AB-401B-4EfC-AADC-AD5F3C50688A -AttackSurfaceReductionRules_Actions Enabled\n\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/defender-endpoint-demonstration-attack-surface-reduction-rules?view=o365-worldwide#scenario-2-asr-rule-blocks-the-test-file-with-the-corresponding-vulnerability\n\n\nSet-MpPreference -AttackSurfaceReductionRules_Ids D4F940AB-401B-4EFC-AADC-AD5F3C50688A -AttackSurfaceReductionRules_Actions Enabled\n\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshooting-mode-scenarios?view=o365-worldwide"},{"timestamp":"1692761220.0","comment_id":"987892","poster":"donathon","content":"should be AD.","upvote_count":"1"},{"poster":"tatendazw","timestamp":"1685708520.0","upvote_count":"2","content":"A&D https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#powershell","comment_id":"912809"},{"upvote_count":"1","content":"https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide","timestamp":"1679647680.0","poster":"wyindualizer","comment_id":"849121"},{"content":"Set-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions Enabled\n--\nAdd-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions AuditMode","poster":"SavageJ","timestamp":"1679355600.0","upvote_count":"1","comment_id":"845356"},{"content":"Audit does not mean Blocking Question stands for \"You need to prevent users from downloading and running additional payloads from the Office VBA macros as additional child processes.\" Auditing something you are not implementing anything to prevent, but to gain the knowledge to later on take the action you want to.","upvote_count":"2","comment_id":"795053","timestamp":"1675251360.0","poster":"Nailik_Ms"},{"timestamp":"1665451380.0","poster":"Atun23","upvote_count":"2","content":"According to MS content this should be A and D, because the company is trying to prevent, not checking first if it will work.\n\nAudit mode for evaluation\nUse audit mode to evaluate how attack surface reduction rules would affect your organization if enabled. Run all rules in audit mode first so you can understand how they affect your line-of-business applications. Many line-of-business applications are written with limited security concerns, and they might perform tasks in ways that seem similar to malware. By monitoring audit data and adding exclusions for necessary applications, you can deploy attack surface reduction rules without reducing productivity","comment_id":"691637"},{"comment_id":"676940","content":"It is A & D. I am 100% sure.","upvote_count":"2","timestamp":"1663923960.0","poster":"ArunRavilla"},{"poster":"Sango","content":"A and D are the only logical two: Must use Set-MpPreference with Enabled and then Add-MpPreference with Enabled. Audit does not block.","upvote_count":"2","comment_id":"650394","timestamp":"1661193060.0"},{"upvote_count":"1","content":"This is 100% A,D - you want to SET the RULE (Enable) and then enable ASR. \nReference: https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#powershell","poster":"prjreddit","timestamp":"1658578200.0","comment_id":"635553"},{"poster":"tarakrishna1692","comment_id":"634693","upvote_count":"1","content":"It is A & D","timestamp":"1658417820.0"},{"upvote_count":"1","poster":"sainfosec","comment_id":"634290","content":"It has to be A,D. The requirements are to prevent.","timestamp":"1658362020.0"},{"upvote_count":"5","comments":[{"timestamp":"1652780760.0","poster":"j888","content":"Yep CD. You need to set the rules to enable 1st and then follow by adding the defensive mode","comment_id":"602871","upvote_count":"2"},{"upvote_count":"1","poster":"paraze","comment_id":"1101842","content":"ChatGPT agrees with you :\nTo achieve the goal of preventing users from downloading and running additional payloads from Office VBA macros, you should use the Attack Surface Reduction (ASR) rules in Windows Defender. Specifically, you want to enable ASR rules for Office VBA macros. The correct commands are:\n\nC. Add-MpPreference -AttackSurfaceReductionRules_Ids D4F940AB-401B-4EfC-AADC-AD5F3C50688A -AttackSurfaceReductionRules_Actions Enabled\n\nThis command adds a new Attack Surface Reduction rule for Office VBA macros and enables it.\n\nD. Set-MpPreference -AttackSurfaceReductionRules_Ids D4F940AB-401B-4EFC-AADC-AD5F3C50688A -AttackSurfaceReductionRules_Actions AuditMode\n\nThis command sets the Attack Surface Reduction rule for Office VBA macros to AuditMode. AuditMode allows you to monitor the rule's impact without blocking the execution, which can be useful for testing before enforcing the rule.\n\nSo, the correct options are C and D.","timestamp":"1703097900.0"}],"timestamp":"1652539800.0","comment_id":"601643","content":"C, D\n\nSet-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions Enabled\nAdd-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions AuditMode\n\nLink : https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide","poster":"maf001"},{"upvote_count":"2","comment_id":"575710","timestamp":"1648319160.0","poster":"oreoale","content":"Answers are B,C. \"Enable\" setting does not exist. Each ASR rule contains one of four settings:\nNot configured | Disabled: Disable the ASR rule\nBlock: Enable the ASR rule\nAudit: Evaluate how the ASR rule would impact your organization if enabled\nWarn: Enable the ASR rule but allow the end user to bypass the block\nReference: https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide","comments":[{"timestamp":"1649606520.0","upvote_count":"5","content":"\"ENABLE\" does indeed very much so exist.\nSet-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions Enabled\n\nCorrect answers are A and D","comment_id":"583776","poster":"oldmagic"},{"comment_id":"1005231","upvote_count":"1","timestamp":"1694473800.0","content":"A&D. \"Enable\" setting exist.\nSet-MpPreference -AttackSurfaceReductionRules_Ids <rule ID> -AttackSurfaceReductionRules_Actions Enabled\n\nLink: https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide#:~:text=Type%20one%20of%20the%20following%20cmdlets.%20(For%20more%20information%2C%20such%20as%20rule%20ID%2C%20refer%20to%20Attack%20surface%20reduction%20rules%20reference.)","poster":"arcausbd"}]},{"timestamp":"1645767660.0","comment_id":"555795","upvote_count":"1","poster":"Contactfornitish","content":"Why one would select auditmode?? A & D"},{"timestamp":"1645444140.0","poster":"liberty123","upvote_count":"1","comment_id":"552806","content":"agree with A, D"},{"content":"I was thinking C,D because normally we set a new policy with Add-MpPreference with audit-mode to see the effects of the policy, and after Set-MpPreference to change policy to Enabled mode. But, the correct is A,D because the questions said \"Each correct answer presents a complete solution\", so both Add-MpPreference and Set-MpPreference in Enable mode is correct, cause Set and Add can create policies, but the Set can change policies too.","poster":"pedromonteirozikado","timestamp":"1643225340.0","comment_id":"533182","upvote_count":"5"},{"content":"The answers BC are correct. You can check the link below for more details. \n\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#block-all-office-applications-from-creating-child-processes","comments":[{"timestamp":"1645355880.0","upvote_count":"3","content":"Actually it says AD if you look into configuration article: https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-attack-surface-reduction?view=o365-worldwide","poster":"felipe_g","comment_id":"551722"},{"timestamp":"1642391160.0","comment_id":"525444","content":"yes seems very convincing point imp point is CHILD PROCESSES(You plan to enable protection against downloading and running additional payloads from the Office VBA macros as additional child processes.)","upvote_count":"1","poster":"prabhjot"},{"poster":"pedromonteirozikado","upvote_count":"5","content":"Is not B,C because Audit Mode policies can't block anything.","timestamp":"1643225520.0","comment_id":"533185"}],"timestamp":"1642326000.0","upvote_count":"4","poster":"BubuNigeria","comment_id":"524806"},{"poster":"Jos8","content":"I've got another practice test in which the question is \"You need to identify which Office VBA macros might be affected\" -> The correct answer is B and C because you just want to check the result. \nIn this case, correct answer is A, D because you actually want to activate the rule.","comment_id":"508560","upvote_count":"7","timestamp":"1640360580.0"},{"comment_id":"504237","upvote_count":"2","poster":"Hacker00","content":"A and D correct","timestamp":"1639834560.0"},{"comment_id":"500390","content":"Shoud be A,B? Since Audit mode at first(B) to check and then set to Enable to block(A)","poster":"HelloJim","upvote_count":"1","timestamp":"1639372980.0"},{"upvote_count":"5","comment_id":"485523","poster":"ReginaldoBarreto","timestamp":"1637713500.0","content":"Should be A-D."},{"upvote_count":"1","comments":[{"upvote_count":"5","comment_id":"482779","timestamp":"1637434020.0","content":"From Microsoft:\n\nyou can configure attack surface reduction capabilities to run in audit mode to see how they'll work. In audit mode, you can enable:\n\nAttack surface reduction rules\nExploit protection\nNetwork protection\nAnd controlled folder access in audit mode\nAudit mode lets you see a record of what would have happened if you had enabled the feature.\n\nYou can enable audit mode when testing how the features will work. This will help make sure your line-of-business apps aren't affected. You can also get an idea of how many suspicious file modification attempts occur over a certain period of time.\n\nThe features won't block or prevent apps, scripts, or files from being modified. However, the Windows Event Log will record events as if the features were fully enabled. With audit mode, you can review the event log to see what affect the feature would have had if it was enabled.","poster":"Remilia"}],"comment_id":"482778","content":"Can anyone confirm if the correct answer really is AD and not BC?","poster":"Remilia","timestamp":"1637433960.0"},{"timestamp":"1634025840.0","upvote_count":"5","comment_id":"460975","content":"Set-MpPreference should always precede Add-MpPreference always so A and D are correct answers as the mode is enabled for both of them (protect)","poster":"arunkum"}],"unix_timestamp":1632947340,"answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction","topic":"1","timestamp":"2021-09-29 22:29:00","question_text":"Your company uses line-of-business apps that contain Microsoft Office VBA macros.\nYou need to prevent users from downloading and running additional payloads from the Office VBA macros as additional child processes.\nWhich two commands can you run to achieve the goal? Each correct answer presents a complete solution.\nNOTE: Each correct selection is worth one point.\nA.\n//IMG//\n\nB.\n//IMG//\n\nC.\n//IMG//\n\nD.\n//IMG//"},{"id":"G3zSyslLxQXGxb5PKAof","answer_images":[],"answer_ET":"A","topic":"1","question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/100918-exam-sc-200-topic-1-question-40-discussion/","question_id":35,"unix_timestamp":1677466800,"answer":"A","timestamp":"2023-02-27 04:00:00","discussion":[{"content":"correct\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/m365d-autoir-actions?view=o365-worldwide#undo-completed-actions","comment_id":"832291","poster":"slimjago","timestamp":"1678222800.0","upvote_count":"7"},{"content":"Correct","comment_id":"1301783","upvote_count":"2","poster":"Nikki0222","timestamp":"1729645440.0"},{"upvote_count":"1","poster":"chepeerick","content":"option A","comment_id":"1051263","timestamp":"1698020820.0"},{"comment_id":"1050252","content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/m365d-autoir-actions?view=o365-worldwide#undo-completed-actions\n\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/m365d-autoir-actions?view=o365-worldwide#to-remove-a-file-from-quarantine-across-multiple-devices","poster":"Dracula666","upvote_count":"1","timestamp":"1697955360.0"},{"comment_id":"912619","timestamp":"1685692380.0","content":"Selected Answer: A\nConfirmed A is correct","poster":"billo79152718","upvote_count":"1"},{"comment_id":"823130","comments":[{"comment_id":"823131","timestamp":"1677466860.0","poster":"antoniokt","content":"However, please correct me if I am wrong.","upvote_count":"3"}],"timestamp":"1677466800.0","poster":"antoniokt","content":"Selected Answer: A\nA is correct","upvote_count":"3"}],"choices":{"D":"From Threat tracker, review the queries.","B":"From the investigation page, review the AIR processes.","C":"From Quarantine from the Review page, modify the rules.","A":"From the History tab in the Action center, revert the actions."},"answers_community":["A (100%)"],"answer_description":"","question_text":"You have a Microsoft 365 subscription that uses Microsoft 365 Defender.\n\nA remediation action for an automated investigation quarantines a file across multiple devices.\n\nYou need to mark the file as safe and remove the file from quarantine on the devices.\n\nWhat should you use in the Microsoft 365 Defender portal?","exam_id":122,"isMC":true}],"exam":{"isImplemented":true,"isBeta":false,"lastUpdated":"12 Apr 2025","provider":"Microsoft","name":"SC-200","id":122,"isMCOnly":false,"numberOfQuestions":371},"currentPage":7},"__N_SSP":true}