{"pageProps":{"questions":[{"id":"oJ4gxNQSLPzbyzRefIfU","url":"https://www.examtopics.com/discussions/microsoft/view/100159-exam-sc-200-topic-1-question-41-discussion/","answers_community":["B (100%)"],"question_text":"You have a Microsoft 365 E5 subscription that uses Microsoft 365 Defender.\n\nYou need to review new attack techniques discovered by Microsoft and identify vulnerable resources in the subscription. The solution must minimize administrative effort.\n\nWhich blade should you use in the Microsoft 365 Defender portal?","timestamp":"2023-02-21 01:18:00","isMC":true,"exam_id":122,"unix_timestamp":1676938680,"answer":"B","choices":{"D":"Learning hub","C":"Incidents & alerts","B":"Threat analytics","A":"Advanced hunting"},"question_images":[],"question_id":36,"topic":"1","answer_images":[],"answer_ET":"B","answer_description":"","discussion":[{"timestamp":"1676938680.0","content":"Selected Answer: B\nAnswer B:\nHowever, please correct me if I am wrong.","upvote_count":"8","comment_id":"816052","comments":[{"comment_id":"846498","poster":"mumumu","upvote_count":"3","content":"yes, it is B\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/threat-analytics?view=o365-worldwide","timestamp":"1679444340.0"}],"poster":"kay000001"},{"poster":"Nikki0222","timestamp":"1729645440.0","upvote_count":"2","comment_id":"1301784","content":"B correct"},{"timestamp":"1719380760.0","comment_id":"1237215","content":"On Exam 25/06/2024","poster":"Rand0mConsultant","upvote_count":"4"},{"comment_id":"1107970","content":"The question implies emerging threats which is provided by MS in Threat Analytics Blade of MS Defender","timestamp":"1703781540.0","upvote_count":"1","poster":"Murtuza"},{"timestamp":"1698020820.0","poster":"chepeerick","comment_id":"1051264","upvote_count":"2","content":"Option B"},{"poster":"tatendazw","content":"Correct browse to https://security.microsoft.com/threatanalytics3 or on M365 Defender go to Threat intelligence, expand it and click Threat analytics","upvote_count":"2","comment_id":"916252","timestamp":"1686055920.0"}]},{"id":"Ly5f5Nb1saRsM3nZaqBn","answer_images":[],"answer":"D","answer_description":"","question_text":"Case study -\n\nThis is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.\n\nTo answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.\n\nAt the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.\n\n\nTo start the case study -\nTo display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.\n\n\nOverview -\n\nFabrikam, Inc. is a financial services company.\n\nThe company has branch offices in New York, London, and Singapore. Fabrikam has remote users located across the globe. The remote users access company resources, including cloud resources, by using a VPN connection to a branch office.\n\n\nExisting Environment -\n\n\nIdentity Environment -\n\nThe network contains an Active Directory Domain Services (AD DS) forest named fabrikam.com that syncs with an Azure AD tenant named fabrikam.com. To sync the forest, Fabrikam uses Azure AD Connect with pass-through authentication enabled and password hash synchronization disabled.\n\nThe fabrikam.com forest contains two global groups named Group1 and Group2.\n\n\nMicrosoft 365 Environment -\n\nAll the users at Fabrikam are assigned a Microsoft 365 E5 license and an Azure Active Directory Premium Plan 2 license.\n\nFabrikam implements Microsoft Defender for Identity and Microsoft Defender for Cloud Apps and enables log collectors.\n\n\nAzure Environment -\n\nFabrikam has an Azure subscription that contains the resources shown in the following table.\n\n//IMG//\n\n\nAmazon Web Services (AWS) Environment\n\nFabrikam has an Amazon Web Services (AWS) account named Account1. Account1 contains 100 Amazon Elastic Compute Cloud (EC2) instances that run a custom Windows Server 2022. The image includes Microsoft SQL Server 2019 and does NOT have any agents installed.\n\n\nCurrent Issues -\n\nWhen the users use the VPN connections, Microsoft 365 Defender raises a high volume of impossible travel alerts that are false positives.\n\nDefender for Identity raises a high volume of Suspected DCSync attack alerts that are false positives.\n\n\nRequirements -\n\n\nPlanned changes -\n\nFabrikam plans to implement the following services:\n\n• Microsoft Defender for Cloud\n• Microsoft Sentinel\n\n\nBusiness Requirements -\n\nFabrikam identifies the following business requirements:\n\n• Use the principle of least privilege, whenever possible.\n• Minimize administrative effort.\n\nMicrosoft Defender for Cloud Apps Requirements\n\nFabrikam identifies the following Microsoft Defender for Cloud Apps requirements:\n\n• Ensure that impossible travel alert policies are based on the previous activities of each user.\n• Reduce the amount of impossible travel alerts that are false positives.\n\nMicrosoft Defender for Identity Requirements\n\nMinimize the administrative effort required to investigate the false positive alerts.\n\nMicrosoft Defender for Cloud Requirements\n\nFabrikam identifies the following Microsoft Defender for Cloud requirements:\n\n• Ensure that the members of Group2 can modify security policies.\n• Ensure that the members of Group1 can assign regulatory compliance policy initiatives at the Azure subscription level.\n• Automate the deployment of the Azure Connected Machine agent for Azure Arc-enabled servers to the existing and future resources of Account1.\n• Minimize the administrative effort required to investigate the false positive alerts.\n\n\nMicrosoft Sentinel Requirements -\n\nFabrikam identifies the following Microsoft Sentinel requirements:\n\n• Query for NXDOMAIN DNS requests from the last seven days by using built-in Advanced Security Information Model (ASIM) unifying parsers.\n• From AWS EC2 instances, collect Windows Security event log entries that include local group membership changes.\n• Identify anomalous activities of Azure AD users by using User and Entity Behavior Analytics (UEBA).\n• Evaluate the potential impact of compromised Azure AD user credentials by using UEBA.\n• Ensure that App1 is available for use in Microsoft Sentinel automation rules.\n• Identify the mean time to triage for incidents generated during the last 30 days.\n• Identify the mean time to close incidents generated during the last 30 days.\n• Ensure that the members of Group1 can create and run playbooks.\n• Ensure that the members of Group1 can manage analytics rules.\n• Run hunting queries on Pool1 by using Jupyter notebooks.\n• Ensure that the members of Group2 can manage incidents.\n• Maximize the performance of data queries.\n• Minimize the amount of collected data.\n\n\nYou need to minimize the effort required to investigate the Microsoft Defender for Identity false positive alerts.\n\nWhat should you review?","question_images":["https://img.examtopics.com/sc-200/image172.png"],"question_id":37,"isMC":true,"topic":"1","timestamp":"2023-08-02 05:00:00","exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/117039-exam-sc-200-topic-1-question-42-discussion/","unix_timestamp":1690945200,"discussion":[{"content":"Selected Answer: D\nhttps://learn.microsoft.com/en-us/defender-for-identity/understanding-security-alerts#defender-for-identity-and-nnr-network-name-resolution","timestamp":"1690945200.0","comment_id":"969592","upvote_count":"14","poster":"donathon"},{"upvote_count":"6","comment_id":"1048738","poster":"Rajpatlolla","content":"Selected Answer: D\nOption D, is the right choice because it focuses on making sure we are very sure about where the alerts are coming from in Microsoft Defender for Identity. This helps us save time and effort when dealing with false alarms. It also allows us to respond faster to real threats.","timestamp":"1697802660.0"},{"timestamp":"1736016780.0","content":"Selected Answer: C\nhe alert status provides an indication of whether the alert is being investigated, dismissed, or remediated. By reviewing and analyzing the alert status in Defender for Identity, you can quickly determine if an alert is a false positive and act accordingly. Managing false positives and dismissing them or resolving them effectively helps reduce investigation efforts.","upvote_count":"1","comment_id":"1336490","poster":"Nova458453"},{"upvote_count":"2","comment_id":"1301785","timestamp":"1729645440.0","poster":"Nikki0222","comments":[{"comment_id":"1301786","content":"Correct *","poster":"Nikki0222","upvote_count":"1","timestamp":"1729645500.0"}],"content":"D correr"},{"timestamp":"1698020880.0","comment_id":"1051266","content":"Option D","poster":"chepeerick","upvote_count":"3"},{"content":"the correct answer is C and D. You should review the alert status and the certainty of the source computer to minimize the effort required to investigate the false positive alerts","timestamp":"1694353080.0","upvote_count":"1","poster":"mali1969","comment_id":"1004019","comments":[{"poster":"Ramye","comment_id":"1137507","content":"You have to choose just one answer - the one best suited for the scenario.","upvote_count":"1","timestamp":"1706783400.0"}]},{"content":"Well, please argue if I may be wrong, but both B and D seems to be correct here.\n\nBasically the way to go about this investigation is indeed to check the alerts for low certainty on Source/Destination computers, but just the same goes for resolution method, so... it should be both, if not, why just D? \n\nThanks!","poster":"cris_exam","timestamp":"1693945740.0","comment_id":"999872","upvote_count":"3"},{"content":"Selected Answer: B\nShould this not be: B. the resolution method of the source computer ? - Correct me if I am wrong.","poster":"billo79152718","comment_id":"970070","upvote_count":"2","timestamp":"1690973820.0"}],"answer_ET":"D","answers_community":["D (87%)","9%"],"choices":{"C":"the alert status","A":"the status update time","D":"the certainty of the source computer","B":"the resolution method of the source computer"}},{"id":"uhFQKxfKkgdZ5YJJSoeU","exam_id":122,"question_images":["https://img.examtopics.com/sc-200/image183.png"],"discussion":[{"upvote_count":"12","comment_id":"1008397","timestamp":"1694776440.0","poster":"trashbox","comments":[{"poster":"Nikki0222","comment_id":"1301787","timestamp":"1729645500.0","upvote_count":"1","content":"Correct"},{"upvote_count":"3","timestamp":"1695792240.0","poster":"donathon","comment_id":"1018468","content":"IdentityInfo does have AccountUpn. But since the query is about logon events, then IdentityLogonEvents would contain the correct data while IdentityInfo just have the information about the Identity and not the logonevents."}],"content":"1. IdentityLogonEvents\nThe final column requires \"AccountUpn.\" Therefore, \"IdentityInfo\" would not be appropriate. Since it's about sign-in attempts to ADDS domain controllers, \"IdentityLogonEvents\" would be the suitable choice.\n\n2. union\nWe need to extract the latest 100 sign-in attempts from BOTH \"Devices\" AND \"ADDS domain controllers.\" Using \"union\" would be optimal."},{"poster":"mipe64","comment_id":"1043651","content":"DeviceLogonEvents\n| extend Table = 'DeviceLogonEvents'\n| take 100\n| union (\n IdentityLogonEvents \n | extend Table = 'IdentityLogonEvents'\n | take 100\n)\n| project-reorder Timestamp, Table, AccountDomain, AccountName, AccountUpn, AccountSid \n| order by Timestamp asc","upvote_count":"5","timestamp":"1697305920.0"},{"upvote_count":"2","poster":"user636","content":"I think the images for the answers are swapped in the question. \nYou need to select the \"Union\" operator first and then the second table name \"IdentityLogonEvents\". \n\nFirstTable\n| take 100\n| union ( SecondTable | take 100)\n| project TimeGenerated, AccountName\n\nRef: https://learn.microsoft.com/en-us/training/modules/build-multi-table-statements-kusto-query-language/2-use-union-operator","comment_id":"1273383","timestamp":"1724755980.0"},{"poster":"wheeldj","content":"Can explain how use the take operator in this query would return the 100 MOST RECENT logons?\n\nI thought Take returned a random selection. wouldn't it be better to use Top instead?\nie - top 100 by Timestamp","comment_id":"1199208","timestamp":"1713625440.0","upvote_count":"3"},{"poster":"smanzana","comment_id":"1069655","timestamp":"1699901820.0","upvote_count":"1","content":"Answer:\nIdentityLogonEvents\nUnion"},{"comments":[{"upvote_count":"2","content":"Yes, I just tested with Imreed's query. Didn't get any error but the result came empty as i dont's have relevant info.","comment_id":"1160162","timestamp":"1708993740.0","poster":"Ramye"}],"content":"Query syntax is all wrong in question. Imreed is correct with this syntax.","timestamp":"1697288340.0","poster":"danb67","upvote_count":"3","comment_id":"1043446"},{"poster":"imreed","comment_id":"1039338","content":"DeviceLogonEvents | extend Table = 'table1' | take 100\n| union IdentityLogonEvents\n| extend table = 'table2' | take 100 \n| project-reorder Timestamp, Table, AccountDomain, AccountName, AccountUpn, AccountSid\n| order by Timestamp asc\n\nAnswer - \nIdentityLogonEvents\nUnion","upvote_count":"4","timestamp":"1696929420.0"},{"comment_id":"1004026","upvote_count":"2","poster":"mali1969","content":"DeviceLogonEvnets | extend Table = 'table1' | take 100\n| DeviceLogonEvent (\n| union \n| extented table = 'table2' | take 100 )\n| project-reorder Timestamp, Table, AccountDomain, AccountName, AccountUpn, AccountSid \n| order by Timestamp asc\n\nDeviceLogonEvent\nUnion","timestamp":"1694353680.0"},{"comment_id":"1002889","timestamp":"1694232720.0","comments":[{"content":"Or you could actually throw up a lab in 20 mins and test it. Just a thought.","comment_id":"1027298","timestamp":"1696679460.0","poster":"danb67","upvote_count":"9"}],"content":"Need someone to confirm the correct answer please.\n NO chatGPT lickers or opinion prophets please.","upvote_count":"1","poster":"Fez786"},{"comment_id":"1002888","comments":[{"comments":[{"timestamp":"1696367820.0","poster":"Fez786","upvote_count":"1","comment_id":"1024236","content":"i have no idea. i am learning just like you. therefore i dont know whats the correct answer"}],"poster":"Unlikely","timestamp":"1695476340.0","upvote_count":"1","comment_id":"1014950","content":"Fez, since you've had the question IRL: is the syntax here correct? shouldn't union be before parenthesis?"}],"content":"This new question arrived today 9th september 2033","poster":"Fez786","timestamp":"1694232600.0","upvote_count":"1"}],"answer":"","question_id":38,"isMC":false,"unix_timestamp":1694232600,"answer_images":["https://img.examtopics.com/sc-200/image184.png"],"answer_ET":"","topic":"1","answer_description":"","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 E5 subscription that uses Microsoft Defender 365.\n\nYour network contains an on-premises Active Directory Domain Services (AD DS) domain that syncs with Azure AD.\n\nYou need to identify the 100 most recent sign-in attempts recorded on devices and AD DS domain controllers.\n\nHow should you complete the KQL query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","url":"https://www.examtopics.com/discussions/microsoft/view/120310-exam-sc-200-topic-1-question-43-discussion/","answers_community":[],"timestamp":"2023-09-09 06:10:00"},{"id":"G6KUhKMLSaUrCSxxRESf","isMC":false,"topic":"1","discussion":[{"poster":"trashbox","content":"1. IdentityQueryEvents\nWhen considering a table with AccountSid and it's about the LDAP request, it is \"IdentityQueryEvents.\"\n\n2. isnotempty\nFor determining whether there is a value in the AccountSid, it is \"isnotempty.\"","comment_id":"1008411","comments":[{"upvote_count":"1","poster":"Nikki0222","timestamp":"1729645500.0","comment_id":"1301788","content":"Correct"}],"timestamp":"1694777460.0","upvote_count":"13"},{"comment_id":"1237216","timestamp":"1719380760.0","poster":"Rand0mConsultant","content":"On Exam 25/06/2024","upvote_count":"5"},{"content":"IdentityQueryEvents\nisnotempty","upvote_count":"1","comment_id":"1071718","poster":"smanzana","timestamp":"1700069460.0"},{"comment_id":"1012041","timestamp":"1695198300.0","content":"in exam 9/20/23","upvote_count":"4","poster":"jamclash"},{"poster":"a311","comment_id":"1008347","timestamp":"1694771640.0","content":"Correct answer (tested): \nIdentityQueryEvents\n| where isnotempty(AccountSid)\n\n\"has\" syntax requires a column (ref. https://learn.microsoft.com/en-us/azure/data-explorer/kusto/query/has-operator#syntax) while \"isnotempty\" can follow a \"where\" (ref. https://learn.microsoft.com/en-us/azure/data-explorer/kusto/query/isnotemptyfunction#example)","upvote_count":"4"},{"comments":[{"poster":"mali1969","comment_id":"1004035","comments":[{"comment_id":"1024592","timestamp":"1696409760.0","poster":"hovlund","upvote_count":"1","content":"Isnotempty is correct, verify here: https://learn.microsoft.com/en-us/azure/data-explorer/kusto/query/isnotemptyfunction. it checks if there is a value. Where \"has\" compares a value, and there is no value to compare, it is only checking if there is a value in general"}],"upvote_count":"1","content":"pls confirm 2nd option either has or isnotempty","timestamp":"1694354340.0"}],"timestamp":"1694354160.0","content":"IdentityQueryEvent | where has (AccountSid) \n\nTo identify LDAP requests by AD DS users to enumerate AD DS objects, you need to use the IdentityQueryEvent table, which contains information about LDAP queries performed by users or applications. You also need to use the has operator, which checks if a string field contains a specified substring. Finally, you need to filter by the AccountSid column, which contains the security identifier (SID) of the user or application that performed the query","upvote_count":"1","comment_id":"1004031","poster":"mali1969"},{"content":"This new question arrived today 9th september 2023. Can someone please verify the correct","upvote_count":"1","poster":"Fez786","comment_id":"1002985","timestamp":"1694241480.0"}],"question_id":39,"answer_description":"","answer":"","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 E5 subscription that uses Microsoft Defender 365.\n\nYour network contains an on-premises Active Directory Domain Services (AD DS) domain that syncs with Azure AD.\n\nYou need to identify LDAP requests by AD DS users to enumerate AD DS objects.\n\nHow should you complete the KQL query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answers_community":[],"url":"https://www.examtopics.com/discussions/microsoft/view/120311-exam-sc-200-topic-1-question-44-discussion/","answer_images":["https://img.examtopics.com/sc-200/image186.png"],"exam_id":122,"answer_ET":"","timestamp":"2023-09-09 06:14:00","unix_timestamp":1694232840,"question_images":["https://img.examtopics.com/sc-200/image185.png"]},{"id":"P6aKPKb2zBC2Hv067crr","timestamp":"2023-09-09 06:18:00","answers_community":["C (100%)"],"question_images":[],"question_id":40,"isMC":true,"exam_id":122,"answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/120312-exam-sc-200-topic-1-question-45-discussion/","topic":"1","answer_images":[],"discussion":[{"content":"Selected Answer: C\nAnswer is C:\n\nA. User enrichment settings in the context of Defender for Cloud Apps typically involve enriching user data with additional info from external sources. While user enrichment can be beneficial, it is not directly related to investigating threats using the unified audit log.\n\nB. The Azure connector is generally used for connecting Defender for Cloud Apps to Azure services. It is not specifically related to investigating threats in the unified audit log.\n\nC. Configuring the Office 365 connector allows Microsoft Defender for Cloud Apps to collect and analyze audit logs, which are vital for investigating and responding to security threats.\n\nD. While automatic log upload settings are important for ensuring that the logs are regularly uploaded, it's the configuration of the specific connectors (such as the Office 365 connector) that determines which logs are collected and made available for investigation.","comment_id":"1142306","upvote_count":"9","timestamp":"1707232380.0","poster":"Porter5000"},{"content":"C answer","timestamp":"1729645500.0","poster":"Nikki0222","comment_id":"1301789","upvote_count":"1"},{"comment_id":"1191489","timestamp":"1712569500.0","poster":"conu","content":"the correct answer should be Microsoft 365 Connector, not Office 365 Connector.","upvote_count":"2"},{"poster":"chepeerick","upvote_count":"1","timestamp":"1698021240.0","comment_id":"1051271","content":"Option C"},{"timestamp":"1694679240.0","comment_id":"1007352","upvote_count":"4","content":"Selected Answer: C\nC - Office 365 connector\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/connect-office-365","poster":"NICKTON81"},{"upvote_count":"2","poster":"mali1969","timestamp":"1694354520.0","comment_id":"1004037","content":"Selected Answer: C\noffice 365 connector"},{"content":"This new question arrived today 9th september 2023.\nCan someone please verify the correct answer?","timestamp":"1694233080.0","upvote_count":"1","comment_id":"1002894","poster":"Fez786"}],"answer":"C","unix_timestamp":1694233080,"answer_ET":"C","choices":{"D":"the Automatic log upload settings","C":"the Office 365 connector","A":"the User enrichment settings","B":"the Azure connector"},"question_text":"You have a Microsoft 365 E5 subscription that uses Microsoft Defender 365.\n\nYou need to ensure that you can investigate threats by using data in the unified audit log of Microsoft Defender for Cloud Apps.\n\nWhat should you configure first?"}],"exam":{"numberOfQuestions":371,"isImplemented":true,"lastUpdated":"12 Apr 2025","name":"SC-200","isBeta":false,"id":122,"isMCOnly":false,"provider":"Microsoft"},"currentPage":8},"__N_SSP":true}