{"pageProps":{"questions":[{"id":"jaRwYmeZkWDvyE58BFRL","isMC":false,"answer_images":["https://img.examtopics.com/sc-200/image308.png"],"answer_description":"","unix_timestamp":1718449140,"answer":"","topic":"7","exam_id":122,"answers_community":[],"timestamp":"2024-06-15 12:59:00","answer_ET":"","question_images":["https://img.examtopics.com/sc-200/image307.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/142582-exam-sc-200-topic-7-question-9-discussion/","discussion":[{"timestamp":"1718449140.0","comment_id":"1230901","poster":"jumborca","content":"answer from GPT4\nlet Logons = SecurityEvent\n| where EventID == 4624\n| summarize LogonCount = count() by AccountName;\nlet Logoffs = SecurityEvent\n| where EventID == 4634\n| summarize LogoffCount = count() by AccountName;\nLogons\n| join kind=inner (Logoffs)\n on AccountName\n| project AccountName, LogonCount, LogoffCount\n| render barchart","upvote_count":"3"}],"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace that contains a custom workbook named Workbook1.\n\nYou need to create a visual in Workbook1 that will display the logon count for accounts that have logon event IDs of 4624 and 4634.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_id":361},{"id":"A8EWsCbH0y0Kdafx8xgZ","question_text":"You need to complete the query for failed sign-ins to meet the technical requirements.\nWhere can you find the column name to complete the where clause?","unix_timestamp":1640022000,"discussion":[{"comments":[{"poster":"Metasploit","timestamp":"1698478260.0","comment_id":"706235","content":"I agree, D. For this case scenario and as per requirement, Identify all cases of users who failed to sign in to an Azure resource for the first time from a given country. \n\nYou may want to update the enrichment with \"FirstTimeUserConnectedFromCountry\". :)\nhttps://learn.microsoft.com/en-us/azure/sentinel/ueba-reference#country-connected-from","upvote_count":"3"}],"poster":"Lion007","upvote_count":"13","content":"Selected Answer: D\nD is correct. By increasing the time window, we would know if the failed sign ins are common or suspecious. \n\nThe corrected code would be something like:\n\n\nBehaviorAnalytics\n| where ActivityType == \"FailedLogOn\"\n| extend ActivityInsightsArray=parse_json(ActivityInsights)\n| extend UnusualFailedSignIns = tostring(parse_json(ActivityInsightsArray).UnusualNumberOfFailedSignInOfThisUser)\n| where UnusualFailedSignIns == True\n| summarize count() by SourceIPLocation, UserName\n| order by count_ desc","timestamp":"1688060280.0","comment_id":"624810"},{"timestamp":"1671558000.0","content":"D-Correct answer","upvote_count":"8","poster":"Hacker00","comment_id":"505592"},{"timestamp":"1730221620.0","content":"Correct option","comment_id":"1057004","poster":"chepeerick","upvote_count":"1"},{"poster":"Muffen","timestamp":"1679142720.0","content":"Selected Answer: D\nCorrect - The query window will provide IntelliSense to help figure out what the column is as you type. You can also just do a broad search for all failed logins and see which columns are returned in the output.\n\nReference: https://docs.microsoft.com/en-us/azure/azure-monitor/logs/log-analytics-tutorial#write-a-query","upvote_count":"6","comment_id":"570512"}],"answer":"D","question_images":[],"choices":{"D":"the query windows of the Log Analytics workspace","A":"Security alerts in Azure Security Center","C":"Azure Advisor","B":"Activity log in Azure"},"topic":"8","timestamp":"2021-12-20 18:40:00","url":"https://www.examtopics.com/discussions/microsoft/view/68331-exam-sc-200-topic-8-question-1-discussion/","exam_id":122,"question_id":362,"answer_description":"","answer_images":[],"answers_community":["D (100%)"],"answer_ET":"D","isMC":true},{"id":"J0YSDOjhwZ2n4iOJXIEM","topic":"8","discussion":[{"comments":[{"timestamp":"1708898580.0","poster":"Ramye","comment_id":"1159227","upvote_count":"5","content":"Just adding the below so it’s easy to remember \n\nLogic Apps = Playbooks = Automation"}],"timestamp":"1633052400.0","content":"Correct. Logic Apss = Playbooks which provide automated workflows to run based on triggers.","poster":"Eltooth","comment_id":"455232","upvote_count":"17"},{"upvote_count":"7","comment_id":"450404","timestamp":"1632414960.0","poster":"AlaReAla","content":"\"Playbooks in Azure Sentinel are based on workflows built in Azure Logic Apps, a cloud service that helps you schedule, automate, and orchestrate tasks and workflows across systems throughout the enterprise. This means that playbooks can take advantage of all the power and customizability of Logic Apps' built-in templates.\""},{"timestamp":"1724312520.0","upvote_count":"1","content":"Selected Answer: D\nExplanation: Azure Sentinel is a cloud-native SIEM (Security Information and Event Management) system that provides intelligent security analytics and threat intelligence across the enterprise. Sentinel livestreams allow security teams to create real-time, continuous monitoring streams that can be used to detect and respond to active attacks immediately. This feature is specifically designed for active monitoring and rapid response, making it the best fit for the requirement to \"rapidly remediate active attacks.\"","poster":"g_man_rap","comment_id":"1270555"},{"poster":"chepeerick","upvote_count":"1","content":"Correct option to use playbooks","timestamp":"1698599580.0","comment_id":"1057011"},{"content":"Selected Answer: B\nCorrect. Logic apps will help automate remediations via Playbooks. The ketword in the question is \"rapidly remediating active attacks\".","poster":"Lion007","upvote_count":"3","comment_id":"624813","timestamp":"1656524400.0"},{"poster":"Fllinstone","content":"\"Active Attack\" makes me feel like it's D.","comments":[{"content":"I thought the same :D","timestamp":"1671149460.0","comment_id":"746617","upvote_count":"1","poster":"Lafsa"},{"poster":"Jens128","content":"I felt the same, but livestreams are for \"test new queries, get notified when events occurs and launch investigation\" - so no imidiate action included","comment_id":"534660","upvote_count":"7","timestamp":"1643370900.0"},{"poster":"Ramye","comment_id":"1159228","content":"Yes, active attack but also says to remediate rapidly. So how do you do that? Using automation - that’s Playbooks","upvote_count":"2","timestamp":"1708898760.0"}],"comment_id":"470975","timestamp":"1635725940.0","upvote_count":"6"}],"question_id":363,"url":"https://www.examtopics.com/discussions/microsoft/view/62620-exam-sc-200-topic-8-question-2-discussion/","answer_images":[],"question_images":[],"answer_ET":"B","isMC":true,"exam_id":122,"unix_timestamp":1632414960,"answers_community":["B (75%)","D (25%)"],"question_text":"You need to remediate active attacks to meet the technical requirements.\nWhat should you include in the solution?","timestamp":"2021-09-23 18:36:00","answer_description":"","answer":"B","choices":{"B":"Azure Logic Apps","D":"Azure Sentinel livestreams","C":"Azure Functions","A":"Azure Automation runbooks"}},{"id":"hIj3TO2vcojA1OSYlgL7","exam_id":122,"answer":"","timestamp":"2021-05-14 14:48:00","discussion":[{"comments":[{"poster":"teehex","timestamp":"1641282840.0","comment_id":"398047","comments":[{"content":"Not everything. You can see in their examples within your posted url where the changes are for one of their queries.\n\nThe appfileevents had the folderpath column but the updated cloudappevents query did not have the folderpath column as it is not part of cloudappevents.","timestamp":"1682668080.0","comment_id":"706245","upvote_count":"6","poster":"Metasploit"},{"comment_id":"456751","timestamp":"1649017680.0","poster":"AlaReAla","content":"I too will go with @Teehex. Quoting the text from shared URL for your ease:\n\n\"The AppFileEvents table, which contains file activities from these applications, will stop getting populated with new data in early 2021. Activities involving these applications, including file activities, will be recorded in the new CloudAppEvents table\"","upvote_count":"8"}],"content":"Read it bro https://techcommunity.microsoft.com/t5/microsoft-365-defender/hunt-across-cloud-app-activities-with-microsoft-365-defender/ba-p/1893857\n\nCloudAppEvents replaced AppFileEvents so everything AppFireEvents had is included in CloudAppEvents","upvote_count":"22"}],"comment_id":"357200","timestamp":"1636901280.0","content":"CloudAppEvents doesn't have the FolderPath column, so it's probably DeviceFileEvents: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide","upvote_count":"23","poster":"Beitran"},{"timestamp":"1639174320.0","comment_id":"379259","poster":"fr54fr","upvote_count":"13","comments":[{"timestamp":"1640901600.0","upvote_count":"5","poster":"madhatter","content":"Its easy to get confused with File properties but this question asks for \"data access, download, or deletion for Microsoft Cloud App Security-protected applications\"\n\nProvided answer most likely correct \"CloudAppEvents\"","comment_id":"395169"}],"content":"users hunting through file-related activities in cloud services should use the CloudAppEvents table instead [Column name: ActivityObjects - List of objects, such as files or folders, that were involved in the recorded activity] \nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-cloudappevents-table?view=o365-worldwide"},{"poster":"kazaki","timestamp":"1723962300.0","upvote_count":"5","content":"as usual outdated question with outdated answers\nDeviceFileEvents is the answer","comment_id":"1153116"},{"content":"Folderpath column not in cloudappevents. \nhttps://techcommunity.microsoft.com/t5/microsoft-365-defender/hunt-across-cloud-app-activities-with-microsoft-365-defender/ba-p/1893857 article published 2020\n https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide article updated 11/2023\nso will go with AppFileEvents.","comment_id":"1114715","timestamp":"1720195980.0","poster":"estyj","upvote_count":"1"},{"poster":"danb67","content":"Query is wrong. Neither of the 3 tables listed has the 4 columns required. \n\n4 columns required are FileName, FolderPath, ActionType, AccountDisplayname.\n\nCheck this for yourself.\n\nDeviceProcessEvents comes closest. That has FileName, FolderPath, ActionType and 'acccountname' columns\n\nI think there are errors in the given query","upvote_count":"1","comment_id":"1044984","timestamp":"1713273000.0"},{"poster":"Anil0512","upvote_count":"3","timestamp":"1711013220.0","comment_id":"1012885","content":"DeviceFileEvents & Count"},{"content":"Correct cloudappevents does not have the needed columns.","comment_id":"987076","comments":[{"poster":"danb67","upvote_count":"1","timestamp":"1713272640.0","content":"True but DeviceFileEvents does not have all the needed columns either. DeviceFileEvents does not have the AccountDipslayName column. So I think this query is wrong altogether.","comment_id":"1044973"}],"poster":"donathon","upvote_count":"2","timestamp":"1708584240.0"},{"content":"It's:\nDeviceFileEvents\ncount()\n\n - CloudAppEvents\n ○ The CloudAppEvents table in the advanced hunting schema contains information about activities in various cloud apps and services covered by Microsoft Defender for Cloud Apps\n ○ CloudAppEvents does not have FileName and FolderPath\n - DeviceFileEvents\n ○ The DeviceFileEvents table in the advanced hunting schema contains information about file creation, modification, and other file system events\n - DeviceProcessEvents\nThe DeviceProcessEvents table in the advanced hunting schema contains information about process creation and related events.","upvote_count":"5","comment_id":"827029","poster":"wsrudmen","timestamp":"1693660140.0"},{"content":"Answers are correct:\n\nCloudAppEvents\n| where timeStamp > ago(2d)\n| where ActionType in (\"Data Access\", \"Data Download\", \"Data Deletion\")\n| summarize activityCount = count() by FolderPath, FileName, ActionType, AccountDisplayName\n| where activityCount > 5","poster":"Apocalypse03","comment_id":"753993","upvote_count":"6","timestamp":"1687499640.0","comments":[{"comment_id":"948250","poster":"theplaceholder","timestamp":"1704909780.0","upvote_count":"3","content":"how are you finding FolderPath and FileName in CloudAppEvents? they're not there in my workspace"},{"content":"This query will filter the CloudAppEvents data by time (using the ago function to only include events from the past 48 hours), action type (using the in operator to include only data access, data download, or data deletion actions), and count the number of activities per file (using the summarize operator and the count() function). Finally, it will filter the results to only include files with more than five activities (using the where clause and the activityCount column).","upvote_count":"2","timestamp":"1687499640.0","comment_id":"753994","poster":"Apocalypse03","comments":[{"upvote_count":"1","timestamp":"1713272760.0","content":"But the CloudAppEvents table does not have the FileName or FolderName columns so your query does not work. The DeviceFileEvents does not have all the needed columns either. DeviceFileEvents does not have the AccountDipslayName column.","comment_id":"1044976","poster":"danb67"}]}]},{"content":"DeviceFileEvents\n Timestamp\n FileName\n FolderPath\nCount()\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide\n\nCloudAppEvents does not have FileName and FolderPath","comment_id":"735274","upvote_count":"7","poster":"ACSC","timestamp":"1685891700.0"},{"timestamp":"1684364760.0","poster":"Davanitz","comment_id":"720993","content":"These should be the right query since FolderPath and FileName don't exist in CloudAppEvents.\nCloudAppEvents\n| where Timestamp > ago(2d)\n| summarize activityCount = count() by ObjectName, ActionType, AccountDisplayName\n| where activityCount > 5","upvote_count":"2"},{"poster":"hanyahmed","comment_id":"653130","upvote_count":"3","timestamp":"1677621300.0","content":"It is correct answer.\nfirst answer :\nCloudAppEvents --> Yes\nEvents involving accounts and objects in Office 365 and other cloud apps and services\nDeviceFileEvents --> No because it doesn't have involving accounts.\nFile creation, modification, and other file system events\nFrom <https://docs.microsoft.com/en-us/learn/modules/query-logs-azure-sentinel/5-understand-microsoft-365-defender-tables> \nSecond answer : count"},{"content":"Nevermind my last comment","timestamp":"1663868640.0","poster":"feln","upvote_count":"1","comment_id":"573196"},{"timestamp":"1663868460.0","comment_id":"573191","upvote_count":"1","content":"So it says 'where timestamp > ago (2d)' and we're looking for events in the last 48h ? Doesn't look right does it? Shouldn't it be 'where timestamp < ago (2d)?","poster":"feln"},{"content":"Answer is correct : CloudAppEvents and count\n\n\"The AppFileEvents table, which contains file activities from these applications, will stop getting populated with new data in early 2021. Activities involving these applications, including file activities, will be recorded in the new CloudAppEvents table.\"","timestamp":"1662991260.0","comment_id":"566253","upvote_count":"4","poster":"subhuman"},{"content":"Cloud app events + Count","poster":"Contactfornitish","timestamp":"1661572140.0","upvote_count":"5","comment_id":"557165"},{"poster":"kakakayayaya","content":"In modern environment none of this answers are correct.","timestamp":"1654596120.0","comments":[{"comment_id":"495946","poster":"kakakayayaya","upvote_count":"3","timestamp":"1654596600.0","content":"DeviceProcessEvents and DeficeFileEvents doesn't have AccountDisplayName column\nCloudAppEvents doesn't have FolderPath and Filename column."}],"comment_id":"495937","upvote_count":"3"},{"content":"Cloud app events and Count are correct answers.","timestamp":"1649132160.0","upvote_count":"5","comment_id":"457463","comments":[{"content":"Thank you Eltooth!","timestamp":"1653385920.0","poster":"Remilia","comment_id":"485908","upvote_count":"2"}],"poster":"Eltooth"},{"comment_id":"375710","poster":"somsom","timestamp":"1638781140.0","upvote_count":"1","content":"Since they are looking for file events, it should not be process rather devicefileevents, then count"},{"comment_id":"370945","content":"Since we are tracking for file activities, the best answers in my opinion is DeviceFileEvents.","poster":"[Removed]","upvote_count":"4","timestamp":"1638277440.0"},{"poster":"_adem","upvote_count":"1","timestamp":"1636969560.0","comment_id":"357670","content":"Only DeviceProcessEvents table has all the specified columns the summarize activityCount. So the answer should be DeviceProcessEvents"}],"isMC":false,"answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/52695-exam-sc-200-topic-8-question-3-discussion/","answer_images":["https://www.examtopics.com/assets/media/exam-media/04261/0009300002.png"],"question_text":"HOTSPOT -\nYou need to create an advanced hunting query to investigate the executive team issue.\nHow should you complete the query? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answers_community":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0009300001.png"],"question_id":364,"unix_timestamp":1620996480,"answer_ET":"","topic":"8"},{"id":"qp9qZWgwwE9G8pIvmmp5","answer_images":["https://www.examtopics.com/assets/media/exam-media/04261/0009500001.jpg"],"topic":"8","answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/azure/sentinel/extend-sentinel-across-workspaces-tenants","question_id":365,"discussion":[{"timestamp":"1723742100.0","comment_id":"1151250","upvote_count":"22","poster":"louisaok","content":"Congratulations on making it so far here."},{"upvote_count":"15","content":"Correct answer - - 1 workspace (every sentinel requires a workspace)","poster":"Eltooth","timestamp":"1649132280.0","comment_id":"457464"},{"poster":"uday1985","comment_id":"1209909","upvote_count":"13","timestamp":"1731355020.0","content":"The dungeons of SC-200. Congrats on making it here dragon slayers!"},{"timestamp":"1719415920.0","content":"Use the union operator alongside the workspace( ) expression to apply a query across tables in multiple workspaces.","upvote_count":"3","comment_id":"1106260","poster":"Murtuza"},{"upvote_count":"1","comment_id":"1057020","poster":"chepeerick","content":"Correct option","timestamp":"1714404180.0"},{"comment_id":"1012887","poster":"Anil0512","content":"1 & Workspace","upvote_count":"1","timestamp":"1711013520.0"},{"upvote_count":"6","content":"You will use the workspace ID and the union operator to extend queries across workspaces.","poster":"yoton","comment_id":"667182","timestamp":"1678643040.0"},{"content":"Correct answer","upvote_count":"2","poster":"Lion007","timestamp":"1672344480.0","comment_id":"624830"},{"upvote_count":"1","poster":"rdy4u","content":"https://docs.microsoft.com/en-us/azure/sentinel/extend-sentinel-across-workspaces-tenants#cross-workspace-workbooks\n\n1, workspace to colocate","timestamp":"1666927380.0","comment_id":"593493"}],"exam_id":122,"question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0009400001.jpg"],"answer_ET":"","url":"https://www.examtopics.com/discussions/microsoft/view/63608-exam-sc-200-topic-8-question-4-discussion/","answer":"","question_text":"HOTSPOT -\nYou need to implement Azure Sentinel queries for Contoso and Fabrikam to meet the technical requirements.\nWhat should you include in the solution? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","isMC":false,"answers_community":[],"timestamp":"2021-10-05 06:18:00","unix_timestamp":1633407480}],"exam":{"isBeta":false,"numberOfQuestions":371,"name":"SC-200","isMCOnly":false,"lastUpdated":"12 Apr 2025","isImplemented":true,"id":122,"provider":"Microsoft"},"currentPage":73},"__N_SSP":true}