{"pageProps":{"questions":[{"id":"ZNw89yk137EbJSbbhokT","answer_description":"","unix_timestamp":1629958140,"answer_ET":"","answers_community":[],"topic":"1","answer_images":["https://www.examtopics.com/assets/media/exam-media/04261/0001200001.png"],"question_text":"DRAG DROP -\nYou are investigating an incident by using Microsoft 365 Defender.\nYou need to create an advanced hunting query to count failed sign-in authentications on three devices named CFOLaptop, CEOLaptop, and COOLaptop.\nHow should you complete the query? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nSelect and Place:\n//IMG//","timestamp":"2021-08-26 08:09:00","isMC":false,"answer":"","url":"https://www.examtopics.com/discussions/microsoft/view/60683-exam-sc-200-topic-1-question-1-discussion/","discussion":[{"poster":"DigitalNomad","content":"DeviceLogonEvents \n| where DeviceName in (\"CFOLaptop\" , \"CEOLaptop\" ) and ActionType == \"LogonFailed\"\n| summarize LogonFailures=count() by DeviceName , LogonType\n\n\nThis is the correct answer , I tested it .","upvote_count":"128","comments":[{"poster":"Nikki0222","timestamp":"1729644540.0","comment_id":"1301750","content":"This answer is correct","upvote_count":"1"},{"poster":"CatoFong","content":"DigitalNomad is correct.","comment_id":"636867","timestamp":"1658770860.0","upvote_count":"3"},{"comment_id":"836276","content":"correct.","poster":"sasasach","timestamp":"1678552440.0","upvote_count":"3"},{"comment_id":"1045653","content":"Me too and correct","upvote_count":"1","timestamp":"1697527740.0","poster":"danb67"},{"poster":"stromnessian","timestamp":"1641819300.0","upvote_count":"6","comment_id":"520853","content":"DigitalNomad is exactly right. Usual examtopics story (this is the 5th one I've done in the past year or so) - do your own research as many of the answers are wrong."},{"comment_id":"537349","timestamp":"1643656860.0","poster":"pedromonteirozikado","content":"Tested it here too, ActionType is the type of action obviously, and FailureReason is the reason why the Action failed. Then it makes no sense compare the ActionType with FailureReason because the values will never match.","upvote_count":"3"}],"timestamp":"1726771320.0","comment_id":"458039"},{"comment_id":"431982","timestamp":"1629958140.0","content":"I think the third box is answered wrong. ActionType == \"LogonFailed\" should be the correct answer.","upvote_count":"21","poster":"ReffG"},{"content":"DeviceLogonEvents\n| where DeviceName in (\"CFOLaptop\" , \"CEOLaptop\" ) and ActionType == \"LogonFailed\"\n| summarize LogonFailures=count() by DeviceName , LogonType\n\n\nThis is the correct answer , I tested it .\n\nhttps://docs.google.com/document/d/1oNH9i2ssNi9gISG3JGuxUoUhmAA4xCaGahEKv2dRN6Y/edit?usp=sharing","timestamp":"1742631720.0","upvote_count":"1","comment_id":"1401845","poster":"Nityaanantha_Raman"},{"upvote_count":"1","comment_id":"1316231","content":"ChatGPT says : \n\nDeviceLogonEvents\n| where DeviceName in (\"CFOLaptop\", \"CEOLaptop\", \"COOLaptop\") \n| where LogonType == \"Failed\" \n| summarize FailedSignInCount = count() by DeviceName","poster":"mikl","timestamp":"1732269780.0"},{"comments":[{"timestamp":"1672321800.0","comment_id":"761077","content":"How can a reason be an action???? Action type is a reason, did you hear yourself?","poster":"EricChu","upvote_count":"3"}],"comment_id":"746868","content":"The correct answer is:\n\nDeviceLogonEvents\n\n| where DeviceName in (\"CFOLaptop\", \"CEOLaptop\", \"COOLaptop\") and\n\nActionType == FailureReason\n\n|s summarize LogonFailures=count () by DeviceName, LogonType\n\nHere is a brief explanation of how this query works:\n\nThe DeviceLogonEvents table is selected, which contains logon events for devices.\n\nThe where clause filters the events to only include those that have a DeviceName of CFOLaptop, CEOLaptop, or COOLaptop, and an ActionType of FailureReason. This effectively filters the events to only include failed logon events from the specified devices.\n\nThe summarize clause counts the number of events that match the previous criteria, grouping the results by DeviceName and LogonType. The count() function counts the number of events in each group, and the LogonFailures alias is used to label this count in the resulting output.","timestamp":"1727065440.0","upvote_count":"3","poster":"Apocalypse03"},{"comment_id":"1248684","timestamp":"1721106000.0","poster":"Hawklx","content":"Please fix this answer","upvote_count":"3"},{"upvote_count":"2","comment_id":"1181295","content":"In given answer, ActionType should be \"LogonFailed\".","poster":"Vamshi_Pasham","timestamp":"1711248840.0"},{"poster":"mc250616","comment_id":"1067851","timestamp":"1699708500.0","content":"Hi All,\nChecked again in real environment. Shown answer is not correct as Failure Reason is not one fo the ActionTypes and no result by this search. \nCorrect Answer is ;\n--------------\nDeviceLogonEvents\n| where DeviceName in (\"CFOLaptop\" , \"CEOLaptop\", \"COOLaptop\") and \nActionType == \"LogonFailed\"\n| summarize LogonFailures=count() by DeviceName , LogonType","upvote_count":"3"},{"upvote_count":"1","content":"Correct","poster":"chepeerick","comment_id":"1049830","timestamp":"1697922360.0"},{"content":"Correct answer should be: ActionType=\"LogonFailed\".\nWhen running this query, there is no any result returned.\nDeviceLogonEvents\n| where ActionType == FailureReason","poster":"NathanZ","timestamp":"1689749940.0","upvote_count":"1","comment_id":"956354"},{"comment_id":"851644","content":"correct Answer is DeviceLogonEvents\n\n| where DeviceName in (\"CFOLaptop\", \"CEOLaptop\", \"COOLaptop\") and\n\nActionType == FailureReason\n\n|s summarize LogonFailures=count () by DeviceName, LogonType","timestamp":"1679886120.0","upvote_count":"1","poster":"cyber_mks"},{"upvote_count":"7","poster":"gyaansastra","comment_id":"764139","timestamp":"1672704120.0","content":"Only 3 types of ActionType exist based on the schema. Try yourself with a long time range (e.g below last 14days)\n\nDeviceLogonEvents\n| where TimeGenerated >= ago(14d)\n| distinct ActionType \n\nResult:\nLogonSuccess\nLogonFailed\nLogonAttempted\n\nThat should clear the doubts that \"LogonFailed\" is the correct option, not \"FailureReason\". Strongly suggest going through the official schema and the actual query for validation."},{"content":"Under DeviceLogonEvents schema, below are the ActionType values available and FailureReason is the column in the schema that can be fetched\nActionType values:\nLogonAttempted\nLogonFailed\nLogonSuccess\nand hence the answer is ActionType == 'LogonFailed' ; also a string should be mentioned in a single or double quotes","poster":"BhanuD","upvote_count":"2","timestamp":"1668636720.0","comment_id":"720051"},{"content":"Tested, ActionType == LogonFailed","timestamp":"1665583260.0","poster":"arunrider","comment_id":"693149","upvote_count":"4"},{"content":"DeviceLogonEvents\n|where Devicename in (\"CFOlaptops\", \"CEOLaptop\") and ActionType == \"LogonFailed\"\n|summarize LoginFailures=count() by DeviceName, LogonType","upvote_count":"3","timestamp":"1649553240.0","comment_id":"583545","poster":"Pandaguo"},{"content":"See DeviceLogonEvents options -> https://docs.microsoft.com/en-us/azure/azure-monitor/reference/tables/devicelogonevents","upvote_count":"4","poster":"oreoale","timestamp":"1648467840.0","comment_id":"576816"},{"poster":"chaska","content":"Answer is correct\nDeviceLogonEvents\n| where DeviceName in (\"CFOLaptop\",\"CEOLaptop\",\"COOLaptop\") and ActionType == FailureReason\n| summarize count() by DeviceName, LogonType,TimeGenerated\nAs far as I know ActionType contains only LogonSuccess, LogonAttempted and empty value. \nEmpty value in same rows in columns ActionType and FailureReason means failed sign-in authentications.","upvote_count":"3","comment_id":"572816","timestamp":"1647939480.0"},{"poster":"Badr_j","timestamp":"1647763440.0","upvote_count":"4","comment_id":"571485","content":"ActionType == \"LogonFailed\" is the correct option,"},{"comment_id":"548011","timestamp":"1644956760.0","upvote_count":"5","poster":"pedromonteirozikado","content":"Funny facts, on the official practice test from MeasureUp, the correct answer is ActionType == FailureReason, but that's the wrong answer..."},{"content":"ActionType == \"LogonFailed\" is the correct option, always test the queries and check by yourself.","upvote_count":"4","timestamp":"1643224860.0","poster":"pedromonteirozikado","comment_id":"533171"},{"poster":"stromnessian","upvote_count":"2","timestamp":"1641819180.0","comment_id":"520851","content":"What DigitalNomad said, 100%."},{"comment_id":"468891","content":"Hi, \n\nWhat is the correct answer?","upvote_count":"1","timestamp":"1635376980.0","poster":"Daigo"},{"comment_id":"455659","poster":"AlaReAla","content":"FailureReason itself is a parameter, so it cannot be equated (compared) to ActionType, so it should be equated to \"LogonFailed\". You may refer below link to get a flavour of the parameter:\n\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-best-practices?view=o365-worldwide","timestamp":"1633113720.0","upvote_count":"5"},{"comments":[{"upvote_count":"1","poster":"rk4ai","comment_id":"435008","timestamp":"1630293480.0","comments":[{"timestamp":"1630293720.0","content":"Moderator - Please remove my second comment. ActionType == \"LogonFailed\" is the correct one.","comment_id":"435010","upvote_count":"2","poster":"rk4ai"}],"content":"I stand corrected. FailureReason is a String too that has the Information explaining why the recorded action failed."}],"comment_id":"435006","poster":"rk4ai","content":"ActionType is a String. \"LogonFailed\" is the correct answer.","upvote_count":"6","timestamp":"1630293240.0"}],"question_id":1,"question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0001100001.png"],"exam_id":122},{"id":"WzJvj8KyKMbDdc2S0Xmu","isMC":true,"answer_images":[],"answers_community":["A (100%)"],"timestamp":"2021-04-15 19:13:00","answer_description":"","question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/50222-exam-sc-200-topic-1-question-10-discussion/","exam_id":122,"answer":"A","topic":"1","answer_ET":"A","discussion":[{"timestamp":"1618506780.0","upvote_count":"14","poster":"kwach","comment_id":"336478","content":"correct answer is A:\nhttps://docs.microsoft.com/en-us/defender-for-identity/manage-sensitive-honeytoken-accounts"},{"timestamp":"1646733960.0","poster":"Tx4free","upvote_count":"7","content":"Selected Answer: A\nBest answer","comment_id":"563141"},{"timestamp":"1729644720.0","comment_id":"1301756","upvote_count":"2","poster":"Nikki0222","content":"Yes , correct"},{"timestamp":"1697923620.0","comment_id":"1049856","upvote_count":"1","content":"Yes, correct","poster":"chepeerick"},{"comment_id":"369958","timestamp":"1622362680.0","content":"Correct answer","upvote_count":"3","poster":"Task"}],"unix_timestamp":1618506780,"question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are configuring Microsoft Defender for Identity integration with Active Directory.\nFrom the Microsoft Defender for identity portal, you need to configure several accounts for attackers to exploit.\nSolution: From Entity tags, you add the accounts as Honeytoken accounts.\nDoes this meet the goal?","question_id":2,"choices":{"A":"Yes","B":"No"}},{"id":"bwHRfn1dIp21WaHfdO0d","answer_ET":"B","choices":{"A":"Yes","B":"No"},"timestamp":"2021-05-30 10:18:00","answers_community":["B (100%)"],"unix_timestamp":1622362680,"url":"https://www.examtopics.com/discussions/microsoft/view/53800-exam-sc-200-topic-1-question-11-discussion/","topic":"1","answer":"B","question_images":[],"discussion":[{"poster":"Metasploit","comment_id":"697111","content":"Selected Answer: B\nHoneytoken entities are used as traps for malicious actors. Any authentication associated with these honeytoken entities triggers an alert.\n\nSettings>Identities>Entity tags>Honey Token> Add Users or Devices","upvote_count":"9","timestamp":"1665995460.0"},{"comment_id":"369959","timestamp":"1622362680.0","content":"Correct","poster":"Task","upvote_count":"7"},{"poster":"Nikki0222","upvote_count":"2","timestamp":"1729644720.0","comment_id":"1301757","content":"No, correct"},{"upvote_count":"1","content":"no, this is correct","comment_id":"1049857","timestamp":"1697923620.0","poster":"chepeerick"},{"poster":"Tx4free","upvote_count":"4","content":"Selected Answer: B\nCorrect answer","comment_id":"563142","timestamp":"1646734020.0"}],"isMC":true,"answer_images":[],"question_id":3,"question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are configuring Microsoft Defender for Identity integration with Active Directory.\nFrom the Microsoft Defender for identity portal, you need to configure several accounts for attackers to exploit.\nSolution: From Azure AD Identity Protection, you configure the sign-in risk policy.\nDoes this meet the goal?","answer_description":"","exam_id":122},{"id":"A28wU46q4qfaisAXTw0Z","isMC":true,"timestamp":"2021-05-30 10:19:00","answers_community":["B (100%)"],"choices":{"A":"Yes","B":"No"},"answer_description":"","discussion":[{"upvote_count":"11","timestamp":"1643565780.0","content":"Selected Answer: B\nThis is what honeytoken accounts are meant for (i.e. dormant accounts that generate alerts if accessed). Sensitivity tags are meant for active users and groups.","poster":"stromnessian","comment_id":"536365"},{"poster":"Nikki0222","timestamp":"1729644780.0","comment_id":"1301758","content":"No, correct","upvote_count":"1"},{"upvote_count":"3","comment_id":"527176","timestamp":"1726771980.0","poster":"cloudster998","content":"Manually tagging entities\n\nYou can also manually tag entities as sensitive or honeytoken accounts. If you manually tag additional users or groups, such as board members, company executives, and sales directors, Defender for Identity will consider them sensitive."},{"comment_id":"1049866","poster":"chepeerick","upvote_count":"1","timestamp":"1697924460.0","content":"Correct B"},{"timestamp":"1662064620.0","upvote_count":"1","comment_id":"656663","poster":"Taisuke","content":"Selected Answer: B\nBest answer."},{"poster":"Tx4free","content":"Selected Answer: B\nBest answer","comment_id":"563143","timestamp":"1646734020.0","upvote_count":"4"},{"upvote_count":"3","timestamp":"1645482180.0","comment_id":"553316","content":"Selected Answer: B\nCorrect answer","poster":"sunnybb269"},{"content":"Why B?\nhttps://docs.microsoft.com/en-us/defender-for-identity/manage-sensitive-honeytoken-accounts","timestamp":"1641819480.0","comment_id":"520855","poster":"PLhiro","comments":[{"comment_id":"697112","upvote_count":"1","content":"B = No\nThe URL you posted is the answer to your question. Lookup HoneyToken Accounts. :)\n\n\"... you need to configure several accounts for attackers to exploit.\"","timestamp":"1665995700.0","poster":"Metasploit"}],"upvote_count":"1"},{"comment_id":"369960","content":"Correct","poster":"Task","timestamp":"1622362740.0","upvote_count":"2"}],"answer_ET":"B","answer":"B","answer_images":[],"question_text":"Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\nYou are configuring Microsoft Defender for Identity integration with Active Directory.\nFrom the Microsoft Defender for identity portal, you need to configure several accounts for attackers to exploit.\nSolution: You add the accounts to an Active Directory group and add the group as a Sensitive group.\nDoes this meet the goal?","question_id":4,"url":"https://www.examtopics.com/discussions/microsoft/view/53801-exam-sc-200-topic-1-question-12-discussion/","question_images":[],"unix_timestamp":1622362740,"exam_id":122,"topic":"1"},{"id":"MK88VYiDUnTQwmFFw2C4","isMC":true,"timestamp":"2021-08-22 04:34:00","answers_community":["A (100%)"],"choices":{"C":"Block and Enable redirect","A":"Dynamic Delivery","D":"Monitor and Enable redirect","B":"Replace"},"answer_description":"","discussion":[{"upvote_count":"43","poster":"jasonfmj","content":"Correct\nDynamic Delivery Delivers messages immediately, but replaces attachments with placeholders until Safe Attachments scanning is complete.\nFor details, see the Dynamic Delivery in Safe Attachments policies section later in this article.\n\nAvoid message delays while protecting recipients from malicious files.\nEnable recipients to preview attachments in safe mode while scanning is taking place.","comment_id":"429003","timestamp":"1629599640.0"},{"timestamp":"1732642500.0","comment_id":"1318221","poster":"ifaiyazhossain","content":"Selected Answer: A\nA is the right answer.","upvote_count":"1"},{"poster":"Nikki0222","comment_id":"1301759","content":"Dynamic delivery , correct","timestamp":"1729644780.0","upvote_count":"1"},{"comment_id":"746889","poster":"Apocalypse03","upvote_count":"4","content":"Selected Answer: A\nTo reduce the amount of time it takes to deliver email messages that contain attachments while still scanning the attachments for malware and blocking any messages that contain malware, you should configure the Safe Attachments policies to use the \"Dynamic Delivery\" option.\n\nDynamic Delivery is a feature in Microsoft Defender for Office 365 that allows you to optimize the delivery of email messages containing attachments by scanning the attachments for malware before they are delivered to the recipient's mailbox. This allows you to quickly deliver messages that are deemed safe while still protecting against malware threats.\n\nTo configure the Safe Attachments policies to use Dynamic Delivery, you can go to the Mail flow > Safe attachments policies page in the Microsoft 365 admin center and select the \"Dynamic Delivery\" option for each policy.\n\nOptions B, C, and D are not relevant to reducing the delivery time for email messages with attachments and do not provide the same level of protection against malware threats as Dynamic Delivery.","timestamp":"1727066160.0"},{"content":"Selected Answer: A\nIf you’re interested to set up the Safe Attachment / Dynamic Delivery here are the steps \nhttps://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/safe-attachments-policies-configure?view=o365-worldwide","poster":"Ramye","comment_id":"1149675","timestamp":"1707869340.0","upvote_count":"1"},{"poster":"chepeerick","comment_id":"1049867","content":"Selected Answer: A\nCorrect, A","upvote_count":"1","timestamp":"1697924520.0"},{"timestamp":"1684829520.0","content":"Dynamic Delivery","poster":"gepoy01","upvote_count":"2","comment_id":"904720"},{"upvote_count":"1","poster":"TeeKay_From_the_South","content":"Dynamic Delivery. A is the correct answer.","timestamp":"1684150500.0","comment_id":"898225"},{"poster":"kovora","content":"Correct Answer is A","timestamp":"1666619040.0","upvote_count":"1","comment_id":"703070"},{"upvote_count":"2","timestamp":"1661056320.0","content":"Selected Answer: A\nCorrect answer","poster":"bluegeek","comment_id":"649595"},{"content":"Correct\nhttps://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/safe-attachments?view=o365-worldwide#dynamic-delivery-in-safe-attachments-policies","poster":"eveyklel","upvote_count":"1","timestamp":"1655021820.0","comment_id":"615212"},{"upvote_count":"2","timestamp":"1650017040.0","content":"Dynamic Delivery Correct!","comment_id":"586272","poster":"M0809"},{"comment_id":"567199","content":"Selected Answer: A\nCorrect Answer is A","timestamp":"1647206520.0","upvote_count":"3","poster":"TomG"},{"comment_id":"563145","upvote_count":"3","timestamp":"1646734080.0","content":"Selected Answer: A\nCorrect answer","poster":"Tx4free"},{"timestamp":"1643317440.0","poster":"stromnessian","content":"Selected Answer: A\nBadly worded question but that's all part of the MS exam experience.","comment_id":"534123","upvote_count":"4"}],"answer_ET":"A","answer":"A","answer_images":[],"question_text":"You implement Safe Attachments policies in Microsoft Defender for Office 365.\nUsers report that email messages containing attachments take longer than expected to be received.\nYou need to reduce the amount of time it takes to deliver messages that contain attachments without compromising security. The attachments must be scanned for malware, and any messages that contain malware must be blocked.\nWhat should you configure in the Safe Attachments policies?","url":"https://www.examtopics.com/discussions/microsoft/view/60198-exam-sc-200-topic-1-question-13-discussion/","question_id":5,"question_images":[],"unix_timestamp":1629599640,"exam_id":122,"topic":"1"}],"exam":{"provider":"Microsoft","isMCOnly":false,"numberOfQuestions":371,"id":122,"lastUpdated":"12 Apr 2025","isBeta":false,"name":"SC-200","isImplemented":true},"currentPage":1},"__N_SSP":true}