{"pageProps":{"questions":[{"id":"Yc6z5mNf751kNL9eVN9X","answers_community":[],"exam_id":122,"discussion":[{"upvote_count":"20","content":"Correct Answer are.\nAzureActivity & Extend.","comment_id":"1012776","timestamp":"1695270960.0","comments":[{"upvote_count":"1","poster":"danb67","content":"Agreed.","comment_id":"1043373","timestamp":"1697282220.0"},{"content":"AzureActivity\n| where OperationNameValue contains \"...\"","comment_id":"1012777","timestamp":"1695271020.0","upvote_count":"1","poster":"Anil0512"}],"poster":"Anil0512"},{"upvote_count":"7","content":"Azure and only extend can be used as = is used instead of ==","poster":"chepeerick","timestamp":"1697588580.0","comment_id":"1046446"},{"content":"AzureActivity \nExtend","timestamp":"1722123660.0","comment_id":"1256513","upvote_count":"1","poster":"smanzana"},{"poster":"7d801bf","upvote_count":"1","content":"correct answer Azure Activity and Extend","comment_id":"1241328","timestamp":"1720002300.0"},{"content":"AzureActivity & Extend","poster":"fbernis","timestamp":"1707323280.0","comment_id":"1143508","upvote_count":"1"}],"question_id":221,"question_images":["https://img.examtopics.com/sc-200/image209.png"],"unix_timestamp":1694235900,"url":"https://www.examtopics.com/discussions/microsoft/view/120333-exam-sc-200-topic-3-question-86-discussion/","timestamp":"2023-09-09 07:05:00","isMC":false,"answer_ET":"","answer_description":"","topic":"3","answer":"","question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that contains a Microsoft Sentinel workspace.\n\nYou need to create a hunting query using Kusto Query Language (KQL) that meets the following requirements:\n\n• Identifies an anomalous number of changes to the rules of a network security group (NSG) made by the same security principal.\n• Automatically associates the security principal with a Microsoft Sentinel entity.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_images":["https://img.examtopics.com/sc-200/image210.png"]},{"id":"cm6W5DIhLYtWWUtqpqlO","answer_description":"","question_id":222,"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace.\n\nYou need to configure a report visual for a custom workbook. The solution must meet the following requirements:\n• The count and usage trend of AppDisplayName must be included.\n• The TrendList column must be useable in a sparkline visual.\n\nHow should you complete the KQL query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_images":["https://img.examtopics.com/sc-200/image211.png"],"timestamp":"2023-09-09 07:05:00","discussion":[{"upvote_count":"2","comment_id":"1272030","poster":"user636","timestamp":"1724565540.0","content":"Join & make-series are the correct answers"},{"comment_id":"1256514","upvote_count":"1","timestamp":"1722123840.0","content":"Join\nMake-series","poster":"smanzana"},{"comment_id":"1056445","poster":"chepeerick","timestamp":"1698525960.0","content":"Correct option","upvote_count":"1"},{"content":"https://www.cloudsma.com/2021/04/kusto-make-series-vs-summarize/\ncorrect","poster":"danb67","comment_id":"1050437","timestamp":"1697969820.0","upvote_count":"1"},{"timestamp":"1696119180.0","upvote_count":"2","comment_id":"1021901","poster":"sand5234","content":"Answer is correct\nMore explanation here\nhttps://www.cloudsma.com/2021/04/kusto-make-series-vs-summarize/"},{"content":"He is right there, correct answers are - Join & make-series. Join is 100% correct; searched up for make-series it is to be correct too.","poster":"Anil0512","upvote_count":"2","timestamp":"1695271560.0","comment_id":"1012783"},{"content":"This new question arrived today 9th september 2023.\nCan someone please verify the correct answer?","comment_id":"1002933","poster":"Fez786","upvote_count":"1","timestamp":"1694235900.0"}],"url":"https://www.examtopics.com/discussions/microsoft/view/120334-exam-sc-200-topic-3-question-87-discussion/","answer_ET":"","unix_timestamp":1694235900,"answers_community":[],"topic":"3","exam_id":122,"answer":"","isMC":false,"answer_images":["https://img.examtopics.com/sc-200/image212.png"]},{"id":"CJVEGzr18Po6DRwkWWNB","url":"https://www.examtopics.com/discussions/microsoft/view/120335-exam-sc-200-topic-3-question-88-discussion/","topic":"3","answer_description":"","isMC":false,"answer_images":["https://img.examtopics.com/sc-200/image214.png"],"unix_timestamp":1694235960,"answer":"","question_id":223,"answers_community":[],"question_text":"DRAG DROP\n-\n\nYou have an Azure subscription that contains two users named User1 and User2 and a Microsoft Sentinel workspace named workspace1.\n\nYou need to ensure that the users can perform the following tasks in workspace1:\n• User1 must be able to dismiss incidents and assign incidents to users.\n• User2 must be able to modify analytics rules.\n\nThe solution must use the principle of least privilege.\n\nWhich role should you assign to each user? To answer, drag the appropriate roles to the correct users. Each role may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","timestamp":"2023-09-09 07:06:00","question_images":["https://img.examtopics.com/sc-200/image213.png"],"exam_id":122,"answer_ET":"","discussion":[{"comment_id":"1006790","upvote_count":"9","poster":"jamclash","timestamp":"1694621580.0","content":"correct answer. user1=MS responder; user2=MS contributor\nhttps://learn.microsoft.com/en-us/azure/sentinel/roles"},{"timestamp":"1694670960.0","comment_id":"1007256","upvote_count":"6","content":"All Microsoft Sentinel built-in roles grant read access to the data in your Microsoft Sentinel workspace.\n\nMicrosoft Sentinel Reader can view data, incidents, workbooks, and other Microsoft Sentinel resources.\n\nMicrosoft Sentinel Responder can, in addition to the above, manage incidents (assign, dismiss, etc.).\n\nMicrosoft Sentinel Contributor can, in addition to the above, create and edit workbooks, analytics rules, and other Microsoft Sentinel resources.\n\nMicrosoft Sentinel Playbook Operator can list, view, and manually run playbooks.\n\nMicrosoft Sentinel Automation Contributor allows Microsoft Sentinel to add playbooks to automation rules. It isn't meant for user accounts.","poster":"donathon"},{"upvote_count":"1","poster":"smanzana","timestamp":"1722123900.0","content":"MS Responder \nMS Contributer","comment_id":"1256515"},{"timestamp":"1698525960.0","poster":"chepeerick","upvote_count":"1","content":"Correct option","comment_id":"1056446"},{"content":"correct","comment_id":"1046448","timestamp":"1697588640.0","upvote_count":"1","poster":"chepeerick"},{"content":"Answer is correct - MS Responder and MS Contributer","poster":"Anil0512","upvote_count":"1","comment_id":"1012829","timestamp":"1695276600.0"},{"content":"This new question arrived today 9th september 2023.\nCan someone please verify the correct answer?","comments":[{"upvote_count":"1","comment_id":"1158150","poster":"Ramye","timestamp":"1708807500.0","content":"Answers are correct and clearly mentioned here: https://learn.microsoft.com/en-us/azure/sentinel/roles"}],"comment_id":"1002934","upvote_count":"1","poster":"Fez786","timestamp":"1694235960.0"}]},{"id":"keEx8qOCPoqbR79Ph047","url":"https://www.examtopics.com/discussions/microsoft/view/120336-exam-sc-200-topic-3-question-89-discussion/","answers_community":["A (50%)","D (25%)","B (20%)","5%"],"isMC":true,"question_id":224,"answer_ET":"A","answer":"A","answer_description":"","choices":{"D":"the Alerts page in the Microsoft 365 Defender portal","A":"the entity side panel of the Timeline card in Microsoft Sentinel","C":"the investigation graph on the incidents page of Microsoft Sentinel","B":"the Timeline tab on the incidents page of Microsoft Sentinel"},"answer_images":[],"exam_id":122,"question_text":"You have a Microsoft Sentinel workspace that uses the Microsoft 365 Defender data connector.\n\nFrom Microsoft Sentinel, you investigate a Microsoft 365 incident.\n\nYou need to update the incident to include an alert generated by Microsoft Defender for Cloud Apps.\n\nWhat should you use?","unix_timestamp":1694236020,"discussion":[{"timestamp":"1698614820.0","upvote_count":"10","poster":"kabooze","content":"Selected Answer: A\nIt's A based on this: https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview\n\nother people say they get answer \"b\" out of this but i don't see it ....","comments":[{"poster":"Tuitor01","content":"In Incidents under Threat Management, pick an incident => View full details\nIn the Incident details page, choose the Entities tab in the middle section of the screen.\nChoose an entity, on the right flying pane, choose the timeline cart\nFor each events in the timeline you have a plus sign at the end that allows you to add this alert to an incident.\n\nAnswer is therefore indeed A","timestamp":"1733307960.0","comment_id":"1321809","upvote_count":"1"}],"comment_id":"1057148"},{"poster":"a311","timestamp":"1695380220.0","comment_id":"1013998","comments":[{"upvote_count":"3","content":"If anything, that URL shows it's answer A","timestamp":"1698614760.0","poster":"kabooze","comment_id":"1057146"},{"comment_id":"1018886","content":"Based on this article, I say B as well.","upvote_count":"3","comments":[{"timestamp":"1706282640.0","content":"The article literally states you need to go to the entity side panel and then select a timeline card","upvote_count":"2","poster":"nsss","comment_id":"1132608"}],"timestamp":"1695824640.0","poster":"cris_exam"}],"upvote_count":"6","content":"Selected Answer: B\nActually the correct answer is B. https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview"},{"content":"Selected Answer: A\nThe entity side panel of the Microsoft Sentinel timeline card is correct. In the new incident experience of Microsoft Sentinel (currently in preview), you can use the entity timeline to add alerts. This feature allows you to view all entities for a specific incident investigation and add alerts from the side panel. Therefore, if you are using the preview feature, this option is correct. Even considering that the entity timeline feature is in preview, it is the correct choice based on the content of the SC-200 certification exam. It is also important to understand the latest features and methods, as preview features may be included in the exam. cf:https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","comment_id":"1318021","poster":"Takakage","timestamp":"1732617420.0","upvote_count":"1"},{"upvote_count":"1","poster":"Tuitor01","content":"Real life experience : Incidents blade > Select Incident > View full details in the right pane > Select Entities tab in the middle pane > Select an entity > clicl on the timeline card on the right pane > click on the plus sign on the right side of greyed shielded entities > add to exising or new incident. Not the most logical workflow, but it is what it is...","comment_id":"1316417","comments":[{"poster":"Tuitor01","upvote_count":"1","content":"Therefore Answer: A","comment_id":"1316418","timestamp":"1732296720.0"}],"timestamp":"1732296660.0"},{"content":"Selected Answer: A\nSentinel > Incidents > open full details of an incident > select an entity (this will open the entity side panel which holds details about the entity)\n> click on the Timeline card\n> there's a plus sign symbol beside the alerts not included in the incident. Clicking that plus symbol will add that alert to the incident\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","timestamp":"1727853120.0","poster":"talosDevbot","comment_id":"1292265","upvote_count":"2"},{"timestamp":"1724672220.0","poster":"user636","content":"Selected Answer: B\nWhat a mess. Microsoft has changed the GUI in Sentinel.\nIn the old GUI you can access the Timeline in the incident page. \nRef: https://learn.microsoft.com/en-us/azure/sentinel/investigate-cases#how-to-investigate-incidents\n\nThere is no \"Timeline\" tab available directly in Incidents pane in the new GUI.\nYou need to open an Incident & then navigate to Entities tab & then select an entity and in the side pane select \"Timeline\" tab. \nRef: https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview\n\nI'd go for the answer as B.\nA is anyways wrong, because there is no entity side panel of the Timeline card in Microsoft Sentinel. Rather there is the Timeline side panel of the Entities card in Microsoft Sentinel. :)","comment_id":"1272671","upvote_count":"2"},{"upvote_count":"2","comment_id":"1266988","poster":"g_man_rap","timestamp":"1723805580.0","content":"Selected Answer: D\nOption D: The Alerts page in the Microsoft 365 Defender portal\n\nThis is where you can find and manage all alerts generated by Microsoft 365 Defender components, including Defender for Cloud Apps. From this portal, you can associate these alerts with existing incidents or create new incidents. This allows for a comprehensive view and management of security incidents across all Defender products."},{"upvote_count":"1","poster":"smanzana","comment_id":"1256510","timestamp":"1722123240.0","content":"A is correct"},{"content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","timestamp":"1718278320.0","poster":"Sekpluz","comment_id":"1229773","upvote_count":"2"},{"comment_id":"1203962","upvote_count":"2","timestamp":"1714387560.0","poster":"albatros06","content":"Selected Answer: C\nBy using the investigation graph in Microsoft Sentinel, you can explore connections between the existing Microsoft 365 Defender data and potentially find the relevant Defender for Cloud Apps alert related to the incident you're investigating. T"},{"upvote_count":"3","comment_id":"1187444","timestamp":"1711976820.0","content":"Selected Answer: D\nThe wording for option A, B and C makes me doubt them as answers because \n1. The Timeline card does not have an entity side panel, it's actually the entity side panel that has a Timeline card tab.\n2. The timelines tab is not on the incidents page of Sentinel and \n3. The investigation graph is not on the incidents page but rather on the incident details panel.\nThe Alert page in Defender 365 portal does allow you to associate an alert with an incident, so this would be my choice. Thought on this?","poster":"DChilds"},{"timestamp":"1708808340.0","comment_id":"1158158","content":"Selected Answer: A\nAnswer confirmed by items 5 & 6 listed here https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","poster":"Ramye","upvote_count":"1"},{"content":"Selected Answer: D\nThe question is tricky. If you read the following link you will see in limitations that you cannot link defender alerts to defender incidents from Sentinel. You can only do that from Defender portal. https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","poster":"kostask","timestamp":"1707553200.0","comment_id":"1145978","comments":[{"comment_id":"1145981","upvote_count":"1","timestamp":"1707553380.0","poster":"kostask","content":"Now that i thought it again, it says a link a defender for cloud app incident to a M365 Incident. and based on that you can do the following \"You can add Microsoft Defender XDR alerts to non-Defender incidents, and non-Defender alerts to Defender incidents, in the Microsoft Sentinel portal.\"\nSo A should be correct"}],"upvote_count":"1"},{"upvote_count":"3","content":"In the exam on 21/12/2023","comment_id":"1102574","poster":"ApexPredator84","timestamp":"1703166780.0"},{"content":"In the entity page side panel, select the Timeline card. A is the correct choice based on the links provided","comment_id":"1092689","timestamp":"1702229220.0","poster":"Murtuza","upvote_count":"3"},{"poster":"shadowdark83","content":"Selected Answer: A\nBased on the documentation below, I think the aswer is A.\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","upvote_count":"4","timestamp":"1698939360.0","comment_id":"1060652"},{"timestamp":"1698059580.0","poster":"danb67","upvote_count":"1","content":"Selected Answer: D\nChanged my mind. This question has annoyed. I use Sentinel and A, B or C as worded in the question does not allow us to link to another incident. However D does. I have alerts in Sentinel that have been ingested from Defender. If I go to the alert in Defender I can 'link to another incident","comment_id":"1051739"},{"timestamp":"1697970000.0","content":"B based on https://learn.microsoft.com/en-us/azure/sentinel/relate-alerts-to-incidents#add-alerts-using-the-entity-timeline-preview","upvote_count":"1","comments":[{"comment_id":"1050440","upvote_count":"2","poster":"danb67","timestamp":"1697970240.0","content":"Changed my mind to A as the wording in B is strange and doesn't fit"}],"comment_id":"1050438","poster":"danb67"},{"timestamp":"1697298600.0","content":"The provided answer is correct. \nThe article provided by a311 does illustrate how to do this, however, I believe that the instructions were misinterpreted. \n. Launch Sentinel\n. Go to incidents\n. Click on incident >> Investigate\n. In the middle pane you have the Overview tab and the Entities tab, click on Entities\n. Select one of the entities, and notice the blade that appears\nThe options on this screen are, Info, Timeline, Insight. \nIf you select timeline, you will see other alerts that you can add to the incident. \n\nB says the incident timeline, which are the alerts that are added to the incident. \n\nNow read A one more time:\nthe entity side panel of the Timeline card in Microsoft Sentinel","comment_id":"1043573","poster":"IT_Nerd31","upvote_count":"5"},{"poster":"donathon","content":"D for me too","timestamp":"1694671140.0","upvote_count":"1","comment_id":"1007264"},{"timestamp":"1694314020.0","poster":"mali1969","comment_id":"1003636","upvote_count":"3","content":"Selected Answer: D\nD. the Alerts page in the Microsoft 365 Defender portal.\n\nOpen the Microsoft 365 Defender portal and select Alerts.\nFind the alert that you want to add to the incident and select it.\nIn the alert details page, select Add to existing incident.\nIn the Add alert to incident pane, select the incident that you want to update and then select Add.\nThis will add the alert to the incident in both Microsoft 365 Defender and Microsoft Sentinel portals. Any changes you make to the incident in Microsoft 365 Defender will be synchronized to the same incident in Microsoft Sentinel"},{"upvote_count":"1","comment_id":"1002936","poster":"Fez786","timestamp":"1694236020.0","content":"This new question arrived today 9th september 2023.\nCan someone please verify the correct answer?"}],"timestamp":"2023-09-09 07:07:00","topic":"3","question_images":[]},{"id":"hODG21EJyZ4AkcUCiMug","question_images":[],"answer":"D","url":"https://www.examtopics.com/discussions/microsoft/view/50186-exam-sc-200-topic-3-question-9-discussion/","topic":"3","exam_id":122,"answers_community":["D (64%)","A (36%)"],"choices":{"C":"Threat intelligence","D":"Incidents","B":"Analytics","A":"Playbooks"},"question_text":"You have an Azure Sentinel workspace.\nYou need to test a playbook manually in the Azure portal.\nFrom where can you run the test in Azure Sentinel?","question_id":225,"discussion":[{"poster":"HSBNZ","content":"Manual triggering is available from the Azure Sentinel portal in the following blades:\n\nIn Incidents view, choose a specific incident, open its Alerts tab, and choose an alert.\n\nIn Investigation, choose a specific alert.\n\nClick on View playbooks for the chosen alert. You will get a list of all playbooks that start with an When an Azure Sentinel Alert is triggered and that you have access to.\n\nClick on Run on the line of a specific playbook to trigger it.\n\nSelect the Runs tab to view a list of all the times any playbook has been run on this alert. It might take a few seconds for any just-completed run to appear in this list.\n\nClicking on a specific run will open the full run log in Logic Apps.","comment_id":"429014","upvote_count":"28","timestamp":"1629603240.0"},{"comment_id":"796323","content":"Selected Answer: D\nClearly says to go to Incidents first.\nhttps://learn.microsoft.com/en-us/azure/sentinel/tutorial-respond-threats-playbook?tabs=LAC%2Cincidents#run-a-playbook-manually-on-an-alert","comments":[{"upvote_count":"1","timestamp":"1689866280.0","content":"I did not mean to upvote this. Where in the question does it say there has been an alert? Did you just add that in?","poster":"EM1234","comment_id":"957732"},{"timestamp":"1689867060.0","comment_id":"957751","poster":"EM1234","content":"also, where does it say first?","upvote_count":"1"},{"content":"I do not like this question and D is a good choice but when I read the specific doc about testing playbooks (which I had not seen anyone link yet):\nhttps://learn.microsoft.com/en-us/azure/sentinel/automate-responses-with-playbooks#run-a-playbook-manually\n\nI see you can test the playbook three ways:\nTo run a playbook on a specific incident\nTo run a playbook on an alert\nTo run a playbook on an entity","comment_id":"957755","upvote_count":"4","comments":[{"comment_id":"957761","upvote_count":"1","content":"Sorry I did not mean to hit submit yet, I will continue.\n\nSo I see three ways to test but then this sentence:\n\nIn any of these panels, you'll see two tabs: Playbooks and Runs.\n\nSo then, I think in this poorly worded question you actually do click on \"playbooks\" to test. \n\nIf I see this on the exam I am not sure which one I would choose, it could be a lot more clear than it is IMO.","timestamp":"1689867360.0","poster":"EM1234"}],"timestamp":"1689867240.0","poster":"EM1234"}],"upvote_count":"8","poster":"palito1980","timestamp":"1675362360.0"},{"timestamp":"1727671320.0","poster":"talosDevbot","upvote_count":"1","comment_id":"1291400","content":"Selected Answer: D\nSentinel > Incidents > click on an incident > Actions > Run Playbook"},{"content":"Selected Answer: D\nConfirmed from SC-200 Microsoft Practice Assessment\n\nhttps://learn.microsoft.com/en-us/credentials/certifications/exams/sc-200/practice/assessment?assessment-type=practice&assessmentId=59","poster":"Ramye","comment_id":"1163668","upvote_count":"7","timestamp":"1709317080.0"},{"comment_id":"1135432","timestamp":"1706580780.0","content":"You can test a playbook manually in Azure Sentinel from both A. Playbooks and B. Incidents.\n\nA. Playbooks: You can run a playbook directly from the Playbooks blade in Azure Sentinel. This allows you to test the playbook independently of any incident or alert.\n\nB. Incidents: You can also run a playbook from an incident in Azure Sentinel. This allows you to test the playbook in the context of a specific incident.","upvote_count":"1","poster":"xoe123"},{"poster":"estyj","upvote_count":"1","timestamp":"1705447440.0","content":"D: Incidents https://techcommunity.microsoft.com/t5/microsoft-sentinel-blog/run-microsoft-sentinel-playbooks-from-workbooks-on-demand/ba-p/3193074","comment_id":"1124581"},{"poster":"chepeerick","comment_id":"1054822","timestamp":"1698344040.0","upvote_count":"1","content":"Option A"},{"poster":"danb67","timestamp":"1697994780.0","comment_id":"1050912","upvote_count":"1","content":"Selected Answer: D\nD for me. Click on an incident then click on action and then run playbook"},{"comments":[{"timestamp":"1709150460.0","comment_id":"1161963","upvote_count":"1","poster":"Ramye","content":"But the questions asked ---> From where can you run the test in Azure Sentinel? \nYour last sentence says - the answer is Incident."},{"comment_id":"1015504","poster":"Anil0512","content":"bang on answer, cheers","timestamp":"1695534300.0","upvote_count":"1"}],"content":"Selected Answer: A\nThe answer is A. Playbooks.\n\nPlaybooks are logic apps that allow you to automate and orchestrate your threat response in Azure Sentinel. You can create playbooks from templates or from scratch, and assign them to alerts or incidents to run automatically when triggered by an automation rule. You can also run playbooks manually on-demand, on a particular entity or alert, to test their functionality or perform a specific action.","upvote_count":"3","comment_id":"989182","poster":"mali1969","timestamp":"1692879780.0"},{"comments":[{"comment_id":"1292559","content":"Agree:\nIn Microsoft Sentinel, you can manually test a playbook from the \"Playbooks\" blade. Here's how to do it:\n\n1. Navigate to Microsoft Sentinel in the Azure portal.\n2. Select the appropriate workspace.\n3. In the left-hand menu, click on \"Configuration\" and then select \"Playbooks.\"\n4. Find the playbook you want to test and click on it to open its details.\n5. At the top, you'll see an option to \"Run playbook.\" Click this to start a manual test.","upvote_count":"1","poster":"sergioandreslq","timestamp":"1727913600.0"}],"comment_id":"975217","poster":"donathon","content":"Selected Answer: A\nIn the Playbooks tab, you'll see a list of all the playbooks that you have access to and that use the appropriate trigger - whether Microsoft Sentinel Incident, Microsoft Sentinel Alert, or Microsoft Sentinel Entity. Each playbook in the list has a Run button which you select to run the playbook immediately.","timestamp":"1691471640.0","upvote_count":"3"},{"timestamp":"1690622640.0","content":"Selected Answer: D\ncorrect","upvote_count":"1","poster":"itsadel","comment_id":"966277"},{"comment_id":"945847","upvote_count":"1","timestamp":"1688747460.0","poster":"mimguy","content":"On the exam July 7 2023"},{"poster":"evilprime","content":"i think keyword is here is \"test\" why test a playbook on a actual incident.. go to playbooks and from there you can test it.","comments":[{"comment_id":"933583","timestamp":"1687696560.0","poster":"7c0a","content":"Cause you need parameters(an array with entities), which are provided by the Sentinel trigger.\nPlease stop using chatGPT for this matter, it is very unreliable approach, ChatGPT is good for other things, like generating basic code for most common/popular scenarios and languages, doing conversions, parsing, etc...","upvote_count":"4"}],"comment_id":"850290","upvote_count":"1","timestamp":"1679762400.0"},{"upvote_count":"4","content":"Selected Answer: A\nA. Playbooks.\n\nTo test a playbook manually in Azure Sentinel, you can use the \"Test\" feature in the Playbooks section of the Azure Sentinel workspace.\n\nTo do this, navigate to the Azure Sentinel workspace in the Azure portal, click on \"Playbooks\" in the left-hand menu, and then select the playbook that you want to test. From there, click the \"Test\" button at the top of the page","comment_id":"817790","poster":"[Removed]","timestamp":"1677067020.0","comments":[{"comment_id":"919433","content":"You give chatgpt answers everytime. So many people here have commented on your alomst every time incorrect answers.","poster":"billo79152718","timestamp":"1686324840.0","upvote_count":"6"}]},{"comment_id":"797705","upvote_count":"4","timestamp":"1675496280.0","content":"Selected Answer: A\nYou can run the test in Azure Sentinel from the \"Playbooks\" blade.","poster":"teouba"},{"upvote_count":"1","content":"Given answer is correct. Option D","comment_id":"747836","poster":"kushagrasharma172","timestamp":"1671260820.0"},{"poster":"subhuman","comment_id":"563743","timestamp":"1646798940.0","upvote_count":"2","content":"Selected Answer: D\nAnswer is Correct"},{"poster":"Tx4free","content":"Selected Answer: D\nBest answer","comment_id":"563537","timestamp":"1646772900.0","upvote_count":"2"},{"comment_id":"550899","upvote_count":"3","poster":"stromnessian","timestamp":"1645273980.0","content":"Selected Answer: D\nCorrect - see link provided."},{"poster":"sommy","upvote_count":"4","content":"correct","comment_id":"336276","timestamp":"1618490520.0"}],"unix_timestamp":1618490520,"timestamp":"2021-04-15 14:42:00","answer_description":"","answer_ET":"D","isMC":true,"answer_images":[]}],"exam":{"lastUpdated":"12 Apr 2025","isBeta":false,"name":"SC-200","isMCOnly":false,"numberOfQuestions":371,"id":122,"provider":"Microsoft","isImplemented":true},"currentPage":45},"__N_SSP":true}