{"pageProps":{"questions":[{"id":"9fgqHnJb4CjRGmRxjmua","answer_images":[],"question_text":"You have 500 on-premises Windows 11 devices that use Microsoft Defender for Endpoint.\nYou enable Network device discovery.\n\nYou need to create a hunting query that will identify discovered network devices and return the identity of the onboarded device that discovered each network device.\n\nWhich built-in function should you use?","exam_id":122,"question_images":[],"isMC":true,"answer":"A","url":"https://www.examtopics.com/discussions/microsoft/view/141667-exam-sc-200-topic-7-question-10-discussion/","answers_community":["A (100%)"],"topic":"7","answer_description":"","discussion":[{"content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/defender-xdr/advanced-hunting-seenby-function","comment_id":"1362910","poster":"Blasty","timestamp":"1740733020.0","upvote_count":"1"},{"poster":"laddu001","content":"Seenby function - https://learn.microsoft.com/en-us/defender-endpoint/device-discovery","comment_id":"1231596","upvote_count":"4","timestamp":"1718584980.0"},{"timestamp":"1717158540.0","upvote_count":"3","content":"Selected Answer: A\nCorrect.\nBy invoking the SeenBy function, in your advanced hunting query, you can get detail on which onboarded device a discovered device was seen by. This information can help determine the network location of each discovered device and subsequently, help to identify it in the network.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/device-discovery","comment_id":"1222146","poster":"rsanx42"}],"question_id":336,"choices":{"D":"current_cluster_endpoint()","C":"next()","A":"SeenBy()","B":"DeviceFromIP()"},"answer_ET":"A","timestamp":"2024-05-31 14:29:00","unix_timestamp":1717158540},{"id":"y6ue1I17HUzrXwIonSFw","url":"https://www.examtopics.com/discussions/microsoft/view/141947-exam-sc-200-topic-7-question-11-discussion/","choices":{"D":"Contributor","C":"Microsoft Sentinel Automation Contributor","A":"Microsoft Sentinel Contributor","B":"Workbook Contributor"},"answer_ET":"B","unix_timestamp":1717606920,"answers_community":["B (71%)","A (29%)"],"question_text":"You have an Azure subscription that contains a resource group named RG1. RG1 contains a Microsoft Sentinel workspace. The subscription is linked to a Microsoft Entra tenant that contains a user named User1.\n\nYou need to ensure that User1 can deploy and customize Microsoft Sentinel workbook templates. The solution must follow the principle of least privilege.\n\nWhich role should you assign to User1 for RG1?","topic":"7","answer_description":"","question_id":337,"answer_images":[],"answer":"B","question_images":[],"timestamp":"2024-06-05 19:02:00","discussion":[{"comment_id":"1225954","upvote_count":"9","content":"Selected Answer: B\ncorrect answer","timestamp":"1717745160.0","poster":"Vokuhila"},{"poster":"threshclo","upvote_count":"7","comment_id":"1258363","timestamp":"1722366960.0","content":"Selected Answer: A\nTo create and delete a Microsoft Sentinel workbook, the user needs either the Microsoft Sentinel Contributor role or a lesser Microsoft Sentinel role, together with the Workbook Contributor Azure Monitor role."},{"poster":"a_kto_to","upvote_count":"1","comment_id":"1378710","content":"Selected Answer: B\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles/monitor#workbook-contributor","timestamp":"1741587300.0"},{"poster":"dnt91","timestamp":"1733294460.0","comment_id":"1321747","upvote_count":"3","content":"Selected Answer: B\nTo manage TEMPLATES (not only workbook), you need the Workbook Contributor Role, not the Sentinel Contributor Role which help managing workbooks (not templates)"},{"poster":"Itsmebigal","timestamp":"1733202120.0","content":"Selected Answer: B\nActions Description\nMicrosoft.Insights/workbooks/write Create or update a workbook\nMicrosoft.Insights/workbooks/delete Delete a workbook\nMicrosoft.Insights/workbooks/read Read a workbook\nMicrosoft.Insights/workbooks/revisions/read Get the workbook revisions\nMicrosoft.Insights/workbooktemplates/write Create or update a workbook template\nMicrosoft.Insights/workbooktemplates/delete Delete a workbook template\nMicrosoft.Insights/workbooktemplates/read Read a workbook template\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles/monitor#workbook-contributor","comment_id":"1321240","upvote_count":"3"},{"comment_id":"1320508","upvote_count":"1","timestamp":"1733044680.0","poster":"barneyone","content":"Selected Answer: B\nCorrect answer"},{"poster":"choukou","content":"B---->ok","timestamp":"1731922980.0","comment_id":"1313921","upvote_count":"1"},{"timestamp":"1726484700.0","poster":"dyavlito","content":"Answer: B. Workbook Contributor\n\nExplanation:\nWorkbook Contributor role grants the required permissions to deploy and customize workbook templates in Microsoft Sentinel.\nIt provides the ability to create and modify workbooks without granting broader permissions that are not needed for this task.\nThe other roles provide broader access or different functionalities that are not necessary for just working with workbook templates:\n\nA. Microsoft Sentinel Contributor grants broader permissions across Microsoft Sentinel but is not required solely for workbook templates.\nC. Microsoft Sentinel Automation Contributor is focused on automating tasks and is unrelated to workbooks.\nD. Contributor grants full access to manage all resources in the resource group, which is more access than needed.\nTherefore, Workbook Contributor is the best choice for this scenario.","upvote_count":"4","comment_id":"1284615","comments":[{"timestamp":"1728625440.0","upvote_count":"3","comment_id":"1295848","poster":"talosDevbot","content":"Agreed\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles/monitor#workbook-contributor"}]}],"exam_id":122,"isMC":true},{"id":"7Jb4YvgvFnnZEMx10yEO","answers_community":[],"answer_description":"","isMC":false,"question_id":338,"unix_timestamp":1717567080,"answer":"","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 subscription that uses Microsoft Defender XDR.\n\nYou need to create a custom detection rule that will identify devices that had more than five antivirus detections within the last 24 hours.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","discussion":[{"poster":"e072f83","comment_id":"1229836","upvote_count":"5","timestamp":"1718285280.0","content":"correct, see script: https://learn.microsoft.com/en-us/defender-xdr/custom-detection-rules"},{"content":"ReportId x2","poster":"g_man_rap","timestamp":"1724230260.0","comment_id":"1269972","upvote_count":"2"},{"comment_id":"1224543","content":"DeviceEvents\n| where ingestion_time() > ago(1d)\n| where ActionType == \"AntivirusDetection\"\n| summarize (Timestamp, ReportId)=arg_max(Timestamp, ReportId), count() by DeviceId\n| where count_ > 5","timestamp":"1717567080.0","poster":"smosmo","upvote_count":"2"}],"exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/141909-exam-sc-200-topic-7-question-12-discussion/","answer_ET":"","answer_images":["https://img.examtopics.com/sc-200/image310.png"],"topic":"7","question_images":["https://img.examtopics.com/sc-200/image309.png"],"timestamp":"2024-06-05 07:58:00"},{"id":"74c4dgI7hxOiVjDVZiMG","exam_id":122,"answer":"","topic":"7","question_text":"HOTSPOT\n-\n\nYou need to build a KQL query in a Microsoft Sentinel workspace. The query must return the SecurityEvent record for accounts that have the last record with an EventID value of 4624.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_images":["https://img.examtopics.com/sc-200/image329.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/151200-exam-sc-200-topic-7-question-13-discussion/","unix_timestamp":1731502140,"discussion":[{"comments":[{"poster":"Madzius","timestamp":"1735886280.0","content":"This question was on the test. The answer seems to be good.","upvote_count":"3","comment_id":"1335915"},{"poster":"HAjouz","content":"Dropdown 1: where EventID == 4624\n\nDropdown 2: summarize arg_max(TimeGenerated, *) by Account","comment_id":"1325974","timestamp":"1734058020.0","upvote_count":"2"}],"upvote_count":"8","content":"GPT4:\nSecurityEvent\n| where EventID == 4624\n| summarize arg_max(TimeGenerated, *) by Account","timestamp":"1731502140.0","comment_id":"1311249","poster":"chirva"},{"content":"I think the answer should be:\nDropdown 1: summarize arg_max(TimeGenerated, *) by Account\nDropdown 2: where EventID == 462\nMy reasoning for the above is this - the questions says to return accounts where the last record was eventid 4624. So first we need to find the last record for each account and then filter for 4624.","upvote_count":"1","timestamp":"1739803680.0","comment_id":"1357826","comments":[{"comment_id":"1357827","content":"Small typo in my 2nd sentence: Dropdown 2: where EventID == 4624","poster":"8b70ec7","timestamp":"1739803680.0","upvote_count":"1"}],"poster":"8b70ec7"}],"answer_description":"","timestamp":"2024-11-13 13:49:00","question_id":339,"isMC":false,"question_images":["https://img.examtopics.com/sc-200/image328.png"],"answers_community":[],"answer_ET":""},{"id":"GGCeNjv6XQJ0S8Nj2cwn","question_images":[],"choices":{"E":"SMB and RPC only","C":"SMB only","D":"RDP and RPC only","B":"RPC only","F":"RDP, RPC, and SMB","A":"RDP only"},"topic":"7","unix_timestamp":1736114520,"answers_community":["F (100%)"],"answer_ET":"F","url":"https://www.examtopics.com/discussions/microsoft/view/153923-exam-sc-200-topic-7-question-14-discussion/","answer_description":"","question_text":"You have a Microsoft 365 subscription that contains a user named User1 and two Windows devices named Device1 and Device2. Device1 and Device2 are onboarded to Microsoft Defender for Endpoint.\n\nThe following events occur.\n\n• User1 signs in to Device1.\n• Automatic attack disruption in Microsoft Defender XDR responds to an attack on Device1 and contains User1.\n• User1 attempts to connect to Device2.\n\nWhich protocols will Device2 block when User1 attempts to connect to Device2?","answer":"F","timestamp":"2025-01-05 23:02:00","exam_id":122,"question_id":340,"isMC":true,"answer_images":[],"discussion":[{"poster":"Blasty","comment_id":"1362914","content":"Selected Answer: F\nWhen an identity is contained, any supported Microsoft Defender for Endpoint onboarded device will block incoming traffic in specific protocols related to attacks (network logons, RPC, SMB, RDP), terminate ongoing remote sessions and logoff existing RDP connections (terminating the session itself including all its related processes), while enabling legitimate traffic.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts#contain-user-from-the-network","timestamp":"1740733800.0","upvote_count":"2"},{"upvote_count":"2","poster":"trut_hz","comment_id":"1339548","timestamp":"1736692620.0","content":"Selected Answer: F\nWhen Automatic Attack Disruption in Microsoft Defender XDR contains a user due to an identified attack, it takes specific actions to isolate the user and prevent the spread of the attack. One of these actions is blocking specific protocols to limit lateral movement and access to other devices.\n\nFor User1, attempting to connect to another device (Device2) after being contained will result in blocking access via the following protocols:\n\nRDP (Remote Desktop Protocol):\n\nCommonly used for remote management and often exploited in lateral movement attacks.\nRPC (Remote Procedure Call):\n\nUsed for remote execution of tasks and communication between Windows systems; also a common target for attackers.\nSMB (Server Message Block):\n\nFacilitates file sharing and other operations between devices. Attackers frequently exploit SMB vulnerabilities for lateral movement and data exfiltration."},{"poster":"CubicTeach","upvote_count":"1","timestamp":"1736114520.0","comment_id":"1336887","content":"Selected Answer: F\nNot sure but from Copilot: F"}]}],"exam":{"isBeta":false,"isImplemented":true,"lastUpdated":"12 Apr 2025","isMCOnly":false,"id":122,"numberOfQuestions":371,"name":"SC-200","provider":"Microsoft"},"currentPage":68},"__N_SSP":true}