{"pageProps":{"questions":[{"id":"psOF9wg9ZoVKxS2Uwmz7","answers_community":[],"unix_timestamp":1694235600,"answer_description":"","answer":"","topic":"3","question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace named sws1.\n\nYou need to create a query that will detect when a user creates an unusually large numbers of Azure AD user accounts.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","url":"https://www.examtopics.com/discussions/microsoft/view/120324-exam-sc-200-topic-3-question-77-discussion/","answer_ET":"","isMC":false,"discussion":[{"poster":"blueking","comments":[{"content":"BehaviorAnalytics to get ActivityInsights and UserInsights, and AuditLogs to get TargetResources","comment_id":"1290946","timestamp":"1727589660.0","poster":"Another_one","upvote_count":"2"}],"content":"BehaviorAnalytics\nAuditLogs","timestamp":"1703477460.0","comment_id":"1105007","upvote_count":"17"},{"comment_id":"1143435","content":"1. BehaviorAnalytics\n- Explanation: ActivityInsights Column\n- Reference: https://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/behavioranalytics\n2. AuditLogs\n - Explanation: TargetResources Column\n - Reference: https://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/auditlogs","upvote_count":"10","timestamp":"1707318120.0","poster":"Respen"},{"timestamp":"1722280800.0","upvote_count":"3","comment_id":"1257666","content":"1-BehaviorAnalytics \n2-AuditLogs","poster":"smanzana"},{"comment_id":"1080919","upvote_count":"6","timestamp":"1701020820.0","poster":"mc250616","content":"As DigitaIV already mentioned; the query only works for me if I use first BehaivorAnalytics and then Audit logs. Tested"},{"timestamp":"1699217400.0","upvote_count":"2","poster":"Ghost042","comment_id":"1063273","content":"Auditlogs,\nBehaviourAnalytics"},{"upvote_count":"1","content":"Auditlogs table does not have activity insights","poster":"Kurdd","comment_id":"1060029","timestamp":"1698868320.0"},{"timestamp":"1698631200.0","comments":[{"timestamp":"1708732380.0","content":"Joining the same table?","poster":"Ramye","comment_id":"1157567","upvote_count":"3"}],"comment_id":"1057279","content":"BehaviorAnalytics, BehaviorAnalytics","poster":"Fez786","upvote_count":"1"},{"poster":"chepeerick","timestamp":"1698524820.0","upvote_count":"1","comment_id":"1056428","content":"Correct"},{"timestamp":"1698056460.0","content":"BehaviorAnalytics, BehaviorAnalytics. It's only this table has ActivityInsights and UserInsights. The userinsights column contains an array of data and this query pulls out the accountdisplayname from it and adds it to a new column named DisplayName. I am just confused as to why we are joining the same table to itself.","comment_id":"1051713","poster":"danb67","upvote_count":"2","comments":[{"timestamp":"1698056760.0","upvote_count":"2","comment_id":"1051714","content":"My guess is this query if correct, uses default join (innerunique) would mean that on the left table we will get the add user row. Then from the right table we will get details of each user created. Whereas if we didnt join the tables and just did one big query then we would get too much info back.","poster":"danb67"}]},{"upvote_count":"4","poster":"DigitalV","comment_id":"1041868","timestamp":"1697123580.0","content":"Don't ask me why but the query only works for me if I use first BehaivorAnalytics and then Audit logs"},{"timestamp":"1695706020.0","upvote_count":"4","content":"BehaviorAnalytics, BehaviorAnalytics for me too.","poster":"donathon","comment_id":"1017400","comments":[{"timestamp":"1708775940.0","content":"Well, with this you would get at least 1 point - lol","upvote_count":"2","poster":"Ramye","comment_id":"1157852"}]},{"comment_id":"1012560","upvote_count":"2","timestamp":"1695234480.0","content":"what is the correct answer? im seeing different answers from 2 users below..................","poster":"Fez786"},{"comment_id":"1012427","content":"Correct answer are.\nBehaviourAnalytics and BehaviourAnalytics \nTried and tested.","poster":"Anil0512","comments":[{"content":"But why would you join same table?","upvote_count":"4","comment_id":"1019174","poster":"Vika_1_111","timestamp":"1695841380.0"}],"timestamp":"1695221220.0","upvote_count":"5"},{"content":"AuditLogs \nBehaviorAnalytics","comment_id":"1003609","comments":[{"upvote_count":"2","timestamp":"1706692980.0","content":"Its wrong. Test it. Its BehaviorAnalytics and AuditLogs","poster":"luisM14","comment_id":"1136580"}],"timestamp":"1694311260.0","poster":"mali1969","upvote_count":"4"},{"content":"SecurityEvents, BehaviorAnalytics","upvote_count":"1","timestamp":"1694239200.0","comment_id":"1002963","comments":[{"poster":"Nabbo92","comments":[{"upvote_count":"2","timestamp":"1697271120.0","content":"Why would you join the same table together?","comment_id":"1043249","poster":"danb67"},{"timestamp":"1695365940.0","comment_id":"1013728","upvote_count":"1","poster":"a311","content":"https://learn.microsoft.com/en-us/azure/sentinel/ueba-reference#activityinsights-field"}],"content":"BehaviorAnalytics, BehaviorAnalytics. Only that has the activityinsights column","comment_id":"1004478","timestamp":"1694411880.0","upvote_count":"6"}],"poster":"Nabbo92"}],"question_id":211,"exam_id":122,"question_images":["https://img.examtopics.com/sc-200/image197.png"],"answer_images":["https://img.examtopics.com/sc-200/image198.png"],"timestamp":"2023-09-09 07:00:00"},{"id":"PQO30tqYrm1bNXPrxGY7","answer_ET":"B","choices":{"D":"the Alert automation settings","A":"the incident automation settings","C":"entity mapping","B":"the query rule"},"timestamp":"2023-09-09 07:00:00","answer":"B","question_id":212,"question_text":"You have a Microsoft Sentinel playbook that is triggered by using the Azure Activity connector.\n\nYou need to create a new near-real-time (NRT) analytics rule that will use the playbook.\n\nWhat should you configure for the rule?","topic":"3","answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/120325-exam-sc-200-topic-3-question-78-discussion/","unix_timestamp":1694235600,"exam_id":122,"question_images":[],"answers_community":["B (59%)","A (35%)","6%"],"discussion":[{"comment_id":"1003610","content":"Selected Answer: B\nthe answer is B. the query rule.\n\nTo create an NRT rule, you need to follow these steps:\n\nFrom the Microsoft Sentinel navigation menu, select Analytics.\nSelect Create from the button bar, then NRT query rule (preview) from the drop-down list.\nFollow the instructions of the analytics rule wizard.","poster":"mali1969","timestamp":"1710043440.0","upvote_count":"10"},{"comment_id":"1416859","content":"Selected Answer: D\nYou need to configure the alert automation settings to trigger the playbook.","poster":"Optimizor_IT","timestamp":"1743500220.0","upvote_count":"1"},{"poster":"e072f83","comment_id":"1221782","timestamp":"1733002440.0","upvote_count":"3","content":"obsolete question:\nAs of June 2023, you can no longer select playbooks to run directly from an analytics rule by adding it to the following list. Playbooks already in the list will continue to run until March 2026, when this method will be deprecated.\nInstead, to run a playbook in response to an alert generated by this analytics rule, create an Automation rule."},{"upvote_count":"1","timestamp":"1729068720.0","content":"Selected Answer: A\nI am understanding the question to ask how you plan on making sure the new NRT rule uses the already existing playbook. You already know what query you will run, to make use of the already existing playbook you would have to configure the incident automation. Answer is A.","comment_id":"1196481","comments":[{"upvote_count":"1","content":"I change my mind and go with B. The rule is what you configure for the NRT to use the playbook.","timestamp":"1729691940.0","poster":"DChilds","comment_id":"1200775"}],"poster":"DChilds"},{"comment_id":"1136206","timestamp":"1722369180.0","poster":"luisM14","content":"Selected Answer: A\nfor me is A.\n\nFor a rule to use a playbook, you need to configure automation","upvote_count":"2"},{"upvote_count":"1","content":"In the Set rule logic tab, you can either write a query directly in the Rule query field, the choice is B","poster":"Murtuza","timestamp":"1719573900.0","comment_id":"1107799"},{"upvote_count":"2","timestamp":"1718961720.0","poster":"ApexPredator84","comment_id":"1102395","content":"In the exam on 21/12/2023"},{"timestamp":"1716968880.0","poster":"NeoTactics","upvote_count":"3","content":"Selected Answer: A\nI tested it and think it is \"A\". When creating a new NRT Rule, it is only possible to add a playbook when using \"When incident is created trigger\" or \"When incident is updated\". It is not possible to select \"Alert\" for NRT rule. So, as the question ask what needs to be done for the playbook to be triggered in the NRT rule, this should be \"A\"","comment_id":"1083327"},{"poster":"chepeerick","comment_id":"1056433","upvote_count":"1","timestamp":"1714336620.0","content":"Correct option"},{"upvote_count":"1","comment_id":"1012429","content":"B\n\nYou create NRT rules the same way you create regular scheduled-query analytics rules:\nFrom the Microsoft Sentinel navigation menu, select Analytics.\nSelect Create from the button bar, then NRT query rule (preview) from the drop-down list.\nFollow the instructions of the analytics rule wizard","timestamp":"1710953520.0","poster":"Anil0512"}],"answer_images":[],"isMC":true},{"id":"Rfh6KTDei2vR1NeQNUHb","question_text":"You need to visualize Microsoft Sentinel data and enrich the data by using third-party data sources to identify indicators of compromise (IoC).\n\nWhat should you use?","answer_images":[],"choices":{"A":"notebooks in Microsoft Sentinel","B":"Microsoft Defender for Cloud Apps","C":"Azure Monitor"},"answer_description":"","exam_id":122,"answer":"A","topic":"3","discussion":[{"content":"Selected Answer: A\nA. notebooks in Microsoft Sentinel. Notebooks are interactive tools that allow you to run Python code, query data, perform machine learning, and create visualizations. Notebooks can help you hunt for threats, investigate incidents, and perform data analysis using Microsoft Sentinel data and external data sources.","comment_id":"1003613","poster":"mali1969","timestamp":"1725933960.0","upvote_count":"7"},{"content":"Correct option","poster":"chepeerick","upvote_count":"1","timestamp":"1730155020.0","comment_id":"1056434"},{"content":"correct.","comment_id":"1016089","poster":"Anil0512","timestamp":"1727202120.0","upvote_count":"1"}],"question_id":213,"answer_ET":"A","unix_timestamp":1694235660,"timestamp":"2023-09-09 07:01:00","question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/120326-exam-sc-200-topic-3-question-79-discussion/","answers_community":["A (100%)"],"isMC":true},{"id":"daXNL4qAcSY35v4NFEzQ","answer":"BE","question_id":214,"unix_timestamp":1624133220,"answer_images":[],"answer_ET":"BE","discussion":[{"upvote_count":"23","content":"Correct - every sentinel deployment must have a workspace - and the union command is used to join multiple workspaces together.","poster":"Eltooth","comments":[{"comments":[{"content":"Actually, E says --> Add the Azure Sentinel solution to each workspace. And, having multiple workspaces for Sentinel in a tenant is very much doable, and in some cases, it is recommended, i.e. different regions or projects, for easier management. In this question, there are different projects in each Azure subscription so having Sentinel solutions in those workspaces makes sense.","comment_id":"1161950","timestamp":"1709148960.0","poster":"Ramye","upvote_count":"3"}],"poster":"Shared","timestamp":"1670176200.0","comment_id":"735317","upvote_count":"1","content":"Well option E says to add Sentinel, which seems to be wrong as there can be 1 Sentinel/tenant and works across subscriptions: https://github.com/MicrosoftDocs/azure-docs/issues/85443\nhttps://techcommunity.microsoft.com/t5/microsoft-sentinel/azure-sentinel-instances-per-subscription/m-p/2278936"}],"comment_id":"457490","timestamp":"1633410360.0"},{"timestamp":"1733471640.0","upvote_count":"1","poster":"xRiot007","comment_id":"1322656","content":"Selected Answer: BE\nAnswer is B and E - you install sentinel on each workspace and then query using an union. An alternative to this is to use Azure Lighthouse."},{"content":"100% the answer is B and E\nIt's stated in Microsoft's documentation: https://learn.microsoft.com/en-us/azure/sentinel/extend-sentinel-across-workspaces-tenants\n\nUnder the \"Include cross-workspace queries in scheduled analytics rules\" section:\n\"You must deploy Microsoft Sentinel on every workspace referenced in the query.\"\n\nUnder the \"Hunt across multiple workspaces\" section:\n\"Cross-workspace hunting capabilities enable your threat hunters to create new hunting queries, or adapt existing ones, to cover multiple workspaces, by using the union operator and the workspace() expression as shown above.\"","upvote_count":"2","timestamp":"1727670780.0","poster":"talosDevbot","comment_id":"1291393"},{"poster":"4rk4n4","upvote_count":"1","timestamp":"1709434020.0","content":"Selected Answer: BE\nB AND E","comment_id":"1164462"},{"poster":"chepeerick","timestamp":"1698343980.0","content":"Correct BE","comment_id":"1054821","upvote_count":"1"},{"timestamp":"1694021280.0","poster":"mali1969","comment_id":"1000846","content":"B and C. Here is why:\n\nOption B is correct because you can query multiple workspaces in a single query by using the workspace() expression to refer to a table in a different workspace and the union operator to combine the results from multiple tables.\nOption C is correct because you can use the alias statement to simplify cross-workspace queries by saving a long reference to a table in another workspace as a function.\n\nOption A is not correct because adding the Security Events connector to the Azure Sentinel workspace does not enable you to query across multiple workspaces. \n\nOption D is not correct because there is no such thing as the resource expression or the alias operator in Kusto Query Language (KQL)\n\nOption E is not correct because adding the Azure Sentinel solution to each workspace does not allow you to perform cross-workspace hunting queries.","upvote_count":"1"},{"content":"You can include up to 20 workspaces in a single query. However, for good performance, we recommend including no more than 5.\nYou must deploy Microsoft Sentinel on every workspace referenced in the query.","comment_id":"1000341","poster":"emv","upvote_count":"1","timestamp":"1693985220.0"},{"content":"Selected Answer: BE\nAccording to the URL in the answer:\nUse the union operator alongside the workspace( ) expression to apply a query across tables in multiple workspaces.\nYou must deploy Microsoft Sentinel on every workspace referenced in the query.","poster":"donathon","comment_id":"992740","timestamp":"1693277880.0","upvote_count":"1"},{"upvote_count":"2","content":"Selected Answer: AB\nI see no reason why you would need more sentinel instances. Follow the design decision tree here:\nhttps://learn.microsoft.com/en-us/azure/sentinel/design-your-workspace-architecture#decision-tree\nI think B is obviously part of the solution. The question is what other choice. I am going with A. It makes more sense to me than making additional Sentinel instances. \n\nI wonder if you made all of them, which one would you be hunting in? \n\nA and B for me.","comment_id":"957731","timestamp":"1689866040.0","comments":[{"poster":"Mducks","timestamp":"1707669060.0","upvote_count":"1","comment_id":"1147502","content":"Given answer is correct.\nhttps://learn.microsoft.com/en-us/azure/sentinel/extend-sentinel-across-workspaces-tenants\nCopied and pasted 4 sentences directly from link above:\nYou can query multiple workspaces, allowing you to search and correlate data from multiple workspaces in a single query.\nUse the workspace( ) expression, with the workspace identifier as the argument, to refer to a table in a different workspace.\nUse the union operator alongside the workspace( ) expression to apply a query across tables in multiple workspaces.\nYou must deploy Microsoft Sentinel on every workspace referenced in the query."}],"poster":"EM1234"},{"comments":[{"upvote_count":"4","content":"what is chatgpt? if i am ask.","timestamp":"1680183180.0","comment_id":"855811","poster":"mangali84"}],"poster":"evilprime","upvote_count":"1","timestamp":"1679762100.0","content":"chatgpt says 'B E' using exact question with given answers. \nE. You need to add the Azure Sentinel solution to each Log Analytics workspace that you want to search. This allows Azure Sentinel to collect data from the workspace and store it in the Azure Sentinel workspace.","comment_id":"850288"},{"content":"Selected Answer: BD\n. Create a query that uses the workspace expression and the union operator, and D. Create a query that uses the resource expression and the alias operator\nCreate a query that uses the workspace expression and the union operator to combine the data from all the Log Analytics workspaces. For example:\nunion *\n| where TimeGenerated > ago(1d)\nCreate a query that uses the resource expression and the alias operator to query data from specific resources across all the subscriptions. For example\nAzureActivity\n| where ResourceProviderValue == \"Microsoft.Compute\"\n| where OperationNameValue == \"Microsoft.Compute/virtualMachines/delete\"\n| project SubscriptionId, ResourceGroup, Resource, Caller, TimeGenerated, ActivityStatus\n| summarize count() by Resource","comment_id":"817789","poster":"[Removed]","timestamp":"1677066900.0","upvote_count":"2"},{"poster":"daba_fcb","timestamp":"1676058540.0","upvote_count":"3","comment_id":"804696","content":"Selected Answer: AB\nI think it's A B, \nA - security events connector is called \"Security events via legacy agent\" and it's Legacy version based on the Microsoft Monitor Agent / Log Analytics\" and the question states that windows events of the VM's are stored in a log analytics workspace. Reference:\nhttps://jeffreyappel.nl/collect-security-events-in-sentinel-with-the-new-ama-agent-and-dcr/"},{"upvote_count":"1","comment_id":"802127","poster":"[Removed]","timestamp":"1675866900.0","content":"Should the answer include a data connector if it is a new Sentinel?"},{"comment_id":"753379","comments":[{"comment_id":"753382","upvote_count":"1","timestamp":"1671719520.0","poster":"Windy232","comments":[{"timestamp":"1676247240.0","poster":"Cho","comment_id":"806941","upvote_count":"2","content":"I would choose increased cost and increased deployment complexity."},{"timestamp":"1675104000.0","comment_id":"793186","comments":[{"content":"According to the url you have provided its \n\nLimited support for querying data accross workspaces\nLack of a single pane of glass","comment_id":"1047680","upvote_count":"1","poster":"danb67","timestamp":"1697702580.0"}],"poster":"midaoui","content":"I would answer:\n- Lack of a single pane of glass\n- Increased deployment complexity\nhttps://charbelnemnom.com/top-best-practices-for-deploying-azure-sentinel/","upvote_count":"1"}],"content":"Which one should be chose?\nThanks all"}],"upvote_count":"1","poster":"Windy232","content":"Your company has an Azure subscription that hosts resources in multiple Azure regions in different countries.\nWhat are two primary drawbacks of implementing single-tenant with regional workspaces Microsoft Sentinel in your environment as compared to the single-tenant single workspace option? Each correct answer presents part of the solution.\n\nLimited support for querying data across workspaces\nIncreased cost of network bandwidth\nLack of a single pane of glass\nIncreased cost of compute services\nIncreased deployment complexity","timestamp":"1671719460.0"},{"upvote_count":"1","comment_id":"750218","poster":"Apocalypse03","timestamp":"1671480480.0","content":"Selected Answer: BE\nlet subscriptions = [subscription1, subscription2, ...];\nunion withsource=source\n(\n workspace(\"workspace1\").SecurityEvent | where TimeGenerated >= ago(1d),\n workspace(\"workspace2\").SecurityEvent | where TimeGenerated >= ago(1d),\n ...\n)"},{"upvote_count":"4","content":"Questions states, \"All the subscriptions use the same Azure Active Directory (Azure AD) tenant\" - from MS - Multiple Azure tenants Microsoft Sentinel supports data collection from Microsoft and Azure SaaS resources only within its own Azure Active Directory (Azure AD) tenant boundary. Therefore, each Azure AD tenant requires a separate workspace.\n\nSince we are using the same AD the answer should be A and B.\n\nAlso it would be a pain to manage all these Sentinel instances.\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/extend-sentinel-across-workspaces-tenants","comment_id":"709427","poster":"AMZ","timestamp":"1667334840.0"},{"comment_id":"668346","upvote_count":"1","content":"Selected Answer: BE\nCorrect. LAs need sentinels and then query with union","timestamp":"1663096260.0","poster":"Fukacz"},{"poster":"CatoFong","timestamp":"1658861640.0","upvote_count":"1","content":"Selected Answer: BE\nBE is correct","comment_id":"637584"},{"poster":"AbdulMueez","comment_id":"607656","timestamp":"1653569700.0","upvote_count":"2","content":"CORRECT"},{"comment_id":"597021","timestamp":"1651701600.0","poster":"Enjosi","upvote_count":"2","content":"Agree. B and E are correct"},{"timestamp":"1649844420.0","content":"Selected Answer: BE\nB and E","comment_id":"585139","upvote_count":"2","poster":"Fishman22222"},{"poster":"timtim589","content":"Selected Answer: BE\nDefinitely B and E. To query logs across multiple workspaces, all workspaces should have a sentinel solution deployed on top of them and the union workspace('WorkspaceName') should be used.","comment_id":"581587","timestamp":"1649220840.0","upvote_count":"1"},{"timestamp":"1646772840.0","poster":"Tx4free","upvote_count":"2","comment_id":"563535","content":"Selected Answer: BE\nBest options"},{"upvote_count":"4","comment_id":"429496","content":"To query data across workspaces, use the workspace() function before the table name.\n\nKusto\n\nCopy\nTableName\n\n| union workspace(\"WorkspaceName\").TableName","timestamp":"1629662520.0","poster":"jasonfmj"},{"content":"Correct Answer\nhttps://docs.microsoft.com/en-us/learn/modules/create-manage-azure-sentinel-workspaces/2-plan-for-azure-sentinel-workspace","upvote_count":"2","timestamp":"1624133220.0","poster":"emmdekay","comment_id":"385760","comments":[{"poster":"danb67","timestamp":"1697702820.0","comment_id":"1047683","upvote_count":"1","content":"Agreed I was back and forth with this one but this link helped. Answer is correct imo."}]}],"exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/55643-exam-sc-200-topic-3-question-8-discussion/","timestamp":"2021-06-19 22:07:00","question_images":[],"topic":"3","answers_community":["BE (61%)","AB (28%)","11%"],"choices":{"D":"Create a query that uses the resource expression and the alias operator.","C":"Use the alias statement.","E":"Add the Azure Sentinel solution to each workspace.","A":"Add the Security Events connector to the Azure Sentinel workspace.","B":"Create a query that uses the workspace expression and the union operator."},"isMC":true,"answer_description":"","question_text":"Your company stores the data of every project in a different Azure subscription. All the subscriptions use the same Azure Active Directory (Azure AD) tenant.\nEvery project consists of multiple Azure virtual machines that run Windows Server. The Windows events of the virtual machines are stored in a Log Analytics workspace in each machine's respective subscription.\nYou deploy Azure Sentinel to a new Azure subscription.\nYou need to perform hunting queries in Azure Sentinel to search across all the Log Analytics workspaces of all the subscriptions.\nWhich two actions should you perform? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point."},{"id":"HT1IxbID2IrYVn3FE2vP","exam_id":122,"answer":"","answer_ET":"","timestamp":"2023-09-09 07:02:00","answer_description":"","answers_community":[],"question_id":215,"question_images":["https://img.examtopics.com/sc-200/image199.png"],"unix_timestamp":1694235720,"url":"https://www.examtopics.com/discussions/microsoft/view/120327-exam-sc-200-topic-3-question-80-discussion/","topic":"3","discussion":[{"content":"Logs and Hunting. You create a bookmark based on a query you have run. So go to logs and run a query. Choose one of the results and then you get the option to save as Bookmark. Only once you have created the query will you then see the query on the hunting blade under bookmarks. Then in the hunting blade we have the option to link the new bookmark to an incident.\nBased on real world experience I go with Logs and Hunting","timestamp":"1698059040.0","upvote_count":"18","poster":"danb67","comments":[{"timestamp":"1733505420.0","comment_id":"1322860","poster":"Tuitor01","content":"Yup, the only place you can create a bookmark is from the logs blade, you select your results, you click, create bookmark on top of the result tables, then in the bookmark table (previous blade) you select you bookmark assign to new or existent incident.","upvote_count":"3"},{"timestamp":"1698877560.0","comment_id":"1060094","poster":"shadowdark83","content":"Correct!","upvote_count":"2"}],"comment_id":"1051733"},{"timestamp":"1713471900.0","upvote_count":"5","comment_id":"1198161","poster":"DChilds","content":"Answer is correct:\nHunting blade\nHunting blade \n\nhttps://learn.microsoft.com/en-us/azure/sentinel/bookmarks#add-bookmarks-to-a-new-or-existing-incident"},{"comment_id":"1360706","upvote_count":"1","content":"Hunting blade - hunting blade","poster":"HAjouz","timestamp":"1740335940.0"},{"content":"I think that hunting blade and logs blade are the correct answers","timestamp":"1722280440.0","poster":"smanzana","comment_id":"1257665","upvote_count":"1"},{"content":"1. From the Hunting tab, select a hunt.\n2. Select View query results. This action opens the query results in the Logs pane.\n3. Select Add bookmark\n\nsource: https://learn.microsoft.com/en-us/azure/sentinel/bookmarks\n\nAnswer is:\nHunting blade\nLogs blade","timestamp":"1718031960.0","comment_id":"1227940","poster":"danituga","upvote_count":"3"},{"timestamp":"1712384820.0","upvote_count":"1","comment_id":"1190262","poster":"Shaddy43","content":"Hunting bookmarks in Microsoft Sentinel help you by preserving the queries you ran in Microsoft Sentinel - Logs, along with the query results that you deem relevant.\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/bookmarks\n\n\n1. Logs\n2. Hunting"},{"comment_id":"1099907","upvote_count":"1","content":"For adding a bookmark to an existing incident: Select one incident","poster":"Murtuza","timestamp":"1702920180.0"},{"timestamp":"1702147800.0","comments":[{"comments":[{"upvote_count":"2","content":"I got it - it says clearly here: https://learn.microsoft.com/en-us/azure/sentinel/bookmarks#add-bookmarks-to-a-new-or-existing-incident\n\n\"In the Azure portal, navigate to Microsoft Sentinel > Threat management > Hunting > Bookmarks tab, and select the bookmark or bookmarks you want to add to an incident.\"","poster":"Ramye","timestamp":"1708802700.0","comment_id":"1158113"}],"comment_id":"1158112","content":"can you explain why you think Hunting and Incidents? This is not clear in the info with the link. thx","upvote_count":"1","poster":"Ramye","timestamp":"1708802160.0"}],"content":"This link suggests HUNTING and then INCIDENTS\nhttps://learn.microsoft.com/en-us/azure/sentinel/bookmarks","poster":"Murtuza","comment_id":"1091981","upvote_count":"3"},{"poster":"ethhacker","comment_id":"1073988","timestamp":"1700311440.0","upvote_count":"1","content":"Select a hunting query from the Microsoft Sentinel hunting page and click \"View query results\" in hunting query details to view the results in Log Analytics. Use the check boxes to select one or more rows that contain the information you find interesting and click \"Add bookmark\". This preserves the data in the row for future reference. Learn more"},{"poster":"kabooze","content":"It's both hunting\nhttps://learn.microsoft.com/en-us/azure/sentinel/bookmarks\ncheck the comment in the purple box where it says that although you do the bookmarking in \"logs\", this option is only available if you go via the sentinel interface.","upvote_count":"2","timestamp":"1698607020.0","comment_id":"1057095"},{"upvote_count":"1","content":"So in my tenant I can't create a Boomark in the hunting blade. To create a bookmark you do it from the logs page. Question may be outtdated now.\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents#dive-deeper-into-your-data-in-logs\n\nThen from the logs page you can assign the bookmark to an incident\nLog and Logs for me","timestamp":"1697969100.0","comments":[{"upvote_count":"1","content":"hmmmm did some more digging and you can run a query from the bookmarks page abd it then takes you to the logs page to actually create the bookmark.","timestamp":"1697969280.0","poster":"danb67","comment_id":"1050433"}],"comment_id":"1050429","poster":"danb67"},{"poster":"chepeerick","upvote_count":"2","comment_id":"1046436","content":"Hunting and incident","timestamp":"1697587380.0"},{"upvote_count":"1","poster":"SaHaGe","comment_id":"1020404","content":"The second is Incident\nR: https://learn.microsoft.com/en-us/azure/sentinel/bookmarks#add-bookmarks-to-a-new-or-existing-incident","timestamp":"1695959100.0"},{"content":"Close I could get to getting some more in depth on this is that this below article explaining how to save as a bookmark and then you can add it to an incident (aka associating bookmark to incident) - all this is done from the Incidents tab.\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents#dive-deeper-into-your-data-in-logs\n\nSo, the answers as I judge this question are: Hunting and Incidents","comment_id":"1018453","timestamp":"1695791460.0","poster":"cris_exam","upvote_count":"1"},{"timestamp":"1695222540.0","upvote_count":"1","comment_id":"1012440","content":"I would go for.\nHunting and Incidents","poster":"Anil0512"},{"timestamp":"1694351940.0","upvote_count":"2","comment_id":"1004010","poster":"Jacek_","content":"Twice hunting blade ?"},{"upvote_count":"3","poster":"mali1969","comment_id":"1003615","content":"Correct\nCreating a bookmark by using the = hunting blade\nAssociate a bookmark with incident by using the = hunting blade","timestamp":"1694311920.0"}],"answer_images":["https://img.examtopics.com/sc-200/image200.png"],"isMC":false,"question_text":"DRAG DROP\n-\n\nYou have a Microsoft Sentinel workspace that contains an Azure AD data connector.\n\nYou need to associate a bookmark with an Azure AD-related incident.\n\nWhat should you do? To answer, drag the appropriate blades to the correct tasks. Each blade may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//"}],"exam":{"isMCOnly":false,"provider":"Microsoft","name":"SC-200","numberOfQuestions":371,"isBeta":false,"lastUpdated":"12 Apr 2025","id":122,"isImplemented":true},"currentPage":43},"__N_SSP":true}