{"pageProps":{"questions":[{"id":"5sLxmzctxtUTZRPJhLCm","answer_images":[],"discussion":[{"upvote_count":"10","timestamp":"1730959020.0","poster":"Kristiannn","content":"Selected Answer: D\nYou can investigate by just viewing the Incident. The question does not specify that the user \"manage\" the Incident.","comment_id":"1308252"},{"comment_id":"1387453","upvote_count":"1","timestamp":"1741701360.0","poster":"Onimole","content":"Selected Answer: A\nPrerequisites\nThe Microsoft Sentinel Responder role assignment is required to investigate incidents.\n\nLearn more about roles in Microsoft Sentinel.\n\nIf you have a guest user that needs to assign incidents, the user must be assigned the Directory Reader role in your Microsoft Entra tenant. Regular (nonguest) users have this role assigned by default.\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents"},{"poster":"limpan","content":"Selected Answer: A\nA. Microsoft Sentinel Responder\nExplanation:\n\n Microsoft Sentinel Responder: This role allows User1 to investigate incidents, including viewing incidents, updating their status, and adding comments. It does not grant permissions to create or modify analytics rules, playbooks, or other configurations, which aligns with the principle of least privilege.\n\nWhy not the other options?\n\n B. Microsoft Sentinel Contributor: This role grants full access to manage Microsoft Sentinel, including creating and modifying analytics rules, playbooks, and other configurations, which exceeds the required permissions.\n\n C. Microsoft Sentinel Automation Contributor: This role is used to manage automation rules and playbooks, not for investigating incidents.\n\n D. Microsoft Sentinel Reader: This role only allows viewing incidents and data but does not permit User1 to investigate or update incidents.\n\nThus, the correct answer is A.","upvote_count":"1","timestamp":"1740397080.0","comment_id":"1360992"},{"poster":"b174f8f","content":"Selected Answer: A\nIn Topic 4 Question 29 has a similar case, where “investigate” is required only. It is also marked as requiring the “Respond” role.\n\nHere Microsoft specifies that “investigate” requires the role of “respond”:\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents\n\nI think its a bad use of the word, and they shouldn't leave questions open to the imagination, but I'm going to go with A.","timestamp":"1739794020.0","comment_id":"1357789","upvote_count":"1"},{"poster":"xRiot007","content":"Selected Answer: A\nIf you just need to investigate, read rights are enough. \nIf you need to actually investigate and respond/solve the incident, you need to be a Responder.","upvote_count":"1","comment_id":"1338365","timestamp":"1736431860.0"},{"content":"Selected Answer: A\nThe problem statement mentions that \"User1 can investigate incidents using Workspace1.\" If it is just \"investigation,\" it is possible with the Microsoft Sentinel Reader role. However, investigating incidents typically involves checking the details of the incident and, if necessary, changing the status of the incident or adding comments. These actions require the Microsoft Sentinel Responder role.","poster":"Takakage","timestamp":"1732708380.0","upvote_count":"4","comment_id":"1318613"},{"upvote_count":"3","poster":"chirva","content":"Selected Answer: A\nGPT4:\nThe \"Microsoft Sentinel Reader\" role provides read-only access to Microsoft Sentinel resources, which includes viewing incidents, workbooks, and other data. However, it does not provide the necessary permissions to actively investigate or respond to incidents.\n\nFor User1 to be able to investigate incidents, they need more than just read access; they need the ability to interact with and manage incidents. Therefore, the \"Microsoft Sentinel Reader\" role would not be sufficient for this purpose.\n\nThe correct role to assign to User1 to ensure they can investigate incidents while adhering to the principle of least privilege is:\n\nA. Microsoft Sentinel Responder","timestamp":"1731487560.0","comment_id":"1311176"},{"poster":"sapphire","upvote_count":"1","timestamp":"1731272520.0","content":"Selected Answer: A\nTo investigate the incident, read privileges are sufficient. Microsoft Sentinel Reader","comment_id":"1309637"}],"question_text":"You have an Azure subscription that contains a Microsoft Sentinel workspace named Workspace1 and a user named User1.\n\nYou need to ensure that User1 can investigate incidents by using Workspace1. The solution must follow the principle of least privilege.\n\nWhich role should you assign to User1?","question_images":[],"answers_community":["A (55%)","D (45%)"],"isMC":true,"answer_description":"","exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/150927-exam-sc-200-topic-3-question-106-discussion/","timestamp":"2024-11-07 06:57:00","choices":{"D":"Microsoft Sentinel Reader","C":"Microsoft Sentinel Automation Contributor","A":"Microsoft Sentinel Responder","B":"Microsoft Sentinel Contributor"},"answer_ET":"A","unix_timestamp":1730959020,"topic":"3","question_id":136,"answer":"A"},{"id":"vgBltReP2XkUJLPGIUTn","isMC":false,"answer_ET":"","answer_images":["https://img.examtopics.com/sc-200/image314.png"],"question_images":["https://img.examtopics.com/sc-200/image313.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/150999-exam-sc-200-topic-3-question-107-discussion/","discussion":[{"upvote_count":"7","content":"AzureActivity and 401\nhttps://learn.microsoft.com/en-us/troubleshoot/developer/webapps/iis/www-administration-management/http-status-code","poster":"Mobollz","timestamp":"1731192480.0","comment_id":"1309223"},{"comment_id":"1421341","upvote_count":"1","timestamp":"1743577920.0","content":"Both of the answers are wrong:\n403 OR 403 makes no sense. It should be 401 - Unauthorized.\nThe first field is AzureActivity.","poster":"Optimizor_IT"},{"content":"MicrosoftGraphActivityLogs\n401\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/microsoftgraphactivitylogs - microsoftgraphactivitylogs has the field \"ResponseStatusCode\"\n401- unauthorized","poster":"BtwIdonno","upvote_count":"1","comment_id":"1357759","timestamp":"1739789160.0"},{"timestamp":"1737386580.0","upvote_count":"2","poster":"LinearB","content":"401...\nWhat is the difference between ResponseStatusCodes 401, 402, and 403?\nHere's a brief overview of the differences between HTTP status codes 401, 402, and 403:\n\n401 Unauthorized: This status code indicates that the request has not been applied because it lacks valid authentication credentials for the target resource. It means the client needs to authenticate itself to get the requested response.\n\n402 Payment Required: This status code is reserved for future use and is not currently used in practice. It was intended to indicate that the requested resource is only available for a fee.\n\n403 Forbidden: This status code indicates that the server understood the client's request, but is refusing to fulfill it. Unlike 401, this status code does not imply that the client can make the request again with proper authentication; it means access is forbidden for the client.","comment_id":"1343688"},{"poster":"sapphire","comments":[{"content":"sorry Microsoft Graph activity logs and 401 are correct answers","timestamp":"1731273480.0","comments":[{"comments":[{"content":"403 does make sense - https://developer.mozilla.org/en-US/docs/Web/HTTP/Status#client_error_responses (401 actually means not authenticated and thus restricted by default)","upvote_count":"1","timestamp":"1736432040.0","comment_id":"1338368","poster":"xRiot007"}],"comment_id":"1315930","poster":"Tuitor01","upvote_count":"3","timestamp":"1732209780.0","content":"403 makes absolutely no sense here, 401 must be the correct choice sine http respond code 401 means basically wrong password and 403 means forbidden. 402 is not even used (reserved ) example query =\n MicrosoftGraphActivityLogs\n| where TimeGenerated >= ago(3d)\n| where ResponseStatusCode == 401 or ResponseStatusCode == 403 \n| where RequestUri contains \"/groups\"\n| summarize UniqueRequests=count_distinct(RequestId) by AppId, ServicePrincipalId, UserId\n| sort by UniqueRequests desc\n| limit 20\nFrom https://learn.microsoft.com/en-us/graph/microsoft-graph-activity-logs-overview"}],"upvote_count":"6","poster":"sapphire","comment_id":"1309654"}],"content":"explain in - https://learn.microsoft.com/en-us/graph/microsoft-graph-activity-logs-overview\nMicrosoft Graph activity logs and 403","timestamp":"1731273480.0","comment_id":"1309652","upvote_count":"4"},{"content":"I wonder what is the logic of this query answer: Why would one use a redundant condition of where xxx = 403 OR xxx = 403 ? This comment is posted on 10/11/2024 when the shown greenbox for answer 1 is AuditLogs and answer 2 is 403.","upvote_count":"3","timestamp":"1731200880.0","comment_id":"1309249","poster":"0854338"},{"upvote_count":"1","content":"I will take activity log and 403 due to insufficient permission. I may be wrong though\nwill be glad if this question can get more discussions on time","comment_id":"1308884","poster":"Sparkletoss","comments":[{"upvote_count":"1","comment_id":"1308886","timestamp":"1731091440.0","poster":"Sparkletoss","content":"I will take Azureactivity and 403 due to insufficient permission. I may be wrong though\nwill be glad if this question can get more discussions on time"}],"timestamp":"1731091020.0"},{"poster":"chirva","content":"GPT4:\nAzureActivity\n| where ResponseStatusCode == \"401\" or ResponseStatusCode == \"403\"\n\n\n 401 Unauthorized: This status code indicates that the request has not been applied because it lacks valid authentication credentials for the target resource.\n 403 Forbidden: This status code indicates that the server understood the request but refuses to authorize it. This is typically the status code that indicates insufficient permissions.","comment_id":"1308680","timestamp":"1731056340.0","upvote_count":"1"}],"topic":"3","answer":"","question_id":137,"exam_id":122,"answer_description":"","answers_community":[],"unix_timestamp":1731056340,"question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that contains a Log Analytics workspace named Workspace1.\n\nYou configure Azure activity logs and Microsoft Entra ID logs to be forwarded to Workspace1.\n\nYou need to query Workspace1 to identify all the requests that failed due to insufficient authorization.\n\nHow should you complete the KQL query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","timestamp":"2024-11-08 09:59:00"},{"id":"hMb4xCnESWPhjCbVp6rG","discussion":[{"upvote_count":"1","poster":"Blasty","comment_id":"1359206","timestamp":"1740049980.0","content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/securityincident"},{"poster":"jbonsap","upvote_count":"2","comment_id":"1331994","content":"Selected Answer: A\nThe SecurityIncident table in Microsoft Sentinel contains information about incidents, including details such as incident ID, severity, status, and tasks","timestamp":"1735230360.0"}],"answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/153480-exam-sc-200-topic-3-question-108-discussion/","topic":"3","question_id":138,"choices":{"C":"SentinelAudit","B":"SecurityEvent","A":"SecurityIncident","D":"SecurityAlert"},"question_text":"You have a Microsoft 365 subscription that uses Microsoft Defender XDR.\n\nYou are investigating an incident.\n\nYou need to review the incident tasks that were performed. The solution must include a query that will display the incidents in a workbook, and then display the tasks of each incident in another grid.\n\nWhich table should you target in the query?","exam_id":122,"answer":"A","timestamp":"2024-12-26 17:26:00","unix_timestamp":1735230360,"answer_images":[],"isMC":true,"answers_community":["A (100%)"],"answer_ET":"A","question_images":[]},{"id":"kzD6F3BbjsmdDSNFrmdZ","isMC":true,"answers_community":["A (100%)"],"choices":{"B":"Logic App Contributor","D":"Azure Sentinel Reader","A":"Azure Sentinel Responder","C":"Azure Sentinel Contributor"},"answer_ET":"A","answer_description":"","unix_timestamp":1630324920,"question_text":"Your company uses Azure Sentinel.\nA new security analyst reports that she cannot assign and resolve incidents in Azure Sentinel.\nYou need to ensure that the analyst can assign and resolve incidents. The solution must use the principle of least privilege.\nWhich role should you assign to the analyst?","discussion":[{"upvote_count":"23","timestamp":"1649135460.0","content":"Roles for working in Azure Sentinel\nAzure Sentinel-specific roles\n\nAll Azure Sentinel built-in roles grant read access to the data in your Azure Sentinel workspace.\n\nAzure Sentinel Reader can view data, incidents, workbooks, and other Azure Sentinel resources.\n\nAzure Sentinel Responder can, in addition to the above, manage incidents (assign, dismiss, etc.)\n\nAzure Sentinel Contributor can, in addition to the above, create and edit workbooks, analytics rules, and other Azure Sentinel resources.\n\nAzure Sentinel Automation Contributor allows Azure Sentinel to add playbooks to automation rules. It is not meant for user accounts.\n\nCorrect answer is Azure Sentinel Responder.","poster":"Eltooth","comment_id":"457494"},{"comment_id":"566794","content":"Selected Answer: A\nAnswer is correct. \nUsing the least privilege principle Microsoft Sentinel Responder is the best role to assign this user","upvote_count":"5","poster":"subhuman","timestamp":"1663063560.0"},{"upvote_count":"1","timestamp":"1724175840.0","poster":"Ramye","content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/azure/sentinel/roles","comment_id":"1154962"},{"comment_id":"1054824","upvote_count":"1","timestamp":"1714155300.0","poster":"chepeerick","content":"Responder"},{"comment_id":"550902","content":"Selected Answer: A\nIMHO the answer is A.","upvote_count":"1","poster":"stromnessian","timestamp":"1660905360.0"},{"content":"Correct!","upvote_count":"1","poster":"NoNameP","comment_id":"435438","timestamp":"1646056920.0"},{"timestamp":"1646044140.0","content":"correct","poster":"somsom","upvote_count":"1","comment_id":"436155"}],"answer":"A","url":"https://www.examtopics.com/discussions/microsoft/view/61035-exam-sc-200-topic-3-question-11-discussion/","question_id":139,"timestamp":"2021-08-30 14:02:00","topic":"3","exam_id":122,"answer_images":[],"question_images":[]},{"id":"dcGYyqWR3k7yJXd4rAFn","timestamp":"2021-10-02 07:48:00","question_text":"You recently deployed Azure Sentinel.\nYou discover that the default Fusion rule does not generate any alerts. You verify that the rule is enabled.\nYou need to ensure that the Fusion rule can generate alerts.\nWhat should you do?","answers_community":["B (100%)"],"topic":"3","answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/63457-exam-sc-200-topic-3-question-12-discussion/","question_id":140,"discussion":[{"poster":"Eltooth","timestamp":"1649135520.0","comment_id":"457498","upvote_count":"15","content":"Correct - add data connectors to bring in source data for rules, notebooks, playbooks to query/take action against."},{"poster":"karlEzio","comment_id":"455878","content":"The answer is Correct. By default, fusion is enabled. But to generate the alert, the data connectors must be configured.","upvote_count":"9","timestamp":"1648878480.0"},{"poster":"luisM14","content":"Selected Answer: B\ncorrect","comment_id":"1130858","timestamp":"1721831100.0","upvote_count":"1"},{"upvote_count":"1","content":"Correct","poster":"chepeerick","timestamp":"1714155300.0","comment_id":"1054825"},{"upvote_count":"2","comment_id":"667112","content":"https://docs.microsoft.com/en-us/azure/sentinel/configure-fusion-rules","timestamp":"1678639500.0","poster":"amsioso"},{"comment_id":"648680","content":"Selected Answer: B\nBest Option","poster":"Mockento","timestamp":"1676777400.0","upvote_count":"4"}],"exam_id":122,"unix_timestamp":1633153680,"answer_images":[],"question_images":[],"choices":{"D":"Add a hunting bookmark.","A":"Disable, and then enable the rule.","B":"Add data connectors","C":"Create a new machine learning analytics rule."},"isMC":true,"answer_ET":"B","answer":"B"}],"exam":{"isImplemented":true,"isBeta":false,"numberOfQuestions":371,"isMCOnly":false,"lastUpdated":"12 Apr 2025","id":122,"provider":"Microsoft","name":"SC-200"},"currentPage":28},"__N_SSP":true}