{"pageProps":{"questions":[{"id":"5Xwk9td70xBKTNrf9wcX","question_images":["https://img.examtopics.com/sc-200/image201.png"],"answers_community":[],"unix_timestamp":1694235720,"exam_id":122,"answer_images":["https://img.examtopics.com/sc-200/image202.png"],"topic":"3","question_id":216,"discussion":[{"upvote_count":"8","timestamp":"1710044220.0","comments":[{"comment_id":"1152782","content":"indeed. \nresponder because it is the least privileged role that can execute these tasks.\ndirectory reader because user1 is a guest user so requires this role.\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents","timestamp":"1723915380.0","poster":"Discuss4certi","upvote_count":"1"}],"poster":"mali1969","content":"Correct Answer:\n1. Microsoft Sentinel Responder \n2. Directory readers","comment_id":"1003620"},{"content":"Microsoft sentinel responder\nDirectory readers\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-incidents","upvote_count":"5","timestamp":"1711111200.0","comment_id":"1013978","poster":"SJHCI"},{"poster":"chepeerick","timestamp":"1714336680.0","content":"Correct option","comment_id":"1056437","upvote_count":"1"},{"timestamp":"1713398640.0","upvote_count":"1","poster":"chepeerick","comment_id":"1046437","content":"correct"}],"url":"https://www.examtopics.com/discussions/microsoft/view/120328-exam-sc-200-topic-3-question-81-discussion/","answer_ET":"","answer_description":"","timestamp":"2023-09-09 07:02:00","answer":"","question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that contains a guest user named User1 and a Microsoft Sentinel workspace named workspace1.\n\nYou need to ensure that User1 can triage Microsoft Sentinel incidents in workspace1. The solution must use the principle of least privilege.\n\nWhich roles should you assign to User1? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","isMC":false},{"id":"ozkei9JeYxTXNZei8szx","topic":"3","exam_id":122,"timestamp":"2023-09-09 07:03:00","question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that uses Microsoft Sentinel and contains a user named User1.\n\nYou need to ensure that User1 can enable User and Entity Behavior Analytics (UEBA) for entity behavior in Azure AD. The solution must use the principle of least privilege.\n\nWhich roles should you assign to User1? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_id":217,"unix_timestamp":1694235780,"answer_ET":"","discussion":[{"upvote_count":"2","timestamp":"1722123420.0","comment_id":"1256511","content":"1. Security Administrator \n2. Microsoft Sentinel Contributor","poster":"smanzana"},{"poster":"uday1985","comment_id":"1204736","upvote_count":"2","content":"Microsoft Sentinel: https://learn.microsoft.com/en-gb/azure/sentinel/enable-entity-behavior-analytics.\n\nAs per the prerequisites, I have both:\n\nthe Security Administrator admin role in Entra Id\nthe Microsoft Sentinel Contributor RBAC role on the entire subscription","timestamp":"1714515900.0"},{"poster":"chepeerick","content":"correct","comment_id":"1046438","timestamp":"1697587440.0","upvote_count":"3"},{"comment_id":"1013979","content":"Correct Answer\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/enable-entity-behavior-analytics","poster":"SJHCI","timestamp":"1695379260.0","upvote_count":"4"},{"timestamp":"1694312520.0","upvote_count":"4","comment_id":"1003625","poster":"mali1969","content":"Correct Answer\n1. Security Administrator\n2. Microsoft Sentinel Contributor"}],"question_images":["https://img.examtopics.com/sc-200/image203.png"],"answer_description":"","url":"https://www.examtopics.com/discussions/microsoft/view/120329-exam-sc-200-topic-3-question-82-discussion/","answer_images":["https://img.examtopics.com/sc-200/image204.png"],"isMC":false,"answer":"","answers_community":[]},{"id":"PfxRHK3IBC5aMCNhU8KV","answer_images":["https://img.examtopics.com/sc-200/image206.png"],"isMC":false,"question_text":"HOTSPOT\n-\n\nYou have an Azure subscription that contains the following resources:\n\n• A virtual machine named VM1 that runs Windows Server\n• A Microsoft Sentinel workspace named Sentinel1 that has User and Entity Behavior Analytics (UEBA) enabled\n\nYou have a scheduled query rule named Rule1 that tracks sign-in attempts to VM1.\n\nYou need to update Rule1 to detect when a user from outside the IT department of your company signs in to VM1. The solution must meet the following requirements:\n\n• Utilize UEBA results.\n• Maximize query performance.\n• Minimize the number of false positives.\n\nHow should you complete the rule definition? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer":"","question_images":["https://img.examtopics.com/sc-200/image205.png"],"exam_id":122,"answers_community":[],"discussion":[{"timestamp":"1694661000.0","upvote_count":"9","comment_id":"1007135","content":"Correct answer\nhttps://learn.microsoft.com/en-us/azure/sentinel/ueba-reference#ueba-enrichments\nThe IdentityInfo table is where identity information synchronized to UEBA from Azure Active Directory (and from on-premises Active Directory via Microsoft Defender for Identity) is stored.\nIn the question it's trying to join 2 tables using AccountSID with the $left and $right corresponding to respective tables\nSecurityEvent\n| where EventID in (\"4624\",\"4672\")\n| where Computer == \"My.High.Value.Asset\"\n| join kind=inner (\n IdentityInfo\n | summarize arg_max(TimeGenerated, *) by AccountObjectId) on $left.SubjectUserSid == $right.AccountSID\n| where Department != \"IT\"\nhttps://learn.microsoft.com/en-us/azure/sentinel/investigate-with-ueba#embed-identityinfo-data-in-your-analytics-rules-public-preview","poster":"donathon"},{"comment_id":"1256512","upvote_count":"1","poster":"smanzana","timestamp":"1722123540.0","content":"Inner\nIdentityinfo"},{"timestamp":"1711883220.0","comment_id":"1186729","poster":"ostralo","content":"IdentityInfo table has Department info.\n\nAfter you enable UEBA for your Microsoft Sentinel workspace, data from your Microsoft Entra ID is synchronized to the IdentityInfo table in Log Analytics for use in Microsoft Sentinel.","upvote_count":"2"},{"poster":"chepeerick","upvote_count":"2","comment_id":"1056441","content":"Correct option","timestamp":"1698525720.0"},{"comment_id":"1055204","content":"Tested. \n\nInner\nIdentityinfo","upvote_count":"2","timestamp":"1698393300.0","poster":"Anil0512"},{"upvote_count":"3","timestamp":"1694421720.0","comments":[{"comment_id":"1256556","upvote_count":"2","timestamp":"1722133020.0","poster":"Studytime2023","content":"If you use this link: https://learn.microsoft.com/en-us/azure/sentinel/ueba-reference#identityinfo-table\nYou will see the table columns match: \n| summarize arg_max(TimeGenerated, *) by AccountObjectId) on $left.SubjectUserSid == $right.AccountSID\n| where Department != \"IT\"\n\nIf you use this link: https://learn.microsoft.com/en-us/azure/sentinel/ueba-reference#behavioranalytics-table\nyou will see those columns don't match."},{"upvote_count":"2","poster":"danb67","timestamp":"1697281500.0","content":"Nope there is no Department column in the BehaviorAnalytics table","comment_id":"1043354"}],"comment_id":"1004566","content":"Inner and BehaviorAnalytics.\n\"The BehaviorAnalytics table is where UEBA's output information is stored.\"\nhttps://learn.microsoft.com/en-us/azure/sentinel/ueba-reference.","poster":"Nabbo92"}],"url":"https://www.examtopics.com/discussions/microsoft/view/120330-exam-sc-200-topic-3-question-83-discussion/","topic":"3","timestamp":"2023-09-09 07:03:00","question_id":218,"answer_ET":"","unix_timestamp":1694235780,"answer_description":""},{"id":"PSZcswjHXtWREYP2skl4","answers_community":[],"isMC":false,"question_text":"DRAG DROP\n-\n\nYour network contains an on-premises Active Directory Domain Services (AD DS) domain that syncs with an Azure AD tenant.\n\nYou have a Microsoft Sentinel workspace named Sentinel1.\n\nYou need to enable User and Entity Behavior Analytics (UEBA) for Sentinel1 and collect security events from the AD DS domain.\n\nWhich three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.\n\n//IMG//","question_images":["https://img.examtopics.com/sc-200/image207.png"],"unix_timestamp":1694235840,"exam_id":122,"answer":"","answer_description":"","answer_images":["https://img.examtopics.com/sc-200/image208.png"],"timestamp":"2023-09-09 07:04:00","answer_ET":"","question_id":219,"topic":"3","url":"https://www.examtopics.com/discussions/microsoft/view/120331-exam-sc-200-topic-3-question-84-discussion/","discussion":[{"content":"For Sentinel1, configure the Microsoft defender for identity connector. \nThis will allow you to sync user entities from on-premises Active Directory, using Microsoft Defender for Identity.\n\nTo the AD DS Domain, deploy Microsoft Defender for Identity. \nYou need to install the MDI sensor on your Active Directory domain controller to enable UEBA to collect security events from your on-premises AD DS domain.\n\nFor Sentinel1, enable UEBA. \nYou need to switch the toggle to On and select the data sources on which you want to enable UEBA.","upvote_count":"9","poster":"mali1969","comments":[{"comments":[{"timestamp":"1697281620.0","poster":"danb67","upvote_count":"5","comment_id":"1043356","content":"Yes I have deployed this many times. No point doing the connector before the sensor. Answer is correct."}],"comment_id":"1013043","timestamp":"1695297060.0","poster":"Phil_79","content":"Shouldn't you deploy MDI before connecting it to Sentinel?","upvote_count":"3"}],"timestamp":"1694313180.0","comment_id":"1003629"},{"timestamp":"1703157720.0","poster":"ApexPredator84","upvote_count":"6","content":"In the exam on 21/12/2023","comment_id":"1102396"},{"comment_id":"1307129","upvote_count":"1","content":"To enable User and Entity Behavior Analytics (UEBA) in Microsoft Sentinel and collect security events from the on-premises AD DS domain, the following steps should be performed in sequence:\n\n1. To the AD DS domain, deploy Microsoft Defender for Identity \n This step is necessary to monitor and collect security events from the on-premises AD DS domain.\n\n2. For Sentinel1, configure the Microsoft Defender for Identity connector \n Once Microsoft Defender for Identity is deployed, you need to connect it to Sentinel1 to start collecting data.\n\n3. For Sentinel1, enable UEBA\n After setting up the data collection, you can enable UEBA in Sentinel1 to analyze user and entity behavior.","timestamp":"1730760840.0","poster":"12369b6"},{"comment_id":"1272637","poster":"user636","timestamp":"1724669820.0","content":"The answer is correct:\nDeploy MDI to the on-premises Active Directory Domain Services (AD DS) domain, then configure the Sentinal for UEBA. \nRef: https://learn.microsoft.com/en-us/azure/sentinel/enable-entity-behavior-analytics?tabs=defender#how-to-enable-user-and-entity-behavior-analytics\n\nIn the article above, check the step 3. it states:\n\"To sync user entities from on-premises Active Directory, your Azure tenant must be onboarded to Microsoft Defender for Identity (either standalone or as part of Microsoft Defender XDR) and you must have the MDI sensor installed on your Active Directory domain controller.\"\n\nIt seems the answer provided is correct.","upvote_count":"1"},{"comment_id":"1056443","content":"Correct option","timestamp":"1698525840.0","poster":"chepeerick","upvote_count":"4"}]},{"id":"JNoO2DusfyS111Aqmwag","topic":"3","question_images":[],"answer_description":"","answer":"B","question_id":220,"choices":{"C":"IP address only","D":"used client app and app name only","B":"app name, computer name, IP address, email address, and used client app only","A":"IP address and email address only"},"timestamp":"2023-09-09 07:04:00","answer_images":[],"answers_community":["B (90%)","10%"],"isMC":true,"answer_ET":"B","url":"https://www.examtopics.com/discussions/microsoft/view/120332-exam-sc-200-topic-3-question-85-discussion/","discussion":[{"upvote_count":"5","comments":[{"upvote_count":"1","comment_id":"1325812","timestamp":"1734029400.0","content":"The other entities (app name, computer name, used client app) are more likely to be found in other log sources, such as Azure Activity logs or Microsoft Defender for Endpoint data. Since we're explicitly told that UEBA is using only Audit Logs and Sign-in Logs, those entities wouldn't be included in the UEBA analysis.","poster":"HAjouz"}],"content":"Selected Answer: B\nhttps://learn.microsoft.com/en-us/azure/sentinel/ueba-reference","poster":"donathon","timestamp":"1695768360.0","comment_id":"1018231"},{"poster":"user636","upvote_count":"1","comment_id":"1272647","content":"Not sure if UEBA also investigates client app. It does investigates \"Cloud apps\". \n\nRef: https://learn.microsoft.com/en-us/training/modules/use-entity-behavior-analytics-azure-sentinel/3-explore-entities\n\nBut B seems the best answer.","timestamp":"1724671080.0"},{"comment_id":"1046444","upvote_count":"1","poster":"chepeerick","content":"correcto","timestamp":"1697588460.0"},{"upvote_count":"4","poster":"mali1969","comment_id":"1003630","comments":[{"comment_id":"1012775","poster":"Anil0512","upvote_count":"1","content":"I go with you","timestamp":"1695270540.0"}],"content":"Selected Answer: B\nB. app name, computer name, IP address, email address, and used client app only. These are all entities that can be investigated by using UEBA in Microsoft Sentinel.","timestamp":"1694313300.0"}],"unix_timestamp":1694235840,"exam_id":122,"question_text":"You have a Microsoft Sentinel workspace.\n\nYou enable User and Entity Behavior Analytics (UEBA) by using Audit Logs and Signin Logs.\n\nThe following entities are detected in the Azure AD tenant:\n\n• App name: App1\n• IP address: 192.168.1.2\n• Computer name: Device1\n• Used client app: Microsoft Edge\n• Email address: user1@company.com\n• Sign-in URL: https://www.company.com\n\nWhich entities can be investigated by using UEBA?"}],"exam":{"isMCOnly":false,"provider":"Microsoft","id":122,"name":"SC-200","isBeta":false,"numberOfQuestions":371,"isImplemented":true,"lastUpdated":"12 Apr 2025"},"currentPage":44},"__N_SSP":true}