{"pageProps":{"questions":[{"id":"lOhgZkj7V8zKWgzBaTab","question_images":[],"topic":"7","answers_community":["D (100%)"],"exam_id":122,"unix_timestamp":1714060320,"answer_description":"","choices":{"B":"AADDomainServicesAccountLogon","D":"IdentityLogonEvents","C":"SigninLogs","A":"AADServicePrincipalRiskEvents"},"discussion":[{"comment_id":"1202123","upvote_count":"11","poster":"DChilds","comments":[{"timestamp":"1717070520.0","poster":"rsanx42","upvote_count":"1","comment_id":"1221562","content":"Agreed."}],"timestamp":"1714060320.0","content":"Selected Answer: D\nHere is a sample query from Microsoft Learn documentation:\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/queries/identitylogonevents"},{"upvote_count":"1","poster":"talosDevbot","comment_id":"1293027","content":"Selected Answer: D\nIdentityLogonEvents table\n- Table that holds info about authentication activities made through your on-premises Active Directory\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/identitylogonevents","timestamp":"1728017520.0"},{"comment_id":"1229174","upvote_count":"1","content":"Selected Answer: D\nhttps://techcommunity.microsoft.com/t5/security-compliance-and-identity/enhancing-microsoft-defender-for-identity-data-using-microsoft/ba-p/2178286","timestamp":"1718198400.0","poster":"e072f83"},{"comment_id":"1218861","upvote_count":"2","timestamp":"1716714360.0","content":", the correct table to query for identifying LDAP simple binds to the AD DS domain controllers is AADDomainServicesAccountLogon.\\","comments":[{"content":"No, this is for Entra ID Domain Services","comment_id":"1246553","timestamp":"1720767420.0","poster":"Hawklx","upvote_count":"1"}],"poster":"laddu001"},{"comment_id":"1202129","content":"Selected Answer: D\nIdentityLogonEvents","upvote_count":"3","poster":"pk69","timestamp":"1714060740.0"}],"answer_ET":"D","url":"https://www.examtopics.com/discussions/microsoft/view/139587-exam-sc-200-topic-7-question-4-discussion/","question_id":356,"question_text":"Your on-premises network contains an Active Directory Domain Services (AD DS) forest.\n\nYou have a Microsoft Entra tenant that uses Microsoft Defender for Identity. The AD DS forest syncs with the tenant.\n\nYou need to create a hunting query that will identify LDAP simple binds to the AD DS domain controllers.\n\nWhich table should you query?","isMC":true,"answer":"D","answer_images":[],"timestamp":"2024-04-25 17:52:00"},{"id":"pec8IoJbLAHnT6F7kGuk","answer_ET":"","answer_images":["https://img.examtopics.com/sc-200/image287.png"],"topic":"7","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 subscription.\n\nYou need to identify all the security principals that submitted requests to change or delete groups.\n\nHow should you complete the KQL query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_images":["https://img.examtopics.com/sc-200/image286.png"],"answer_description":"","discussion":[{"comment_id":"1354140","upvote_count":"4","timestamp":"1739137260.0","poster":"Edindude","content":"MicrosoftGraphActivities\n| where RequestUri contains '/group'\n| where RequestMethod != \"GET\"\n| project AppId, UserId, ServicePrincipalId"},{"content":"Correct","timestamp":"1722202140.0","comment_id":"1257095","upvote_count":"2","poster":"smanzana"},{"upvote_count":"4","content":"First I think it's POST req, but then i see \"identify submitted requests\" and now I know answer is GET.","comments":[{"poster":"kukuliquid","timestamp":"1715628480.0","upvote_count":"7","comment_id":"1211046","content":"The original answer is correct but this explanation is false\nRequestMethod DIFFERS FROM \"GET\" meaning it will return requests that are not simple get, but can be POST, PUT, UPDATE, DELETE..."}],"timestamp":"1714416780.0","comment_id":"1204173","poster":"teho99"}],"url":"https://www.examtopics.com/discussions/microsoft/view/139747-exam-sc-200-topic-7-question-5-discussion/","answers_community":[],"unix_timestamp":1714416780,"question_id":357,"answer":"","isMC":false,"exam_id":122,"timestamp":"2024-04-29 20:53:00"},{"id":"DQAnZxhUaCisRvebpEzm","answers_community":["A (69%)","C (31%)"],"answer":"A","question_text":"You have a Microsoft 365 subscription that uses Microsoft Defender for Endpoint Plan 2 and contains a macOS device named Device1.\n\nYou need to investigate a Defender for Endpoint agent alert on Device1. The solution must meet the following requirements:\n\n• Identify all the active network connections on Device1.\n• Identify all the running processes on Device1.\n• Retrieve the login history of Device1.\n• Minimize administrative effort.\n\nWhat should you do first from the Microsoft Defender portal?","unix_timestamp":1714061220,"timestamp":"2024-04-25 18:07:00","question_id":358,"answer_ET":"A","exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/139590-exam-sc-200-topic-7-question-6-discussion/","choices":{"B":"From Advanced features in Endpoints, enable Live Response unsigned script execution.","A":"From Devices, click Collect investigation package for Device1.","C":"From Devices, initiate a live response session on Device1.","D":"From Advanced features in Endpoints, disable Authenticated telemetry."},"isMC":true,"answer_description":"","question_images":[],"answer_images":[],"topic":"7","discussion":[{"comment_id":"1204388","upvote_count":"11","timestamp":"1714461660.0","poster":"wheeldj","content":"Selected Answer: A\nAnswer A: The investigation package collected by defender includes all the required information and is considerable less admin effort than running a live response session and collecting this information interactively.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"},{"timestamp":"1714066860.0","poster":"DChilds","comment_id":"1202189","upvote_count":"5","content":"Selected Answer: A\nA is correct.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"},{"content":"Selected Answer: C\nThe correct answer is C. From Devices, initiate a live response session on Devic","timestamp":"1734137700.0","upvote_count":"2","poster":"CDR","comment_id":"1326290"},{"comment_id":"1310237","poster":"sapphire","upvote_count":"2","timestamp":"1731348360.0","content":"Selected Answer: A\n• Minimize administrative effort.\nA is Correct."},{"comment_id":"1305414","poster":"rebecchu0731","content":"Asked copilot and answer is live session. While collecting an investigation package can provide a snapshot of the device’s current state, it may not offer the same level of detailed, real-time information and control as a live response session.","timestamp":"1730378100.0","upvote_count":"1"},{"upvote_count":"2","comment_id":"1255262","timestamp":"1721944020.0","poster":"smanzana","content":"A\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"},{"content":"Selected Answer: C\nchecked chat-gpt and the answer is C Here's why:\n\nInitiating a live response session allows you to interact with Device1 in real-time. You can run commands to check active network connections, running processes, and retrieve the login history.\nMinimize administrative effort: Live response sessions provide direct access and control, which minimizes the need for additional configurations or complex procedures.\nThe other options either involve additional steps that are not immediately necessary (like collecting an investigation package, which can be more comprehensive but less direct for immediate queries) or configurations that don't directly address the investigative tasks at hand.\nBy starting a live response session, you can quickly gather the necessary information directly from Device1, fulfilling the investigation requirements effectively.","upvote_count":"2","timestamp":"1718531760.0","poster":"Avaris","comment_id":"1231290"},{"comment_id":"1212259","comments":[{"comment_id":"1295839","timestamp":"1728621960.0","content":"I would argue that collecting the Investigation package requires less effort because all you have to do is download the package, and look for the info you need in the Network Connections folder, Processes folder, and Users and groups folder.\nWhereas for a live session, you will have to establish a session and execute several commands to retrieve the information you need","upvote_count":"2","poster":"talosDevbot"}],"poster":"laddu001","content":"Minimize Administrative Effort:\nLive response sessions allow you to interact directly with the device, minimizing administrative overhead.","upvote_count":"2","timestamp":"1716043620.0"},{"upvote_count":"2","content":"Selected Answer: C\nBy initiating a live response session, you can achieve your investigation goals while minimizing administrative effort. Remember that live response provides real-time access to the device, allowing you to perform tasks directly on Device","poster":"ServerBrain","timestamp":"1714153680.0","comment_id":"1202735"},{"content":"Selected Answer: C\nlive response session","comment_id":"1202134","timestamp":"1714061220.0","upvote_count":"2","poster":"pk69"}]},{"id":"2P9BabzRVnjJ7yLznCFo","timestamp":"2024-04-26 11:06:00","discussion":[{"upvote_count":"18","content":"Second option should be where SiteUrl !=\"","poster":"DChilds","comment_id":"1202500","timestamp":"1714122360.0"},{"poster":"g_man_rap","upvote_count":"6","timestamp":"1724222820.0","comment_id":"1269906","content":"OfficeActivity\n| where Operation in ((Operations))\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where SiteUrl != \" \"\n| summarize Number = count() by Site_Url, UserId, Operation, TimeGenerated\n\nFirst Dropdown: where Operation in ((Operations))\nSecond Dropdown: where SiteUrl != \" \""},{"poster":"VeiN","timestamp":"1730033700.0","content":"There is a similar case under. I think this is badly copied, and \"AH\" is \"All\"\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where '{Operations:lable}'=='All' or Operation in ({Operations})\n\nusing {} will enable to select/write entries in workbook that will be used in the query \n\n| where SiteUrl != \" \" => OK","comment_id":"1303586","upvote_count":"1"},{"content":"The project statement gums up the sumarize","upvote_count":"2","timestamp":"1714975860.0","poster":"MqQuintana","comment_id":"1207209"}],"isMC":false,"topic":"7","exam_id":122,"url":"https://www.examtopics.com/discussions/microsoft/view/139645-exam-sc-200-topic-7-question-7-discussion/","unix_timestamp":1714122360,"answers_community":[],"question_images":["https://img.examtopics.com/sc-200/image288.png"],"answer_description":"","answer_ET":"","answer_images":["https://img.examtopics.com/sc-200/image289.png"],"question_id":359,"answer":"","question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace.\n\nYou plan to visualize data from Microsoft SharePoint Online and OneDrive sites.\n\nYou need to create a KQL query for the visual. The solution must meet the following requirements:\n\n• Select all workloads as a single operation.\n• Include two parameters named Operations and Users.\n• In the results, exclude empty values for the site URLs.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//"},{"id":"8hZfIt3omyR1br58LyL0","unix_timestamp":1718582760,"answer_images":["https://img.examtopics.com/sc-200/image306.png"],"timestamp":"2024-06-17 02:06:00","question_id":360,"url":"https://www.examtopics.com/discussions/microsoft/view/142629-exam-sc-200-topic-7-question-8-discussion/","answer":"","discussion":[{"content":"SecurityEvent\n| summarize count() by bin(TimeGenerated, 1d)\n| render timechart","poster":"g_man_rap","upvote_count":"5","comment_id":"1269909","timestamp":"1724223180.0"},{"poster":"smanzana","upvote_count":"2","timestamp":"1722202440.0","comment_id":"1257097","content":"Correct"},{"upvote_count":"2","comment_id":"1231585","timestamp":"1718582760.0","poster":"laddu001","content":"SecurityEvent\n| where TimeGenerated >= ago(7d) // Filter events from the past 7 days\n| summarize EventCount = count() by bin(TimeGenerated, 1d) // Count events per day\n| render timechart"}],"question_text":"HOTSPOT\n-\n\nYou have a Microsoft Sentinel workspace that contains a custom workbook.\n\nYou need to query for a summary of security events. The solution must meet the following requirements:\n\n• Identify the number of security events ingested during the past week.\n• Display the count of events by day in a chart.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_images":["https://img.examtopics.com/sc-200/image305.png"],"answers_community":[],"answer_description":"","answer_ET":"","exam_id":122,"isMC":false,"topic":"7"}],"exam":{"name":"SC-200","lastUpdated":"12 Apr 2025","isBeta":false,"provider":"Microsoft","numberOfQuestions":371,"isImplemented":true,"id":122,"isMCOnly":false},"currentPage":72},"__N_SSP":true}