{"pageProps":{"questions":[{"id":"PNTz2fV6zppmuQzPiZVs","unix_timestamp":1629599640,"isMC":false,"answer_ET":"","answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide","url":"https://www.examtopics.com/discussions/microsoft/view/60197-exam-sc-200-topic-1-question-14-discussion/","question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0002400001.png"],"topic":"1","answer":"","timestamp":"2021-08-22 04:34:00","question_text":"HOTSPOT -\nYou are informed of an increase in malicious email being received by users.\nYou need to create an advanced hunting query in Microsoft 365 Defender to identify whether the accounts of the email recipients were compromised. The query must return the most recent 20 sign-ins performed by the recipients within an hour of receiving the known malicious email.\nHow should you complete the query? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","question_id":6,"answers_community":[],"exam_id":122,"answer_images":["https://www.examtopics.com/assets/media/exam-media/04261/0002500001.png"],"discussion":[{"comment_id":"538154","timestamp":"1726771980.0","comments":[{"content":"it would be top 20 by some table. So answer is de facto take 20 indeed.","comment_id":"1322670","upvote_count":"1","timestamp":"1733474340.0","poster":"Tuitor01"}],"upvote_count":"42","poster":"pedromonteirozikado","content":"The first answer \"EmailEvents\" is right because only EmailEvents table have the Subject column, but both EmailEvents and EmailAttachmentInfo have the ThreatType table (old MalwareFilterVerdict).\nThe second answer: IdentityLogonEvents, is right, because is the only table that have identity objects related.\nThe third answer: take 20, according to MS \"here is no guarantee which records are returned, unless the source data is sorted.\", \"take and limit are synonyms\".\nI tested by myself, and the only query that return the latest results was: top 20 by Timestamp, because only \"top 20\" didn't work."},{"upvote_count":"11","timestamp":"1727066160.0","content":"//Define new table for malicious emails\nlet MaliciousEmails=EmailEvents\n//List emails detected as malware, getting only pertinent columns\n| where ThreatTypes has \"Malware\" \n| project TimeEmail = Timestamp, Subject, SenderFromAddress, AccountName = tostring(split(RecipientEmailAddress, \"@\")[0]);\nMaliciousEmails\n| join (\n//Merge malicious emails with logon events to find logons by recipients\nIdentityLogonEvents\n| project LogonTime = Timestamp, AccountName, DeviceName\n) on AccountName \n//Check only logons within 30 minutes of receipt of an email\n| where (LogonTime - TimeEmail) between (0min.. 30min)\n| take 10","poster":"jasonfmj","comment_id":"429002"},{"upvote_count":"1","content":"Why use take and not top in this scenario?\nThe query in your case doesn't explicitly mention sorting the logon events by a specific column (e.g., timestamp). It simply limits the results to a certain number, so take is appropriate here.\nIf you wanted the 20 most recent logon events, you could use top 20 by LogonTime, which ensures that you are retrieving the most recent events sorted by time.","timestamp":"1728352740.0","comment_id":"1294524","poster":"Thezuland1098"},{"timestamp":"1728119640.0","poster":"talosDevbot","content":"The output of KQL queries are sorted by descending order of the first column.\nSo take 20 works out here","upvote_count":"2","comment_id":"1293410"},{"content":"The answer is correct. Here is an example: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide#review-logon-attempts-after-receipt-of-malicious-emails\n\n//Define new table for malicious emails\nlet MaliciousEmails=EmailEvents\n//List emails detected as malware, getting only pertinent columns\n| where ThreatTypes has \"Malware\" \n| project TimeEmail = Timestamp, Subject, SenderFromAddress, AccountName = tostring(split(RecipientEmailAddress, \"@\")[0]);\nMaliciousEmails\n| join (\n//Merge malicious emails with logon events to find logons by recipients\nIdentityLogonEvents\n| project LogonTime = Timestamp, AccountName, DeviceName\n) on AccountName \n//Check only logons within 30 minutes of receipt of an email\n| where (LogonTime - TimeEmail) between (0min.. 30min)\n| take 10","comment_id":"574729","upvote_count":"4","timestamp":"1727066220.0","poster":"oreoale"},{"poster":"g_man_rap","timestamp":"1724401860.0","upvote_count":"2","comment_id":"1271187","content":"EmailEvents is used to filter out the malicious emails.\nIdentityLogonEvents is used to check for sign-ins by those who received the malicious emails.\ntop 20 ensures that only the most recent 20 sign-in events are returned, which matches the requirement of the task."},{"upvote_count":"2","timestamp":"1717489020.0","poster":"emartiy","content":"EmailEvents, IdentityLogonEvents, take 20 because take operator in kql returns most recents records in event table..","comment_id":"1224007"},{"poster":"chepeerick","comment_id":"1049881","timestamp":"1697924820.0","upvote_count":"1","content":"correct, There is no guarantee which records are returned, unless the source data is sorted. If the data is sorted, then the top values will be returned."},{"content":"EmailEvents, IdentityLogonEvents, take 20","upvote_count":"3","comment_id":"912830","timestamp":"1685710920.0","poster":"tatendazw"},{"content":"Given Answer is correct, check the following page that has this query under the section \"Review logon attempts after receipt of malicious emails\"\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide#review-logon-attempts-after-receipt-of-malicious-emails","upvote_count":"4","timestamp":"1673444340.0","poster":"Ramkid","comments":[{"comments":[{"upvote_count":"1","poster":"danb67","content":"ignore this wrong question","comment_id":"1027372","timestamp":"1696683420.0"}],"poster":"danb67","upvote_count":"1","content":"This query is wrong and Microsoft need to fix this page. Take 10 will never give you the most recent logins. It gives a random 10 results and is different each time you run it.","comment_id":"1027369","timestamp":"1696683360.0"}],"comment_id":"772582"},{"poster":"Fukacz","upvote_count":"4","content":"Correct. Take 20 is equal to top 20 by timestamp here.","timestamp":"1663089180.0","comments":[{"poster":"danb67","content":"why? Would it not need by Timestamp at the end","upvote_count":"1","comment_id":"1043431","timestamp":"1697286900.0"}],"comment_id":"668270"},{"content":"take 20 is correct if you need to select most recent logins.","poster":"its_me_Nat","comment_id":"566427","upvote_count":"1","timestamp":"1647127980.0"},{"poster":"jetodo7615","timestamp":"1641478560.0","comment_id":"518279","upvote_count":"6","content":"Answer is correct, but the solution is incomplete, as the results needs to be sorted before \"take\" command (most recent logons). \"Top\" is not an option here as it needs \"by\" argument to be correct."},{"content":"Believe given answer to be correct","comment_id":"516943","timestamp":"1641324840.0","upvote_count":"4","poster":"RandomNickname"},{"poster":"ReginaldoBarreto","comments":[{"upvote_count":"3","poster":"pedromonteirozikado","comment_id":"538153","timestamp":"1643742060.0","content":"Yes, | top 20 by Timestamp"},{"comment_id":"493142","content":"I guess so top should be used in this case","upvote_count":"2","comments":[{"timestamp":"1650674640.0","content":"As per 'Pedromonteirozikado' it is missing \"by Timestamp\" statement. So the given answer is correct.","comment_id":"590313","upvote_count":"1","poster":"j888"}],"poster":"zedricko","timestamp":"1638535020.0"}],"upvote_count":"3","content":"take operator\nThere is no guarantee which records are returned, unless the source data is sorted.\n------------------------\nfor this query the correct would not use top ? \nSince they ask for recent records","timestamp":"1638318180.0","comment_id":"491083"}]},{"id":"u0SKhCn4gUOqaHQ1U9Gz","exam_id":122,"question_images":[],"answers_community":["C (100%)"],"topic":"1","timestamp":"2021-08-21 06:36:00","isMC":true,"question_text":"You receive a security bulletin about a potential attack that uses an image file.\nYou need to create an indicator of compromise (IoC) in Microsoft Defender for Endpoint to prevent the attack.\nWhich indicator type should you use?","answer":"C","url":"https://www.examtopics.com/discussions/microsoft/view/60113-exam-sc-200-topic-1-question-15-discussion/","answer_description":"","choices":{"B":"a URL/domain indicator that has Action set to Alert and block","A":"a URL/domain indicator that has Action set to Alert only","D":"a certificate indicator that has Action set to Alert and block","C":"a file hash indicator that has Action set to Alert and block"},"question_id":7,"answer_ET":"C","discussion":[{"upvote_count":"25","timestamp":"1727066280.0","comment_id":"428497","poster":"HSBNZ","content":"The correct answer it seems like, as steps for to Create an indicator for files from the settings page\n1. In the navigation pane, select Settings > Endpoints > Indicators (under Rules).\n\n2. Select the File hashes tab.\n\n3. Select Add indicator.\n\n4. Specify the following details:\n\n5. Indicator - Specify the entity details and define the expiration of the indicator.\n* Action - Specify the action to be taken and provide a description.\n* Scope - Define the scope of the device group.\n* Review the details in the Summary tab, then select Save."},{"timestamp":"1646735820.0","content":"Selected Answer: C\nCorrect answer","comment_id":"563164","upvote_count":"7","poster":"Tx4free"},{"comment_id":"1301760","timestamp":"1729644840.0","content":"C correct answer","upvote_count":"1","poster":"Nikki0222"},{"upvote_count":"1","comment_id":"1051374","poster":"Makawai","timestamp":"1698030540.0","content":"C is the right answer"},{"timestamp":"1697925180.0","poster":"chepeerick","comment_id":"1049902","content":"C, correct","upvote_count":"1"},{"comment_id":"753311","content":"Selected Answer: C\ncorrect","timestamp":"1671714360.0","upvote_count":"3","poster":"kamun1st"}],"unix_timestamp":1629520560,"answer_images":[]},{"id":"bolxXpgH29wdWvXMNFYS","answers_community":["BD (81%)","BC (19%)"],"question_id":8,"answer":"BD","answer_description":"","isMC":true,"question_images":[],"topic":"1","unix_timestamp":1629520320,"timestamp":"2021-08-21 06:32:00","answer_images":[],"discussion":[{"comment_id":"431025","content":"Provided answer B and D is correct.\nSecurity Reader - can access M365 Security Center.\nActive Remediation Actions role in Defender for Endpoint meets need to 'approve and reject' pending actions with respect to Defender For Endpoint.\nRequirement does not need more.","timestamp":"1726772040.0","poster":"PhilAus","upvote_count":"27"},{"upvote_count":"9","timestamp":"1727066280.0","comments":[{"timestamp":"1697527500.0","poster":"danb67","comments":[{"timestamp":"1713080340.0","upvote_count":"1","comment_id":"1195364","content":"You are right. But the question states \"The analyst must be able to approve and reject pending actions generated by Microsoft Defender for Endpoint\", so we don't have to take in consideration the other defender components.\nB and D are the correct answers.","poster":"WORKTRAIN"}],"content":"B is not enough to approve/reject email related pending actions though is it? https://learn.microsoft.com/en-us/microsoft-365/security/defender/m365d-action-center?view=o365-worldwide So a user assigned only the active remediation roles will not be able to approve or reject email related pending actions. So answer is BC","comment_id":"1045648","upvote_count":"2"}],"content":"Selected Answer: BD\nThis question is tricky.\n\nIf you follow the question directly, they are not asking either/or. They want you to assign 2 roles to the Analyst each being half of the entire solution. Using least privileges the answer should be BD. \n\nNot A = Too many other permissions not needed.\nB = the Active remediation actions role in Microsoft Defender for Endpoint is enough for the task to be done of approving/rejecting pending actions.\nNot C = Would be able to fulfill both B and D and (more), not least privilege.\nD = Quite redundant, but gives reader roles read access to the portal up until RBAC is turned on the defender permissions. Least Privilege. ¯\\_(ツ)_/¯","comment_id":"697344","poster":"Metasploit"},{"upvote_count":"2","timestamp":"1729644900.0","comment_id":"1301761","content":"BD correct","poster":"Nikki0222"},{"content":"Slight confused by this one, this link suggests the answer is B & C:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/m365d-action-center?view=o365-worldwide\nRemediation action: \nMicrosoft Defender for Endpoint remediation (devices) \n\nRequired roles and permissions:\nSecurity Administrator role assigned in either Azure Active Directory (Azure AD) (https://portal.azure.com) or the Microsoft 365 admin center (https://admin.microsoft.com)\n--- or ---\nActive remediation actions role assigned in Microsoft Defender for Endpoint","upvote_count":"5","poster":"TOMtheBOMB","timestamp":"1727066280.0","comments":[{"upvote_count":"4","poster":"AlaReAla","timestamp":"1632945300.0","comment_id":"454455","content":"Option C will not follow the least prervilige principle. Further, this role is more for administration stuff like editing or deleting roles etc. \n\nCheckout the below URL for more info:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/user-roles?view=o365-worldwide"},{"poster":"Xyz_40","comments":[{"poster":"uday1985","comment_id":"867324","timestamp":"1681217400.0","upvote_count":"3","content":"does PoLP mean anything to you?"}],"comment_id":"657677","timestamp":"1662140940.0","content":"BC is the correct answer. in D, he would not be able to perform anything but just to view","upvote_count":"1"},{"timestamp":"1681227600.0","content":"The link says it right there:\n--- or ---\nActive remediation actions role assigned in Microsoft Defender for Endpoint\n\nSecurity Administrator has too many additional roles outside of simply approving/rejecting pending actions. This would breach Least Privilege.\n\nRead-only permissions don't have access to the MDE portal once RBAC is enabled in MDE. So you have to enable this role for Security Reader to access.\nSecurity Reader will provide a read-only view into the policies.","comment_id":"867457","poster":"Holii","upvote_count":"1"}],"comment_id":"453664"},{"timestamp":"1727066280.0","poster":"1a144a0","comment_id":"1271772","upvote_count":"1","content":"Selected Answer: BD\nB. the Active remediation actions role in Microsoft Defender for Endpoint:\nThis role specifically allows the analyst to approve or reject pending remediation actions in Microsoft Defender for Endpoint, which is the primary requirement.\n\nD. the Security Reader role in Azure Active Directory (Azure AD):\nThis role provides the analyst with read-only access to security-related information in the Microsoft 365 security center without granting unnecessary administrative privileges. It supports the principle of least privilege by restricting the analyst's permissions to what is necessary for their role."},{"comment_id":"1232323","timestamp":"1718699220.0","content":"Selected Answer: BC\nthe security admin should be able to do more while sec reader can't do these action","upvote_count":"1","poster":"Avaris"},{"poster":"chepeerick","timestamp":"1697925180.0","content":"Selected Answer: BD\nOptions B and D","comment_id":"1049904","upvote_count":"1"},{"comments":[{"poster":"paraze","upvote_count":"1","timestamp":"1703099400.0","content":"Security Reader is enough, Security Administrator not needed. Least Priviledge.\nBD","comment_id":"1101874"}],"timestamp":"1692452280.0","comment_id":"985240","content":"Selected Answer: BC\nReason being that you do not need a Reader Role. \nThe Active remediation actions role in Microsoft Defender for Endpoint: This role grants the analyst the ability to take active remediation actions, which includes approving and rejecting pending actions in Microsoft Defender for Endpoint.\n\nThe Security Administrator role in Azure Active Directory (Azure AD): While not specific to Defender for Endpoint, this role provides broad access to security-related tasks and configuration across Microsoft 365 services, aligning with the analyst's responsibilities.","upvote_count":"3","poster":"Oryx360"},{"upvote_count":"3","content":"The answer should be : B and C\nCheck this article: https://learn.microsoft.com/en-us/microsoft-365/security/defender/m365d-action-center?view=o365-worldwide\n Tip\n\nUsers who have the Global Administrator role assigned in Azure AD can approve or reject any pending action in the Action center. However, as a best practice, your organization should limit the number of people who have the Global Administrator role assigned. We recommend using the Security Administrator, Active remediation actions, and Search and Purge roles listed in the preceding table for Action center permissions.","comment_id":"949154","poster":"TomasValtor","timestamp":"1689093780.0"},{"comment_id":"567204","poster":"TomG","upvote_count":"2","content":"Selected Answer: BD\nGiven answers are correct","timestamp":"1647206820.0"},{"comment_id":"563165","content":"Selected Answer: BD\nCorrect answer","upvote_count":"2","poster":"Tx4free","timestamp":"1646735820.0"},{"poster":"liberty123","upvote_count":"2","content":"Selected Answer: BD\nB and D is correct","timestamp":"1644037380.0","comment_id":"540787"},{"content":"B and D are correct. Minimum privilege is requested. The other two options are for administrators.","poster":"Andreew883","comment_id":"520339","upvote_count":"3","timestamp":"1641746580.0"},{"timestamp":"1639037220.0","upvote_count":"3","content":"Active remediation actions role in MDE portal is enough for approve and reject pending actions generated by Microsoft Defender for Endpoint.\nAs soon as you enable Active remediation actions role, Security Reader role is not work in MDE portal. If you don't enable RBAC in MDE portal you can use Security Reader to access.","poster":"kakakayayaya","comment_id":"497428"},{"upvote_count":"4","timestamp":"1629603360.0","content":"Answer is B and C\nSecurity Reader: A user that belongs to this role has viewing rights to Security Center. The user can view recommendations, alerts, a security policy, and security states, but cannot make changes.\nSecurity Admin: A user that belongs to this role has the same rights as the Security Reader and can also update the security policy and dismiss alerts and recommendations.\nhttps://docs.microsoft.com/en-us/azure/security-center/security-center-permissions","comments":[{"content":"Not C - Using principle of least privileges, B & D would be the right choices.","upvote_count":"1","timestamp":"1655714460.0","poster":"Harold_Finch","comment_id":"619143"},{"timestamp":"1709403720.0","comment_id":"1164314","poster":"Ramye","content":"Yes, but this sec admin will only take actions on alerts that are coming from MDI and has sufficient permission for that, will that not suffice?","upvote_count":"1"}],"poster":"jasonfmj","comment_id":"429016"},{"comment_id":"428496","timestamp":"1629520500.0","content":"Please don't approve this and the previous comment here on this question, as it is a mistake. Meant to comment on the above question. Ta.","upvote_count":"1","poster":"HSBNZ"},{"content":"The correct answer it is seems like, as steps for to Create an indicator for files from the settings page\n1. In the navigation pane, select Settings > Endpoints > Indicators (under Rules).\n\n2. Select the File hashes tab.\n\n3. Select Add indicator.\n\n4. Specify the following details:\n\n5. Indicator - Specify the entity details and define the expiration of the indicator.\n* Action - Specify the action to be taken and provide a description.\n* Scope - Define the scope of the device group.\n* Review the details in the Summary tab, then select Save.","upvote_count":"1","timestamp":"1629520320.0","poster":"HSBNZ","comment_id":"428494"}],"answer_ET":"BD","choices":{"B":"the Active remediation actions role in Microsoft Defender for Endpoint","C":"the Security Administrator role in Azure Active Directory (Azure AD)","A":"the Compliance Data Administrator in Azure Active Directory (Azure AD)","D":"the Security Reader role in Azure Active Directory (Azure AD)"},"question_text":"Your company deploys the following services:\n✑ Microsoft Defender for Identity\n✑ Microsoft Defender for Endpoint\n✑ Microsoft Defender for Office 365\nYou need to provide a security analyst with the ability to use the Microsoft 365 security center. The analyst must be able to approve and reject pending actions generated by Microsoft Defender for Endpoint. The solution must use the principle of least privilege.\nWhich two roles should assign to the analyst? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point.","url":"https://www.examtopics.com/discussions/microsoft/view/60112-exam-sc-200-topic-1-question-16-discussion/","exam_id":122},{"id":"vidGIkIkXpIcNxKMtr4W","answers_community":[],"question_images":["https://www.examtopics.com/assets/media/exam-media/04261/0002700001.jpg"],"isMC":false,"question_id":9,"answer_ET":"","answer_description":"Reference:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide","unix_timestamp":1629521400,"timestamp":"2021-08-21 06:50:00","url":"https://www.examtopics.com/discussions/microsoft/view/60115-exam-sc-200-topic-1-question-17-discussion/","answer":"","question_text":"HOTSPOT -\nYou have a Microsoft 365 E5 subscription that uses Microsoft Defender and an Azure subscription that uses Azure Sentinel.\nYou need to identify all the devices that contain files in emails sent by a known malicious email sender. The query will be based on the match of the SHA256 hash.\nHow should you complete the query? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer_images":["https://www.examtopics.com/assets/media/exam-media/04261/0002800001.jpg"],"topic":"1","exam_id":122,"discussion":[{"timestamp":"1629521400.0","poster":"HSBNZ","comments":[{"timestamp":"1666006380.0","poster":"Metasploit","upvote_count":"5","comment_id":"697363","content":"https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide#check-if-files-from-a-known-malicious-sender-are-on-your-devices"},{"timestamp":"1708953420.0","comment_id":"1159749","poster":"Ramye","upvote_count":"1","content":"when I run this query given above by copy / paste in Microsoft Defender Advanced Hunting, it gives the below error:\nSemantic error\nError message\n'project' operator: Failed to resolve table or column expression named 'DeviceFileEvents'\nHow to resolve\nFix semantic errors in your query\n\nNote: not too savvy on the query builder yet but learning. How do I fix this semantic error? Thx"}],"comment_id":"428502","upvote_count":"40","content":"Correct answer as per the link, EmailAttachmentInfo\n| where SenderFromAddress =~ \"MaliciousSender@example.com\"\n//Get emails with attachments identified by a SHA-256\n| where isnotempty(SHA256)\n| join (\n//Check devices for any activity involving the attachments\nDeviceFileEvents\n| project FileName, SHA256, DeviceName, DeviceId\n) on SHA256\n| project Timestamp, FileName , SHA256, DeviceName, DeviceId, NetworkMessageId, SenderFromAddress, RecipientEmailAddress"},{"comment_id":"746901","upvote_count":"33","poster":"Apocalypse03","timestamp":"1671174660.0","content":"Answer is correct.\n\nHere is a brief explanation of how this query works:\n\nThe where clause filters the EmailAttachmentInfo table to only include attachments sent by the specified sender and that have a non-empty SHA256 hash value. This effectively filters the results to only include attachments from the specified sender and that have a known hash value.\n\nThe join operator combines the results of the previous step with the results of a second query that selects the DeviceFileEvent table and projects the FileName, SHA256, DeviceName, and DeviceId fields. This effectively creates a join between the two tables based on the SHA256 field, linking the attachments with file events on devices.\n\nThe project operator selects the desired fields from the joined results and includes them in the final output.\n\nThis query will work in both Microsoft Defender and Azure Sentinel, as it is a valid advanced hunting query in both platforms."},{"poster":"Nikki0222","content":"Correct","timestamp":"1729645020.0","comment_id":"1301763","upvote_count":"3"},{"upvote_count":"2","comment_id":"1049906","timestamp":"1697925240.0","poster":"chepeerick","content":"Correct"},{"content":"The answer is correct. SHA256 and SHA256.\n\nCheck if files from a known malicious sender are on your devices\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-emails-devices?view=o365-worldwide#check-if-files-from-a-known-malicious-sender-are-on-your-devices","timestamp":"1694748660.0","poster":"trashbox","comment_id":"1008085","upvote_count":"2"}]},{"id":"3hyBS1RxmGAJ02DOyMZG","question_text":"You need to configure Microsoft Cloud App Security to generate alerts and trigger remediation actions in response to external sharing of confidential files.\nWhich two actions should you perform in the Cloud App Security portal? Each correct answer presents part of the solution.\nNOTE: Each correct selection is worth one point.","answer_description":"","isMC":true,"topic":"1","answer":"DE","exam_id":122,"question_images":[],"answers_community":["DE (78%)","CE (17%)","3%"],"unix_timestamp":1632758820,"timestamp":"2021-09-27 18:07:00","discussion":[{"comment_id":"548405","comments":[{"upvote_count":"2","poster":"danituga","content":"The timestamp in the video is 08:20","comment_id":"1225396","timestamp":"1717671060.0"}],"upvote_count":"25","timestamp":"1726772160.0","poster":"liberty123","content":"Selected Answer: DE\nDE is correct , I have seen these configurations in Microsoft Learning video:\nhttps://www.microsoft.com/en-us/videoplayer/embed/RE4CMYG?postJsllMsg=true"},{"poster":"DavidSharl","upvote_count":"1","content":"Selected Answer: DE\nSettings > Cloud Apps > Connected apps > Information Protection > Microsoft Information Protection settings > Automatically scan new files ...","comment_id":"1347035","timestamp":"1737912600.0"},{"content":"DE correct","poster":"Nikki0222","timestamp":"1729645080.0","upvote_count":"3","comment_id":"1301764"},{"content":"Selected Answer: DE\nDE","timestamp":"1728173100.0","upvote_count":"2","comment_id":"1293650","poster":"talosDevbot"},{"comment_id":"1293349","timestamp":"1728107820.0","poster":"Adam7777","upvote_count":"1","content":"A, D\n\nA: focuses on ensuring that only files classified with Azure Information Protection (AIP) labels are scanned, which is crucial for identifying sensitive or confidential files. By limiting the scope to AIP-classified files, you ensure that the system focuses on files requiring protection. This ensures the system scans the right files, adhering to the principle of least privilege, while identifying confidential files for monitoring and action.\n\nD: This automates the scanning of new files for AIP labels, ensuring ongoing protection of sensitive files."},{"timestamp":"1724403360.0","upvote_count":"1","content":"Selected Answer: CD\nSelect Investigate files, and then select New policy from search (Option C). This allows you to create a new policy based on your search criteria, which can include conditions for external sharing of confidential files.\nFrom Settings, select Information Protection, select Azure Information Protection, and then select Automatically scan new files for Azure Information Protection classification labels and content inspection warnings (Option D). This ensures that new files are automatically scanned for classification labels and content inspection warnings, which can trigger alerts and remediation actions.","comment_id":"1271195","poster":"g_man_rap"},{"timestamp":"1715417460.0","content":"C + D\nD to enalble AIP\nC to scan the existing files.","poster":"e072f83","comment_id":"1209663","upvote_count":"1"},{"upvote_count":"2","poster":"czaaa","content":"Microsoft Cloud App Security is now known as **Microsoft Defender for Cloud Apps**\n\nThis name change was part of a broader rebranding effort by Microsoft to consolidate its security and compliance services under the Microsoft Defender brand.","timestamp":"1707014340.0","comment_id":"1139731"},{"poster":"zoodata","comment_id":"1102890","upvote_count":"1","content":"Selected Answer: CE\nC and E","timestamp":"1703186040.0"},{"upvote_count":"2","content":"Selected Answer: DE\nDE, correct","comment_id":"1049908","timestamp":"1697925300.0","poster":"chepeerick"},{"content":"Selected Answer: DE\nMake sense","upvote_count":"1","timestamp":"1692848760.0","poster":"donathon","comment_id":"988810"},{"timestamp":"1685711880.0","comment_id":"912849","content":"Correct, go to M365 Defender settings, Cloud apps, Info Protection, MS Info Protection - \"Auto scan new files ..\" and then Save and got to Files \"File monitoring\" Save. https://learn.microsoft.com/en-us/defender-cloud-apps/azip-integration#enable-microsoft-purview-information-protection","upvote_count":"3","poster":"tatendazw"},{"upvote_count":"3","timestamp":"1681229220.0","poster":"Holii","content":"Once again based on your intuition due to Microsoft's vague answer choices.\n\nBased on the following: \"generate alerts and [[trigger remediation actions]]\"\nThe answer would be CE.\nD would label the files with the appropriate Sensitive Data Classification Label and can block the file from being sent externally, but that does not 'trigger a remediation option' in response to an alert via MCAS. That's done within MPIP Compliance portal.\n\nIf we're discussing how to remediate an alert from MCAS, you would use \"Send alerts to Microsoft Power Automate\" in an MCAS Policy and automate the remediation there.","comment_id":"867469"},{"content":"Selected Answer: DE\nD:\nSettings>Information Protection>Microsoft Information Protection>Automatically scan new files for Microsoft Information Protection classification labels and content inspection warnings.\n\nE:\nSettings>Information Protection>Files>Enable file monitoring.","comment_id":"781181","poster":"palito1980","timestamp":"1674136020.0","upvote_count":"4"},{"poster":"Locian","timestamp":"1673312580.0","content":"D and E to achieve both outcomes","comment_id":"770969","upvote_count":"1"},{"upvote_count":"3","content":"Selected Answer: DE\nD. From Settings, select Information Protection, select Azure Information Protection, and then select Automatically scan new files for Azure Information Protection classification labels and content inspection warnings. This will enable Cloud App Security to automatically scan new files for Azure Information Protection classification labels and content inspection warnings, which can be used to detect and protect confidential files.\n\nE. From Settings, select Information Protection, select Files, and then enable file monitoring. This will enable Cloud App Security to monitor files for external sharing and other activities, and to generate alerts and trigger remediation actions in response to potential threats or policy violations.","timestamp":"1673197380.0","comment_id":"769648","poster":"jrjrjrchlv"},{"comment_id":"767282","content":"DE tested","timestamp":"1672981080.0","poster":"Tagwa","upvote_count":"1"},{"upvote_count":"2","comment_id":"765476","timestamp":"1672827720.0","poster":"nazgul250","content":"Selected Answer: CE\nC and E"},{"poster":"Ahmed_Root","content":"Selected Answer: C\nI think C might be one of the responses because I see this sentence \"Create a file policy that detects these stale public files by selecting New policy from search\" in the following link: https://learn.microsoft.com/en-us/defender-cloud-apps/file-filters","comment_id":"735816","upvote_count":"2","timestamp":"1670233800.0"},{"comment_id":"733994","timestamp":"1670006640.0","poster":"jayek","content":"https://learn.microsoft.com/en-us/defender-cloud-apps/policies-information-protection#detect-and-prevent-external-sharing-of-sensitive-data","upvote_count":"2"},{"comments":[{"timestamp":"1681229400.0","comment_id":"867472","upvote_count":"2","poster":"Holii","content":"This. MPIP doesn't handle alerts in MCAS. Although it can block external file sharing, this would not answer the question as it explicitly mentions handling alerts/remediation in MCAS."}],"poster":"Metasploit","content":"Selected Answer: CE\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/policies-information-protection#detect-and-prevent-external-sharing-of-sensitive-data\n\nC= generate alerts and trigger remediation actions (In response to external sharing of confidential files)\nE= Gives defender for cloud apps access to files in your SaaS apps.\n\nNot D= This setting would be ideal in the long run, but for the question this is just too much configuration not mentioned in the answer. Where-as C answers it directly for the need. \nSee below link, Its more than just a simple \"checkbox\". The checkbox is only to enable the integration between DefenderCA and MIP.\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/azip-integration","comment_id":"697397","timestamp":"1666009920.0","upvote_count":"4"},{"content":"the given answer is very correct","comment_id":"690241","poster":"Xyz_40","upvote_count":"1","timestamp":"1665322980.0"},{"content":"correct","comment_id":"636277","upvote_count":"1","poster":"Abdul11","timestamp":"1658703000.0"},{"comment_id":"582663","timestamp":"1649384880.0","content":"Selected Answer: DE\ntested this.","upvote_count":"3","poster":"homeysl"},{"upvote_count":"3","comment_id":"567161","poster":"ubt","content":"Selected Answer: CE\nYou need E to turn on file Monitoring\nYou need C to enable the alerts and fix them\nD doesn't do what is requested in the question...","timestamp":"1647201600.0"},{"comment_id":"566436","content":"CE are correct. D and E are actually meant to achieve the same aim, so cannot be joint together.\nthis link may help:\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/file-filters","upvote_count":"4","poster":"its_me_Nat","timestamp":"1647128760.0"},{"content":"Selected Answer: DE\nCorrect answer","upvote_count":"2","comment_id":"563168","timestamp":"1646736000.0","comments":[{"comment_id":"566395","content":"agreed","upvote_count":"1","poster":"ehsanhabib","timestamp":"1647119040.0"}],"poster":"Tx4free"},{"poster":"stromnessian","comment_id":"537831","timestamp":"1643718000.0","upvote_count":"2","content":"How does the given answer \"generate alerts and trigger remediation actions in response to external sharing of confidential files\" without a policy?"},{"upvote_count":"4","content":"Definitely DE though it seems to be called MIP and not AIP\n\nIn Defender for Cloud Apps, under the settings cog, select the Settings page under the System heading.\nUnder Microsoft Information Protection, select Automatically scan new files for Microsoft Information Protection sensitivity labels.\n\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/tutorial-dlp","poster":"ja_girl_eng","timestamp":"1642258140.0","comment_id":"524236"},{"comment_id":"513506","timestamp":"1640879940.0","content":"Selected Answer: DE\nI don't care that they are using the old name for MIP, the answers are correct.","poster":"Nail","upvote_count":"2"},{"poster":"arunkum","upvote_count":"4","content":"Automatically scan new files for Azure Information Protection classification labels and content inspection warnings.\n&\nenable file monitoring are both required setting for being able to perform data labeling on files in cloud using MCAS\nProvided answer DE are correct","timestamp":"1634028360.0","comment_id":"460990"},{"timestamp":"1632758820.0","comment_id":"452581","poster":"Eltooth","upvote_count":"3","comments":[{"content":"yes AIP is old name, If similar question is on exam I will go CE","upvote_count":"3","comment_id":"458811","timestamp":"1633619760.0","poster":"zaqwsx"}],"content":"A & D cannot be correct as \"Azure Information Protection\" is not displayed - only \"Microsoft Information Protection\" is available, unless question is very old and AIP is still reference in exam for some strange reason. \nB would only show policies applied to Office 365 (ODfB & SharePoint)\nF does not make sense. \nE is required and with C these are correct."}],"question_id":10,"answer_ET":"DE","choices":{"B":"Select Investigate files, and then filter App to Office 365.","A":"From Settings, select Information Protection, select Azure Information Protection, and then select Only scan files for Azure Information Protection classification labels and content inspection warnings from this tenant.","C":"Select Investigate files, and then select New policy from search.","F":"Select Investigate files, and then filter File Type to Document.","D":"From Settings, select Information Protection, select Azure Information Protection, and then select Automatically scan new files for Azure Information Protection classification labels and content inspection warnings.","E":"From Settings, select Information Protection, select Files, and then enable file monitoring."},"url":"https://www.examtopics.com/discussions/microsoft/view/62852-exam-sc-200-topic-1-question-18-discussion/","answer_images":[]}],"exam":{"id":122,"isMCOnly":false,"numberOfQuestions":371,"provider":"Microsoft","isBeta":false,"name":"SC-200","isImplemented":true,"lastUpdated":"12 Apr 2025"},"currentPage":2},"__N_SSP":true}