{"pageProps":{"questions":[{"id":"dkhUVjYEWsfJ7ogscNfE","unix_timestamp":1661953800,"timestamp":"2022-08-31 15:50:00","url":"https://www.examtopics.com/discussions/microsoft/view/78715-exam-sc-300-topic-2-question-33-discussion/","answers_community":[],"answer_description":"","exam_id":123,"answer_ET":"","topic":"2","discussion":[{"comment_id":"666626","upvote_count":"27","comments":[{"poster":"f2bf85a","comment_id":"867393","upvote_count":"8","comments":[{"timestamp":"1729617480.0","comment_id":"1301660","poster":"Nail","content":"CA policy has nothing to do with User2 since that user is in Group2 and the CA policy is only applied to Group1.","upvote_count":"2"},{"comments":[{"comment_id":"1301658","poster":"Nail","upvote_count":"1","content":"No, because in the last case User2 is coming from a trusted IP range. NYN.","timestamp":"1729617360.0"}],"content":"fmm.. so then the answer should be N Y Y if user2 must be authenticated cause of enforce setting.","timestamp":"1706959740.0","comment_id":"1139186","poster":"aks_exam","upvote_count":"1"}],"content":"I agree with the answers, but in 2) it is YES just because the MFA is enforced. The trusted location does not have the public IPs, Azure AD does not see the private IPs of the clients, just the public internet IP.\nSo User2 does not sign in from a trusted location, thus the CA policy does not apply.\nBut just because he has MFA Enforced, he will be prompted for MFA, so YES","timestamp":"1681223220.0"}],"timestamp":"1662962160.0","poster":"dejo","content":"I think (feel free to discuss):\n1) No\n2) Yes (although the request is from a trusted location, that doesn't mean the MFA prompt will be bypassed! If there was CA policy configured to require MFA with the trusted locations EXCLUDED, then the user would not get the MFA prompt)\n3) No (request is coming from the IP that is added to the MFA trusted IPs list in the legacy MFA portal https://account.activedirectory.windowsazure.com/UserManagement/MfaSettings.aspx)"},{"timestamp":"1667872620.0","upvote_count":"18","comments":[{"content":"Fully agree with NYN answers and with posted explanation.","poster":"MrPrasox","upvote_count":"1","comment_id":"729010","timestamp":"1669633860.0"},{"poster":"mibur","content":"Last one is Y so NYY. a MFA Enforced users is prompted for MFA even when logging in from a whitelisted/trusted location.","comments":[{"content":"From the following link:\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates\n\nIf needed, you can instead enable each account for per-user Azure AD Multi-Factor Authentication. When users are enabled individually, they perform multi-factor authentication each time they sign in (with some exceptions, such as when they sign in from trusted IP addresses or when the remember MFA on trusted devices feature is turned on).","timestamp":"1674695640.0","poster":"wooyourdaddy","comment_id":"788260","upvote_count":"2"},{"upvote_count":"2","timestamp":"1683581640.0","comments":[{"comment_id":"892534","timestamp":"1683582840.0","upvote_count":"2","poster":"kanew","content":"My Bad, the last one is a No. See my reasons on the post a couple below this"}],"poster":"kanew","comment_id":"892524","content":"It is yes but not for that reason or not for just that reason. The CA policy applies and is \"Grant with MFA\" so they will be prompted by the policy in any case."}],"comment_id":"737522","timestamp":"1670397660.0","upvote_count":"4"},{"content":"I agree with you\nno\nyes\nno","poster":"Nivos23","comment_id":"1059647","timestamp":"1698838380.0","upvote_count":"2"},{"upvote_count":"9","poster":"b233f0a","comment_id":"938219","content":"N - User1/Group1 is in CA Policy. IPv4 Range is a trusted location in the CA Policy so no MFA required.\nY - User 2 is not in CA Policy. MFA is Enforced. IP address is not the Public IP for MFA trusted range so not trusted. https://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-mfasettings#trusted-ips\nY - Same as above","timestamp":"1688047500.0"}],"comment_id":"713410","poster":"hyc1983","content":"This is what I think:\n1 - No. Although 10.10.0.0/16 is a named trusted location, it's a private IP range and won't function correctly, so user 1 won't match the condition of CA policy 1. In addition, user 1 has per-user MFA disabled, it won't be prompted for MFA.\n2 - Yes. User2's source IP is 10.10.1.160, the public IP of which is in the range of 20.93.15.0/24, which isn't a trusted MFA range. Besides, User2 is a per-user MFA-enforced user. Therefore, User2 will be prompted for MFA.\n3 - No. The public IP address of 192.168.1.20 is in the space of 193.17.17.0/24, which is an MFA-trusted IP range. Although user2 is a per-user MFA-enforced user, it won't be prompted for MFA."},{"poster":"d1e85d9","timestamp":"1741870920.0","upvote_count":"1","comment_id":"1388305","content":"NO\nYES\nNO"},{"content":"1. it wont promt for MFA. actually the question here is missing a key input which is 'Locations - Trusted locations' should be in exclude state and not include. who keeps trusted location with MFA. hence user 1 coming from trusted location dont need MFA\n2. Yes - User 2 is not part of Group 1 so CA policy doest apply and secondly its MFA state says enforced, which means he is obliged to go via MFA.\n3. Yes - still the same. User2 is obliged to go via MFA as he is in enforced state. Sorry, i couldnt see any trusted microsoft links that state that CA policy dominates per-user MFA. if anyone could find pl. share. And I cannot trust chatgpt, copilot or any GenAI model to provide correct answers. pl. understand they only tell what is taught them with enough conviction. so only trusted links if anyone can share..","timestamp":"1739467860.0","comments":[{"content":"1. Should be doesn't mean it is.","poster":"csi_2025","timestamp":"1740733920.0","upvote_count":"1","comment_id":"1362917"}],"upvote_count":"1","comment_id":"1356223","poster":"anonymousarpanch"},{"timestamp":"1739286420.0","upvote_count":"1","comment_id":"1355029","poster":"armid","content":"I think its\n1. YES - the first table refers to legacy per user authentication and that is not being evaluated when conditional access is used. User 1 is signing in from trusted location, but the policy still states grant access but require MFA\n2. YES - conditional access doesnt apply to this user becasue the scope of the policy is group1 only. Therefore his legacy per user MFA will kick in and that requires him to use MFA unless he is not logging in from the legacy MFA trusted IP of 193.17.17.0/24 which in this case he is not\n3. NO - this time around he is signing in from the per user MFA trusted IP of 193.17.17.0/24\n\nDont let the private ranges fool you. MS will only evaluate the public IPs, you only need to verify the corresponding private addresses match to the public ones."},{"poster":"RemmyT","timestamp":"1718097000.0","upvote_count":"1","content":"NO YES YES\n \nUser1 is member of Group1 -> CAPolicy1 applies\n10.10.1.150 (Location1) connect to Azure with an IP from 20.93.15.0/24 range\nUser1/Group1 -> CAPolicy1 -> Requires MFA : cannot login (MFA disabled)\n\nUser2 is member of Group2 -> CAPolicy1 does not apply\nUser2/Group2 -> MFA enforced -> will be prompted for MFA from any location\n10.10.1.160 (Location1) connect to Azure with an IP from 20.93.15.0/24 range\n192.168.1.20 (Location2) connect to Azure with an IP from 193.17.17.0/24 range\n\n193.17.17.0/24 range - is trusted only in context of CAPolicy1","comment_id":"1228354"},{"upvote_count":"1","poster":"RucasII","comment_id":"1209676","content":"Enabling MFA for a user means that the user has the option to set up MFA, but it is not required. Enforcing MFA means that the user is required to set up MFA and cannot access their account until they have completed the MFA setup process. \n\n \n\nIf you enforce MFA for a user, they will be prompted to set up MFA the next time they log in to their account. They will not be able to access their account until they have completed the MFA setup process. Once they have completed the setup process, they will be required to use MFA every time they log in to their account. \n\n \n\nEnabling MFA gives the user the option to set it up, but they can still access their account without MFA. Enforcing MFA requires the user to set it up and use it every time they log in.","timestamp":"1715419980.0"},{"poster":"emartiy","timestamp":"1711478640.0","upvote_count":"1","comment_id":"1183527","content":"CAPolicy1 workload is Group1. So, User1 is member of that group and this policy address that user. User2 is not member of Group1. This CAPolicy1 won't be applied for this user..However, user2 has MFA enforced.. This is tricky point...\n\n1) No - Why? User1 is member of group1 and CAPolicy1 will apply. Since user1 login from IP address in Location1 which is marked as trusted location, MFA won't be prompted... If user one try to login from an untrusted location, since MFA isn't enabled, when it is forced via policy, user1 login won't success..\n2) YES - MFA is forced for user2. Even CAPolicy1 isn't assign to user2 due to user group, for each sign-in form any IP range user2 will be prompted MFA.\n3) YES - Same above option 2. \nNO - YES - YES."},{"content":"Tested on Azure\n1. No. Because CAPolicy1 not applied, because of the location does not meet trust location requirement. Only public IP can be captured.\n2. Yes. MFA is enforced for this user2\n3. No. MFA is enforced for this user2, but the location is in the MFA trust IP ranges, so MFA is skipped.\n\nAdditional finding: the IP configured in MFA trusted ips will also fall into the \"all trust locations\" in conditional access policy","comment_id":"1161302","upvote_count":"2","timestamp":"1709102100.0","poster":"zlzl"},{"content":"Hi guys, just one question, 10.10.0.0/16 and 192.168.0.0/16 are both private IP, meaning you can set up these IP segments in any network. So, if user2 connects to the tenant from IP 192.168.1.20, how do you know it's from the public IP 193.17.17.0/24?","comment_id":"1138797","upvote_count":"1","timestamp":"1706899860.0","poster":"Shuihe"},{"poster":"Nyamnyam","content":"N-Y-N\nThink of this:\nLocation1 is a \"named location\" marked as trusted, but wrongly configured with a private IP range, which the cloud-based MFA cannot resolve (it sees only the public IP address).\nAnd then we have \"MFA has a trusted IP address range of 193.17.17.0/24\", which is a service setting under Protection > Multifactor authentication > Service settings. This works outside of CAPs!\nThen comes the CAP with the \"All trusted locations\" condition, which will never be triggered, as clarified above!\nThen the answers are clear:\nUser1 will NEVER be prompted for MFA.\nUser2 will be prompted for MFA EXCEPT from the \"MFA trusted IPs\", which is only the public IP from Location2 (which is case 3)","timestamp":"1699433460.0","upvote_count":"2","comment_id":"1065460"},{"upvote_count":"4","poster":"syougun200x","timestamp":"1694989620.0","content":"1 No. Regardless if the policy applies or not, User 1 is MFA Disabled. No prompt.\n2 Yes. The policy does not apply to User 2 (Assignments only to group 1). User 2 is MFA enforced. to be prompted.\n3 No. The policy does not apply to User 2 (Assignments only to group 1). User 2 is MFA enforced, but the IP range is included in the below (MFA setting).\n\nSkip multi-factor authentication for requests from following range of IP address subnets","comment_id":"1010100"},{"poster":"Hawklx","timestamp":"1686678480.0","upvote_count":"2","content":"The question is very confusing and it needs to be broken down a bit further\n\nLocation 1: is 20.93.15.0/24 (this is trusted as named location)\nLocation 2: is 193.17.17.0/24 (this is a trusted IP range for Skip multi-factor authentication in the legacy MFA portal)\n\nThe CA policy target only users in Group1 that are in trusted locations, it does not say it All trusted location are excluded (this is an assumption, but this is not what the problem statement says)\n\nso if a users is in the 10.10.0.0/16 range, is actually in Location1\nand if a user is in the 192.168.0.0/16, is in Location2\n\n1. User1 is in Location1 so the CA policy does require to do MFA, the CA apply to trusted location not the other way around, the word \"exclude trusted location\" was never mentioned.\n2. User2 is in Location1 but not in Group1, no CA policy apply\n3. User2 is in Location2 that is trusted, so no MFA is going to apply there\n\nso the answers are\nY\nN\nN","comments":[{"content":"User1 MFA is disabled, so user1 can't be prompted isn't it?","upvote_count":"1","timestamp":"1693764180.0","comment_id":"997853","poster":"ServerBrain"},{"upvote_count":"1","content":"Completely agree","comment_id":"964232","comments":[{"poster":"ivzdf","timestamp":"1690415820.0","content":"if the condition is met which in this case is trusted location, then in order to grant access MFA must be met.","comment_id":"964236","upvote_count":"1"}],"poster":"ivzdf","timestamp":"1690415640.0"}],"comment_id":"922432"},{"timestamp":"1683581400.0","poster":"kanew","content":"The correct answer is N,Y,Y . It seemed so simple initially and I got it wrong but it's not as easy as it looked at first glance. We are being asked if the user will be prompted for MFA - NOT if they fall within scope of a conditional access policy. \n\nNumber 2 is the only part that should cause any confusion. An enforced status means the legacy per user MFA is enabled.(I tested this. MFA Registration because of a CA policy does not change the legacy per MFA status - it remains as \"disabled\".) In this scenario the user will be asked to MFA every time except from a trusted location. The trusted location exception does not apply here so they will get a MFA prompt because of the per user MFA setting.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates","upvote_count":"1","comment_id":"892523","comments":[{"upvote_count":"1","timestamp":"1683582720.0","content":"Ok so 2 mins after i posted the above i have egg on my face -:-(. I missed that the the policy only applied to Group 1 so user 2 isn't in scope. I also missed the terminology of a named location marked as trusted versus a trusted IP. A trusted IP is part of the legacy per user MFA so in part 3 USER 2 is not part of the conditional access policy but does have MFA enforced. However they are coming from a trusted IP so will not receive a MFA prompt. N,Y,N.","comment_id":"892532","poster":"kanew"}]},{"upvote_count":"3","comments":[{"upvote_count":"1","comment_id":"892525","poster":"kanew","content":"2 is Y. The Enforced MFA status of User 2 means they are using the per user MFA setting and will be prompted for MFA every time. Remember we are not being asked if the conditional access policy applies but if the user will be prompted for MFA","timestamp":"1683581940.0"},{"comments":[{"content":"*correction: trusted location is the private IP range, which is likely a misconfiguration, because we needed the public NAT here.","timestamp":"1686509100.0","upvote_count":"1","comment_id":"920916","poster":"Holii"}],"comment_id":"920914","upvote_count":"3","poster":"Holii","timestamp":"1686508980.0","content":"Re-read the question.\nPolicy is only applying to Group1/User1.\nTHE POLICY DOES NOT APPLY TO GROUP2/USER2\n\n1 - No - User 1 has MFA disabled, but this doesn't matter. They won't be asked for it because it's not a trusted location. (The policy is looking for only trust location on 1923.17.17.0/24, like you said)\n2 - Yes - User 2 is coming from a non-trusted location. It has MFA enforced.\n3 - No - User 3 is coming from a trusted location. It has MFA enforced.\n\nWe only are using the CA policy for User 1. User 2 is treated strictly on only the MFA trusted IP range."}],"content":"The answer shown is correct, but the explanation for it it not.\n\nAnswer is: N-N-Y\nReason:\n1 - No - User 1 has MFA Disabled, so will not be prompted for MFA\n2 - No - User 2 is coming from Location 1 and Location one's IP is only configured in this CA policy using a private address, so it won't be prompted.\n3 - Yes - User 2 is coming from Location 2, and this is configured in the CA policy to prompt MFA.\n\nThe main confusion is due to the configuration being weak. \nIf you want to prompt for MFA and exclude Trusted locations, you set the locations as \"All Locations\", exclude \"Trusted Locations\" and Require MFA - This means that you will be prompted for MFA at all locations except the Trusted Locations.\n\nWhat this policy will actually achieve is only prompting for MFA in the Trusted Location 193.17.17.0/24, and nowhere else.","poster":"JBail","comment_id":"881393","timestamp":"1682502420.0"},{"upvote_count":"2","comment_id":"867389","poster":"f2bf85a","comments":[{"upvote_count":"1","content":"Sorry, it is No Yes NO (made a mistake on the 3rd one)","poster":"f2bf85a","comment_id":"867390","timestamp":"1681222980.0"}],"timestamp":"1681222920.0","content":"No: User1 Has MFA Disabled, but although he is member of Group1, the public IP range he is logging in from does not belong to the Trusted location (only public IP is visible to Azure AD), so the CA policy will not apply.\nYes: User2 connects from a Public CIDR that is not a trusted location and is in Group2, so CA policy does not apply, but MFA is Enforced, so he will be prompted for MFA.\nYes: User2 policy does not apply (not in trusted locations and member of Group 2), has MFA Enforced, but connects from the MFA Trusted IP range (public range), so he won't be prompted for MFA. \nTested it in lab, if MFA Trusted IP CIDRs are defined and enabled, MFA Enforcent is bypassed."},{"comment_id":"863682","upvote_count":"1","poster":"iwantmyexamsobad","timestamp":"1680859380.0","content":"To me it's YES NO NO\n1) YES because the CA policy is only for group1 (user1). His public IP address is not trusted thereforme the CA push a MFA prompt no matter his user MFA status.\n2) The CA policy only applies to group1 members, user2 isn't a part of that.\n3) same as above"},{"timestamp":"1680218280.0","comment_id":"856417","upvote_count":"2","poster":"rfuentessc","content":"The level of confusion seems to display the level ridiculousness of some of these questions","comments":[{"timestamp":"1680251160.0","comment_id":"856784","poster":"StijnDW","content":"wooyourdaddy explained the reasoning though","upvote_count":"1"}]},{"poster":"Taigr","timestamp":"1676368620.0","upvote_count":"1","content":"Hi guys, why is 10.10.1.160 trusted IP? IP range for 10.10.0.0/24 is \"10.10.0.0 - 10.10.0.255\"\nso it should not be in trusted IPs","comment_id":"808262","comments":[{"comment_id":"870043","upvote_count":"1","timestamp":"1681458060.0","poster":"Raven84","content":"It is /16 not /24"}]},{"poster":"AWS56","content":"No-Yes-No","timestamp":"1676127540.0","upvote_count":"1","comment_id":"805323"},{"comments":[{"poster":"Raven84","content":"CA applies to trusted locations only. So User1 will not be affected of any CA imho","comments":[{"content":"User 1 will be affected on CA policy named CAPolicy1, because conditions of Locations is applied to All trusted locations, it does not select exclude all trusted locations. So, when User1 access from any of trusted locations User1 will be prompted for MFA.","timestamp":"1690612920.0","comment_id":"966175","upvote_count":"1","poster":"eternalenvy"}],"comment_id":"870044","upvote_count":"1","timestamp":"1681458120.0"}],"timestamp":"1674997680.0","content":"YYN\nUser 1 is accessing from internal IP which will not be dedicated by the policy so he will be informed for MFA by CA regardless he registered for MFA for not\nUser 2 already enforced for MFA so will be enforced for MFA regardless part of CA or not as he is not accessing from trusted IPs\nUser 2 will not be prompt for MFA as accessing from trusted IP range","comment_id":"791649","upvote_count":"3","poster":"Halwagy"},{"timestamp":"1674674220.0","content":"1-NO\nUser1 is targeted by the CAPolicy.\nThe IP is in the trusted location \"Location1\", so the grant access requiring MFA will be bypassed\n\n2-YES\nUser2 is out of the CA policy and has MFA enabled for him and have maybe already registered MFA.\nHe is not in the trusted MFA IP address range (of MFA settings), so MFA will be required\n\n3-NO\nUser2 is out of the CA policy and has MFA enabled for him and have maybe already registered MFA.\nHe is in the trusted MFA IP address range (of MFA settings), so MFA will be bypassed","comment_id":"788054","upvote_count":"2","poster":"wsrudmen"},{"content":"1. No-- User1 is in the CA policy and exempt\n2. No- User2 is not in the CA but coming from Trusted Location, which is tenant-wide\n3. Yes- User 2 is not in the CA and also not logging in from Trusted location. Also has MFA enforced.","comment_id":"775041","poster":"LP223","timestamp":"1673663280.0","upvote_count":"4"},{"poster":"jack987","comment_id":"757797","upvote_count":"2","content":"The answer is correct. \nNo - No - Yes\nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-mfasettings\nNote\nThe trusted IPs can include private IP ranges only when you use MFA Server. For cloud-based Azure AD Multi-Factor Authentication, you can use only public IP address ranges.","timestamp":"1672084440.0"},{"timestamp":"1669845960.0","comment_id":"732032","upvote_count":"1","poster":"Ikeinater","comments":[{"content":"NYN*\nSee hyc1983 explanation.","poster":"Ikeinater","upvote_count":"1","comment_id":"740291","timestamp":"1670606400.0"}],"content":"NNN \nuser 1 is the only one in group 1. User 1 MFA is disabled and the other 2 questions talk about group 2 to which the policy doesn't apply. The rest of the question is just there to trick you."},{"timestamp":"1665411180.0","comment_id":"691235","content":"N o, No, No is the correct answer.","poster":"TheMCT","upvote_count":"3"},{"content":"Y - User1 access from Location1 that is marked as trusted. Policy have a condition for \"All trusted locations.\nN - Out of scope. Policy only applies to Group1.\nN - Out of scope. Policy only applies to Group1.","poster":"uffman","upvote_count":"5","timestamp":"1665342780.0","comment_id":"690492"},{"poster":"martinods","timestamp":"1665126780.0","content":"N- because the MFA is disabled for user 1\nY- because MFA for user 2 is Enforced and users 2 is out of policy scope (policy is for group1, user 2 is on group2)\nY- same of above","upvote_count":"6","comments":[{"upvote_count":"2","poster":"martinods","content":"N- because the MFA is disabled for user 1\nN- MFA is Enforced for users 2 but the connection is from trusted IP \nY- because MFA for user 2 is Enforced and users 2 is out of policy scope (policy is for group1, user 2 is on group2)","timestamp":"1665386760.0","comment_id":"690815"}],"comment_id":"688411"},{"content":"I think answer is: N/Y/Y\n1. User is part of Group1 so policy applies, but even though user is signing in from trusted IP, it is private address and Azure AD handles only the public address during sign in. So CA policy is not effecting User1 because of the trusted location is private address.\n2. User has enforced MFA so it will prompt. CA policy will not effect User2 because of the group assignment + Same thing with the private / public address that is in 1.\n3. User has enforced MFA so it will prompt. Even though user2 is coming from public IP that is trusted, enforce still enforces MFA.","timestamp":"1665114300.0","comment_id":"688266","upvote_count":"4","poster":"Vexix"},{"timestamp":"1663518060.0","poster":"Hot_156","comments":[{"timestamp":"1664487240.0","poster":"Hot_156","content":"The first on is N because the MFA is disabled","upvote_count":"1","comment_id":"683077"}],"comment_id":"672561","upvote_count":"3","content":"I think the first thing is to understand that MFA Disabled and MFA Enforced don't mean the user is prompted for MFA every time tries to access something. MFA Enforced means the user has completed the enrollment.\n\nHaving said that, the CA policy applies just to GROUP 1 which has USER 1 as a member. USER 2 is out of the scope of the CA. I think it should be,\nN - User 1 is trying to access from a trusted network\nN - User 2 is out of the scope of the CA. MFA is enforced but what I have found is that Enforced means the \"enrollment is complete\" and nothing else\nN - It is still out of CA scope."},{"comments":[{"content":"MFA enforced means the user went through the enrollment and complete it. It doesn't mean it will be required for MFA.\n\nEnabled: The user has been enrolled in MFA but has not completed the registration process. They will be prompted to complete the registration process the next time they sign in.\n\nEnforced: The user has been enrolled and has completed the MFA registration process. Users are automatically switched from enabled to enforced when they register for Azure AD MFA.\n\nDisabled: This is the default state for a new user that has not been enrolled in MFA.","upvote_count":"1","poster":"Hot_156","timestamp":"1663709700.0","comment_id":"674538"}],"timestamp":"1663414320.0","comment_id":"671466","content":"1. Yes Private IP address ranges cannot be used in named locations\nhttps://learn.microsoft.com/en-us/azure/active-directory/conditional-access/location-condition\n2. Yes User 2 has MFA enforced\n3.Yes MFA trusted IP setting not applicable here.","upvote_count":"4","poster":"Faheem2020"},{"content":"IMO, answer is NYY.\n1. No. User1 will not be prompted for MFA because user not in CA scope and MFA is disabled.\n2. Yes. User2 will be prompted for MFA because it is enforced.\n3. No. User2 is coming from Trusted MFA IP range so it will bypass MFA.","timestamp":"1663110540.0","comment_id":"668468","comments":[{"timestamp":"1663709760.0","poster":"Hot_156","comment_id":"674539","upvote_count":"2","content":"Enabled: The user has been enrolled in MFA but has not completed the registration process. They will be prompted to complete the registration process the next time they sign in.\n\nEnforced: The user has been enrolled and has completed the MFA registration process. Users are automatically switched from enabled to enforced when they register for Azure AD MFA.\n\nDisabled: This is the default state for a new user that has not been enrolled in MFA."}],"poster":"ItchyBrain81","upvote_count":"1"},{"upvote_count":"3","timestamp":"1662817380.0","poster":"geobarou","comment_id":"665446","content":"The answer is NNY. User1 is from a trusted location. CAPolicy1 will let him. User2 has enforced MFA in the group. Every time he must use MFA.\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates#azure-ad-multi-factor-authentication-user-states"},{"comment_id":"655144","upvote_count":"7","content":"CA policy applies to group 1 only, User2 is not member of group1, user 2 will not be prompted for MFA regardless where he logs in from.","comments":[{"comment_id":"731574","upvote_count":"1","timestamp":"1669816920.0","content":"MFA \"disabled\" doesn't mean the user can't use it. If a CA policy hit the user the user is prompted to register MFA. So technically not prompted for MFA but prompted to register MFA. I tested and can confirm this.\n\nNow the question is if user1 is hit by CAPolicy1. He comes from 10.10.0.150 which falls in the IP range of the named location Location1 (10.10.0.0/16), in which case the policy is hit.\nUnless that IP is considered part of Location1 in the table (not named location) and his public IP would be 20.93.15.0/24 in which case he is not hit by CAPolicy1","poster":"mcas"},{"content":"According to the answers because user1 is in a trusted location MFA won't be necessary, but for user two the policy does not apply so the answer should be NNN imo.","upvote_count":"2","poster":"UnDarisp","comment_id":"660441","timestamp":"1662402180.0"},{"comment_id":"667929","upvote_count":"3","timestamp":"1663068060.0","poster":"mimguy","content":"Agree, user2 not in scope of the CA policy but User2's MFA setting is enforced, so User2 will be prompted","comments":[{"poster":"Arjanussie","upvote_count":"1","comment_id":"827335","timestamp":"1677785760.0","content":"MFA will only be enforced if a policy is applied......not if you have mfa enabled"}]},{"upvote_count":"2","timestamp":"1663724160.0","content":"The first on is N because the MFA is disabled","poster":"Hot_156","comment_id":"674673"}],"poster":"existingname","timestamp":"1661953800.0"}],"question_text":"HOTSPOT -\nYou have an Azure Active Directory (Azure AD) tenant that contains the users shown in the following table.\n//IMG//\n\nYou have the locations shown in the following table.\n//IMG//\n\nThe tenant contains a named location that has the following configurations:\n✑ Name: Location1\n✑ Mark as trusted location: Enabled\n\nIPv4 range: 10.10.0.0/16 -\n//IMG//\n\nMFA has a trusted IP address range of 193.17.17.0/24.\n✑ Name: CAPolicy1\n✑ Assignments\n- Users or workload identities: Group1\n- Cloud apps or actions: All cloud apps\n✑ Conditions\n- Locations: All trusted locations\n✑ Access controls\n- Grant\n- Grant access: Require multi-factor authentication\n- Session: 0 controls selected\n✑ Enable policy: On\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//","answer":"","answer_images":["https://img.examtopics.com/sc-300/image499.png"],"question_images":["https://www.examtopics.com/assets/media/exam-media/04262/0011100001.png","https://www.examtopics.com/assets/media/exam-media/04262/0011100002.jpg","https://www.examtopics.com/assets/media/exam-media/04262/0011100005.png","https://www.examtopics.com/assets/media/exam-media/04262/0011200006.jpg"],"isMC":false,"question_id":156},{"id":"IlzarDlCEtPQqk4gi8x3","answer":"","unix_timestamp":1662006000,"timestamp":"2022-09-01 06:20:00","answer_description":"Box 1: Guest3 only -\nWhen does a guest user get a one-time passcode?\nWhen a guest user redeems an invitation or uses a link to a resource that has been shared with them, they'll receive a one-time passcode if:\nThey don't have an Azure AD account\nThey don't have a Microsoft account\nThe inviting tenant didn't set up federation with social (like Google) or other identity providers.\n\nBox 2: 30 minutes -\nOne-time passcodes are valid for 30 minutes. After 30 minutes, that specific one-time passcode is no longer valid, and the user must request a new one. User sessions expire after 24 hours. After that time, the guest user receives a new passcode when they access the resource. Session expiration provides added security, especially when a guest user leaves their company or no longer needs access.\nReference:\nhttps://docs.microsoft.com/en-us/azure/active-directory/external-identities/one-time-passcode","answer_images":["https://www.examtopics.com/assets/media/exam-media/04262/0011500001.jpg"],"question_id":157,"isMC":false,"discussion":[{"upvote_count":"1","comment_id":"1183538","timestamp":"1727369880.0","content":"Example\nGuest user nicole@firstupconsultants.com is invited to Fabrikam, which doesn't have Google federation set up. Nicole doesn't have a Microsoft account. They'll receive a one-time passcode for authentication\n\nwhat about User1 which has Azure AD Account adatum.com domain? Based on the above example, User and User3 would receive one-time passcode, ??","poster":"emartiy"},{"poster":"dbmc","timestamp":"1712304660.0","content":"Correct, and was on exam today.","upvote_count":"4","comments":[{"comment_id":"1025910","poster":"mfarhat1994","upvote_count":"2","content":"how was the exam and were these questions in the exam ?","timestamp":"1712342520.0"}],"comment_id":"1025383"},{"comment_id":"980857","timestamp":"1707926820.0","upvote_count":"3","poster":"EmnCours","content":"Users:Guest 3 Only\nValid: 30 minutes"},{"poster":"EmnCours","timestamp":"1705745340.0","upvote_count":"3","content":"Users:Guest 3 Only\nValid: 30 minutes\n\n\nWhen a guest user redeems an invitation or uses a link to a resource that has been shared with them, they’ll receive a one-time passcode if:\n\nThey don't have an Azure AD account.\nThey don't have a Microsoft account.\nThe inviting tenant didn't set up federation with social (like Google) or other identity providers.\nThey don't have any other authentication method or any password-backed accounts.\nEmail one-time passcode is enabled.\n\n\nOne-time passcodes are valid for 30 minutes. After 30 minutes, that specific one-time passcode is no longer valid, and the user must request a new one.","comment_id":"957293"},{"poster":"dule27","timestamp":"1702804920.0","comment_id":"925821","content":"Users:Guest 3 Only\nValid: 30 minutes","upvote_count":"4"},{"content":"Guest 3 and 30 minutes","upvote_count":"3","comment_id":"762947","poster":"Pedro2021","timestamp":"1688153400.0"},{"timestamp":"1686590820.0","content":"Answers correct.","upvote_count":"1","poster":"[Removed]","comment_id":"743259"},{"timestamp":"1681879260.0","poster":"kk1","comment_id":"698668","upvote_count":"1","content":"It is correct for 30 min. access"},{"comments":[{"upvote_count":"2","content":"Great link! The given answers are correct in this case","poster":"BRoald","timestamp":"1688640960.0","comment_id":"767692"}],"timestamp":"1677702960.0","content":"Guest 3 Only, 30 minutes: https://docs.microsoft.com/en-us/azure/active-directory/external-identities/one-time-passcode#when-does-a-guest-user-get-a-one-time-passcode","comment_id":"656564","poster":"gwajwara","upvote_count":"4"},{"poster":"existingname","comment_id":"655783","upvote_count":"4","timestamp":"1677651600.0","content":"correct, in the exam today"}],"topic":"2","question_images":["https://www.examtopics.com/assets/media/exam-media/04262/0011300001.png","https://www.examtopics.com/assets/media/exam-media/04262/0011400001.jpg"],"exam_id":123,"url":"https://www.examtopics.com/discussions/microsoft/view/78897-exam-sc-300-topic-2-question-34-discussion/","answers_community":[],"answer_ET":"","question_text":"HOTSPOT -\nYou have an Azure Active Directory (Azure AD) tenant named contoso.com that has Email one-time passcode for guests set to Yes.\nYou invite the guest users shown in the following table.\n//IMG//\n\nWhich users will receive a one-time passcode, and how long will the passcode be valid? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\n//IMG//"},{"id":"6k5Yb5Zjk31H1T5bsNmy","answer":"B","exam_id":123,"discussion":[{"content":"Selected Answer: B\nonly join\nhttps://learn.microsoft.com/en-us/entra/global-secure-access/how-to-install-windows-client","comment_id":"1341620","poster":"c8754bf","timestamp":"1737021840.0","upvote_count":"2"},{"poster":"anonymousarpanch","comment_id":"1341148","upvote_count":"2","content":"Selected Answer: B\nanswer is B. check this link... https://learn.microsoft.com/en-us/entra/global-secure-access/how-to-install-windows-client.\nFor GSA you need Microsoft Entra joined or MS entra hybrid JOINED devices. Microsoft entra registered devices are not supported.","timestamp":"1736961900.0"},{"upvote_count":"4","comments":[{"content":"Changing answer to B.\nMicrosoft Entra Private Access compatibility requires:\n\nGlobal Secure Access Client compatibility.\nJoin type and platform support:\nWindows devices must be Microsoft Entra joined (not just registered).\nAndroid devices are not supported for Private Access","timestamp":"1735858680.0","upvote_count":"3","comment_id":"1335795","poster":"Btn26"}],"timestamp":"1735855680.0","content":"Selected Answer: E\nEPA can be used with both Azure AD Joined and Azure AD Registered devices.\nThe Global Secure Access client can be deployed on various platforms, including Windows, macOS, iOS, Android, and Linux.\nIn this scenario:\n\nDevice1 (Windows 11, Microsoft Entra registered)\nDevice2 (Windows 10, Microsoft Entra joined)\nDevice3 (Windows 10, Microsoft Entra registered)\nDevice4 (Android, Microsoft Entra registered)\nAll these devices are either Azure AD Joined or Azure AD Registered and can have the Global Secure Access client deployed. Therefore, all four devices can potentially use Private Access.\n\nTherefore, the correct answer is E. Device1, Device2, Device3, and Device4.","poster":"Btn26","comment_id":"1335778"},{"content":"Selected Answer: B\nIsn't B a better option? for Android though it seems just registered is enough but there is more to it, the question doesn't say anything about how its managed or if the authenticator app is intalled.\n*Android devices must be Microsoft Entra registered devices.\n-->Devices not managed by your organization must have the Microsoft Authenticator app must be installed.\n-->Devices not managed through Intune must have the Company Portal app installed.\n-->Device enrollment is required for Intune device compliance policies to be enforced.","comment_id":"1331926","timestamp":"1735220100.0","poster":"barlar","upvote_count":"3"}],"topic":"2","question_images":["https://img.examtopics.com/sc-300/image454.png"],"question_id":158,"question_text":"You have a Microsoft Entra tenant that contains the devices shown in the following table.\n\n//IMG//\n\n\nYou plan to configure Microsoft Entra Private Access.\n\nYou deploy the Global Secure Access client to compatible devices.\n\nFrom which devices can you use Private Access?","answer_ET":"B","answer_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/153463-exam-sc-300-topic-2-question-35-discussion/","answers_community":["B (64%)","E (36%)"],"choices":{"E":"Device1, Device2, Device3, and Device4","C":"Device2 and Device4 only","A":"Device1 only","D":"Device1, Device2, and Device3 only","B":"Device2 only"},"answer_description":"","unix_timestamp":1735220100,"isMC":true,"timestamp":"2024-12-26 14:35:00"},{"id":"NeFlJg2rCzrT8AnQIA3k","answer_description":"","answers_community":["A (100%)"],"question_id":159,"isMC":true,"answer_ET":"A","answer_images":[],"answer":"A","choices":{"D":"a user-assigned managed identity","C":"a SQL Server account","B":"an Azure Active Directory (Azure AD) user account","A":"a system-assigned managed identity"},"discussion":[{"content":"To provide App1 with access to db1 while minimizing administrative effort and ensuring that credentials are only available to App1, you should use a system-assigned managed identity.\n\nA system-assigned managed identity is enabled directly on an Azure service instance. When the identity is enabled, Azure creates an identity for the instance in the Azure AD tenant that’s trusted by the subscription of the instance\n\nThis way, you don’t need to create or manage any secrets or credentials for your application. The identity is automatically managed by Azure and enables you to authenticate to any service that supports Azure AD authentication without having any credentials in your code","poster":"mali1969","timestamp":"1703337480.0","comment_id":"931512","upvote_count":"6"},{"comment_id":"1183551","content":"Selected Answer: A\nA system-assigned managed identity","upvote_count":"1","timestamp":"1727370960.0","poster":"emartiy"},{"comment_id":"1064981","timestamp":"1715091060.0","content":"Selected Answer: A\nThe best answer is A. a system-assigned managed identity.\n\nA system-assigned managed identity is a type of managed identity that is automatically created and assigned to an Azure resource when it is created. System-assigned managed identities are easy to use and manage, and they can be used to access resources in Azure, including Azure SQL databases.\n\nD. a user-assigned managed identity: A user-assigned managed identity is a type of managed identity that is created and managed by the user. User-assigned managed identities can be used to access resources in Azure, but they are more complex to use and manage than system-assigned managed identities.","upvote_count":"1","poster":"haazybanj"},{"timestamp":"1705745580.0","content":"Selected Answer: A\nCorrect Answer: A","poster":"EmnCours","upvote_count":"1","comment_id":"957297"},{"comment_id":"925825","content":"Selected Answer: A\nA. a system-assigned managed identity","upvote_count":"1","poster":"dule27","timestamp":"1702805220.0"},{"comment_id":"897400","upvote_count":"1","timestamp":"1699958040.0","poster":"ShoaibPKDXB","content":"Selected Answer: A\nA is correct"},{"comment_id":"851957","timestamp":"1695806340.0","upvote_count":"1","content":"A is correct: system assigned MI","poster":"chikorita"},{"comment_id":"787936","upvote_count":"2","content":"Selected Answer: A\nA is correct","timestamp":"1690298100.0","poster":"Oknip"},{"poster":"Halwagy","comment_id":"781324","upvote_count":"2","timestamp":"1689777600.0","content":"Selected Answer: A\nAnser is correct"}],"topic":"2","question_text":"You have an Azure subscription that contains an Azure SQL database named db1.\n\nYou deploy an Azure App Service web app named App1 that provides product information to users that connect to App1 anonymously.\n\nYou need to provide App1 with access to db1. The solution must meet the following requirements:\n\n• Credentials must only be available to App1.\n• Administrative effort must be minimized.\n\nWhich type of credentials should you use?","timestamp":"2023-01-19 17:40:00","url":"https://www.examtopics.com/discussions/microsoft/view/96014-exam-sc-300-topic-2-question-36-discussion/","unix_timestamp":1674146400,"exam_id":123,"question_images":[]},{"id":"Bfpo3UKwZ8yG5cm0E8Dr","question_id":160,"isMC":true,"question_images":["https://img.examtopics.com/sc-300/image203.png"],"exam_id":123,"answer":"C","url":"https://www.examtopics.com/discussions/microsoft/view/96030-exam-sc-300-topic-2-question-37-discussion/","topic":"2","timestamp":"2023-01-19 18:49:00","choices":{"D":"built-in Azure subscription roles and built-in Azure AD roles only","B":"built-in Azure subscription roles only","E":"Role1, Role2, built-in Azure subscription roles, and built-in Azure AD roles","C":"built-in Azure subscription roles and Role2 only","A":"Role2 only"},"unix_timestamp":1674150540,"answers_community":["C (79%)","A (18%)","3%"],"answer_ET":"C","answer_images":[],"question_text":"You have an Azure subscription that contains the custom roles shown in the following table.\n\n//IMG//\n\n\nYou need to create a custom Azure subscription role named Role3 by using the Azure portal. Role3 will use the baseline permissions of an existing role.\n\nWhich roles can you clone to create Role3?","answer_description":"","discussion":[{"timestamp":"1684397160.0","content":"I have cleared 3 certifications and can confirm the answer is F","comments":[{"timestamp":"1691131020.0","content":"looooool","poster":"UKG","comment_id":"971736","upvote_count":"4"}],"poster":"haskelatchi","comment_id":"900894","upvote_count":"22"},{"upvote_count":"12","poster":"voituredecourse","timestamp":"1688449320.0","comment_id":"942413","content":"I have cleared 19 certifications, it is definitely C"},{"content":"Selected Answer: C\nRole2 is an Azure subscription role, so it can be cloned for the new custom role.\nYou can also clone built‐in Azure subscription roles (e.g., Reader, Contributor, etc.).\nHence, the only valid sources to clone when creating Role3 (a custom subscription role) are:\n\nRole2 and any built-in Azure subscription roles.","poster":"Rackup","upvote_count":"1","comment_id":"1365604","timestamp":"1741214640.0"},{"content":"Selected Answer: E\nAnswer E) Role1, Role2, built-in Azure subscription roles, and built-in Azure AD roles\n\nThe question is stating that the two listed roles, Role1 and Role2, are custom roles. The key to the question is \"clone\" from an \"existing role\"...\n\nSo you are able to clone from the two existing custom roles listed as well as from the built-in Azure subscription and built-in Azure AD roles to use as baselines for the new role.","comments":[{"comment_id":"1362921","poster":"csi_2025","upvote_count":"1","timestamp":"1740734520.0","content":"Maybe focus on the entirety of the question instead of just the key. The question asks what roles you can clone to create role3 and role3 being an Azure subscription role."}],"poster":"YesPlease","upvote_count":"1","comment_id":"1361090","timestamp":"1740411840.0"},{"upvote_count":"2","content":"Selected Answer: C\nI have never cleared a certification, but i would still pick C","poster":"barlar","comment_id":"1331928","timestamp":"1735220340.0"},{"comment_id":"1245941","timestamp":"1720679040.0","upvote_count":"2","content":"C:\n\nAll your base are belong to us","poster":"Panama469"},{"comment_id":"1183554","content":"Selected Answer: C\nRole 1 is custom role which is Azure AD Role.. If you want to clone Azure Sub.. role ,you need to clone one role type it even built-in or custom... So Answer is C.. Think wide!","timestamp":"1711480740.0","upvote_count":"2","poster":"emartiy"},{"content":"Selected Answer: C\nyou can clone Azure subscription roles to make new Azure subscription roles.","poster":"curtmcgirt","comment_id":"1090737","timestamp":"1702004820.0","upvote_count":"3"},{"comments":[{"comments":[{"poster":"kijken","upvote_count":"1","content":"Thank you for clarifying. Now I understand the question and answer is C :)","comment_id":"1086850","timestamp":"1701612300.0"}],"poster":"Alscoran","timestamp":"1701185160.0","content":"They are not. Role 2 is a custom Azure subscription role. Now they are asking what you can CLONE. The answer you can clone one of the Built-in Azure subscription roles or Role 2 (which is a custom one, not a built-in one).","comment_id":"1082693","upvote_count":"6"}],"comment_id":"1072477","content":"am I the only one thinking that the 2 answers in C are the same?\nMaybe I misunderstand the question","upvote_count":"2","timestamp":"1700144460.0","poster":"kijken"},{"poster":"haazybanj","upvote_count":"3","comment_id":"1064984","timestamp":"1699373580.0","content":"I have cleared 29 certifications but can't confirm the answer."},{"content":"Selected Answer: C\nC. built-in Azure subscription roles and Role2 only","poster":"dule27","comment_id":"925827","timestamp":"1686987060.0","upvote_count":"5"},{"upvote_count":"5","comment_id":"866583","timestamp":"1681155060.0","content":"Selected Answer: C\nI have passed AZ-104 & AZ-305, I would go for Option C too.","poster":"kmk_01"},{"timestamp":"1679908680.0","comments":[{"timestamp":"1680523620.0","poster":"topzz","comment_id":"859876","comments":[{"upvote_count":"3","content":"LOL. I have passed AZ-104 & AZ-305, I would go for Option C too.","comment_id":"866580","poster":"kmk_01","timestamp":"1681155000.0"}],"upvote_count":"10","content":"thanks for confirming that you cleared 2 certs, otherwise your statement wouldn't have been as valuable."}],"upvote_count":"3","poster":"chikorita","comment_id":"851956","content":"i have cleared 2 certifications\ni can confirm its C: built-in Azure subscription roles and Role2 only"},{"content":"Selected Answer: C\nI tested in a very clean tenant:\n1. Went to create a custom role and in the drop down I saw all azure built-in roles\n2. Created a custom role (test-custom) and went to create a custom role again, this time in drop down, I could also see test-custom","comment_id":"818331","timestamp":"1677095520.0","upvote_count":"5","poster":"Zak366"},{"comment_id":"805314","timestamp":"1676126820.0","content":"Selected Answer: C\nIt's unclear if the question asks which roles can be cloned from a single action or in general, but I'd say the latter. So, both custom and Azure built-in roles can be cloned - https://learn.microsoft.com/en-us/azure/role-based-access-control/custom-roles-portal#clone-a-role","upvote_count":"4","poster":"dejo"},{"comment_id":"788081","upvote_count":"3","poster":"wsrudmen","content":"Selected Answer: A\nI think it's Role2 only as the option to clone is only for custom existing role.\nAfter you can copy paste the JSON of a built-in role, but it's not native.\nIt's a little bit ambiguous...","timestamp":"1674676020.0"},{"poster":"Kuneho","timestamp":"1674650520.0","upvote_count":"5","content":"The answer is correct. C. tested in the lab. You can clone Role2 (CustomRole) and Azure Built-in Roles","comment_id":"787624"},{"comment_id":"781427","timestamp":"1674150540.0","upvote_count":"3","poster":"Halwagy","content":"Selected Answer: A\nit is not clear, \nbut Role2 only or Bulti-in Azure subscription role only not both of them"}]}],"exam":{"provider":"Microsoft","lastUpdated":"12 Apr 2025","isImplemented":true,"numberOfQuestions":383,"isBeta":false,"name":"SC-300","id":123,"isMCOnly":false},"currentPage":32},"__N_SSP":true}