{"pageProps":{"questions":[{"id":"fFHLIWM1VYC28b6VFXso","answer_description":"","topic":"1","exam_id":123,"question_images":["https://www.examtopics.com/assets/media/exam-media/04262/0002200001.png"],"discussion":[{"timestamp":"1620829980.0","comments":[{"poster":"loukyexamtopic","timestamp":"1722184860.0","upvote_count":"1","comment_id":"1256921","content":"did you tested this in 365 admin centre or AAD"},{"comments":[{"timestamp":"1647100560.0","comment_id":"566249","upvote_count":"7","poster":"lime568","content":"because the equipments have a mailbox"}],"comment_id":"371909","content":"Agreed, also tested. However I found you can assign 'equipment users' e.g. Projectors with no license - odd one.","timestamp":"1622554020.0","poster":"hhaywood","upvote_count":"4"},{"upvote_count":"1","timestamp":"1677681540.0","poster":"Arjanussie","content":"Test it also You can't assign the users with no license / mailbox","comment_id":"825971"},{"timestamp":"1631295240.0","comment_id":"442625","comments":[{"timestamp":"1641904380.0","poster":"007Ali","upvote_count":"1","comment_id":"521527","content":"On a Security Group, going to Group Memberships -> Add Memberships, locating a Mail Enabled Security Group is greyed out and states \"Mail-enabled security groups are not allowed.\""},{"poster":"mackypatio","upvote_count":"1","comment_id":"596714","content":"I agree, I literally have hundreds of unlicensed users that are members of mail-enabled security groups in my production tenant, both in-cloud and synced from onprem.","timestamp":"1651660860.0"}],"upvote_count":"6","content":"I do not agree. I also tested this. Indeed if you look at it from the groups tab you cannot find the user in the list to add it to the MESG. But if you go to the user you can add a membership to the group.","poster":"Discuss4certi"},{"upvote_count":"3","comment_id":"598204","poster":"rsamant","content":"Right. you need to have exchange service included in the icense so E3 and E5 users can only be added","timestamp":"1651941420.0"},{"poster":"Hot_156","upvote_count":"3","comment_id":"673562","content":"Which objects can you add as members to Group3? - From Azure AD, you can add any user to a Mail-enabled Security Group (licensed or unlicensed)... You have to remember that a group is also a SECURITY GROUP! This exam is based on Azure AD IAM, so I would say D.","timestamp":"1663612800.0"}],"content":"The answer is Use2 only. I just tested. You can't assign the users with no license. 100%","comment_id":"355567","poster":"Cheguevarax","upvote_count":"87"},{"poster":"Diginomad","comments":[{"comment_id":"521259","poster":"xupiter","upvote_count":"6","content":"That's right, but only for Azure portal. Using Microsoft 365 admin center, you can add unlicensed users to a Mail-enabled Security Group. So answer is D.","timestamp":"1641872580.0","comments":[{"upvote_count":"2","comment_id":"679072","comments":[{"content":"Sorry xupiter you are correct. If you open the mail enabled SG, then you won't, be able to add the user, but if you open the unlicensed users from Users/Active Users/\"user\"/Groups/Manage groups then you can add the unlicensed user to the mail-enabled SG... Correct answer is D.","upvote_count":"1","comments":[{"content":"no you can't from portal.azure.com / it's not permited (may be it was possible 1 year ago but not now)","timestamp":"1666697820.0","comment_id":"703812","upvote_count":"3","poster":"Fcnet"}],"comment_id":"679076","timestamp":"1664129640.0","poster":"zol95"},{"comment_id":"905268","content":"But you can go to O365 Admin Center -> Users -> Active Users, select the user -> Account -> Manage groups and assign the group to the user.\nSo technically you added the user to the group.","timestamp":"1684879500.0","upvote_count":"1","poster":"Chris7910"}],"poster":"zol95","timestamp":"1664129340.0","content":"You are incorrect. Tested in Lab environment:\nIn the M365 admin center, only users can be added to the mail-enabled security group.\nYou can only add licensed users to the group, unlicensed users won't even show up on the member select page. Correct answer is definitely E."}]}],"content":"Selected Answer: E\nThe answer is E - User2 Only. When you try to add a member to a Mail-enabled Security Group, you won't be able to see unlicensed Users. I had to test this when I saw contradictory comments.","upvote_count":"21","comment_id":"506102","timestamp":"1640090400.0"},{"content":"Selected Answer: D\nI was able (from the 365 admin center) to go to the unlicensed user, go to their group listings and add them to the mail enabled security group. However, I could not add the user while going to the group itself and trying to add the member that way. As from Entra, it does not tie down to a license for memberships, so it should also allow. So answer is D. Microsoft may want answer E, but this is the real world and the real world shows D.","upvote_count":"1","poster":"Obi_Wan_Jacoby","comment_id":"1559108","timestamp":"1744159080.0","comments":[{"timestamp":"1744237500.0","comment_id":"1559396","upvote_count":"1","poster":"Obi_Wan_Jacoby","content":"Answer is still D, but I wanted to update. Within Entra I could neither add the group via the user properties nor add the users via the group properties. So the only way you can do this is via the Admin center. I also tried this from the azure portal and had the same issue as in Entra."}]},{"upvote_count":"3","comment_id":"1392077","content":"Selected Answer: D\nCorrect answer is D.\n\nOnly users & service principals are able to be added to mail-enabled security groups (groups cannot be nested). Being added to a security group does not depend on licensing, so both users are eligible.","poster":"noa808a","timestamp":"1741889700.0"},{"upvote_count":"1","comment_id":"1340336","poster":"Oskarma","content":"Selected Answer: D\nI've just added a user without license to a mail enabled security group in my tenant. And you can't add security groups to mail enabled security groups: https://learn.microsoft.com/en-us/entra/fundamentals/how-to-manage-groups#:~:text=Adding%20security%20groups%20as%20members%20of%20mail%2Denabled%20security%20groups.","timestamp":"1736857200.0"},{"comments":[{"comment_id":"1347583","timestamp":"1738013580.0","content":"You could not be more wrong, Entra ID does not require users to be licensed to be added to a mail-enabled security group.\nUnlicensed users can still be added as members because group membership management in Entra ID is independent of licensing.","poster":"Frank9020","upvote_count":"1"}],"content":"Selected Answer: E\nTo get an email you need the licence:D\nCannot add Security groups that may have users without licenses duh.! ^^","timestamp":"1736150760.0","comment_id":"1337018","upvote_count":"2","poster":"test123123"},{"poster":"saha241108","comment_id":"1336956","upvote_count":"1","content":"Selected Answer: C\nbecome a member of mail enabled security group there has no pre-requisite like license user or not. you can add user as well as group as a member of group. So, the correct answer should be C","timestamp":"1736135400.0"},{"comment_id":"1330230","upvote_count":"3","timestamp":"1734831780.0","poster":"Matt19","content":"Selected Answer: D\nUnlicensed user can be added to a MESG NOW on Entra so D"},{"timestamp":"1728974820.0","comment_id":"1298018","upvote_count":"3","content":"Selected Answer: D\nI tested it, and a user with no license can be added to the MESG, done in it from the entra admin center","poster":"doori88"},{"comment_id":"534273","upvote_count":"2","timestamp":"1727082300.0","content":"Add a group to another group\nYou can add an existing Security group to another existing Security group (also known as nested groups), creating a member group (subgroup) and a parent group. The member group inherits the attributes and properties of the parent group, saving you configuration time.\n\n Important\n\nWe don't currently support:\n\nAdding groups to a group synced with on-premises Active Directory.\nAdding Security groups to Microsoft 365 groups.\nAdding Microsoft 365 groups to Security groups or other Microsoft 365 groups.\nAssigning apps to nested groups.\nApplying licenses to nested groups.\nAdding distribution groups in nesting scenarios.\nAdding security groups as members of mail-enabled security groups\nhttps://docs.microsoft.com/en-us/azure/active-directory/fundamentals/active-directory-groups-membership-azure-portal","poster":"MaxLily"},{"content":"The question is clearly about the AAD/Entra ID not 365admin portal. Please let us know how you exactly do the lab in detail, as I see allot of labs done that are not important with this question","poster":"loukyexamtopic","timestamp":"1721994000.0","comment_id":"1255693","upvote_count":"1"},{"content":"No license - No Money","poster":"HartMS","comment_id":"1195221","timestamp":"1713060360.0","upvote_count":"2"},{"poster":"penatuna","upvote_count":"3","comment_id":"1149828","timestamp":"1707885180.0","content":"Selected Answer: D\nTested in my tenant. D is the correct answer, if you can use M365 admin center.\n\nAzure portal / Entra - Cannot add members to mail enabled group. Cannot add Mail-enabled groups to users.\n \nMicrosoft 365 admin center - Can add only User2 to Group3. Can add Group3 to both User2 and User3.\n \nExchange portal - Can add only User2 to Group3. Cannot add groups to users, cause there’s no user blade in Exhange portal."},{"content":"E. User2 only, because only mailboxed users can be added to the MailEnable Security Group.\nTested","upvote_count":"1","timestamp":"1707589500.0","comment_id":"1146570","poster":"RahulX"},{"poster":"lojlkdnfvlirez","content":"the correct anwser is \"D\": User1 and User2 only, the question is Which objects can you add as members to Group3?","timestamp":"1702994640.0","comment_id":"1100680","upvote_count":"1"},{"poster":"RahulX","comment_id":"1083332","content":"The Correct ans is User 2.\nUser 2 has valid exol license, thus having smtp address. \nTested on Lab: Only user and DL can be added into M365 Mail enabled security group.","timestamp":"1701251820.0","upvote_count":"2"},{"upvote_count":"2","timestamp":"1696768500.0","comment_id":"1027959","poster":"JCkD4Ni3L","content":"Selected Answer: D\nAdd user to the domain contacts in the admin center, then you will be able to add it to your mail-enabled SG. I do this on a regular basis.. answer is « D »."},{"comment_id":"1019546","content":"Selected Answer: E\nTested in lab, you can't assign security/m365 groups, neither an unlicensed group.","upvote_count":"3","timestamp":"1695884940.0","poster":"Softeng"},{"upvote_count":"1","comment_id":"1015776","poster":"Bear4","content":"I can add a other mail enabled security group? So User 2 and Group 3.","timestamp":"1695559560.0"},{"comment_id":"998986","upvote_count":"1","poster":"syougun200x","content":"As of today, when I tested in my tenant, User 1 and user 2 can be added. No groups appear to choose from in the list.","timestamp":"1693883460.0"},{"poster":"edmca","upvote_count":"1","content":"D is correct. I tried to add to create a test mail-enabled sec group and tried to add an unlicensed user from Exchange admin center but the system would not let me, however, you can go to O365 Admin Center -> Users -> Active Users, select the user -> Account -> Manage groups and assign the group to the user. The unlicensed user won't be able to receive the mail since it doesn't have any mail related license","comment_id":"983163","timestamp":"1692235560.0"},{"content":"Selected Answer: E\nIt's E: User 2 only\nThe Identity needs to have a mailbox.\nSo only Users with a mailbox, shared mailbox identities and Mail-Enabled security groups can be added.\n\n- Mail-enabled security groups cannot contain M365 groups or Security groups, but they can contain other Mail-Enabled Security Groups.\n- M365 Groups cannot contain other groups in general.","timestamp":"1691643960.0","comment_id":"977288","upvote_count":"4","poster":"EmnCours"},{"content":"This is an exam for Azure, they don't want you touching admin center for this...The answer is E","comment_id":"929816","timestamp":"1687371900.0","poster":"zyhke","upvote_count":"3"},{"poster":"Holii","content":"Why is it not A?\nI tried unlicensed users. Couldn't add them. So it's definitely either A or E.\n\nI tried unlicensed Microsoft 365 Groups. It worked. I tried sending out an email to the mail-enabled security group and it sent the email out to all the users part of the Microsoft 365 group.\nThe question says \"Directly assigned license\", you can definitely have a Microsoft 365 group without a license directly assigned, but have users with licenses and the flow will work as expected...\nAre we to assume they mean an unlicensed Microsoft 365 Group *with* unlicensed users?","comment_id":"916487","timestamp":"1686071340.0","comments":[{"comment_id":"916493","timestamp":"1686072000.0","upvote_count":"1","poster":"Holii","content":"Update: These were groups that were additionally registered as Distribution Groups, not solely Microsoft 365 Groups.\n\nAnswer is E."}],"upvote_count":"1"},{"comment_id":"904205","poster":"dule27","upvote_count":"3","content":"Selected Answer: E\nE. User2 only","timestamp":"1684772520.0"},{"content":"Selected Answer: E\nE is correct","timestamp":"1684077720.0","upvote_count":"3","poster":"ShoaibPKDXB","comment_id":"897652"},{"timestamp":"1683523380.0","poster":"OK2020","comment_id":"891830","content":"Selected Answer: E\nWhich Microsoft 365 plans include groups?\nAny Microsoft 365 subscription that has Exchange Online and SharePoint Online will support groups. That includes the Business Essentials and Business Premium plans, and the Enterprise E1, E3, and E5 plans. The group takes on the licensing of the person who creates the group (also known as the \"organizer\" of the group). As long as the organizer has the proper license for whatever features you want the group to have, that license will convey to the group.\n\nhttps://learn.microsoft.com/en-us/microsoft-365/admin/create-groups/office-365-groups?view=o365-worldwide","upvote_count":"4"},{"content":"Selected Answer: E\nIt's E: User 2 only\n The Identity needs to have a mailbox.\n So only Users with a mailbox, shared mailbox identities and Mail-Enabled security groups can be added.\n\n- Mail-enabled security groups cannot contain M365 groups or Security groups, but they can contain other Mail-Enabled Security Groups.\n- M365 Groups cannot contain other groups in general.","poster":"f2bf85a","comment_id":"876266","upvote_count":"3","timestamp":"1682063520.0"},{"poster":"ccadenasa","upvote_count":"1","content":"User2 only. Tested in my lab","timestamp":"1678271520.0","comment_id":"832817"},{"timestamp":"1677143460.0","poster":"ra1paul","comment_id":"819010","content":"D is the correct answer. \nYou can add a shared mailbox without license to a Mail enabled security group from EAC.","upvote_count":"1"},{"poster":"AlanWake69","timestamp":"1672016280.0","comment_id":"756112","content":"Selected Answer: E\nTested in labs. Only users with License.","upvote_count":"8"},{"upvote_count":"3","content":"I would like to share why I choose User1 and User2. Obviously User1 has no license, but anyway it can be the user of a shared mailbox or it can be configured as a mail enabled user.","timestamp":"1671468300.0","comment_id":"750041","poster":"MarcoHurry","comments":[{"upvote_count":"1","timestamp":"1672093140.0","content":"First tested for a user of a shared mailbox from Exchange Admin Center, Microsoft 365 Admin Center and it works ! Then for a unlicensed user without a shared mailbox and it works too ! You can't add any user in a mail-enabled security group from Azure Active Directory Admin Center.","comment_id":"757890","poster":"Ludosan","comments":[{"poster":"Ludosan","timestamp":"1672093800.0","comment_id":"757892","upvote_count":"1","content":"For an unlicensed user without a shared mailbox, it works from Microsoft 365 Admin Center but not from (New) Exchange Admin Center."}]}]},{"upvote_count":"3","comment_id":"724349","timestamp":"1669124940.0","content":"Selected Answer: E\nTested. Unlicensed users and the groups don't show up as eligible members to add to the group. Not even that \"licensed\" security group. smh","poster":"Jhill777"},{"upvote_count":"1","poster":"ANDRESCB1988","timestamp":"1667870220.0","comment_id":"713390","content":"Los usuarios deben tener una licencia de exchange para poder anadirse a un grupo mail-enabled.\nSolo el usuario 2 puede anadirse al grupo."},{"poster":"LHADUK","content":"it's definitely answer D! \nadmin center - groups - distribution group - add members - you cannot find user without licence and you can't add it to distribution group\n admin center - active users - select unlicensed user, under account choose group - manage groups - assign membership - select distribution group and add. \nTry for yourself, correct answer is D - user 1 and user 2!","comment_id":"712987","upvote_count":"5","timestamp":"1667819040.0"},{"poster":"Jawad1462","timestamp":"1667468640.0","upvote_count":"3","content":"Selected Answer: E\nCorrect answer only licensed users can be assigned","comment_id":"710391"},{"comment_id":"708955","poster":"Magis","content":"Selected Answer: D\nCorrect is D. Tested it today.\n\nYou cannot add unlicensed users during group creation phase but you can do it latter.\n\nTry this workflow:\n1. Create Mail Enabled Security Group.\n2. Go to Unlicensed User settings.\n3. Modify unlicensed user group membership and you can select and add him to mail enabled security group.\n\nIt make sense to me as this group have two purposes:\n1. Distribute emails to all members.\n2. Provide access to One Drive and SharePoint resources. \n\nSo you really do not need to be licensed O365 users to get security settings applied by this group.","timestamp":"1667290320.0","upvote_count":"4"},{"content":"User2 only yes \nwhen you try to add a member fraom the group (mail enabled sec) from admin center you can't see any users without license, you are just able to see those with license with is logic (as it is a mail enabled group)","timestamp":"1666697580.0","upvote_count":"1","comment_id":"703805","poster":"Fcnet"},{"timestamp":"1664408220.0","content":"Selected Answer: D\nJust tested for myself... not even able to manage this in Azure AD; have to use M365 and it allows you to add unlicensed and licensed users.","poster":"Boogs","upvote_count":"2","comment_id":"682201"},{"upvote_count":"3","content":"Selected Answer: E\nTested in Lab environment:\n\nMail enabled Security Group can only be managed in the M365 Admin Center.\nIn AAD, you can't modify the membership. - \"Some groups can't be managed in the Azure Portal.\"\n\nIn the M365 admin center, only users can be added to the mail-enabled security group.\n\nYou can only add licensed users to the group, unlicensed users won't even show up on the member select page. \n\nCorrect answer is definitely E.","poster":"zol95","comments":[{"timestamp":"1664129700.0","content":"Correction!\nIf you open the mail enabled SG, then you won't be able to add the user, but if you open the unlicensed users from Users/Active Users/\"user\"/Groups/Manage groups then you can add the unlicensed user to the mail-enabled SG... Correct answer is D.","upvote_count":"1","comment_id":"679077","poster":"zol95"}],"comment_id":"679068","timestamp":"1664129220.0"},{"upvote_count":"4","timestamp":"1664061240.0","comment_id":"678280","poster":"samir45","content":"Selected Answer: E\nYou can't add a group to a mail-enabled security group. Also, you cannot add non-license users to this group."},{"content":"Selected Answer: D\nLiterally just tested this in my lab. Answer is D.\nFirst off, you can only add users to Group3 via the admin.microsoft.com portal. Second, you can add both User 1 and User 2 (unlicensed and licensed) to Group3, which is also licensed.","timestamp":"1662840300.0","poster":"w00t","comment_id":"665655","upvote_count":"2"},{"timestamp":"1661713140.0","content":"Selected Answer: E\nE for sure","poster":"hb0011","comment_id":"653113","upvote_count":"3"},{"content":"Selected Answer: E\nCan't add user without License to a Mail enabled security group.\nAnd can't as M365 group, security group as well. \nTested and confirming","upvote_count":"3","timestamp":"1661101800.0","comment_id":"649834","poster":"YuvaRajaVignesh"},{"poster":"Flacky_Penguin32","upvote_count":"1","comment_id":"638938","content":"Selected Answer: D\nAgree with others it's D; sneaky.","timestamp":"1659055980.0"},{"timestamp":"1657445640.0","poster":"Seed001","upvote_count":"2","content":"https://docs.microsoft.com/en-US/microsoft-365/admin/create-groups/compare-groups?WT.mc_id=365AdminCSH_inproduct&view=o365-worldwide","comment_id":"629508"},{"upvote_count":"2","poster":"CharlieMike","comment_id":"628920","content":"Selected Answer: D\nUnlicensed can be added via Admin center","timestamp":"1657321020.0"},{"content":"Selected Answer: D\nThe MS article below implies that you can add members that are not mail enabled, including that such group can be used for other means than messaging, such as adding access to resources.\n\nThe article advised the following;\nIf a mail-enabled security group contains members that aren't mail-enabled, a non-delivery report (also known as an NDR or bounce message) is returned for those non-mail-enabled members when you send a message to the group. To prevent NDRs, you can expand the group members in the To field of the message before you send the message (only the mail-enabled members of the group will appear).\n\nhttps://docs.microsoft.com/en-us/exchange/recipients/mail-enabled-security-groups?view=exchserver-2019","upvote_count":"2","poster":"RandomNickname","timestamp":"1654537140.0","comments":[{"upvote_count":"1","comments":[{"comment_id":"612676","upvote_count":"2","poster":"RandomNickname","timestamp":"1654596900.0","content":"**Correction take 2**\nFrom 365 Admin center, via the user account then selecting Groups & Manage Groups, you can actually add a user this way to a mail enabled security group.\nSo first answer applies, D being correct, any user mail enabled or not.\n:)"}],"comment_id":"612672","poster":"RandomNickname","timestamp":"1654596360.0","content":"**Correction**\n\nTesting on MS 365 tenant, on GUI on home page in Teams&Groups or Exchange, you don't have an option to select any non mail enable accounts, so searching only shows mail enabled accounts.\nChecking in AZAD, and attempting to add a non mail enable user account to a mail enabled group, the group itself is actually greyed out and a message is displayed \"Mail-Enabled security groups are not allowed\"\nHowever you can add non mail enabled user to MS365 Groups and Distribution lists that are mail enabled."}],"comment_id":"612459"},{"poster":"DemekeAd","content":"the Answer is E\nprohibited for below membership:\nAdding groups to a group synced with on-premises Active Directory.\nAdding Security groups to Microsoft 365 groups.\nAdding Microsoft 365 groups to Security groups or other Microsoft 365 groups.\nAssigning apps to nested groups.\nApplying licenses to nested groups.\nAdding distribution groups in nesting scenarios.\nAdding security groups as members of mail-enabled security groups\nhttps://docs.microsoft.com/en-us/azure/active-directory/fundamentals/active-directory-groups-membership-azure-portal","comment_id":"584539","upvote_count":"1","timestamp":"1649745060.0"},{"poster":"Sh1rub10","upvote_count":"2","content":"Selected Answer: E\nCorrect","timestamp":"1648450380.0","comment_id":"576671"},{"poster":"stromnessian","content":"Selected Answer: E\nJust tested this. I could not add users that didn't have a license.","upvote_count":"2","timestamp":"1646498040.0","comment_id":"561521"},{"poster":"xDinoKoalax","timestamp":"1646317920.0","comment_id":"560122","upvote_count":"2","content":"TBH, this question is pretty simple, if you notice that mail-enabled SG should be only managed under EAC or Admin Center. And when you search for adding members under Admin Center\\Groups - you'll find out the answer is User2 Only."},{"poster":"GPerez73","comment_id":"539904","content":"Technically, it is possible. I have added non-license users to a MESG. So answer would be D. But does it make sense? a non-license user doesn't have an email or teams. So, what would the be the reason to assign it to a MESG?","upvote_count":"2","timestamp":"1643914440.0"},{"upvote_count":"2","content":"you can add both licensed and un-licensed user, just tested. Correct answer should be D.","comment_id":"539682","timestamp":"1643890800.0","poster":"ankush_MS"},{"timestamp":"1639142760.0","upvote_count":"2","content":"tested this in my lab and only licensed users are able to be added to a mailed enabled security group. Has to be done EAC portal. User without license did not show up when tried to add members but when I assigned a license to the user they showed. Answer is E","comment_id":"498652","poster":"PrimeTime09"},{"timestamp":"1638871140.0","poster":"Prianishnikov","upvote_count":"5","comment_id":"495857","content":"Selected Answer: D\nI just tested this case. I can add unlicensed user from M365 portal and EXO admin center, so answer is D.","comments":[{"upvote_count":"1","comment_id":"512186","poster":"KennethYY","content":"You have to distinguish between Security group and mail-enabled security group","timestamp":"1640783160.0"}]},{"content":"If I had the option of User 2 and Group 1 would that be also right considering that they are both licensed?","comments":[{"comment_id":"600956","timestamp":"1652416320.0","poster":"jilly78","upvote_count":"1","content":"no. you can't nest mail-enabled security groups"}],"upvote_count":"1","timestamp":"1637165100.0","comment_id":"480123","poster":"Deorla"},{"comment_id":"445131","upvote_count":"5","poster":"NickDouglas","comments":[{"timestamp":"1649328900.0","upvote_count":"2","poster":"Nilz76","content":"Incorrect on 1st Part: Mail-Enabled Security Groups can be created from Microsoft 365 Admin Center or Exchange Admin Center. I've just created one now. \nCorrect on 2nd Part: If I go into the group (via M365 Admin Center) and add a member, (like the question suggests) I can only add the Licensed Users (unlicensed users do not show up) - Answer to me is User 2 Only.","comment_id":"582368"}],"timestamp":"1631699460.0","content":"mail-enabled security group can only be created from Exchange Online portal , user doesn't have license cannot be added , hence Answer is E: User 2 only"},{"upvote_count":"2","comment_id":"432117","content":"False !!! i just tested it, i added a guest user ( no licence from my tenant) on a mail-enabled security group. Correct answer D","poster":"Angby","timestamp":"1629968880.0"},{"content":"In case similar question arise, from my lab we can add also guest users in MESG","timestamp":"1627279620.0","poster":"Jt909","comment_id":"414438","upvote_count":"2"},{"upvote_count":"1","poster":"melatocaroca","content":"Tricky question IMHO C\n\n Mail-enabled security Group is an Active Directory Universal group not a Microsoft 365 / Office 365 groups\n\nActive Directory Universal group can contain users, computer, global groups and other universal group, can be used to assign access permissions to resources in Active Directory and can also be used to distribute messages. Can contain Microsoft 365 security groups if group writeback is enabled on AD connect. Does not depend on license assign like Microsoft 365 security groups","comment_id":"405588","comments":[{"upvote_count":"3","content":"Fixing my previous assumption Azure Active Directory (Azure AD) tenant , so mail enabled group is not from AD, is form AAD, so Microsoft 365 groups are used for collaboration, giving members access to a shared mailbox, calendar, files, SharePoint site, and so on. Group members can only be users.\nUser member do need to have an Office 365 license assigned, so answer IMHO must be \nD. User1 and User2 only","comment_id":"407740","timestamp":"1626426420.0","poster":"melatocaroca"}],"timestamp":"1626196380.0"},{"comment_id":"360522","upvote_count":"4","poster":"Funkydave","timestamp":"1621342800.0","content":"the answer is correct. \ngroup is a \"mail-enabled security group\" which can contain only distribution groups, other mail-enabled security groups or users."},{"timestamp":"1620839160.0","comment_id":"355668","upvote_count":"2","poster":"arghhhh","content":"Incorrect, a license is required. Try it out on your tenant."},{"timestamp":"1620241860.0","content":"D - only users can be members of email enabled sec groups. They do not need a license to be a member.","comment_id":"350532","poster":"Val_0","upvote_count":"5"},{"timestamp":"1620211260.0","comment_id":"350201","poster":"B0","upvote_count":"1","content":"What can I add to a Mail-enabled security group? \nDistribution groups and other mail-enabled security groups"},{"poster":"aokisan","comments":[{"timestamp":"1620213660.0","poster":"Funkydave","content":"user 1 does not have a m365 license.","upvote_count":"2","comment_id":"350233"}],"comment_id":"349340","upvote_count":"5","timestamp":"1620126300.0","content":"the answer is D. User can be a member of SG."}],"url":"https://www.examtopics.com/discussions/microsoft/view/51784-exam-sc-300-topic-1-question-7-discussion/","answer_images":[],"answer":"E","answer_ET":"E","answers_community":["E (68%)","D (31%)","1%"],"isMC":true,"question_id":66,"question_text":"You have an Azure Active Directory (Azure AD) tenant that contains the objects shown in the following table.\n//IMG//\n\nWhich objects can you add as members to Group3?","timestamp":"2021-05-04 13:05:00","choices":{"C":"User1, User2, Group1 and Group2","A":"User2 and Group2 only","D":"User1 and User2 only","B":"User2, Group1, and Group2 only","E":"User2 only"},"unix_timestamp":1620126300},{"id":"80pG3l3pT4vLVgyxTeCP","url":"https://www.examtopics.com/discussions/microsoft/view/132162-exam-sc-300-topic-1-question-70-discussion/","question_text":"HOTSPOT -\n\nYou have a Microsoft Entra tenant that has a Microsoft Entra ID P2 service plan. The tenant contains the users shown in the following table.\n\n//IMG//\n\n\nYou have the Device settings shown in the following exhibit.\n\n//IMG//\n\n\nUser1 has the devices shown in the following table.\n\n//IMG//\n\n\nFor each of the following statements, select Yes if the statement is true. Otherwise. select No.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_description":"","timestamp":"2024-01-25 22:04:00","exam_id":123,"topic":"1","isMC":false,"answer_ET":"","question_id":67,"unix_timestamp":1706216640,"discussion":[{"poster":"Anusha_2000","content":"No\nYes\nNo","comment_id":"1132544","timestamp":"1706275920.0","upvote_count":"27"},{"comments":[{"comments":[{"comment_id":"1145232","poster":"penatuna","content":"NOTE:\nAdditional local administrators on Microsoft Entra joined devices: This setting allows you to select the users who are granted local administrator rights on a device. These users are added to the Device Administrators role in Microsoft Entra ID. Global Administrators in Microsoft Entra ID and device owners are granted local administrator rights by default. This option is a premium edition capability available through products like Microsoft Entra ID P1 or P2 and Enterprise Mobility + Security.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/devices/assign-local-admin\nhttps://learn.microsoft.com/en-us/azure/active-directory/devices/concept-azure-ad-register\nhttps://learn.microsoft.com/en-us/entra/identity/devices/assign-local-admin#manage-administrator-privileges-using-microsoft-entra-groups-preview\nhttps://learn.microsoft.com/en-us/entra/identity/devices/manage-device-identities","timestamp":"1707452460.0","upvote_count":"9"}],"comment_id":"1145231","timestamp":"1707452400.0","content":"2) YES\nAdmin1 is a Cloud Device Administrator. You must be assigned one of the following roles to manage device settings:\n• Global Administrator\n• Cloud Device Administrator\nhttps://learn.microsoft.com/en-us/azure/active-directory/devices/device-management-azure-portal#configure-device-settings\n\n3) NO\nThis only applies to Win 10/11 Entra JOINED devices. This device is only registered.","upvote_count":"14","poster":"penatuna"}],"upvote_count":"12","comment_id":"1145230","content":"1) NO\nMaximum number of devices: This setting enables you to select the maximum number of Microsoft Entra joined or Microsoft Entra registered devices that a user can have in Microsoft Entra ID. If users reach this limit, they can't add more devices until one or more of the existing devices are removed. The default value is 50. You can increase the value up to 100. If you enter a value above 100, Microsoft Entra ID sets it to 100. You can also use Unlimited to enforce no limit other than existing quota limits.\nNote! The Maximum number of devices setting applies to devices that are either Microsoft Entra joined or Microsoft Entra registered. This setting doesn't apply to Microsoft Entra hybrid joined devices.\nhttps://learn.microsoft.com/en-us/azure/active-directory/devices/device-management-azure-portal#configure-device-settings","timestamp":"1707452400.0","poster":"penatuna"},{"comment_id":"1365903","poster":"d1e85d9","content":"1. No - max 5 device. \n2. No - Cloud Device Administrator role cannot change MFA settings for Azure Entra devices.\n3. No - this is only registered.","upvote_count":"1","timestamp":"1741271040.0"},{"timestamp":"1739992140.0","poster":"YesPlease","content":"1) No: MS Entra limits reflect both Registered and JOINED\n\nhttps://learn.microsoft.com/en-us/mem/intune/enrollment/device-limit-intune-azure#microsoft-entra-device-limit\n\n2) No: Cloud Device Administrator can only ENABLE, DISABLE, and DELETE devices and are not able to change any other properties.\n\nhttps://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference#cloud-device-administrator\n\n3) No: Although ADMIN2 has the right role as \"Microsoft Entra Joined Device Local Administrator\", the device is only REGISTERED and not JOINED so permissions are not valid locally.\n\nhttps://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference#microsoft-entra-joined-device-local-administrator","upvote_count":"1","comment_id":"1358926"},{"upvote_count":"1","timestamp":"1732500240.0","comment_id":"1317291","poster":"rtsh06","content":"This is based on my understanding.\n\nExplanation: \nBox 1: No. User1 already has 4 devices registered under his name and there is limit to register max 5 devices. Hence User 1 can register additional 1 device only. \n\nBox 2: Yes. I tested this condition in my test tenant, I was able to change the Require Multi-Factor Authentication from No to Yes. \n\nBox 3: No. Condition 3 is applicable to Win 10/11 Entra Joined devices. The keyword is JOINED. Device 3 is Entra Registered."},{"upvote_count":"1","content":"No\nNo\nNo","timestamp":"1731356580.0","poster":"MadsB","comment_id":"1310308"},{"content":"When maximum number of devices limit is set in Azure tenant, it is basically irrelevant of Entra Joint or Entra registered devices? My idea was answer to 1 would be yes, becuase there was only 1 Entra Joined device, but in discussion pannel i have realised it is different.","upvote_count":"1","timestamp":"1729670640.0","comment_id":"1301943","poster":"BRZSZCL"},{"timestamp":"1725238920.0","poster":"hml_2024","upvote_count":"3","content":"Check Question 21\n\nYes \nNo\nNo","comment_id":"1276281"},{"comment_id":"1249741","timestamp":"1721230740.0","upvote_count":"3","poster":"thetootall","content":"1) NO\nMaximum number of devices: 5\nUser already has 4 in Entra - they can only add 1 more\n\n2) YES\nAdmin1 is a Cloud Device Administrator. \n\n3) NO\nThis only applies to Win 10/11 Entra JOINED devices. This device is only registered."},{"poster":"jarattdavis","timestamp":"1720863000.0","content":"1. NO = Devices already added: 2 (1 Microsoft Entra joined + 1 Microsoft Entra registered). Remaining devices you can add: 5 - 2 = 3. So, you can add 3 additional Windows 10 devices, whether they are Microsoft Entra joined or Microsoft Entra registered.","upvote_count":"1","comment_id":"1247215"},{"poster":"NotanAdmin","timestamp":"1716180960.0","comment_id":"1214120","content":"2) No\nCloud Device Admin - This is a privileged role. Users in this role can enable, disable, and delete devices in Microsoft Entra ID and read Windows 10 BitLocker keys (if present) in the Azure portal. The role does not grant permissions to manage any other properties on the device.","upvote_count":"3"},{"upvote_count":"7","poster":"emartiy","content":"YES -1 device is joined 1 registered so user can still join 4 device to azure since count is 1/5 (join important, not register)\nNO - Cloud Device Asdmins has no privileged to perform this option.\nNO - Device is not azure joined. It is only registered. So, this option also not valid.","timestamp":"1711637820.0","comments":[{"content":"The device maximum has nothing to do with the join type, it’s an overall limit regardless join of register so the first one is a NO.","comments":[{"timestamp":"1717046100.0","upvote_count":"1","comment_id":"1221394","poster":"Alcpt","content":"correct. the answer is NO NO NO"}],"comment_id":"1202706","poster":"Futfuyfyjfj","timestamp":"1714151100.0","upvote_count":"5"}],"comment_id":"1184828"},{"timestamp":"1706255100.0","content":"No\nYes\nNo","upvote_count":"4","poster":"ELQUMS","comment_id":"1132336"},{"comment_id":"1132060","poster":"dbz_34","upvote_count":"4","timestamp":"1706216640.0","content":"no\nyes\nno"}],"answer":"","answers_community":[],"question_images":["https://img.examtopics.com/sc-300/image328.png","https://img.examtopics.com/sc-300/image329.png","https://img.examtopics.com/sc-300/image330.png","https://img.examtopics.com/sc-300/image331.png"],"answer_images":["https://img.examtopics.com/sc-300/image495.png"]},{"id":"Z4fnRIHzVzcOcsihYg3M","answer":"B","timestamp":"2024-01-24 00:55:00","isMC":true,"discussion":[{"poster":"ignitelatam","comment_id":"1130102","comments":[{"upvote_count":"1","comment_id":"1203137","poster":"Alcpt","content":"No. Don't guess. It's A.\nhttps://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions#enabling-permissions-management\nEnabling Permissions Management\nTo activate a trial or purchase a license, you must have Global Administrator permissions.","timestamp":"1714225440.0","comments":[{"upvote_count":"5","timestamp":"1719753600.0","content":"The article has been updated and now reads Billing Administrator required to purchase or active a trial. To onboard (after purchase), GA is needed. The question only asks about buying the license.","poster":"omnomsnom","comment_id":"1239654"},{"timestamp":"1716552720.0","upvote_count":"2","comment_id":"1217430","poster":"Alcpt","content":"im guessing here. yes its B. \npity there is no delete button"}]}],"content":"Selected Answer: B\nCorrect","timestamp":"1706054100.0","upvote_count":"11"},{"comment_id":"1362054","timestamp":"1740580620.0","poster":"csi_2025","upvote_count":"1","content":"Selected Answer: B\nWhat is sub1? A user? A submarine? A substitute?"},{"upvote_count":"1","poster":"YesPlease","content":"Selected Answer: B\nAnswer B) Billing Administrator\n\nBilling Administrator can: Makes purchases, manages subscriptions, manages support tickets, and monitors service health.\n\nhttps://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference#billing-administrator","timestamp":"1739998800.0","comment_id":"1358968"},{"timestamp":"1737492600.0","content":"Selected Answer: B\nB. Billing Administrator","poster":"PD1","comment_id":"1344360","upvote_count":"1"},{"poster":"mohamedbenamor","timestamp":"1732128480.0","comment_id":"1315446","upvote_count":"3","content":"Selected Answer: B\nhttps://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions#enabling-permissions-management"},{"upvote_count":"1","comment_id":"1285627","content":"It's A that i will choose!","timestamp":"1726643400.0","poster":"seleneliane"},{"upvote_count":"2","timestamp":"1719754620.0","poster":"jim85","content":"Selected Answer: B\nhttps://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions - Billing Admin","comment_id":"1239660"},{"upvote_count":"3","poster":"BMO3","timestamp":"1714017300.0","comment_id":"1201735","content":"User1 need to be able to purchase the license. Only Global admins can purchase an Entra Permissions Management license, as stated in MS docs: https://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions"},{"content":"Selected Answer: B\nhttps://learn.microsoft.com/en-us/entra/permissions-management/onboard-enable-tenant","comment_id":"1194358","comments":[{"content":"No. You enable MEPM via billing admin. You use Global admin to buy licenses. Read the question. Don't guess.","timestamp":"1714225620.0","poster":"Alcpt","comment_id":"1203140","upvote_count":"1"}],"upvote_count":"1","timestamp":"1712928240.0","poster":"criminal1979"},{"timestamp":"1711637880.0","upvote_count":"1","comment_id":"1184829","content":"Selected Answer: B\nCorrect","poster":"emartiy"},{"timestamp":"1711259760.0","upvote_count":"1","poster":"Menard001","content":"Selected Answer: B\nThe solution must follow the principle of least privilege.\n\nis the global admin is least privilege account?\nI think that is billing admin","comment_id":"1181338"},{"poster":"penatuna","upvote_count":"3","timestamp":"1707367860.0","content":"Selected Answer: A\nI would say A. Global Administrator. \n\n\"To activate a trial or purchase a license, you must have Global Administrator permissions.\"\nhttps://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions#enabling-permissions-management\n\n\"There are two ways to activate a trial or a full product license.\nThe first way is to go to the Microsoft 365 admin center.\n• Sign in as a Global Administrator for your tenant.\n• Go to Setup and sign up for a Microsoft Entra Permissions Management trial.\n• For self-service, Go to the Microsoft 365 portal to sign up for a 45-day free trial or to purchase licenses.\nThe second way is through Volume Licensing or Enterprise agreements.\n• If your organization falls under a volume license or enterprise agreement scenario, contact your Microsoft representative.\"\nhttps://learn.microsoft.com/en-us/entra/permissions-management/onboard-enable-tenant#activate-a-free-trial-or-paid-license","comment_id":"1144071","comments":[{"upvote_count":"1","timestamp":"1711259820.0","content":"The solution must follow the principle of least privilege.\n\nis the global admin is least privilege account?\nI think that is billing admin","comment_id":"1181339","poster":"Menard001"},{"timestamp":"1710369900.0","poster":"Millla","content":"Correct answer","comment_id":"1172948","upvote_count":"1"},{"upvote_count":"1","poster":"penatuna","comment_id":"1144072","comments":[{"content":"This is in yesterday exam. I choose \"C\".","upvote_count":"1","comment_id":"1285485","poster":"hml_2024","timestamp":"1726613460.0"},{"content":"Ok, things have changed since I answered to this question. Before the link below said Global Admin, now it says Billing Administrator:\nhttps://learn.microsoft.com/en-us/entra/permissions-management/product-roles-permissions#enabling-permissions-management","comment_id":"1214671","poster":"penatuna","timestamp":"1716259920.0","upvote_count":"1"}],"content":"Wrong Answers:\nB. Billing Administrator makes purchases, manages subscriptions, manages support tickets, and monitors service health. Can’t add role assignments so cannot activate Permissions Management Administrator role.\n\nC. Permissions Management Administrator\nAssign the Permissions Management Administrator role to users who need to do the following tasks:\n• Manage all aspects of Microsoft Entra Permissions Management, when the service is present.\n\nD. User Access Administrator is an Azure RBAC role, that lets you manage user access to Azure resources. Nothing to do with Permission Management.","timestamp":"1707367860.0"}]},{"poster":"ELQUMS","content":"Billing administrator","timestamp":"1706255100.0","upvote_count":"3","comment_id":"1132337"},{"upvote_count":"2","timestamp":"1706082960.0","content":"To complete this task, you must have at least Billing Administrator permissions. You can't enable Permissions Management as a user from another tenant who has signed in via B2B or via Azure Lighthouse.\n\nPrerequisites\nTo enable Permissions Management in your organization:\nYou must be eligible for or have an active assignment to the Permissions Management Administrator role as a user in that tenant.\n\nTherefore, I think that Permissions Management Administrator might be the best role. C.\n\nhttps://learn.microsoft.com/en-us/entra/permissions-management/onboard-enable-tenant","comment_id":"1130365","poster":"throwaway10188"}],"topic":"1","question_text":"You have an Azure subscription named Sub1 that contains a user named User1.\n\nYou need to ensure that User1 can purchase a Microsoft Entra Permissions Management license for Sub1. The solution must follow the principle of least privilege.\n\nWhich role should you assign to User1?","answer_images":[],"answers_community":["B (88%)","12%"],"url":"https://www.examtopics.com/discussions/microsoft/view/131922-exam-sc-300-topic-1-question-71-discussion/","answer_ET":"B","unix_timestamp":1706054100,"exam_id":123,"choices":{"A":"Global Administrator","D":"User Access Administrator","C":"Permissions Management Administrator","B":"Billing Administrator"},"question_id":68,"answer_description":"","question_images":[]},{"id":"tsWADAfTbiwOEtEN0wsx","url":"https://www.examtopics.com/discussions/microsoft/view/131993-exam-sc-300-topic-1-question-72-discussion/","answer_description":"","isMC":true,"discussion":[{"timestamp":"1709784780.0","poster":"penatuna","content":"Selected Answer: B\nYou need two role assignments, one for RG1 and other for RG2. If you make just one assignment for both of the Resource groups, User1 will have Virtual machine & Storage account creating rights in both resource groups. If you put the scope on Subscription or Management group that has these Resource groups, the resource groups will inherit the role assignment from higher level (parent) resource.\n\nYou can make a custom role for RG1 with permissions shown below:\n*/read - View all resources\nMicrosoft.Compute/virtualMachines/restart/action - Restart virtual machines.\nMicrosoft.Compute/virtualMachines/write - Creates a new virtual machine or updates an existing virtual machine.\nMicrosoft.Storage/storageAccounts/write - Creates a storage account with the specified parameters or update the properties or tags or adds custom domain for the specified storage account.\n\nFor RG2 you should make custom role with these permissions:\n*/read - View all resources\nMicrosoft.Compute/virtualMachines/restart/action - Restart virtual machines.","comment_id":"1167643","upvote_count":"9"},{"poster":"[Removed]","upvote_count":"5","content":"Selected Answer: C\nA. 1: Assigning a single role likely wouldn't provide all the required permissions.\nB. 2: It might be possible with two roles, but achieving granular control for resource group specific actions requires more than one.\nC. 3: This is the most likely scenario. We need separate role assignments for broader and specific resource group permissions.\nD. 4: While possible, 3 roles should be sufficient to achieve the desired outcome.\nHere's a breakdown of the minimum required RBAC role assignments:\n\nReader role: This grants User1 the ability to view all resources across the subscription, fulfilling the first requirement.\nContributor role for RG1: This grants User1 permission to create virtual machines and storage accounts within resource group RG1, addressing the needs for resource creation in a specific group.\nVirtual Machine Contributor role: This grants User1 the ability to restart virtual machines across the subscription, fulfilling the third requirement.","comment_id":"1216250","timestamp":"1716442500.0"},{"comment_id":"1411822","content":"Selected Answer: C\nReader Role at the subscription level:\n\nAllows User1 to view all resources.\nVirtual Machine Contributor Role at the subscription level:\n\nAllows User1 to restart virtual machines in any resource group.\nCustom Role at the RG1 level:\n\nIncludes permissions to create virtual machines and storage accounts in RG1.","poster":"nik_si","upvote_count":"1","timestamp":"1743273600.0"},{"poster":"ElWhitepages","comment_id":"1395592","content":"Selected Answer: C\nReader at the subscription level\nLets User1 see all resources (every RG, every resource type).\nVirtual Machine Operator at the subscription level\nLets User1 start, stop, and restart VMs anywhere in the subscription—but not create or delete them.\nContributor on RG1\nLets User1 create (and manage) any resource in RG1 (including VMs, storage accounts, etc.)\nDoes not give them creation rights in RG2 or other resource groups.","timestamp":"1741955940.0","upvote_count":"1"},{"poster":"bardock100","comment_id":"1359653","timestamp":"1740122820.0","content":"Selected Answer: C\nTo meet the requirements for User1, you will need to assign three RBAC roles:\n\nReader role at the subscription level to allow User1 to view all resources.\nVirtual Machine Contributor role at the subscription level to allow User1 to restart virtual machines.\nContributor role at the RG1 level to allow User1 to create virtual machines and storage accounts in RG1 only.\nTherefore, the minimum number of RBAC role assignments required is C. 3","upvote_count":"2"},{"comments":[{"timestamp":"1740580800.0","upvote_count":"1","content":"And than you forget that the second requirement is to restart virtual machines regardless in which RG they are.","poster":"csi_2025","comment_id":"1362067"}],"content":"Selected Answer: B\nAnswer B) 2\n\nYou can create just one custom role to create VM, restart them and the create storage account....and apply it to only RG1. Assign READER role at top level to view all resources outside of RG1.","poster":"YesPlease","comment_id":"1358978","upvote_count":"1","timestamp":"1740000480.0"},{"comment_id":"1354847","upvote_count":"1","content":"Selected Answer: B\nCan be done with 2 custom role assignments. The question doesn't explicitly state that only in-built roles can be used.","timestamp":"1739249760.0","poster":"_marc"},{"comment_id":"1344979","content":"Selected Answer: C\nThis is a retarded question. It can be either 3 or 4","poster":"JohnnyChimpo","timestamp":"1737585660.0","upvote_count":"2"},{"upvote_count":"4","comment_id":"1325632","poster":"khangkowng1","content":"Selected Answer: C\nMinimum Number of Role Assignments:\nTo meet these requirements, User1 needs a combination of Reader, Virtual Machine Contributor, and Storage Account Contributor roles. Since there is overlap in the roles that allow User1 to restart VMs and create VMs, we can optimize the number of role assignments.\n\nReader role at the subscription level.\nVirtual Machine Contributor role at RG1 (to allow both VM creation and VM restart in RG1).\nStorage Account Contributor role at RG1.\nConclusion:\nThe minimum number of role assignments required is 3.\n\nThus, the correct answer is: C. 3","timestamp":"1734010800.0"},{"comments":[{"timestamp":"1714226220.0","comment_id":"1203145","content":"Nope. \n#1 Global reader to read the entire sub,\n#2 vm contributor\n#3 vm contributor\n#4 storage account contributor","poster":"Alcpt","upvote_count":"4"},{"comments":[{"poster":"Cybersecgirl","content":"When I checked it via copiloy it says 3, while chatgpt says 4 roles. I am more confused now.","upvote_count":"1","timestamp":"1726390500.0","comment_id":"1284002"}],"timestamp":"1711638780.0","poster":"emartiy","content":"I got this question checked via Copilot (Microsoft's ChatGpt:)) Answer is 4 roles.\n\n1-view all resource (RG1 and RG2)\n2-restart virtual machines scoped all rescource\n3-Create virtual machine (Scoped resource based Virtual Machine Contributor role for RG1) (contributor role can create VM in RG1. If this role isn't given recourse scoped, can be able create VM in RG2 and it is not wanted based on question).\n4-Create storage in RG1 (Scoped resource basedStorage Account Contributor role for RG1. If this role isn't given recourse scoped, can be able create storage in RG2 and it is not wanted based on question)","comment_id":"1184837","upvote_count":"2"}],"comment_id":"1182797","upvote_count":"4","poster":"emartiy","content":"Selected Answer: B\n2 RBAC roles are sufficient to perform what in case.","timestamp":"1711401900.0"},{"upvote_count":"5","poster":"mb0812","comment_id":"1181116","timestamp":"1711223520.0","content":"Selected Answer: C\nAnswer has to be C\nView all resources: READER role\nRestart virtual machines (it means RG1 and RG2 machines): VM contributor role\nCreate VM/Storage accounts in RG1: Contributor role for RG1"},{"upvote_count":"3","timestamp":"1709071620.0","comments":[],"content":"Selected Answer: B\n2 roles are sufficient:\n- Reader on the subscription level. It fulfills the 1st requirement.\n- Contributor or Owner on RG1, which fulfills the 2nd requirement\n- There is nothing to do with RG2 because it's empty (I assume). So, no role should be assigned.","poster":"Ragdoll","comment_id":"1161021"},{"comment_id":"1152278","content":"Selected Answer: C\nTo enable User1 to perform the specified tasks in Azure, you would need at least three role-based access control (RBAC) role assignments:\n\nReader Role: This role allows User1 to view all resources in both resource groups, RG1 and RG2.\n\nVirtual Machine Contributor Role: This role permits User1 to restart virtual machines. It should be assigned at the scope of both RG1 and RG2 to cover all virtual machines.\n\nContributor Role for RG1: This role allows User1 to create virtual machines and storage accounts, but it should be assigned specifically to RG1 only.\n\nTherefore, the minimum number of RBAC role assignments required is 3, making option C the correct answer.","upvote_count":"4","timestamp":"1708124640.0","poster":"Sozo"},{"comments":[{"comment_id":"1298447","poster":"enklau","upvote_count":"1","timestamp":"1729027920.0","content":"yes i think the same"}],"poster":"Doinitza","timestamp":"1707818340.0","comment_id":"1149053","content":"It's 2 (B), by adding custom role/s.","upvote_count":"4"},{"poster":"loaysalameh","upvote_count":"5","timestamp":"1706716080.0","content":"Selected Answer: C\n3 roles\nAssign User1 the \"Reader\" role at the subscription level to view all resources.\nAssign User1 the \"Virtual Machine Contributor\" role at the RG1 level to restart virtual machines and create virtual machines in RG1 only.\nAssign User1 the \"Storage Account Contributor\" role at the RG1 level to create storage accounts in RG1 only.","comment_id":"1136933"},{"poster":"SFAY","upvote_count":"3","timestamp":"1706522460.0","content":"Selected Answer: C\nIf least privilege is not a concern then you just need one role - Contributor for both R1 and R2\nHowever, I believe we will always want least privileges and in that case you will need three RBAC roles:\nReader - to view all resources in r1 and r2 as there are other resources besides VMs and SAs in the RGs.\nVM Contributor - To create & restart VMs\nStorage Account Contributor - To create storage accounts","comment_id":"1134809"},{"comments":[{"poster":"dbz_34","upvote_count":"1","content":"i'm sorry i read the question too quickly only on rg1 to create a storage account and a virtual machine","comment_id":"1132088","timestamp":"1706218380.0"}],"upvote_count":"1","comment_id":"1132081","timestamp":"1706217840.0","poster":"dbz_34","content":"Selected Answer: A\ntechnically 1 role is possible since the question doesn't require the use of the least privileges the role of contributor could suffice?"},{"content":"You can TECHNICALLY provide all of it is requested with 2 roles (which the question is asking for) but if you wanted to be as strict as possible 4 roles would be the best IMO.","comment_id":"1130367","timestamp":"1706083140.0","upvote_count":"2","poster":"throwaway10188","comments":[{"content":"yes correct he asked about how many RBAC assignments not about how many roles you will choose","timestamp":"1713822000.0","upvote_count":"1","comment_id":"1200384","poster":"klayytech"}]}],"answer_ET":"C","answers_community":["C (63%)","B (35%)","2%"],"timestamp":"2024-01-24 08:59:00","question_images":[],"answer_images":[],"topic":"1","answer":"C","question_id":69,"question_text":"You have an Azure subscription that contains a user named User1 and two resource groups named RG1 and RG2.\n\nYou need to ensure that User1 can perform the following tasks:\n\n• View all resources.\n• Restart virtual machines.\n• Create virtual machines in RG1 only.\n• Create storage accounts in RG1 only.\n\nWhat is the minimum number of role-based access control (RBAC) role assignments required?","exam_id":123,"choices":{"A":"1","C":"3","D":"4","B":"2"},"unix_timestamp":1706083140},{"id":"TDTVHS3HLBK69p74mnY1","url":"https://www.examtopics.com/discussions/microsoft/view/132434-exam-sc-300-topic-1-question-73-discussion/","question_id":70,"timestamp":"2024-01-30 11:21:00","question_text":"You work for a company named Contoso, Ltd. that has a Microsoft Entra tenant named contoso.com.\n\nContoso is working on a project with the following two partner companies:\n\n• A company named A. Datum Corporation that has a Microsoft Entra tenant named adatum.com.\n• A company named Fabrikam, Inc. that has a Microsoft Entra tenant named fabrikam.com.\n\nWhen you attempt to invite a new guest user from adatum.com to contoso.com, you receive an error message.\n\nYou can successfully invite a new guest user from fabnkam.com to contoso.com.\n\nYou need to be able to invite new guest users from adatum.com to contoso.com.\n\nWhat should you configure?","question_images":[],"exam_id":123,"answer":"D","unix_timestamp":1706610060,"topic":"1","answer_description":"","answer_images":[],"discussion":[{"timestamp":"1725849000.0","comments":[{"content":"You can use an allowlist or a blocklist to allow or block invitations to B2B collaboration users from specific organizations. For example, if you want to block personal email address domains, you can set up a blocklist that contains domains like Gmail.com and Outlook.com. Or, if your business has a partnership with other businesses like Contoso.com, Fabrikam.com, and Litware.com, and you want to restrict invitations to only these organizations, you can add Contoso.com, Fabrikam.com, and Litware.com to your allowlist.\n\nYou can create either an allowlist or a blocklist. You can't set up both types of lists. By default, whatever domains aren't in the allowlist are on the blocklist, and vice versa.\n\nhttps://learn.microsoft.com/en-us/entra/external-id/external-collaboration-settings-configure\nhttps://learn.microsoft.com/en-us/entra/external-id/allow-deny-list","upvote_count":"1","poster":"penatuna","comment_id":"1169263","timestamp":"1725849060.0"}],"content":"Selected Answer: D\nYou can select “Allow invitations to be sent to any domain (most inclusive)” to allow guest invites to be sent to any domain. \n\nYou can also select “Allow invitations only to the specified domains (most restrictive)”, and add adatum.com to it.\n\nOR you can check if “Deny invitations to the specified domains” is selected, and contoso.com is in there.\n\nHowever, you can find all of the above in Microsoft Entra admin centre | External Identities | External collaboration settings | Collaboration restrictions.","comment_id":"1169262","poster":"penatuna","upvote_count":"6"},{"comment_id":"1135686","content":"You need to add adatum.com to the list of domains on External Identities >> External Collab Settings >> Collaboration Restrictions >> Allow invitations only to the specified domains.","poster":"avdan16","timestamp":"1722328980.0","upvote_count":"6"},{"timestamp":"1741779120.0","comment_id":"1387827","poster":"d1e85d9","upvote_count":"1","content":"Selected Answer: D\nThe correct answer is:\n\nD. Collaboration restrictions\n\nExplanation:\nSince you are unable to invite guest users from adatum.com but can invite users from fabrikam.com, this indicates that there is a restriction on external collaboration for certain domains.\n\nIn Microsoft Entra ID (formerly Azure AD), Collaboration restrictions allow organizations to control which external domains can be invited as guest users. If adatum.com is blocked, you will see an error when attempting to invite users from that domain.\n\nTo resolve this issue:\n\nGo to Microsoft Entra admin center.\nNavigate to External Identities > External collaboration settings.\nUnder Collaboration restrictions, check if adatum.com is blocked and remove it from the restricted list.\nThus, the correct setting to configure is Collaboration restrictions."},{"content":"Selected Answer: C\nC)\nExternal Identities | External collaboration settings | Collaboration restrictions","upvote_count":"1","poster":"bardock100","comment_id":"1359656","timestamp":"1740123780.0"},{"upvote_count":"4","content":"Selected Answer: D\nCorrect","timestamp":"1722327660.0","comment_id":"1135676","poster":"SFAY"}],"isMC":true,"answers_community":["D (92%)","8%"],"answer_ET":"D","choices":{"C":"Named locations","A":"Guest invite settings","D":"Collaboration restrictions","B":"Verifiable credentials"}}],"exam":{"name":"SC-300","isBeta":false,"lastUpdated":"12 Apr 2025","isMCOnly":false,"provider":"Microsoft","id":123,"isImplemented":true,"numberOfQuestions":383},"currentPage":14},"__N_SSP":true}