{"pageProps":{"questions":[{"id":"GxIXlwj8kobynYknvmsF","question_images":["https://img.examtopics.com/sc-300/image276.png"],"exam_id":123,"unix_timestamp":1691039880,"answer_description":"","answer_images":["https://img.examtopics.com/sc-300/image277.png"],"url":"https://www.examtopics.com/discussions/microsoft/view/117185-exam-sc-300-topic-4-question-51-discussion/","timestamp":"2023-08-03 07:18:00","question_text":"HOTSPOT\n-\n\nYou have an Azure subscription.\n\nAzure AD logs are sent to a Log Analytics workspace.\n\nYou need to query the logs and graphically display the number of sign-ins per user.\n\nHow should you complete the query? To answer, select the appropriate options in the answer area,\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","question_id":326,"answers_community":[],"answer":"","topic":"4","answer_ET":"","discussion":[{"poster":"penatuna","upvote_count":"7","timestamp":"1720144560.0","content":"SigninLogs \n| where ResultType == 0\n| summarize login_count = count() by Identity\n| render columnchart\n\nTo view and query the logs, you will need to open Log Analytics, click on your workspace and then click on the Logs page. Logs are queried using a language called Kusto Query Language (KQL).\nKusto Query Language (KQL) is a powerful tool to explore your data and discover patterns, identify anomalies and outliers, create statistical modeling, and more. The query uses schema entities that are organized in a hierarchy similar to SQLs: databases, tables, and columns.\nResultType - The result of the sign-in operation can be 0 for success or an error code for failure. In this question it shows successful logins.\nThe summarize operator is essential to performing aggregations over your data. The summarize operator groups together rows based on the by clause and then uses the provided aggregation function to combine each group in a single row.\nFind the number of events by Identity using summarize with the count aggregation function.\nRender operator instructs the user agent to render a visualization of the query results. In this question, it uses column chart.","comment_id":"1114240"},{"poster":"nils241","content":"SigninLogs\n|where ResultType == 0\n|summarize login_count = count() by Identity\n|render columnchart\n\nTest in my lab.","timestamp":"1706962680.0","upvote_count":"5","comment_id":"970989"},{"content":"this question was in exam \nSigninLogs\n| where ResultType == 0\n| summarize login_count = count() by Identity\n| render columnchart","comment_id":"1351549","timestamp":"1738697280.0","upvote_count":"2","poster":"Navros"},{"content":"- Summarize \n- Render","poster":"AK_1234","upvote_count":"1","comment_id":"1028515","timestamp":"1712639640.0"},{"poster":"kanag1","content":"Correct\nSigninLogs \n| where ResultType == 0\n| summarize login_count = count() by Identity\n| render columnchart","comment_id":"970763","upvote_count":"1","timestamp":"1706944680.0"}],"isMC":false},{"id":"g6QoalGCNrK54nKxnryk","discussion":[{"content":"Selected Answer: D\nUnsanctioning an app doesn't block use, but enables you to more easily monitor its use with the Cloud Discovery filters. You can then notify users of the unsanctioned app and suggest an alternative safe app for their use, or generate a block script using the Defender for Cloud Apps APIs to block all unsanctioned apps.\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","comments":[{"poster":"Alcpt","content":"correct answer. Easiest configuration for monitoring is D vs B.\nthis question says nothing about blocking the app.","comment_id":"1214789","upvote_count":"1","timestamp":"1716277500.0"},{"comment_id":"1129270","timestamp":"1705995180.0","upvote_count":"1","content":"If you unsanction an app, the next message is shown: \"Tag as unsanctioned?\nApps with the Unsanctioned tag will be blocked by Microsoft Defender for Endpoint. Configure the integration settings here\".","poster":"Doinitza"}],"upvote_count":"9","comment_id":"970765","poster":"kanag1","timestamp":"1691040120.0"},{"content":"Selected Answer: B\nHow does unsanctioning an app which effectively block access to the app give you an insight to which users access it on their device? i dont see how D is the answer to this question. I believe creating a CLOUD APP ACCESS POLICY is what is needed.\n\nPlease correct me if i am wrong","timestamp":"1701335820.0","comments":[{"comment_id":"1214790","upvote_count":"1","poster":"Alcpt","timestamp":"1716277560.0","content":"why do u want to block Facebook? This question says nothing about blocking the app? Dont lose context of the question"},{"upvote_count":"5","comment_id":"1086343","timestamp":"1701539100.0","content":"Yes B is the answer. Create a Defender for Cloud Apps access policy:\nCreating a Defender for Cloud Apps access policy allows you to define conditions and settings to monitor and control access to specific cloud applications, such as Facebook. This approach helps you gain insights into user activities related to Facebook without immediately blocking or unsanctioning the application.","poster":"Haerenhal"}],"comment_id":"1084139","upvote_count":"8","poster":"MacDanorld"},{"upvote_count":"1","content":"Selected Answer: D\nAnswer D) From the Microsoft Defender for Cloud Apps portal, unsanction Facebook.\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","timestamp":"1742000820.0","poster":"YesPlease","comment_id":"1395756"},{"content":"Selected Answer: D\nYou can mark a specific risky app as unsanctioned by clicking the three dots at the end of the row. Then select Unsanctioned. Unsanctioning an app doesn't block use, but enables you to more easily monitor its use with the cloud discovery filters.","timestamp":"1731491520.0","poster":"vixxx83","upvote_count":"3","comment_id":"1311201"},{"upvote_count":"1","content":"I'm going B - In response to those saying D because of administrative effort: Why Access Policy Minimizes Administrative Effort:\nAutomated Monitoring: Once the access policy is set up, it automatically tracks and logs user activity, reducing the need for manual monitoring.\n\nReal-Time Alerts: Access policies can be configured to provide real-time alerts on specific activities, enabling proactive management.\n\nComprehensive Reporting: Provides detailed reports on user activity, making it easier to identify and analyze usage patterns.\n\nIn comparison, unsanctioning Facebook (option D) would involve more ongoing manual effort to monitor and interpret usage data without the same level of automation and control.","comment_id":"1310939","poster":"Labelfree","timestamp":"1731445860.0"},{"content":"Selected Answer: B\nNeed to create a policy first so we can monitor the logs and take action, I guess B is the right option here","upvote_count":"2","comment_id":"1293986","poster":"Matt19","timestamp":"1728268860.0"},{"comment_id":"1280649","timestamp":"1725839520.0","poster":"hml_2024","content":"Selected Answer: B\no identify which users are accessing Facebook from their devices and browsers while minimizing administrative effort, you should first:\n\nB. Create a Defender for Cloud Apps access policy.\n\nA Defender for Cloud Apps access policy allows you to monitor and control user activities in cloud apps, including identifying access to unsanctioned apps like Facebook. By creating this policy, you can track user access to Facebook and enforce conditional rules if necessary.","upvote_count":"2"},{"timestamp":"1713618720.0","upvote_count":"3","poster":"rameshms85","content":"Selected Answer: D\nUnsanctioning an app doesn't block use, but enables you to more easily monitor its use with the Cloud Discovery filters","comment_id":"1199160"},{"comment_id":"1199101","upvote_count":"2","timestamp":"1713610140.0","content":"Selected Answer: B\nB. Create a Defender for Cloud Apps access policy to monitor Facebook access.\n\nThis policy will track user activity on Facebook without needing extensive configuration on individual devices.","comments":[{"timestamp":"1713639960.0","poster":"klayytech","comment_id":"1199313","upvote_count":"1","content":"1. Unsanctioning Facebook (Discovery):\n\nThis is the first step to enable monitoring.\n\nLog in to the Microsoft Defender for Cloud Apps portal.\nNavigate to Cloud Apps and then Governance.\nLocate Facebook in the list of apps.\nClick the three dots next to Facebook and select Unsanctioned."}],"poster":"klayytech"},{"poster":"KRISTINMERIEANN","timestamp":"1712820780.0","content":"Selected Answer: D\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","upvote_count":"4","comment_id":"1193530"},{"comment_id":"1176904","content":"yall are stupid asf. its D. read MS documentation before coming in here and giving wrong answers like little monkeys\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","poster":"337257e","timestamp":"1710808680.0","upvote_count":"3"},{"upvote_count":"1","poster":"Siraf","comment_id":"1159923","timestamp":"1708964220.0","content":"Correct Answer is D:\nSanctioning/unsanctioning an app: You can mark a specific risky app as unsanctioned by clicking the three dots at the end of the row. Then select Unsanctioned. Unsanctioning an app doesn't block use, but enables you to more easily monitor its use with the Cloud Discovery filters. You can then notify users of the unsanctioned app and suggest an alternative safe app for their use, or generate a block script using the Defender for Cloud Apps APIs to block all unsanctioned apps. \nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app"},{"content":"I mean it does say here on the Microsoft page itself that \"Unsanctioning an app doesn't block use, but enables you to more easily monitor its use with the Cloud Discovery filters.\" Therefore I am leaning more to answer D. https://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","comment_id":"1142122","upvote_count":"1","timestamp":"1707220980.0","poster":"jbraxton7"},{"comment_id":"1136144","poster":"Sneekygeek","comments":[{"upvote_count":"1","poster":"[Removed]","timestamp":"1711032420.0","content":"Unsanctioning doesn't auto block it, so I don't think you're correct - https://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","comment_id":"1179345"}],"timestamp":"1706646180.0","upvote_count":"3","content":"Selected Answer: B\nQuestion clearly asks to get insights into the activity not block it, which un-sanctioning would do."},{"poster":"cpaljchc4","upvote_count":"3","comment_id":"1132185","timestamp":"1706230140.0","content":"Selected Answer: B\nAgree with McDonald, I’m going to balance it up"},{"upvote_count":"3","poster":"ACSC","timestamp":"1696561380.0","content":"Selected Answer: D\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery#sanctioningunsanctioning-an-app","comment_id":"1026188"},{"upvote_count":"1","content":"such a stupid question. First you can see it anyway dont need to unsanctioned the app. I can add a random Tag too.\nIf you have MDE Integration, what you normal have if you are using CAS. Then you block unsancitoned apps automaticlly. If you enable network proteciton it will block it in all browser.","poster":"Logitech","comment_id":"1020117","timestamp":"1695921180.0"},{"upvote_count":"1","content":"Answer is to create a create a conditional access policy\n(You should create a Conditional Access policy. Conditional Access policies allow you to control access to cloud apps based on user, location, device, and app. You can create access policies for any device, including devices that aren’t Hybrid Azure AD Join and not managed by Microsoft Intune, by rolling out client certificates to managed devices or using existing certificates, such as third-party MDM certificates. For example, you can deploy client certificates to managed devices and then block access from devices without a certificate. This solution minimizes administrative effort)","timestamp":"1691838420.0","comments":[{"timestamp":"1691838540.0","poster":"sehlohomoletsane","upvote_count":"1","comment_id":"979327","content":"apologies for the double word"},{"comment_id":"988340","poster":"OutLawTheBoyzz","timestamp":"1692795300.0","content":"Read this... You can mark a specific risky app as unsanctioned by clicking the three dots at the end of the row. Then select Unsanctioned. Unsanctioning an app doesn't block use, but enables you to more easily monitor its use with the Cloud Discovery filters. You can then notify users of the unsanctioned app and suggest an alternative safe app for their use, or generate a block script using the Defender for Cloud Apps APIs to block all unsanctioned apps.\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/governance-discovery","upvote_count":"1"}],"comment_id":"979326","poster":"sehlohomoletsane"}],"answer_ET":"D","question_text":"You have a Microsoft 365 E5 subscription that uses Microsoft Defender for Cloud Apps.\n\nYou need to identify which users access Facebook from their devices and browsers. The solution must minimize administrative effort.\n\nWhat should you do first?","question_id":327,"url":"https://www.examtopics.com/discussions/microsoft/view/117186-exam-sc-300-topic-4-question-52-discussion/","choices":{"A":"Create a Conditional Access policy.","D":"From the Microsoft Defender for Cloud Apps portal, unsanction Facebook.","B":"Create a Defender for Cloud Apps access policy.","C":"Create an app configuration policy in Microsoft Endpoint Manager."},"exam_id":123,"isMC":true,"answer_description":"","answer_images":[],"topic":"4","answer":"D","unix_timestamp":1691040120,"question_images":[],"timestamp":"2023-08-03 07:22:00","answers_community":["D (53%)","B (47%)"]},{"id":"Oqf4KMQPfLLe5XQxOvhX","discussion":[{"upvote_count":"15","comment_id":"969988","poster":"nils241","timestamp":"1690968360.0","comments":[{"upvote_count":"2","comment_id":"1153514","timestamp":"1708283520.0","content":"Correct!\nNow as Microsoft Entra Roles","poster":"Sozo"}],"content":"Selected Answer: D\nA. Role does not fit\nB. Blade does not exist\nC. Makes sense only if an access review would exist\nD: Easiest way: Azure AD roles -> Assignments\n\nAny other suggestions?"},{"poster":"hml_2024","timestamp":"1726355580.0","upvote_count":"1","comment_id":"1283794","content":"Selected Answer: D\nTo identify users that are eligible for the Cloud Application Administrator role, you would need to navigate to the Azure AD roles blade in Azure AD Privileged Identity Management (PIM). This is where all the Azure AD role assignments, including eligible and active users, are managed.\n\nIn the Azure AD roles blade, you can:\n\n • View users who are assigned roles (either eligible or active).\n • Manage role assignments for Azure AD roles, such as the Cloud Application Administrator role.\n • Configure role settings like eligibility duration and activation requirements."},{"comment_id":"1237961","content":"Selected Answer: D\nD, except the TAB is just called 'roles' now. It shows all the roles and the number of assigned/eligible, and you can click on them for more details.","timestamp":"1719473700.0","poster":"Panama469","upvote_count":"1"},{"upvote_count":"1","content":"Selected Answer: B\nB. Makes sense to me but the answer choice is confusing. Taken from the below Microsoft page \"Browse to Identity governance > Privileged Identity Management > Groups.\"\nhttps://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/groups-assign-member-owner","poster":"jbraxton7","comment_id":"1142140","timestamp":"1707222060.0","comments":[{"comment_id":"1214796","poster":"Alcpt","timestamp":"1716277980.0","upvote_count":"1","content":"no dude,\nBrowse to Identity governance > Privileged Identity Management > Microsoft Entra roles"}]},{"comment_id":"1064096","content":"Selected Answer: D\nThe Azure AD roles blade in the Privileged Identity Management settings allows you to manage Azure AD roles, including assigning roles to users and groups, and reviewing user and group eligibility for roles","timestamp":"1699291200.0","poster":"haazybanj","upvote_count":"1"},{"poster":"sherifhamed","content":"Selected Answer: D\nTo identify users eligible for the Cloud Application Administrator role using Azure AD Privileged Identity Management (PIM), you should use the \"Azure AD roles\" blade in the Privileged Identity Management settings (option D).\n\nHere's how you can do it:\n\nGo to the Azure portal (https://portal.azure.com).\n\nIn the left-hand navigation pane, navigate to \"Azure Active Directory.\"\n\nUnder the \"Security\" section, select \"Privileged Identity Management.\"\n\nOn the Privileged Identity Management dashboard, select \"Azure AD roles.\"\n\nIn the list of roles, locate and select the \"Cloud Application Administrator\" role.\n\nIn the \"Eligible\" tab, you can view the list of users who are eligible for the Cloud Application Administrator role.","comment_id":"1018027","upvote_count":"1","timestamp":"1695749040.0"},{"upvote_count":"1","content":"Selected Answer: D\nD. Azure AD roles","comment_id":"981580","timestamp":"1692098640.0","poster":"EmnCours"},{"comment_id":"980474","timestamp":"1691991420.0","upvote_count":"1","content":"Selected Answer: D\nAgree with Nils241","poster":"kalisprod"}],"question_id":328,"timestamp":"2023-08-02 11:26:00","answer_images":[],"topic":"4","answer_description":"","answer":"D","question_images":[],"answers_community":["D (95%)","5%"],"choices":{"A":"Azure resources","D":"Azure AD roles","C":"Review access","B":"Privileged access groups"},"question_text":"You have an Azure subscription that uses Azure AD Privileged Identity Management (PIM).\n\nYou need to identify users that are eligible for the Cloud Application Administrator role.\n\nWhich blade in the Privileged Identity Management settings should you use?","exam_id":123,"url":"https://www.examtopics.com/discussions/microsoft/view/117088-exam-sc-300-topic-4-question-53-discussion/","unix_timestamp":1690968360,"isMC":true,"answer_ET":"D"},{"id":"XE2UnuXzQEg0HLWxpNlC","question_text":"HOTSPOT\n-\n\nYou have a Microsoft 365 E5 subscription.\n\nYou need to create a dynamic user group that will include all the users that do NOT have a department defined in their user profile.\n\nHow should you complete the membership rule? To answer, select the appropriate options in the answer area.\n\nNOTE: Each correct selection is worth one point.\n\n//IMG//","answer_description":"","answers_community":[],"answer_ET":"","discussion":[{"poster":"kanag1","upvote_count":"11","comment_id":"970768","timestamp":"1722663000.0","content":"Correct\n\n(user.department -eq null)\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/enterprise-users/groups-dynamic-membership#use-of-null-values"},{"comment_id":"1363863","timestamp":"1740904080.0","content":"user.department -eq null- \"NOT DEFINED\"\nuser.department -eq null → Includes users where the department attribute is not set.\nuser.department -eq \"\" → Includes users where the department attribute is set but empty.","upvote_count":"2","poster":"rvln7"},{"content":"I believe the correct answer is -eq $null","poster":"Rahgu","upvote_count":"1","comment_id":"1349376","timestamp":"1738292640.0"},{"comment_id":"1042499","upvote_count":"1","timestamp":"1728811020.0","poster":"cgonIT","content":"Answer is correct:\nBox1: -eq\nBox2: null\n\nTested in lab."},{"comment_id":"1039975","upvote_count":"1","timestamp":"1728603600.0","content":"- eq \n- null","poster":"AK_1234"},{"content":"Correct\n\n(user.department -eq null)","timestamp":"1723721160.0","poster":"EmnCours","comment_id":"981581","upvote_count":"1"}],"url":"https://www.examtopics.com/discussions/microsoft/view/117187-exam-sc-300-topic-4-question-54-discussion/","answer_images":["https://img.examtopics.com/sc-300/image279.png"],"exam_id":123,"question_images":["https://img.examtopics.com/sc-300/image278.png"],"timestamp":"2023-08-03 07:30:00","topic":"4","question_id":329,"answer":"","isMC":false,"unix_timestamp":1691040600},{"id":"3u1Wx3Vrz1sym2hmddzE","choices":{"C":"Run the Update-MgDomain cmdlet.","A":"Modify the Diagnostics settings for Azure AD.","D":"Create an Azure AD workbook.","B":"Run the Update-MgOrganization cmdlet."},"answer_images":[],"question_text":"You have an Azure AD Premium P2 tenant.\n\nYou create a Log Analytics workspace.\n\nYou need to ensure that you can view Azure AD audit log information by using Azure Monitor.\n\nWhat should you do first?","topic":"4","discussion":[{"content":"yes... by the poor wording","poster":"enklau","comment_id":"1302576","upvote_count":"3","timestamp":"1729791900.0"},{"upvote_count":"4","timestamp":"1704209940.0","poster":"yawb","content":"Selected Answer: A\nhttps://learn.microsoft.com/en-us/entra/identity/monitoring-health/howto-integrate-activity-logs-with-azure-monitor-logs#send-logs-to-azure-monitor","comment_id":"1112015"},{"content":"Selected Answer: A\nThe correct answer is A. Modify the Diagnostics settings for Azure AD.\n\nTo ensure that you can view Azure AD audit log information by using Azure Monitor, you must first modify the Diagnostics settings for Azure AD to enable streaming of those logs to Azure Monitor.","comment_id":"1064103","timestamp":"1699291500.0","poster":"haazybanj","upvote_count":"2"},{"timestamp":"1697188740.0","upvote_count":"1","comment_id":"1042502","content":"Selected Answer: A\nThink response is correct. A. Modify the Diagnostics settings for Azure AD.","poster":"cgonIT"},{"upvote_count":"1","poster":"ACSC","comment_id":"1027021","content":"Selected Answer: A\nCorrect answer","timestamp":"1696646340.0"}],"answer":"A","exam_id":123,"answer_ET":"A","answers_community":["A (100%)"],"question_id":330,"question_images":[],"url":"https://www.examtopics.com/discussions/microsoft/view/122733-exam-sc-300-topic-4-question-55-discussion/","answer_description":"","isMC":true,"unix_timestamp":1696646340,"timestamp":"2023-10-07 04:39:00"}],"exam":{"id":123,"lastUpdated":"12 Apr 2025","name":"SC-300","provider":"Microsoft","isMCOnly":false,"numberOfQuestions":383,"isBeta":false,"isImplemented":true},"currentPage":66},"__N_SSP":true}